{
  "id": 7031,
  "title": "MAP-21 to FAST Act: Did the Transportation Infrastructure Finance and Innovation Act Program Better Support High-Risk Transportation Infrastructure Projects?",
  "abstract": "The Transportation Infrastructure Finance and Innovation Act (TIFIA) program acts as the U.S. federal government's largest direct financing program for domestic transportation infrastructure development. Employing a direct credit support mechanism, the program aims to leverage municipal and private investments to deliver higher-risk transportation projects that nevertheless offer important benefits for the public. Recent policy changes under the 2015 FAST Act may have altered the market-leveraging function, but existing literature has not evaluated this possibility. As a result, this research evaluated the program's market-leveraging outcomes by investigating whether and how the beneficiary projects' risk profiles, as measured by project credit ratings, changed between the MAP-21 and FAST Act policy periods. The program will produce higher leveraging effects when supporting lower-rated projects since the riskier projects tend to suffer from higher interest rates in financial markets. After constructing a project-level dataset, the authors employed Linear Probability Model and Treatment Effect regressions to assess the possible relationship between the FAST Act amendment and changes to the TIFIA program's risk profile. The study also employed a Binary Logit regression for sensitivity analysis. The empirical findings suggest that the proportion of TIFIA-selected projects with AAA/AA/A versus BBB ratings did not differ significantly between the MAP-21 and FAST Act periods. However, the program allocated a larger proportion of its lending capacity to AAA/AA/A projects during the FAST Act period. Given these findings, policymakers may wish to rebalance the program's objectives if the market-leveraging function remains a priority.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79eefcc31a6670bf25384ed0ad64da6e",
  "timestamp": "2025-05-15T03:04:23.006874"
}