{
  "id": 394,
  "title": "Multi-source data driven cryptocurrency price movement prediction and portfolio optimization",
  "abstract": "The existing cryptocurrency portfolio studies have relied heavily on historical asset returns and ignored the importance of the prediction information of asset returns, which leads to poor out-of-sample performance of the resulting portfolio strategies. To this end, we first crawl the tweets related to cryptocurrencies on Twitter, analyze tweets' sentiment, and construct sentiment indicators. Second, we use the historical trading data, daily Google Trends, and sentiment indicators to forecast the movement of cryptocurrency prices using Support Vector Machine (SVM). Third, we propose a portfolio optimization model by considering both the forecasting infor-mation and the global minimum variance model, and then derive the corresponding portfolio strategy. Finally, we compare the out-of-sample performance of the proposed strategy with classic portfolio strategies and the Cryptocurrency Index. The empirical results show that: on the one hand, the proposed multi-source data can effectively help forecast the cryptocurrency price movements; on the other hand, the proposed portfolio strategy outperforms traditional portfolio strategies regarding the out-of-sample Sharpe ratio, Sortino ratio, and certainty equivalent return, this proves that the proposed strategy can sufficiently combine information between history and future. More importantly, the above conclusions are well verified in the robustness test.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79efeafeb36aef098b2958ea59dea36a",
  "timestamp": "2025-05-15T00:43:10.468343"
}