{
  "id": 3996,
  "title": "EcoStrategic index: Economic value creation through product portfolio diversity for waste-to-x technologies",
  "abstract": "Sustainable decision-making for waste-to-X technologies presents a challenge, encompassing numerous alternatives across the entire supply chain, from biomass selection to diverse product portfolios. Each decision affects sustainability assessments, which span environmental, economic, social, technological, and circularity aspects. Addressing a gap in aligning product portfolio management with circular economy principles, this study introduces the EcoStrategic Index, a composite metric to quantify economic values within potential product portfolios. As part of a broader framework, the EcoStrategic Index integrates seamlessly with other dimensions to support strategic decision-making. Employing the value pyramid of bio-products concept, this study establishes a benchmark classification of chemicals with expert-informed values. Empirical validation was performed through a comparative case study of gasification and pyrolysis technologies, with catalogued product portfolios of approximately 300 and 1000 entries, respectively. Results show that over 50 % of both portfolios consist of functionalized hydrocarbons, with pyrolysis yielding a greater share of fine chemicals (28 %) compared to gasification (1 %), while gasification produces a larger share of inorganic salts and fertilizers (7 %). EcoStrategic Indices indicate that pyrolysis scores equal to or higher than gasification across all five sub-indices in multiple scenarios. To demonstrate its integrability, the TechnoStraegic Index was introduced, adding technology readiness level concept to form a cross-dimensional index reflecting economic value creation and technological maturity. The results show that while pyrolysis exhibits stronger potential for economic value, gasification often outperforms in cross-dimensional evaluations due to considerable higher technological maturity. This framework offers a cost-effective tool for guiding technology selection and strategic planning toward sustainable goals.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79f058fdabca47d4e03787fabcee574d",
  "timestamp": "2025-05-15T01:23:07.248307"
}