{
  "id": 5914,
  "title": "Predictive factors for diabetic foot ulceration: a systematic review",
  "abstract": "Improving ability to predict and prevent diabetic foot ulceration is imperative because of the high personal and financial costs of this complication. We therefore conducted a systematic review in order to identify all studies of factors associated with DFU and assess whether available DFU risk stratification systems incorporate those factors of highest potential value. We performed a search in PubMed for studies published through April 2011 that analysed the association between independent variables and DFU. Articles were selected by two investigators-independently and blind to each other. Divergences were solved by a third investigator. A total of 71 studies were included that evaluated the association between diabetic foot ulceration and more than 100 independent variables. The variables most frequently assessed were age, gender, diabetes duration, BMI, HbA1c and neuropathy. Diabetic foot ulceration prevalence varied greatly among studies. The majority of the identified variables were assessed by only two or fewer studies. Diabetic neuropathy, peripheral vascular disease, foot deformity and previous diabetic foot ulceration or lower extremity amputation which are the most common variables included in risk stratification systems were consistently associated with diabetic foot ulceration development. Existing diabetic foot ulceration risk stratification systems often include variables shown repeatedly in the literature to be strongly predictive of this outcome. Improvement of these risk classification systems though is impaired because of deficiencies noted, including a great lack of standardization in outcome definition and variable selection and measurement. Copyright (C) 2012 John Wiley & Sons, Ltd.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79f486bf750808bb3c54fcf91b006b45",
  "timestamp": "2025-05-15T02:53:02.940585"
}