{
  "id": 3350,
  "title": "A Markowitz-based alternative model: Hedging market shocks under endowment constraints",
  "abstract": "This paper suggests an alternative method of investing funds managed by endowments and foundations that is largely based on the work of Harry Markowitz, Arnold Zellner, and Nassim Taleb. Recognizing most endowments work around their traditional allocation of capital to bonds and stocks, this paper offers another piece of evidence that alternative methods of protection may be advantageous when their portfolios are constructed with forecasting error in mind. It suggests taking long only positions in two Markowitz optimized long/short funds. This could allow exposure to short positions while under long only constraints, and if done correctly, outperform the typical stock/bond split, providing the needed premium for payout liabilities. While this is frequently done by endowments, these funds typically invest in portfolios that are poorly constructed. The approach discussed in this paper utilizes the covariance of forecasting errors in optimizing each of the before mentioned portfolios; they would also be constructed for performance during normal market conditions and unpredictable Black Swan event. This optimization method can be achieved by using a seemingly unrelated regression system for forecasted returns, thereby providing the theoretically correct variance covariance to be utilized in optimization. Even with the very simplistic forecasting model utilized, application of the correct methodology provides enhanced performance. The result is a portfolio that maintains its value during adverse market conditions without sacrificing annual return. The risk-adjusted return of a portfolio constructed using the methodology outlined in this paper would be far higher than that of the stock/bond approach foundations and endowments have relied upon, even during a period of extremely good bond performance, by historical standards.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "79f95106c876109fcab25b68cfdb6e99",
  "timestamp": "2025-05-15T01:16:22.085659"
}