{
  "id": 8812,
  "title": "Relationship between occlusal force and psychological frailty in Japanese community-dwelling older adults: The Septuagenarians, Octogenarians, Nonagenarians Investigation with Centenarians study",
  "abstract": "Background Frailty increases the risk of negative health-related events, such as falls, disability, hospitalizations, and death. Although the association between oral health and physical frailty is well established, the relationship between oral health and psychological frailty has not yet been investigated. Therefore, we conducted a cross-sectional study to examine the association between maximal occlusal force and psychological frailty in Japanese community-dwelling older adults.Methods Psychological frailty was defined as a World Health Organization-5 scale (WHO-5) score of < 13, cognitive and functional status was defined as a Japanese version of the Montreal Cognitive Assessment (MoCA-J) score of < 23, and psychological robustness was defined as a WHO-5 score of >= 13 and a MoCA-J score of >= 23. We used a cross-sectional study design to measure maximal occlusal force in 1810 participants, and examined the following factors relevant to psychological frailty: educational level, financial status, living situation, history of chronic diseases, handgrip strength, and instrumental activities of daily living. We used propensity score matching to match the psychological frailty and psychological robustness groups according to demographic and confounding factors. This process, resulted in 344 participants, of whom 172 were in the psychological frailty group and 172 were in the psychological robustness group. In the matched cohort, differences between groups with and without psychological frailty were compared using generalized estimating equations for maximal occlusal force after adjusting for the number of teeth.Results After controlling for potential confounding factors of frailty, the psychological frailty group showed lower maximal occlusal force compared with the psychological robustness group (unstandardized regression coefficients = -72.7, 95% confidence interval: -126.3 to -19.1).Conclusions Maximal occlusal force was associated with a reduced prevalence of psychological frailty among Japanese community-dwelling older adults participating in our study.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a00044aefec1a1fffd0a4e6337e0a86",
  "timestamp": "2025-05-15T03:22:26.141602"
}