{
  "id": 3043,
  "title": "SUSTAINABILITY OF MICROFINANCE INSTITUTIONS IN THE PHILIPPINES",
  "abstract": "Background and Purpose: Microfinance is the most effective and widely acknowledged method of poverty alleviation across the globe but these days every so and often the MFIs are digressing from their primary mission in pretext of financial and operational sustainability of the organizations. The purpose of this research is to confirm the adherence of double bottom line sustainability of Microfinance institutions (MFIs) and further to identify the determinants of MFIs sustainability in the Philippines. Methodology: The sample for the study was obtained from MIX- market for the period 1999-2018. Principal component analysis and KU model are used to measure the sustainability scores of MFIs. Later, a panel regression model is applied to identify the determinants of sustainability. Findings: MFIs are not adhering to the double bottom line sustainability as majority of MFIs were unsustainable at different benchmarks set for the study. The sustainability can be achieved if MFIs start utilizing their assets, focus on improving their efficiency and portfolio quality. MFIs size also significantly influences the sustainability of MFIs. Contributions: This study highlights the need for policy makers and regulators to develop a regulatory framework to reduce the operating cost and improve the portfolio quality of MFIs in the Philippines. They should also provide guidelines that would help MFIs in improving their asset utilization ratio as it would help them adhere to double bottom line sustainability.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a0b1d217244eb793c3839acc09fe31e",
  "timestamp": "2025-05-15T01:13:09.811558"
}