{
  "id": 7973,
  "title": "COVID-19-Related Racial Discrimination on Asian Australians: An Evaluation of Symptoms of Psychological Distress, Social Support, and Acculturation",
  "abstract": "COVID-19 restrictions and the social and financial repercussions are negatively affecting the mental health of Australians. Asian Australians may be further at risk of negative mental health outcomes due to the racial discrimination that has emerged during this pandemic. This study used an online questionnaire to assess whether COVID-19-related racial discrimination (firsthand and secondhand), acculturation, and perceived social support predicted psychological distress (depressive, anxiety, and stress symptoms) among Asian Australians (n = 113, M-age = 29.82, SDage = 11.96, nonbinary n = 1, female n = 69, male n = 43). Participants perceived high social support and reported moderate amounts of COVID-19-related racial discrimination, as well as moderate cultural preferences for both host and heritage cultures. Multiple regression analyses indicated that (a) social support from significant others and family significantly predicted variance in depressive symptoms, (b) no independent variable was able to significantly predict variance in anxiety, and (c) social support from the family significantly predicted variance in stress. Participants reported mild amounts of depressive symptoms, normal amounts of stress symptoms, and verging amounts of anxiety symptoms that could be considered mild. This research contributes to the wider literature as one of the first studies to focus on Asian Australian mental health during the COVID-19 pandemic and to empirically support anecdotal evidence of COVID-19-related racial discrimination.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a14048b64e5a7e0b52be7ed89b6963e",
  "timestamp": "2025-05-15T03:14:07.170895"
}