{
  "id": 853,
  "title": "Hybrid optimization search-based ensemble model for portfolio optimization and return prediction in business investment",
  "abstract": "In recent years, portfolio optimization is the most attracted topic among researchers. More advanced techniques in portfolio optimization help the investors to gain more profits. The unnecessary panic of investors results in a high level arouses of uncertainty and instability in substandard situations. The allocation of accessible resources across numerous stocks is known as a portfolio. The policy of portfolio requires restructuring over time to make available new information. The stock investment faced an essential downfall in the emergence of health crises; it also affected the market solidity. The performance of a portfolio is enhanced by incorporating existing return prediction models. In this paper, the portfolio optimization along with return prediction is performed by utilizing the ensemble eXtreme Gradient Boosting (XGBoost) and Artificial Neural Network (ANN) termed XGB + ANN. The portfolio prediction is performed with XGB + ANN by optimizing the weight, along with Hybrid Squirrel Search Whale Optimization (HSSWO) algorithm-based portfolio optimization. The predicted portfolio information with ensemble learning is used for the estimation of the best companies regarding their best returns. With the evaluated results, the proposed model has outperformed the other traditional models.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a1bb13245c73412b916eabfe9807dfc",
  "timestamp": "2025-05-15T00:49:03.123573"
}