{
  "id": 7139,
  "title": "Modeling, implementation and evaluation of negotiation strategies based on learning algorithms of machine for the financial market",
  "abstract": "Investing in the stock market is one of the fastest and most attractive ways to make considerable profits in a short period of time. However, due to large variations and fluctuations in this type of market, investors are subject to risks that can also result in large losses. In order to avoid that other students and interested in the financial market area have to spend a lot of time on their research in the implementation of algorithms and can dedicate efforts in creating, validating and improving their trading strategies, this work proposes the design and implementation of a automated framework consisting of 5 stages: Data Extraction, Data Characterization and Transformation, Classification of Trend Forecasting Models, Operation Strategy and Results Analysis. During the simulations, historical quotation data of 9 assets traded on the Brazil Balcao Exchange (B3) was evaluated, for a period of 741 in the Validation stage, for the 8 proposed trend forecasting models. As a result and validation of the proposed framework, a consolidated table containing data (performance, operation / risk and statistics) and 2 graphs: series of closing price and series of accumulated capital (liquid and gross returns and operating cost) evolution of trends will be presented for each of the assets and trend forecasting models.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a1ce8a2df6b6967d3f62ac61eeec66c",
  "timestamp": "2025-05-15T03:05:32.059308"
}