{
  "id": 1774,
  "title": "Improved Fraud Detection in Banking Systems through Machine Learning and Big Data Analytics with Management Key Components",
  "abstract": "The banking industry needs to set up strong detection systems to fight the continuing risk of fraud in order to keep people's trust in financial systems and keep their cash safe. Problems often arise with traditional rule-based detection systems when they are put up against complicated fraud plans. It is possible to find fake activities more easily now that machine learning and big data analytics are becoming more popular. In this research, a complete approach is introduced that makes it easier to spot fraud in banking systems. The system has algorithms for machine learning, important management parts, and big data analytics. using big data technologies to collect and examine a lot of data from a lot of different sources, such as external data streams, internal transaction records, and profiles of customers. Fraud detection systems get better at telling the difference by picking out key features from preprocessed data. Researching on a system that will constantly watch all incoming transfers and send alerts right away if any suspicious activity is seen. Because of this, it is necessary to set limits, create automatic systems for sending out warnings, and come up with ways to spot anomalies. The financial industry must make sure that the methods they use to find and stop fraud are legal and meet their compliance responsibilities.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a30861e50b8dc625bf1900f75b2dfbd",
  "timestamp": "2025-05-15T02:07:25.677818"
}