{
  "id": 2428,
  "title": "Vehicle leasing credit risk assessment modeling by applying extended logistic regression",
  "abstract": "In vehicle leasing industry which presents a great business opportunity, information completed by applicants was assessed and judged by leasing associates manually in most cases; therefore, assessment results would be affected by their personal experience of leasing associates and decisions would be further affected accordingly. There are few researches on applicant credit risk assessment due to not easy to obtain of vehicle leasing data. Further, the difficulty in vehicle leasing risk assessment is increased due to class imbalance problems in vehicle leasing data. In order to address such issue, a research on credit risk assessment in vehicle leasing industry was conducted in this study. The great disparity in the ratio of high risk and low risk data was addressed by applying synthetic minority over-sampling technique (SMOTE). Then, classification effect of risk assessment model was improved by applying logistic regression in a two-phase manner. In the section of empirical analysis, the feasibility and effectiveness of the approach proposed in this study was validated by using data of actual vehicle leasing application cases provided by a financial institution in Taiwan. It is found that the proposed approach provided a simple yet effective way to build a credit risk assessment model for companies that provide vehicle leasing.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a3dc51b12a0fa2a6f60a385cf03b1ea",
  "timestamp": "2025-05-15T02:15:26.976067"
}