{
  "id": 4392,
  "title": "Cost burden among the CF population in the United States: A focus on debt, food insecurity, housing and health services",
  "abstract": "Background: Advancements in the cystic fibrosis (CF) field have resulted in longer lifespans for individuals with CF. This has led to more responsibility for complex care regimens, frequent health care, and prescription medication utilization that are costly and may not be fully covered by health insurance. There are outstanding questions about unmet medical needs among the U.S. population with CF and how the financial burden of CF is associated with debt, housing instability, and food insecurity. Methods: Researchers developed the CF Health Insurance Survey (CF HIS) to survey a convenience sample of people living with CF in the U.S. The sample was weighted to reflect the parameters of the 2019 Cystic Fibrosis Foundation Patient Registry Annual Data Report, and chi-square tests and multiple logistic regression models were conducted. Results: A total of 1,856 CF patients in the U.S. were included in the study. Of these, 64% faced a financial burden: 55% of respondents faced debt issues, 26% housing issues, and 33% food insecurity issues. A third reported at least one unmet medical need: 24% faced unmet prescription needs, 12% delayed or shortened a hospitalization, and 10% delayed or skipped a care center visit as a result of the cost of care. Conclusions: People with CF in the U.S. experience high financial burden, which is associated with unmet medical needs. Income is the biggest risk factor for financial burden for people with CF, with people dually covered by Medicare and Medicaid particularly at risk. & COPY; 2023 European Cystic Fibrosis Society. Published by Elsevier B.V. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a40b1a90654d9ebac0b79d6dabf802b",
  "timestamp": "2025-05-15T02:36:38.499864"
}