{
  "id": 230,
  "title": "Portfolio Optimization Using Novel EW-MV Method in Conjunction with Asset Preselection",
  "abstract": "Integration of asset preselection with appropriate portfolio optimization techniques can improve the performance of the portfolio optimization models. This paper morphed the potential asset selection and the optimal portfolio construction rather than focusing on one. A large volume of sample data from 25 stocks is used for the experiment from the National Stock Exchange, India, between January 2005 and December 2021. Initially, a 3-step screening approach, an asset selection method is applied to select potential assets. The 3-steps comprise data choice, fundamental screening, and the Long Short Term Memory model anticipating real-time stock prices to shortlist stocks with higher expected returns. The suggested approach is effective in determining the quality of assets. Further, the optimal asset allocation is done by introducing a novel exponentially weighted-mean-variance model. This exponential weighting scheme outperforms the classical Mean-Variance model when applied to the maximum Sharpe ratio model. The proposed model outperforms the five baseline techniques in terms of the Sharpe ratio and average potential returns and risks. Additionally, the proposed model's resilience across diversified time frames is tested through the incorporation of multiple time windows, demonstrating robustness of the performance.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a4f10064c61bc2e413f2555c3409318",
  "timestamp": "2025-05-15T00:33:39.489030"
}