{
  "id": 2273,
  "title": "Solar Photovoltaic Modules' Performance Reliability and Degradation Analysis-A Review",
  "abstract": "The current geometric increase in the global deployment of solar photovoltaic (PV) modules, both at utility-scale and residential roof-top systems, is majorly attributed to its affordability, scalability, long-term warranty and, most importantly, the continuous reduction in the levelized cost of electricity (LCOE) of solar PV in numerous countries. In addition, PV deployment is expected to continue this growth trend as energy portfolio globally shifts towards cleaner energy technologies. However, irrespective of the PV module type/material and component technology, the modules are exposed to a wide range of environmental conditions during outdoor deployment. Oftentimes, these environmental conditions are extreme for the modules and subject them to harsh chemical, photo-chemical and thermo-mechanical stress. Asides from manufacturing defects, these conditions contribute immensely to PV module's aging rate, defects and degradation. Therefore, in recent times, there has been various investigations into PV reliability and degradation mechanisms. These studies do not only provide insight on how PV module's performance degrades over time, but more importantly, they serve as meaningful input information for future developments in PV technologies, as well as performance prediction for better financial modelling. In view of this, prompt and efficient detection and classification of degradation modes and mechanisms due to manufacturing imperfections and field conditions are of great importance towards minimizing potential failure and associated risks. In the literature, several methods, ranging from visual inspection, electrical parameter measurements (EPM), imaging methods, and most recently data-driven techniques have been proposed and utilized to measure or characterize PV module degradation signatures and mechanisms/pathways. In this paper, we present a critical review of recent studies whereby solar PV systems performance reliability and degradation were analyzed. The aim is to make cogent contributions to the state-of-the-art, identify various critical issues and propose thoughtful ideas for future studies particularly in the area of data-driven analytics. In contrast with statistical and visual inspection approaches that tend to be time consuming and require huge human expertise, data-driven analytic methods including machine learning (ML) and deep learning (DL) models have impressive computational capacities to process voluminous data, with vast features, with reduced computation time. Thus, they can be deployed for assessing module performance in laboratories, manufacturing, and field deployments. With the huge size of PV modules' installations especially in utility scale systems, coupled with the voluminous datasets generated in terms of EPM and imaging data features, ML and DL can learn irregular patterns and make conclusions in the prediction, diagnosis and classification of PV degradation signatures, with reduced computation time. Analysis and comparison of different models proposed for solar PV degradation are critically reviewed, in terms of the methodologies, characterization techniques, datasets, feature extraction mechanisms, accelerated testing procedures and classification procedures. Finally, we briefly highlight research gaps and summarize some recommendations for the future studies.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a5c3eee16356b39d320d16c4adaee73",
  "timestamp": "2025-05-15T01:05:04.502440"
}