{
  "id": 8945,
  "title": "Factors associated with domestic violence: a cross-sectional survey among women in Jeddah, Saudi Arabia",
  "abstract": "Objective This study aims to identify the factors associated with domestic violence (DV) among women in Jeddah. Design Cross-sectional survey. Setting Outpatient departments of three tertiary hospitals in Jeddah. Participants Convenience sample of women, aged 15-70years, at the outpatient and inpatient clinics. Interventions Between 15 December 2011 and 30 May 2012, a psychologist and a professional health assistant explained the purpose of the research to participants, who were then asked to fill a 50-item questionnaire. The questionnaire was created based on questions from three questionnaires: the NorVold Domestic Abuse Questionnaire, the Pregnancy Risk Assessment Monitoring System and the Kansas Marital Satisfaction Scale. The questionnaire was used to assess the association between DV and family status, male partner attitudes, age, educational attainment, employment, financial and socioeconomic status. Results A total of 2301 women participated in the survey (81% response rate). The meanSD age of the participants was 34.4 +/- 10.9years. The lifetime prevalence of DV was 34%. Abused women had more children than non-abused women (p=0.001), and their spouses were significantly older than those of non-abused women (p<0.0001). Financially dependent women and those with a high educational status were significantly more likely to report abuse (p=0.003 and p<0.001, respectively). Abused women were also likely to report that their spouse was a smoker (p<0.0001) and had completed at least primary or secondary education (p<0.0001). A significantly lower proportion of abused women reported that their male partners were alcohol users (p=0.001). The results of logistic regression showed that women who were financially dependent had about 1.5-fold odds of being physically abused by a spouse. Conclusions Many factors are associated with DV against women, thereby highlighting the need to design effective DV prevention programmes.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a63849bed2bff8ac43115c9fd4ac2db",
  "timestamp": "2025-05-15T03:23:56.121676"
}