{
  "id": 7584,
  "title": "A Cross-Sectional Study on the Associations between Economic, Social, and Political Resources and Subjective Caregiver Burden among Older Spousal Caregivers in Two Nordic Regions",
  "abstract": "Inspired by the caregiver stress process model emphasising the role of resources for caregiving outcomes, the aim of this study was to investigate the prevalence of subjective caregiver burden (SCB) and its associations with individual social, economic, and political resources among older spousal caregivers in a Nordic regional setting. Cross-sectional survey data collected in 2016 in the Bothnia region of Finland and Sweden were used, where 674 spousal caregivers were identified and included in the analyses. The descriptive results showed that about half of the respondents experienced SCB. SCB was more common among Finnish-speaking caregivers. Results from the multivariate logistic regression analysis showed that none of the assessed political resources were significantly associated with SCB when controlling for other variables. Experiencing financial strain was associated with SCB, while personal income was not. Frequent contact with family members was statistically significantly associated with SCB. Future research could use longitudinal data to determine causal relationships, and when data allow, test the full caregiver stress process model to investigate the role of mediating factors in different comparative settings. Accumulated evidence on risk factors for negative outcomes of informal caregiving can contribute to effective screening tools for identifying and supporting vulnerable caregivers, which is becoming increasingly important with the ageing population.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a6474b301d08c041b9a327cba3ce6b5",
  "timestamp": "2025-05-15T03:10:05.546025"
}