{
  "id": 3909,
  "title": "ESG investing versus the market: returns and risk analysis and portfolio diversification in Latin-America",
  "abstract": "PurposeThis study aims to examine the performance of environmental, social and governance (ESG) equity indices in Latin America (LA), evaluating their risk-return characteristics in comparison to conventional benchmark indices.Design/methodology/approachUsing a quantitative empirical approach, the authors analyze ESG equity indices from Brazil, Mexico, Chile, Peru and Colombia, employing metrics such as Sharpe, Sortino and Omega ratios to measure risk-adjusted returns. Regression analysis is employed to assess the replicability of ESG indices by benchmark indices. Monte Carlo simulations are conducted to explore the potential increase in risk-adjusted returns when ESG equity indices are incorporated into portfolios.FindingsThe study addresses critical questions for investors: Can ESG indices outperform their benchmarks? Can these ESG indices be replicated by benchmark counterparts? Do ESG equity indices enhance portfolio diversification? The findings reveal that investing in ESG indices has the potential to enhance risk-adjusted returns and portfolio diversification.Research limitations/implicationsWhile this study focuses on various LA economies, it's important to note variations in currency and volatility.Practical implicationsFor investors in LA, this study highlights the importance of considering ESG indices as part of their investment strategies. While not all ESG indices outperform conventional ones, some may improve diversification and risk-adjusted performance. Investors should carefully assess market-specific conditions and national factors when making investment decisions.Originality/valueThe primary contribution of this study is its focus on LA countries in the examination of diverse portfolios. The research provides valuable insights into the performance of ESG indices in this region compared to conventional benchmark indices. This approach addresses an important gap in the existing literature and offers a more comprehensive perspective on ESG investing and portfolio diversification. PropositoSe examina el rendimiento de los indices-ESG en America Latina (AL), evaluando sus caracteristicas de riesgo y retorno en comparacion con los indices convencionales.Diseno/metodologia/enfoque:Utilizando un enfoque cuantitativo, analizamos los indices-ESG de Brasil, Mexico, Chile, Peru y Colombia, empleando ratios de Sharpe, Sortino y Omega para medir los rendimientos ajustados al riesgo. Se utiliza analisis de regresion para evaluar la replicabilidad de los indices-ESG por parte de los indices de referencia. Se realizan simulaciones de Monte-Carlo para explorar el aumento en los rendimientos ajustados al riesgo cuando se incorporan los indices-ESG en las carteras.Hallazgos:El estudio aborda preguntas criticas: Pueden los indices-ESG superar a sus indices de referencia? Pueden estos indices-ESG ser replicados por sus contrapartes de referencia? Mejoran los indices-ESG la diversificacion de las carteras? Los hallazgos revelan que la inversion en indices-ESG tiene el potential de mejorar los rendimientos y la diversificacion de las carteras de inversion.Limitaciones/implicaciones de la investigacion -Aunque este estudio se centra en diversas economias de AL, es importante tener en cuenta variaciones en moneda y volatilidad.Originalidad/valor:La principal contribucion de este estudio radica en su enfoque en paises de AL en el examen de carteras diversas; ofrece valiosos conocimientos sobre el rendimiento de los indices-ESG en esta region en comparacion con los indices convencionales.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a64e6e621a7ce0f10fb07e778ee2633",
  "timestamp": "2025-05-15T01:22:11.836034"
}