{
  "id": 4322,
  "title": "Appropriateness and timeliness of care-seeking for complications of pregnancy and childbirth in rural Ethiopia: a case study of the Maternal and Newborn Health in Ethiopia Partnership",
  "abstract": "Background: In 2014, USAID and University Research Co., LLC, initiated a new project under the broader Translating Research into Action portfolio of projects. This new project was entitled Systematic Documentation of Illness Recognition and Appropriate Care Seeking for Maternal and Newborn Complications. This project used a common protocol involving descriptive mixed-methods case studies of community projects in six low-and middle-income countries, including Ethiopia. In this paper, we present the Maternal and Newborn Health in Ethiopia Partnership (MaNHEP) case study. Methods: Methods included secondary analysis of data from MaNHEP's 2010 baseline and 2012 end line surveys, health program inventory and facility mapping to contextualize care-seeking, and illness narratives to identify factors influencing illness recognition and care-seeking. Analyses used descriptive statistics, bivariate tests, multivariate logistic regression, and thematic content analysis. Results: Maternal illness awareness increased between 2010 and 2012 for major obstetric complications. In 2012, 45% of women who experienced a major complication sought biomedical care. Factors associated with care-seeking were MaNHEP CMNH Family Meetings, health facility birth, birth with a skilled provider, or health extension worker. Between 2012 and 2014, the Ministry of Health introduced nationwide initiatives including performance review, ambulance service, increased posting of midwives, pregnant women's conferences, user-friendly services, and maternal death surveillance. By 2014, most facilities were able to provide emergency obstetric and newborn care. Yet in 2014, biomedical care-seeking for perceived maternal illness occurred more often compared with care-seeking for newborn illness-a difference notable in cases in which the mother or newborn died. Most families sought care within 1 day of illness recognition. Facilitating factors were health extension worker advice and ability to refer upward, and health facility proximity; impeding factors were time of day, weather, road conditions, distance, poor cell phone connectivity (to call for an ambulance), lack of transportation or money for transport, perceived spiritual or physical vulnerability of the mother and newborn and associated culturally determined postnatal restrictions on the mother or newborn's movement outside of the home, and preference for traditional care. Some families sought care despite disrespectful, poor quality care. Conclusions: Improvements in illness recognition and care-seeking observed during MaNHEP have been reinforced since that time and appear to be successful. There is still need for a concerted effort focusing on reducing identified barriers, improve quality of care and provider counseling, and contextualize messaging behavior change communications and provider counseling.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a8e9274ff50cdd8949192fc8f3cf66d",
  "timestamp": "2025-05-15T01:25:50.575700"
}