{
  "id": 7446,
  "title": "The implementation of a community-centered first aid education program for older adults-community health workers perceived barriers",
  "abstract": "BackgroundOlder adults are a high-risk group for accidental injuries, and strengthening training in first aid for older adults can improve their first aid capabilities and minimize their post-accident mortality. Community health workers are the greatest option to equip older adults with first aid instruction and training. However, the development of first aid education for the public by community health workers fails to take into account the elderly population. In view of this, this study aims to explore the barriers and challenges of first aid training for older adults from the perspective of community health workers and to provide a basis for better first-aid training for older adults in the community.MethodsThis study adopted a qualitative research design. A total of 18 community health workers were recruited from two community health service centers in Qujing and one community health service center in Guangzhou from May to July 2022 to participate in the study. Participants were interviewed face-to-face using semi-structured in-depth interviews. The interview data were analyzed using Krippendorff's thematic clustering technique.ResultsThe results of the study identified community health workers' perceived challenges and barriers to providing first aid training to older adults in the community as older adults-level barriers, community health workers-level barriers, management systems-level barriers, and society-level barriers.ConclusionsCommunity health workers are highly aware of multiple barriers and challenges in providing first aid training to community-based elderly populations. In particular, lack of professional training, heavy workloads, and limited resources and financial support. Therefore, supportive training, policies, and government funding are crucial for community health workers to conduct first aid training for older adults.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7a9f91375b70fc8ae2a0989dac5f7298",
  "timestamp": "2025-05-15T03:08:37.900730"
}