{
  "id": 6762,
  "title": "TAXONOMY OF SEVERITY OF CYBER-ATTACKS IN CYBER-MANUFACTURING SYSTEMS",
  "abstract": "Increasingly named as the number one non-traditional risk cyber-attacks against Cyber-manufacturing Systems (CMS) can cause a wide variety of losses. As the 4th industrial revolution is taking place CMS have become more resilient with the implementation of prevention, detection, redundancy, withstanding, and recovery mechanisms against cyber-attacks. However, the ever-evolving nature of these threats require systems to still be prepared for their eventual occurrence as it's been demonstrated in the increasingly more common advent of successful cyber-attacks. While multiple generic threat models have been proposed by academics and government organizations for assessing the impact of cyber-attacks against Cyber-Physical Systems there is a research gap when it comes to manufacturing specific applications and how to assess their severity. In order to evaluate the impact of a cyber-attack against CMS this taxonomy proposes a classification of threats severity comprising three general themes: i) Operational Impact: Effective production time loss that incur in inability to yield the expected output, ii) Economic Impacts: Direct financial cost of the attack, mitigation, and recovery, and iii) Intangible Losses: Integrity breaches against original patents, models, or intangible actives.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7aad31cc3d7bbe89fea5e339ea401958",
  "timestamp": "2025-05-15T03:01:03.741576"
}