{
  "id": 4131,
  "title": "Evaluation of stock trading performance of students using a web-based virtual stock trading system",
  "abstract": "Most investors lack financial knowledge and information for trading in the stock market. The objective of this study was to enhance the motivation and learning efficiency for students attending a course in financial management. A web-based virtual stock trading (VST) system, embedded with provided functions for financial ratio analysis, was designed to simulate a stock trading environment. Through learning with objective financial analyses, the state of learners' minds is expected not to be affected by news or market fluctuations, which in turn nurtures the students as rational investors. Students were recruited from two universities located in central Taiwan for this study. They were given a virtual budget at the beginning of the semester for online virtual trading. The stock trading behavior, such as risk aversion and disposition effect, was explored through students' trading histories. Furthermore, the learning outcome was evaluated with analysis of trading performance based on five indicators, including returns on budget, stock's trading amount turnover, profit margin of stock trading amount, average budget utilization rate, and returns on average investment amount. Finally, perceived usefulness and behavior intention of the VST system were surveyed using a questionnaire instrument based on the extended technical acceptance model (TAM). The analytic results support risk aversion theory in that students tended to sell high-priced stocks in short periods with a holding day of 4.03 +/- 4.93(N = 32) because of its great price fluctuation even if its price was rising during the study period. In contrast, the holding days of high-priced stocks were significantly shorter than the stocks (t-test, p < 0.01) with lower prices (10.70 +/- 11.92, N = 1136). At the end of the semester, questionnaires were disseminated to the 136 participating students, a total of 103 questionnaires were received with a response rate of 75.74%. The Cronbach's Alpha value was as high as 0.88, indicating that the questionnaire achieved high reliability. It shows that perceived usefulness (4.39 +/- 0.53) and behavior intention (4.31 +/- 0.50) are significantly higher than the neutral value (3) at a level of 0.001 using one-sample t-test, showing that the VST system is useful and the students are willing to further adopt the system and recommend it to other users. After analyses of the received questionnaires with structural equation model (SEM), TAM was verified regarding the adoption of VST as a tool for financial management education. In conclusion, the proposed VST system is useful in financial management education, specific in stock trading, to provide students with knowledge and experience to profit from the stock market through active learning in a virtual trading environment. (C) 2012 Elsevier Ltd. All rights reserved.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ab752c3b3747bef81d492708622afea",
  "timestamp": "2025-05-15T02:33:42.037581"
}