{
  "id": 7793,
  "title": "Does the universal medical insurance system reduce catastrophic health expenditure among middle-aged and elderly households in China? A longitudinal analysis",
  "abstract": "Background The Chinese government has made great progress in establishing the universal medical insurance system. This study aimed to analyze whether the universal medical insurance system protected middle-aged and elderly households from catastrophic health expenditure (CHE). Methods The data were obtained from the China Health and Retirement Longitudinal Study. We used household as our unit of analysis and CHE was measured as out-of-pocket expenditures >= 40% of nonfood household expenditures. Univariate analysis was deployed to examine the impacts of different medical insurance schemes on CHE, and the factors associated with CHE were estimated using a random-effects logit regression model. Results We identified 10,005, 10,370, and 11,567 households in 2011, 2013, and 2015, respectively, and found 12.9% (2011), 26.6% (2013) and 27.9% (2015) of the households experienced CHE. When compared with no insurance, households enrolled in New Rural Cooperative Medical Insurance Scheme (P = 0.023) were associated with a lower incidence of CHE, but other insurance schemes were not significant. Households with members older than 65 years (P < 0.001), members with chronic diseases (P < 0.001), members with poor self-reported health conditions (P < 0.001), and members receiving health care (P < 0.001) had a higher risk of CHE. Large household size (P < 0.001) and high household income per capita (P < 0.001) were major protective factors to CHE incidence. Conclusions Despite China's great stride in the medical insurance coverage, it fell short to provide financial protection against medical expenditure burden. To reduce the risk of CHE, an integrated poverty and elderly-oriented medical insurance system could be put in place to address these problems.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7abe392dd86adadb52d637c6cdd5d295",
  "timestamp": "2025-05-15T03:12:11.646599"
}