{
  "id": 5187,
  "title": "Comparative analysis of financial toxicity between SARS-CoV-2 infection and common comorbidities",
  "abstract": "Financial toxicity is common in individuals with COVID-19 and Long COVID. However, the extent of financial toxicity experienced, in comparison to other common comorbidities, is uncertain. Contributing factors exacerbating financial challenges in Long COVID are also unclear. These knowledge gaps are addressed via a cross-sectional analysis utilizing data from the 2022 National Health Interview Survey (NHIS), a representative sample drawn from the United States. COVID-19 cases were identified through self-reported positive testing or physician diagnoses. Long COVID was defined as experiencing COVID-19-related symptoms for more than three months. Comorbidity was assessed based on self-reported diagnoses of ten doctor-diagnosed conditions (Yes/No). Financial toxicity was defined as having difficulty paying medical bills, cost-related medication nonadherence, delaying healthcare due to cost, and/or not obtained healthcare due to cost. A total of 27,492 NHIS 2022 respondents were included in our analysis, representing 253 million U.S. adults. In multivariable logistic regression models, adults with Long COVID (excluding respondents with COVID-19 but not Long COVID), showed increased financial toxicity compared to those with other comorbidities, such as epilepsy (OR [95% CI]: 1.69 [1.22, 2.33]), dementia (1.51 [1.01, 2.25]), cancer (1.43 [1.19, 1.71]) or respiratory/cardiovascular conditions (1.18 [1.00, 1.40]/1.23 [1.02, 1.47]). Long COVID-related financial toxicity was associated with female sex, age <65 years, lack of medical insurance, current paid employment, residence region, food insecurity, fatigue, mild to severe depression symptoms experienced during the survey completion, visits to hospital emergency rooms, presence of arthritis, cardiovascular or respiratory conditions, and social activity limitations. In conclusion, American adults with Long COVID, but not those who had prior COVID-19 infection without Long COVID, exhibited a higher prevalence of financial toxicity compared to individuals with common comorbidities. Vulnerable populations were at greater risk for financial toxicity. These findings emphasize the importance of evaluating strategies to reduce economic burden and increase awareness of the effect of Long COVID-related financial toxicity on patient's healthcare and health status.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7abf42338068ec196aeda2da0b259208",
  "timestamp": "2025-05-15T02:45:17.080904"
}