{
  "id": 7751,
  "title": "Needs for Portfolio Risk Assessment of Aging Dams in the United States",
  "abstract": "Dam failure can cause extraordinary flooding. Water and wastewater treatment plants, electricity generation facilities, bridges, highways, population centers, and other dams often lie downstream of a dam. If poorly maintained, aging dams can be overtopped by extreme rainfall events, and long-term loss of critical infrastructure services for many communities and regions may result. Such events are now more likely as the climate changes. How should we prioritize dams that need immediate attention and retrofit or remove them? Losses from a dam failure could exceed the infrastructure's replacement costs, through cascading effects in multiple sectors such as electricity, transportation, water supply, and environmental services. The existing dam hazard classification frameworks in the US and many other countries do not formally characterize hazard hotspots considering these impacts. Given that there are over 90,000 dams at different stages of repair, maintenance, and budgetary constraints, a systematic approach is needed to rank their potential failure hazard and allocate resources for risk mitigation. In this paper, we synthesize an approach for preliminary ranking of the priority areas of concern. The approach is scalable over many regions for rapid assessment of magnitude and exposure of a dam failure. The estimation of the consequences of a dam failure, including its financial losses, as well as affected critical infrastructures and population, is explored using publicly available dam break and consequence tools as well as national infrastructure data sets.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ac10179560f84751c0890f6f6c3aebb",
  "timestamp": "2025-05-15T03:11:38.573642"
}