{
  "id": 933,
  "title": "Application of Advanced Bioinformatics to Understand and Predict Burnout Among Surgical Trainees",
  "abstract": "OBJECTIVE: Physician burnout, including surgical trainees, is multidimensional. Input variables used to predict burnout include grit, exhaustion, and financial stress. Each instrument has intrinsic limitations of scope and strength. We hypothesize that bioinformatics methods borrowed from oncogenetics may allow meta-analysis of existing predictive tools to improve identification of sub-populations at highest risk of burnout. DESIGN: A composite survey was created using widely accepted instruments: demographic factors, burnout using the Single-Item Maslach Burnout Inventory Emotional Exhaustion Measure, grit using the Duckworth Grit Scale, occupational fatigue using the Occupational Fatigue Exhaustion/Recovery Scale, financial well-being, perceptions of physician leadership, and attitudes towards robotic surgery. Surveys were analyzed using k-means analysis and supervised/unsupervised clustering. SETTING: Yale General Surgery Residency. PARTICIPANTS: Survey participants consisted of Yale General Surgery residents. Of 70 residents, 53 responded (75.7%). Males comprised 57.1% and each postgraduate year had majority representation, 68.8% to 100%. RESULTS: Unsupervised hierarchical clustering showed heterogeneous resident answer patterns and suggested clusters of responders. To define groups of dissimilar responders, we performed k-means clustering, testing 15 iterations with 50 attempts. The analysis revealed 3 discrete clusters of responders with differential risk for burnout (p = 0.021). The highest risk group demonstrated the lowest grit score, low interest in innovation and leadership, higher financial stress, and concordantly, the highest rates of anxiety, dread, and self-reported burnout. (p = 0.0004; 0.0014; 0.1217; 0.0625; 0.021; 0.0011; 0.0224) CONCLUSIONS: The limited scope of common tools aiming to predict burnout constrains their utility. The machine-learning technique of cluster analysis organizes compound data to describe complex outcomes such as oncologic risks. We apply this analysis technique to create a composite predictor of burnout among surgical residents. Our method determines subgroups of residents sharing unique traits predictive of burnout. Residencies can use this tool to allocate resources to best support resident well-being. (C) 2019 Association of Program Directors in Surgery. Published by Elsevier Inc. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7acfe8f8821ef2822b729979f83163e3",
  "timestamp": "2025-05-15T01:56:49.581920"
}