{
  "id": 4264,
  "title": "Financial toxicity in female patients with breast cancer: a national cross-sectional study in China",
  "abstract": "Purpose To quantify financial toxicity of female patients with breast cancer in China and investigate its factors and patients' coping strategies. Methods The Comprehensive Score for Financial Toxicity (COST) is defined by using a structured questionnaire containing 12 items measuring perceived affordability of healthcare services, with the range of scoring of which being from 0 to 44 (higher score indicates lower financial toxicity). From January to March 2021, a total of 664 female patients diagnosed with stage 0-IV breast cancer were recruited from 33 public tertiary cancer hospitals located in 31 provinces of China. Multivariate linear regression models were used. Results The median age of patients was 48 years (range: 26-84 years), and 62.04% lived in urban areas. The median COST score was 21.00 (interquartile range: 15-26). Older age, higher household income, and better self-reported health status were associated with lower financial toxicity, while a bigger household size, being retired or unemployed, stage IV cancer, and a history of targeted therapy were associated with higher financial toxicity (all P < 0.05). Nearly half of the patients reported using at least one coping strategy, including considering quitting treatment, delaying treatment, and failing to take medicine or attend medical visits as instructed. The people with increased financial toxicity seem to adopt more coping strategies. Conclusions Financial toxicity and coping strategies are common among Chinese women with breast cancer. An understanding of the factors regarding financial toxicity may help oncologists and policy-makers identify at-risk patients and develop targeted interventions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ad152f596be8769d95d741aabd0de0c",
  "timestamp": "2025-05-15T02:35:26.204955"
}