{
  "id": 382,
  "title": "Data Mining Optimization Software and Its Application in Financial Audit Data Analysis",
  "abstract": "The scope of finance is very wide, data also plays a very important role in the financial industry, a small data change, and it may have a great impact on the economy. Therefore, the author proposes data mining optimization software and its application in financial audit data analysis. First, discuss the decision tree method, the main function module design of the system software, the financial analysis software method of weighted multiple random decision trees is described. To conduct verification experiments, the decision-making effect of constructing 10 random decision trees is the best. So, the author constructed a total of 10 random decision trees to analyze the data, since the tree is constructed using a random method, in order to verify the stability of decision tree classification, a total of 5 experiments were carried out, the training data set for each experiment, randomly select 1200 pieces of data from the original data set as training data, the tree is constructed by randomly selecting 12 attributes from 24 attributes. The remaining 300 pieces of data are used as verification data. As can be seen from the results, the accuracy of the random decision tree method is about 10% higher than that of C4.5. In order to improve the accuracy rate of high risk, 300 pieces of high-risk data were added to the training data set. To change the original random sampling into stratified sampling, according to the high, medium, and low risk, the original data is stratified; random sampling is used for each layer, thereby ensuring the amount of training data with high risk. The accuracy of decision tree classification is related to the number of samples of the training data, the larger the number of samples, the more accurate the classification of the constructed decision tree.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ad8f5562df2dc72204ac025deda6e57",
  "timestamp": "2025-05-15T01:50:14.049925"
}