{
  "id": 4574,
  "title": "Measuring financial protection for health in families with chronic conditions in Rural China",
  "abstract": "Background: As the world's largest developing country, China has entered into the epidemiological phase characterized by high life expectancy and high morbidity and mortality from chronic diseases. Cardiovascular diseases, chronic obstructive pulmonary diseases, and malignant tumors have become the leading causes of death since the 1990s. Constant payments for maintaining the health status of a family member who has chronic diseases could exhaust household resources, undermining fiscal support for other necessities and eventually resulting in poverty. The purpose of this study is to probe to what degree health expenditure for chronic diseases can impoverish rural families and whether the New Cooperative Medical Scheme can effectively protect families with chronic patients against catastrophic health expenditures. Methods: We used data from the 4th National Health Services Survey conducted in July 2008 in China. The rural sample we included in the analysis comprised 39,054 households. We used both households suffering from medical impoverishment and households with catastrophic health expenditures to compare the financial protection for families having a chronic patient with different insurance coverage statuses. We used a logistic regression model to estimate the impact of different benefit packages on health financial protection for families having a chronic patient. Results: An additional 10.53% of the families with a chronic patient were impoverished because of healthcare expenditure, which is more than twice the proportion in families without a chronic patient. There is a higher catastrophic health expenditure incidence in the families with a chronic patient. The results of logistic regression show that simply adding extra benefits did not reduce the financial risks. Conclusions: There is a lack of effective financial protection for healthcare expenditures for families with a chronic patient in rural China, even though there is a high coverage rate with the New Cooperative Medical Schemes. Given the coming universal coverage by the New Cooperative Medical Scheme and the increasing central government funds in the risk pool, effective financial protection for families should be possible through systematic reform of both financing mechanisms and payment methods.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ade8a2c811685fe44a904faa432fafe",
  "timestamp": "2025-05-15T02:38:56.258610"
}