{
  "id": 2597,
  "title": "Developing strategies to retain organizational insurers using a clustering technique: Evidence from the insurance industry",
  "abstract": "Formulating strategies to maintain policyholders is one of the main challenges for most insurance companies in Iran. The purpose of this article is to help marketing strategists of insurance companies predict insurees' churn and develop insurees retention strategies. Since the cost of maintaining an insurance policyholder is approximately one-eighth of the cost of attracting new ones, predicting their churn can help insurance companies adopt proper strategies in advance, which will definitely lead to saving marketing costs and maintaining the insurer's portfolio. Accordingly, the main question of this research is how to classify organizational insurees with the help of the clustering technique. This research is conducted in both qualitative and quantitative phases. In the qualitative phase, by conducting a semi-structured interview (interview protocol) with 15 experts in the insurance industry, the influential factors on policyholders' churn are identified. Then, based on the factors identified in the research literature and comparing them with the interview results, eight main factors are finalized. In the quantitative phase, in order to cluster the organizational insurees, 120 samples from the Iran Insurance Company are selected, and k-means is applied for clustering. Organizational insurees are divided into two groups according to the desired indicators. Using the results of clustering, insurees are divided into four groups, and effective marketing strategies are developed for each group. According to the results, the variable health care insurance price has the most effective role in separating the clusters at an error level of <0.01, and on the contrary, the variable liability insurance amount has the least important role at an error level of <0.978.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ae746231cf4e960953df08fd4f8d6ee",
  "timestamp": "2025-05-15T01:08:41.828794"
}