{
  "id": 4448,
  "title": "The Effect of Financial Risk Taking on Profitability in the Pharmaceutical Industry",
  "abstract": "The significance of the pharmaceutical and commercial sectors in the national economy has noticeably intensified, as a result of the COVID-19 pandemic. The main objective of this study was to gain a better insight into the main management characteristics of the actors in the sector. It was assumed that more efficient management of financial investments (acquisitions, loans) caused higher risk financial investment decisions in the pharmaceutical industry in order to place companies in a better position in view of equity investors, illustrated best as the profitability of equity (ROE). This paper examined one possible means of covering the extremely high indirect costs (R&D, marketing) of pharmaceutical companies, also justified by the restructuring of the industry and the effect of investments in long term financial instruments on the ROE of the same business entities. Built on the EMIS database, the analysis only used the indicators of those companies operating in the pharmaceutical industry in Visegrad countries for 2019. The authors sought to draw conclusions about possible management characteristics of the entire pharmaceutical sector of these countries using cluster analysis and linear regression. The initial assumption, or main hypothesis of the study, was that in one of the countries studied or for those businesses operating above a certain revenue category, the impact of a company's risk-taking (which can also be expressed in terms of asset-based financial income) on profitability, may appear or intensify. The performed studies did not show a strong correlation between the explanatory and profit variables either at the national level or at the level of groups formed by regional market position. In other words, the extremely high level of indirect costs were mostly covered by sales of successful cash products, and companies not indebted to suppliers undertook significant risks in the field of financial investments, thereby offsetting the positive impact of the latter on earnings.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7b01fbccab26425534cbfabe9242b1d0",
  "timestamp": "2025-05-15T02:37:16.927044"
}