{
  "id": 8324,
  "title": "Characteristics of Acute Gout Flare in Patients Initiated on Intravenous Bumetanide for Acute Heart Failure Exacerbation",
  "abstract": "Background Heart failure is a clinical syndrome with significant morbidity, mortality, and financial burden. These factors are magnified in patients with associated comorbidities. Therefore, addressing such conditions is critical in decreasing healthcare costs and improving patient outcomes. Gout is a major comorbidity in patients with heart failure. Acute gout flares that occur in the context of acute heart failure exacerbations (AHFE) form an independent risk factor for increased readmissions or death. In this study, we characterized the frequency and outcomes of acute gout flares in patients treated with intravenous (IV) bumetanide for AHFE. Methods This single-center retrospective cohort study included 130 adult patients admitted in a tertiarycare hospital between August 2016 and June 2018. Chart review identified patients who were hospitalized for AHFE with International Classification of Diseases, Tenth Revision (ICD-10) diagnosis code I50, received IV bumetanide, and developed an acute gout flare. Data were analyzed using the chi-square test for categorical variables and the two-sample t-test for continuous variables. Results The annualized frequency of acute gout while receiving IV bumetanide for AHFE was 7.17%. Chronic gout patients who were on colchicine and/or allopurinol while hospitalized were less likely to develop acute gout while receiving IV bumetanide for AHFE compared with those taking neither medication (p-value =0.002). There was no significant difference in length of stay or 30-day readmissions between those who developed acute gout and those who did not. Conclusions Acute gout flares occur with a notable frequency in patients hospitalized for AHFE who are administered IV bumetanide. It is important to continue patients' outpatient gout regimens in an effort to mitigate acute gout flares during this time.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7b272670498a584f6f581baf82b36ecb",
  "timestamp": "2025-05-15T03:17:49.088987"
}