{
  "id": 7060,
  "title": "Insights Into Down Syndrome Screening and Diagnostic Test Preferences Among Pregnant Women: Findings from a Cross-Sectional Study in Vietnam",
  "abstract": "Background: Screening for Down syndrome (DS) conducted in the first trimester provides essential information for expectant parents and healthcare providers to make informed decisions about further diagnostic testing and potential interventions. Objectives: This study aimed to explore the preferences and influential factors for subsequent screening and diagnostic tests among Vietnamese women at risk for DS, including non-invasive prenatal testing (NIPT) and amniocentesis. Methods: A cross-sectional study was conducted from January 2022 to January 2023 with 125 pregnant women selected through convenience sampling at a public hospital in Vietnam. Data were collected from standardized medical records and analysis forms for each participant who underwent first-trimester Double test screening at the healthcare center. Participants were stratified by DS risk thresholds ranging from 1/51 to 1/1000. Chi-square and Fisher's exact tests were used to compare the acceptance rate of screening tests between groups. Logistic regression was utilized to explore factors related to participants' preferences. Results: The majority (71.2%) of participants were under 35 years old. The prevalence of consenting to further tests was 69.7% in the high-risk group (95% CI: [54.02%, 85.38%j) and 67.4% in the moderate-risk group (95% CI: [57.81%, 76.97%1), with all participants in the moderate-risk group selecting NIPT. In the high-risk group, 65.22% preferred NIPT and 34.78% chose amniocentesis. The key reasons for declining further testing included a preference for ultrasound monitoring (70%), financial constraints (7.5%), and religious beliefs (10%). Chi-square analysis indicated a statistically significant variation in diagnostic test selection by age group, with younger women more likely to choose NIPT (P < 0.0001). Conclusions: There is a marked preference for NIPT over invasive methods, especially among younger moderately risk women. These results emphasize the need for individualized counseling and education, as well as increased support for noninvasive testing options through healthcare policy and insurance coverage.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7b35a3ffee8ab1fa9d83c36212ea26fc",
  "timestamp": "2025-05-15T03:04:23.058478"
}