{
  "id": 3766,
  "title": "Financial toxicity in pregnancy and postpartum",
  "abstract": "IntroductionThe financial burden of pregnancy in the United States can be high and is associated with worse mental health and birth outcomes. Research on the financial burden of health care, such as the development of the COmprehensive Score for Financial Toxicity (COST) tool, has been conducted primarily among patients with cancer. This study aimed to validate the COST tool and use it to measure financial toxicity and its impacts among obstetric patients. MethodsWe used survey and medical record data from obstetric patients at a large medical center in the United States. We validated the COST tool using common factor analysis. We used linear regression to identify risk factors for financial toxicity and to investigate associations between financial toxicity and patient outcomes including satisfaction, access, mental health, and birth outcomes. ResultsThe COST tool measured two distinct constructs of financial toxicity in this sample: current financial toxicity and concern over future financial toxicity. Racial/ethnic category, insurance, neighborhood deprivation, caregiving, and employment were associated with current financial toxicity (P < 0.05 for all). Only racial/ethnic category and caregiving were associated with concern over future financial toxicity (P < 0.05 for all). Both current and future financial toxicity were associated with worse patient-provider communication, depressive symptoms, and stress (P < 0.05 for all). Financial toxicity was not associated with birth outcomes or keeping obstetric visits. ConclusionsThe COST tool captures two constructs among obstetric patients, current and future financial toxicity, both of which are associated with worse mental health and patient-provider communication.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7b40643298ca7ae1738a667f88f3afa2",
  "timestamp": "2025-05-15T02:29:59.108144"
}