{
  "id": 465,
  "title": "Support System for Trading in Exchange Market by Distributional Forecasting Model",
  "abstract": "Integration of algorithms of investment theory and artificial intelligence allows one to create a support system for investors in exchange markets based on the ensemble of long-short-termmemory (LSTM) based recurrent neural networks (RNN). The proposed support system contains five stages: preparation of historical data, prediction by an ensemble of LSTM RNNs, assessment of prediction distributions, investment portfolio formation and verification. The prediction process outputs a multi-modal distribution, which provides useful information for investors. The research compares four different strategies based on a combination of distribution forecasting models. The high-low strategy helps decision-makers in exchange markets to recognize signals of transactions and fix limits for expectations. A combination of high-low-daily-weekly predictions helps investors to make daily transactions with knowing distribution of exchange rates during the week. The shift in time of five hours between London and New York inspired us to create a UK-NY strategy, which allows investors to recognize the signals of the market in a very short time. The joined high-low-UK-NY strategy increases the possibility of recognizing the signals of transactions in a very short time and of fixing the limits for day trading. So, this support system for investors is verified as a profitable tool for speculators in the relatively risky currency market.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7b518004a9f801b8f140f28d1d763e91",
  "timestamp": "2025-05-15T00:36:26.487562"
}