{
  "id": 5364,
  "title": "Does Firm Size Matter for ESG Risk? Cross-Sectional Evidence from the Banking Industry",
  "abstract": "The ambiguous evidence regarding the linkages between firm size and ESG risk in the relevant literature justifies the need for their further scientific investigation. A particularly interesting context for this task is offered by the banking industry, where financial institutions face both strong incentives to expand the scale of their activities and high reputational risk sensitivity. Given the above, this paper aims to systematize and enhance the theoretical underpinnings of the relationship between firm size and ESG risk in banks, highlighting its likely non-linear character, and to investigate it empirically in the cross-section of the international banking industry. This research employs uni- and multivariate, and linear and non-linear regression analyses applied to a sample of 668 banks that were assigned the Morningstar Sustainalytics ESG Risk Rating for the year 2021. The results demonstrate that, although, on average, size seems to be associated negatively with ESG risk in the cross-section, the relationship is in fact non-linear and follows a U-shaped pattern. The findings are robust regarding the impact of both country-specific contextual factors and outliers. This study emphasizes the importance of diseconomies of scale in ESG risk management, thus offering some important lessons and recommendations for bank executives and equity investors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7b71a8df42e525eddce9471e4625c98e",
  "timestamp": "2025-05-15T02:47:13.861656"
}