{
  "id": 9119,
  "title": "Prenatal Stress and Psychiatric Symptoms During Early Phases of the COVID-19 Pandemic in Italy",
  "abstract": "Purpose: In February 2020, Italy became the first European country to face the coronavirus disease 2019 (COVID-19) outbreak. The concerns of infection, financial worries, loss of freedom, and isolation during the ongoing pandemic can lead to negative psychological effects, including anxiety, depression, and obsessive-compulsive disorder. The main aim of our study was to evaluate the relationship between pandemic-related stress and pregnancy-specific stress and assess their role in the development of psychiatric symptoms. We predicted that pregnancy-specific stress would mediate an association of pandemic-related stress with psychiatric symptoms. Patients and Methods: A total of 258 pregnant women were assessed for general emotional symptoms with the General Anxiety Disorder-7 (GAD-7), Patient Health Questionnaire-2 (PHQ-2), and an Obsessive-Compulsive Disorder screening (OCD). The Revised Prenatal Distress Questionnaire (NuPDQ) and the Pandemic-Related Pregnancy Stress Scale (PREPS) were administered as measures of pregnancy-specific stress (PSS and pandemic-related, respectively). Mediation effects by NuPDQ for PREPS stress scales on psychiatric outcomes were calculated, using regression series and correcting for general covariates. Results: Almost a third of the sample reported clinically relevant anxiety levels (32.6%), 11.2% were positive for OCD screening and less than 5% were positive for depression screening. The stress related to feeling unprepared for delivery and postpartum (PREPS-PS) predicted PHQ-2 score, both directly and indirectly via PSS, and it predicted GAD-7 score only indirectly. The stress related to fear of infection (PREPS-PIS) was directly associated to GAD-7 score and-through PSS-to PHQ-2 score and OCD. Conclusion: The pandemic onset contributed to poor mental health, especially anxiety, in a substantial portion of Italian pregnant women. Our results emphasize the importance of strategies to reduce pregnancy-specific stress, as well as to diminish stress due to the pandemic. Identifying risk factors for psychological suffering is important to prevent poten-tial long-term consequences for mothers and their offspring.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7b841ea09ecbf973d1726d9285923376",
  "timestamp": "2025-05-15T03:25:54.541471"
}