{
  "id": 8373,
  "title": "Mental impact of Covid-19 among Spanish healthcare workers. A large longitudinal survey",
  "abstract": "Aims Longitudinal data on the mental health impact of the coronavirus disease 2019 (Covid-19) pandemic in healthcare workers is limited. We estimated prevalence, incidence and persistence of probable mental disorders in a cohort of Spanish healthcare workers (Covid-19 waves 1 and 2) -and identified associated risk factors. Methods 8996 healthcare workers evaluated on 5 May-7 September 2020 (baseline) were invited to a second web-based survey (October-December 2020). Major depressive disorder (PHQ-8 >= 10), generalised anxiety disorder (GAD-7 >= 10), panic attacks, post-traumatic stress disorder (PCL-5 >= 7), and alcohol use disorder (CAGE-AID >= 2) were assessed. Distal (pre-pandemic) and proximal (pandemic) risk factors were included. We estimated the incidence of probable mental disorders (among those without disorders at baseline) and persistence (among those with disorders at baseline). Logistic regression of individual-level [odds ratios (OR)] and population-level (population attributable risk proportions) associations were estimated, adjusting by all distal risk factors, health care centre and time of baseline interview. Results 4809 healthcare workers participated at four months follow-up (cooperation rate = 65.7%; mean = 120 days s.d. = 22 days from baseline assessment). Follow-up prevalence of any disorder was 41.5%, (v. 45.4% at baseline, p < 0.001); incidence, 19.7% (s.e. = 1.6) and persistence, 67.7% (s.e. = 2.3). Proximal factors showing significant bivariate-adjusted associations with incidence included: work-related factors [prioritising Covid-19 patients (OR = 1.62)], stress factors [personal health-related stress (OR = 1.61)], interpersonal stress (OR = 1.53) and financial factors [significant income loss (OR = 1.37)]. Risk factors associated with persistence were largely similar. Conclusions Our study indicates that the prevalence of probable mental disorders among Spanish healthcare workers during the second wave of the Covid-19 pandemic was similarly high to that after the first wave. This was in good part due to the persistence of mental disorders detected at the baseline, but with a relevant incidence of about 1 in 5 of HCWs without mental disorders during the first wave of the Covid-19 pandemic. Health-related factors, work-related factors and interpersonal stress are important risks of persistence of mental disorders and of incidence of mental disorders. Adequately addressing these factors might have prevented a considerable amount of mental health impact of the pandemic among this vulnerable population. Addressing health-related stress, work-related factors and interpersonal stress might reduce the prevalence of these disorders substantially. Study registration number: NCT04556565",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7b8a9d9c45d46300c0ca9578b9b50063",
  "timestamp": "2025-05-15T03:18:19.541372"
}