{
  "id": 7247,
  "title": "The role of financial support in preventing the need for child protection services: a mixed method study on the effects and pathways of additional income support",
  "abstract": "Previous studies show that household economic insecurity is associated with poor child health and an increased risk of child maltreatment. Therefore, it can be assumed that family financial support can also prevent the need for child protection services. This study asks: What is the association of families' poverty and granted additional income support with the need for child protection services, and through which pathways does this effect arise? The research is mixed method, and based on Finnish municipality-specific statistical data in 2019 (Sotkanet Indicator Bank, 294 municipalities) and interviews with Finnish social workers (N = 23). Linear regression analysis and qualitative methods were employed. The study shows that poverty has a positive association with the need for child protection services, but on the other hand, additional income support buffers this effect. The research has also revealed pathways through which additional income support prevents the need for child protection services. Through the interviews, pathways of immediate material help, alleviating economic stress and supporting parenting, as well as strengthening social inclusion were identified. Furthermore, the importance of social work and its cooperation practices emerged in the study.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7b8f0f4c32d5075d4c4568e807c2dfa6",
  "timestamp": "2025-05-15T03:06:35.415326"
}