{
  "id": 2351,
  "title": "Can financial markets help attain carbon goals? Evidence from systematic literature review, bibliometric analysis and topic modelling",
  "abstract": "Purpose-This paper presents a conceptual framework based on an extensive literature review. The aim of this study is to deepen understanding of the relationship between carbon performance and the financial market by applying qualitative research approaches. Design/methodology/approach - The investigation has identified 372 articles sourced from Scopus databases, subjecting the bibliographic data to a comprehensive qualitative-quantitative analysis. The research uses established protocols for a structured literature review, adhering to PRISMA guidelines, machine learning-based structural topic modelling using Python and bibliometric citation analysis. Findings - The results identified the leading academic authors, institutions and countries concerning carbon performance and financial markets literature. Quantitative studies dominate this research theme. The study has identified six knowledge clusters using topic modelling related to environmental reporting; price drivers of carbon markets; environmental policy and capital markets; financial development and carbon emissions; carbon risk and financial markets; and environmental performance and firm value. The results of the study also present the opportunities associated with carbon performance and the financial market and propose future research agendas on research through theory, characteristics, context and methodology. Practical implications - The results of the study offer insights to practitioners, researchers and academicians regarding scientific development, intricate relationships and the complexities involved in the intersection of carbon performance and financial markets. For policymakers, a better understanding of carbon performance and financial markets will contribute to designing policies to set up priorities for countering carbon emissions. Social implications - The study highlights the critical areas that require attention to limit greenhouse gas emissions and promote decarbonisation effectively. Policymakers can leverage these insights to develop targeted and evidence-based policies that facilitate the transition to a more sustainable and low-carbon economy. Originality/value - The study initially attempts to discuss the research stream on carbon performance and financial markets literature from a systematic literature review.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7b9ad243ca061dc3c5b3c476fb83a523",
  "timestamp": "2025-05-15T02:14:19.665990"
}