{
  "id": 2893,
  "title": "Systemic risk of Chinese financial institutions and asset price bubbles",
  "abstract": "Although there has not been a large-scale systemic crisis in China, high-risk financial events have occurred continuously in recent years. This research thus creatively analyzes the determinants of systemic risk for Chinese financial institutions from the view of asset price bubbles. First, we identify bubbles in the China stock and real estate markets on the basis of the generalized sup Augmented Dickey-Fuller (GSADF) model and explain the reasons for bubble formations according to the stage of China's economic development and policies implementation. At this stage, considering the differences in economic development levels of different cities, the real estate bubbles in the first, second and third tier cities and the whole country were innovatively identified. Second, on the basis of the DCG-GARCH-CoVaR model to measure the systemic risk of listed financial institutions in China and to classify institutions, the results show that the main source of such risk is the banking sector. Furthermore, by constructing regression models, stock market bubbles and real estate bubbles both positively correlate with systemic risk throughout the sample period. Meanwhile, the impact of bubbles on the systemic risk of different types of financial institutions was taken into account so that regulators prioritized different types of institutions with different characteristics when faced with decisions. Finally, we provide macroprudential policy advice to regulators in order to weaken the impact of bubbles on financial stability to avoid systemic crises.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7bae287adff7820350badc0cc9279e2a",
  "timestamp": "2025-05-15T02:20:16.918705"
}