{
  "id": 9083,
  "title": "Evidence on access to medicines for chronic diseases from household surveys in five low- and middle-income countries",
  "abstract": "The 2011 United Nations (UN) General Assembly Political Declaration on Prevention and Control of Non-Communicable Diseases (NCDs) brought NCDs to the global health agenda. Essential medicines are central to treating chronic diseases such as hypertension and diabetes. Our study aimed to quantify access to essential medicines for people with chronic conditions in five low-and middle-income countries and to evaluate how household socioeconomic status and perceptions about medicines availability and affordability influence access. We analysed data for 1867 individuals with chronic diseases from national surveys (Ghana, Jordan, Kenya, Philippines and Uganda) conducted in 2007-10 using a standard World Health Organization (WHO) methodology to measure medicines access and use. We defined individuals as having access to medicines if they reported regularly taking medicine for a diagnosed chronic disease and data collectors found a medicine indicated for that disease in their homes. We used logistic regression models accounting for the clustered survey design to investigate determinants of keeping medicines at home and predictors of access to medicines for chronic diseases. Less than half of individuals previously diagnosed with a chronic disease had access to medicines for their condition in every country, from 16% in Uganda to 49% in Jordan. Other than reporting a chronic disease, higher household socioeconomic level was the most significant predictor of having any medicines available at home. The likelihood of having access to medicines for chronic diseases was higher for those with medicines insurance coverage [highest adjusted odds ratio (OR) 3.12 (95% confidence intervals (CI): 1.38, 7.07)] and lower for those with past history of borrowing money to pay for medicines [lowest adjusted OR 0.56 (95% CI: 0.34, 0.92)]. Our study documents poor access to essential medicines for chronic conditions in five resource-constrained settings. It highlights the importance of financial risk protection and consumer education about generic medicines in global efforts towards improving treatment of chronic diseases.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7bc4b91bfa88c1bb2cb15feb054b7fe5",
  "timestamp": "2025-05-15T03:25:27.704943"
}