{
  "id": 5663,
  "title": "Determinants of bank stability in a small island economy: a study of Fiji",
  "abstract": "Purpose This study aims to examine the determinants of bank stability based on three measures of bank stability while accounting for key bank-specific, macro-finance and structural variables. The aim is to underscore key indicators of stability that can be tracked by analysts, bank managers and regulators, especially in small economies such as Fiji. Design/methodology/approach The sample comprises a balanced panel of seven banking and financial institutions over the period 2000-2018. For consistency of data and similar functions in terms of deposit and loans, this paper considers five commercial banks and two credit institutions in Fiji. A fixed-effect method of regression is applied, to control for bank heterogeneity. The dependent variable is bank stability, which is based on three measures - the Z-score, the risk-adjusted return on assets and the risk-adjusted equity to assets ratio. Findings It is noted that bank size, funding risk, credit risk and Herfindahl-Hirschman index are positively associated with bank stability. In the extended model, both inflation and economic growth are positively associated with bank stability, although only inflation is statistically significant. Moreover, factors having a negative association with bank stability are the liquidity risk, the net interest margin and the remittances inflow. Additionally, the domestically generated political crises of the years 2000 and 2006 and the global financial crisis of 2007-2008 are negatively associated with bank stability. Originality/value This study empirically examines the determinants of bank stability in Fiji's banking sector. Unlike previous studies, this study considers three measures of stability, with z-score as the dominant measure and as explanatory variables, bank-specific, macro-finance and structural variables. The bank-specific data used in the study were hand-picked from the disclosure statements of banks and macro-finance data were extracted from the World Bank Indicators. The study underscores pertinent factors associated with bank stability in the small island economy of Fiji, which can be of interest to analysts, bankers, regulators and researchers in this domain.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7bcb3e06af7f060744cfb9d77212b5dc",
  "timestamp": "2025-05-15T02:50:21.132229"
}