{
  "id": 7508,
  "title": "Energy poverty in Sweden: Using flexibility capital to describe household vulnerability to rising energy prices",
  "abstract": "Energy poverty has been kept at bay in Sweden for the past decades owing to several beneficial circumstances. However, geopolitical pressure and an accelerating energy transition are changing the circumstances and exposing vulnerabilities to energy poverty in Sweden particularly connected to electricity price peaks. The cir-cumstantial nature of the exposed risks for energy poverty motivates a conceptualisation of the concept in Sweden through the energy vulnerability framework. Also recognising that flexibility is an important ability to be able to dodge short-term price peaks, this paper combines the energy vulnerability literature with the concept of flexibility capital. Using national survey data from 2021, this study seeks to explore vulnerability to heating -related energy poverty in Swedish single-family housing by analysing factors influencing households' self -perceived ability to pay for heating as well as their self-perceived flexibility capital. Logistic regression models revealed that there are geographic as well as sociodemographic factors influencing the energy vulner-ability experienced by Swedish households. Extending the understanding of energy poverty vulnerability beyond mere heating affordability provides a more nuanced understanding of the different types of risks that may emerge among households; for example, low affordability combined with low flexibility capital increases the risk for financial effects of energy poverty, whereas low affordability combined with high flexibility capital increases the risk for energy poverty affecting comfort, convenience and wellbeing. By integrating energy vulnerability with flexibility capital, this paper contributes to a more holistic understanding of challenges connected to a tran-sitioning energy system in general and in the Swedish context in particular.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7bd9ff130453e15e7521ba1399b0ef86",
  "timestamp": "2025-05-15T03:09:07.366932"
}