{
  "id": 5710,
  "title": "Geospatial modelling to estimate the territory at risk of establishment of influenza type A in Mexico-An ecological study",
  "abstract": "The aim of this study was to estimate the territory at risk of establishment of influenza type A (EOITA) in Mexico, using geospatial models. A spatial database of 1973 outbreaks of influenza worldwide was used to develop risk models accounting for natural (natural threat), anthropic (man-made) and environ -mental (combination of the above) transmission. Then, a virus establishment risk model; an introduction model of influenza A developed in another study; and the three models mentioned were utilized using multi-criteria spatial evaluation supported by geographically weighted regression (GWR), receiver operating acteristic analysis and Moran's I. The results show that environ mental risk was concentrated along the Gulf and Pacific coasts, the Yucatan Peninsula and southern Baja California. The identified risk for EOITA in Mexico were: 15.6% and 4.8%, by natural anthropic risk, respectively, while 18.5% presented simultaneous environmental, natural and anthropic risk. Overall, 28.1% localities in Mexico presented a High/High risk for the establish- ment of influenza type A (area under the curve=0.923, P<0.001; GWR, r2=0.840, P<0.001; Moran's I =0.79, P<0.001). Hence, these geospatial models were able to robustly estimate those susceptible to EOITA, where the results obtained show the tion between the geographical area and the different effects health. The information obtained should help devising and direct ing strategies leading to efficient prevention and sound adminis- tration of both human and financial resources.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7bda6cef7c8d0d3fb6792a82178bf7d4",
  "timestamp": "2025-05-15T02:50:21.405573"
}