{
  "id": 2387,
  "title": "Soft Actor-Critic Algorithm Featured Residential Demand Response Strategic Bidding for Load Aggregators",
  "abstract": "Load aggregators (LAs) gather regional demand response (DR) resources as a representative of regional users to transact with the grid. They achieve this by facilitating residential customers to flexibly participate in DR programs. This article proposes a residential DR strategic bidding approach for LAs to improve system reliability while maximizing their financial advantages. It is based on the deep reinforcement learning (DRL) algorithm and is capable of overcoming the computational limitations of conventional model-based strategy design. A probabilistic model considering the electricity usage habits and response willingness was developed to reliably quantify the uncertainty responsive behaviors. A DR bidding model considering bilateral interaction with declaration risk was developed to balance the contradictory relationship between subsidy prices with uncertain DR quantities. In addition, the soft actor-critic algorithm was implemented to optimize the decision-making process, and thereby, optimize the continuous-action-space problem of maximizing the profits of LAs by DR scheduling. The proposed approach demonstrated its effectiveness and superiority in diverse DR situations, compared with a conventional method and another DRL approach.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7be233298e9e392d261356504b5edb14",
  "timestamp": "2025-05-15T02:14:50.307531"
}