{
  "id": 7838,
  "title": "Do post-quitting experiences predict smoking relapse among former smokers in Australia and the United Kingdom? Findings from the International Tobacco Control Surveys",
  "abstract": "Introduction Many smokers attempt to stop smoking every year, but the vast majority of quit attempts fail. This study examined prospectively the association between post-quitting experiences and smoking relapse among ex-smokers in Australia and the United Kingdom. Methods Data came from 584 adult ex-smokers from Australia and the United Kingdom who participated in Wave 9 of the International Tobacco Control Four Country Survey and successfully followed up a year later (Wave 10). Binary logistic regression was used to examine whether baseline post-quitting experiences predicted relapse back to smoking at follow-up. Results Ex-smokers who perceived their stress coping ability had gotten worse since quitting were more likely to relapse back to smoking compared to their counterparts who reported no change (odds ratio = 5.77, 95% confidence interval = 1.64, 20.31, P < 0.01). Ex-smokers who reported their homes had become fresher and cleaner post quitting were less likely to relapse compared to those who did not notice any change (odds ratio = 0.34, 95% confidence interval = 0.13, 0.93, P < 0.05). Perceived changes in life enjoyment, negative affect control, social confidence, work performance, leisure time and financial situation did not independently predict relapse. No country differences were found. Discussion and Conclusions The study showed that ex-smokers' relapse risk was elevated if they perceived any negative impact of quitting on their stress coping whereas relapse risk was reduced if they perceived any positive impact of quitting on the home (e.g. fresher and cleaner). Helping ex-smokers to develop alternative stress coping strategies and highlighting the positive impacts of quitting smoking on the homes may help protect against smoking relapse.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7bf0d95a5062308d9b9608c2ee186b2e",
  "timestamp": "2025-05-15T03:12:36.496214"
}