{
  "id": 4178,
  "title": "Financial health of Syariah and non-Syariah banks: a comparative analysis",
  "abstract": "Purpose This paper aims to investigate whether Syariah banks are more financially stable than non-Syariah banks and check the differential impact of explanatory variables in financial health and efficiency in the context of Indonesia. Design/methodology/approach By using unbalanced panel data from Bankfocus over the period 2011-2018, regression analysis is performed with two response variables representing financial health, ZSCORE for return on average assets, liquid asset to deposit and short-term funding ratio. A number of control variables are used as tools to confirm the hypotheses. To check the robustness of the findings, a model with different specifications has been used. Findings The results indicate that while Syariah banks present higher insolvency risk (less health) for long-term activity, the opposite is true for short-term activity. Other findings show that Syariah and non-Syariah banks contribute differently to the national system of financial stability owing to varying influential factors on the bank's health. Originality/value This paper presents a comparative analysis between the financial stability of Syariah banks and that of non-Syariah banks in Indonesia by building an empirical framework that allows the author to examine the differential effects of each underlying feature on financial stability in Syariah and non-Syariah banks.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c0627003185e75d8e62b49f1c0bd29c",
  "timestamp": "2025-05-15T02:34:13.386650"
}