{
  "id": 5995,
  "title": "Bridging the gap between management and finance: entrepreneurial orientation and idiosyncratic risk",
  "abstract": "Purpose Management theorists suggest that entrepreneurially oriented firms manifest higher risk levels than more conservative companies, but executives of such firms and their consultants argue that the opposite is true. The purpose of this paper is to explore this issue and examine the relationship between entrepreneurial orientation and idiosyncratic risk of firms. Design/methodology/approach Content analysis is applied to the 2018 third-quarter earnings call transcripts for 992 companies to measure five factors attributed to entrepreneurially oriented firms: autonomy, competitive aggressiveness, innovation, proactiveness and risk-taking, and their relationship to firm-level idiosyncratic risk. Multivariate regression analysis is used to examine the effect of these factors on measures of idiosyncratic risk obtained from the Wharton Research database Service's Beta Suite. Findings Results show that firms whose executives frequently use terms related to risk-taking tend to manifest higher levels of idiosyncratic risk, but those firms whose executives stress innovation-related terms tend to have lower levels of idiosyncratic risk. The degree to which executives use words related to the three other entrepreneurial orientation factors show no associations with idiosyncratic risk. Practical implications The results might suggest to managers which of the individual components of entrepreneurial orientation, if adopted, are likely to affect firm-specific risk and in what way. Originality/value This paper is the first to attempt to bridge the gap between the management concept of entrepreneurial orientation and the financial concept of idiosyncratic risk by studying the possible relationship between the two. The research also uses the novel methodology of applying content analysis to earnings call transcripts, which is uncommon in finance research.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c06cf2bc0e35a406f026848559ca8fd",
  "timestamp": "2025-05-15T02:53:33.461565"
}