{
  "id": 6680,
  "title": "Patterns of Preoperative Consultation and Surgical Specialty in an Integrated Healthcare System",
  "abstract": "Background: Many patients scheduled for elective surgery are referred for a preoperative medical consultation. Only limited data are available on factors associated with preoperative consultations. The authors hypothesized that surgical specialty contributes to variation in referrals for preoperative consultations. Methods: This is a cohort study using data from Group Health Cooperative, an integrated healthcare system. The authors included 13,673 patients undergoing a variety of common procedures-primarily low-risk surgeries-representing six surgical specialties, in 2005-2006. The authors identified consultations by family physicians, general internists, pulmonologists, or cardiologists in the 42 days preceding surgery. Multivariable logistic regression was used to estimate the association between surgical specialty and consultation, adjusting for potential confounders including the revised cardiac risk index, age, gender, Deyo comorbidity index, number of prescription medications, and 11 medication classes. Results: The authors found that 3,063 (22%) of all patients had preoperative consultations, with significant variation by surgical specialty. Patients having ophthalmologic, orthopedic, or urologic surgery were more likely to have consultations compared with those having general surgery-adjusted odds ratios (95% CI) of 3.8 (3.3-4.2), 1.5 (1.3-1.7), and 2.3 (1.8-2.8), respectively. Preoperative consultations were more common in patients with lower revised cardiac risk scores. Conclusion: There is substantial practice variation among surgical specialties with regard to the use of preoperative consultations in this integrated healthcare system. Given the large number of consultations provided for patients with low cardiac risk and for patients presenting for low-risk surgeries, their indications, the financial burden, and cost-effectiveness of consultations deserve further study.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c0c8ab2998246b08c28b44ec82c5e4f",
  "timestamp": "2025-05-15T03:00:35.385983"
}