{
  "id": 452,
  "title": "Alcohol policy changes during the first three-months of the COVID-19 pandemic: Development and application of a classification scheme",
  "abstract": "Background: Policy changes in response to the COVID-19 pandemic have impacted on alcohol control. This study describes the development and application of a classification scheme to map alcohol policy changes during the first three -months of the COVID-19 pandemic in five countries and/or subnational jurisdictions. Method: A pre -registered systematic review of policy decisions from March to May 2020, in Australia/New South Wales, Canada/Ontario, Chile, Italy and the United Kingdom. One author extracted the data for each jurisdiction using a country -specific search strategy of government documents. We coded policy changes using an adapted WHO classification scheme, whether the policy was expected to tighten or loosen alcohol control, have mainly immediate or delayed impact on consumption and harm and impact the general population versus specific populations. We present descriptive statistics of policy change. Results: We developed a classification scheme with four levels. Existing policy options were insufficient to capture policy changes in alcohol availability, thus we added seventeen new sub -categories. We found 114 alcohol control policies introduced across the five jurisdictions, covering five (out of ten) WHO action areas. The majority aimed to change alcohol availability, by regulating the operation of alcohol outlets. All countries introduced closures to on -premise alcohol outlets and, except Chile, allowed off -sales via take away or home delivery. We also observed several pricing policies introducing subsidies to support the alcohol industry. Seventy-four percent of policy changes were expected to tighten alcohol control and 12.3 % to weaken control. Weakening policy changes were mostly related to retail mode switching or expansion (allowing take away or home delivery). Conclusion: Alcohol control policies during the first three months of the COVID-19 pandemic were targeted primarily at alcohol availability and about one tenth might weaken alcohol control. Temporary changes to",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c19e7d7703abf72705f0d7f83a500f3",
  "timestamp": "2025-05-15T01:32:30.127118"
}