{
  "id": 9099,
  "title": "Environmental Concerns and Stewardship Behaviors Among Rural Landowners: What Supports Farmers and Non-farmers in Being Good Stewards?",
  "abstract": "Intensive agriculture is a main factor of biodiversity and ecosystem services loss globally. It is therefore of great importance to understand how rural landowners are managing their lands and how environmental stewardship behaviors could be strengthened. Farming and non-farming rural landowners are often considered a homogenous group. In reality, however, they vary by their histories, attitudes, interests, and resources. While many rural landowners manage their lands with environmental values in mind, others may struggle to do so. Ignoring this diversity poses the risk that planning and policy for sustainable agriculture are less effective than they could be. Hence, it is of interest to understand the variety of environmental perceptions and stewardship behaviors across these varied groups. To help addressing this knowledge gap, we conducted a survey of 1,200 farming and non-farming rural landowners, using Ontario as a case study. We specifically investigated whether farming landowners differed from non-farming landowners in expressed environmental concerns and stewardship behaviors, as well as what the roles are of participation in conservation incentive programs, demographic factors, and landholding characteristics. We analyzed survey answers with logistic regression and text analysis. Our results suggest that farming landowners are generally less environmentally concerned than non-farming landowners. However, it appears that this difference may be less driven by farm ownership than by contextual factors, such as landowner age and participation in conservation programs. Participation in conservation programs was more pronounced for non-farming landowners and was associated with higher likelihood of environmental concerns and engaging with stewardship behaviors. In contrast, higher age emerged as predictor of lower environmental concerns. In addition, we found that cost factors and knowledge needs were important barriers for stewardship behaviors across farming and non-farming rural landowners. Based on our results, we are making recommendations for increasing the effectiveness of agricultural sustainability planning and policy in Ontario, focusing on reducing financial and knowledge barriers to pro-environmental land management behaviors.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c1a98196d6fa1bd6d71f0dee6c06c16",
  "timestamp": "2025-05-15T03:25:27.772137"
}