{
  "id": 480,
  "title": "A neural-network-based decision-making model in the peer-to-peer lending market",
  "abstract": "This study proposes an investment recommendation model for peer-to-peer (P2P) lending. P2P lenders usually are inexpert, so helping them to make the best decision for their investments is vital. In this study, while we aim to compare the performance of different artificial neural network (ANN) models, we evaluate loans from two perspectives: risk and return. The net present value (NPV) is considered as the return variable. To the best of our knowledge, NPV has been used in few studies in the P2P lending context. Considering the advantages of using NPV, we aim to improve decision-making models in this market by the use of NPV and the integration of supervised learning and optimization algorithms that can be considered as one of our contributions. In order to predict NPV, three ANN models are compared concerning mean square error, mean absolute error, and root-mean-square error to find the optimal ANN model. Furthermore, for the risk evaluation, the probability of default of loans is computed using logistic regression. Investors in the P2P lending market can share their assets between different loans, so the procedure of P2P investment is similar to portfolio optimization. In this context, we minimize the risk of a portfolio for a minimum acceptable level of return. To analyse the effectiveness of our proposed model, we compare our decision-making algorithm with the output of a traditional model. The experimental results on a real-world data set show that our model leads to a better investment concerning both risk and return.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c1f34ad85f0ba8623db95ece2c059d7",
  "timestamp": "2025-05-15T00:43:47.421129"
}