{
  "id": 8810,
  "title": "Effect of Partner Violence in Adolescence and Young Adulthood on Blood Pressure and Incident Hypertension",
  "abstract": "Intimate partner violence has adverse health consequences, but little is known about its association with hypertension. This study investigates sex differences in the relationship between intimate partner violence and blood pressure outcomes. Data included 9,699 participants from waves 3 (2001-02) and 4 (2008-09) of the National Longitudinal Study of Adolescent Health (51% female). Systolic (SBP) and diastolic (DBP) blood pressure and incident hypertension (SBP >= 140 mmHg, DBP >= 90 mmHg, or taking antihypertensive medication) were ascertained at wave 4. Intimate partner violence was measured at wave 3 with 8 items from the revised Conflict Tactics Scales. Separate victimization and perpetration scores were calculated. Sex-specific indicators of severe victimization and perpetration were created using the 66th percentile among those exposed as a cut point. Sex-specific, linear and logistic regression models were developed adjusting for age, race, financial stress, and education. Thirty-three percent of men and 47% of women reported any intimate partner violence exposure; participants were categorized as having: no exposure, moderate victimization and / or perpetration only, severe victimization, severe perpetration, and severe victimization and perpetration. Men experiencing severe perpetration and victimization had a 2.66 mmHg (95% CI: 0.05, 5.28) higher SBP and a 59% increased odds (OR: 1.59, 95% CI: 1.07, 2.37) of incident hypertension compared to men not exposed to intimate partner violence. No other category of violence was associated with blood pressure outcomes in men. Intimate partner violence was not associated with blood pressure outcomes in women. Intimate partner violence may have long-term consequences for men's hemodynamic health. Screening men for victimization and perpetration may assist clinicians to identify individuals at increased risk of hypertension.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c26a99f86c4acb3cf997e8f6e76f605",
  "timestamp": "2025-05-15T03:22:26.129578"
}