{
  "id": 8879,
  "title": "Risky Drinking Patterns Are Being Continued into Pregnancy: A Prospective Cohort Study",
  "abstract": "Background: Risky patterns of alcohol use prior to pregnancy increase the risk of alcohol-exposed pregnancies and subsequent adverse outcomes. It is important to understand how consumption changes once women become pregnant. Objective: The aim of this study was to describe the characteristics of women that partake in risky drinking patterns before pregnancy and to examine how these patterns change once they become pregnant. Methods: A sample of 1577 women from the 1973-78 cohort of the Australian Longitudinal Study on Women's Health were included if they first reported being pregnant in 2000, 2003, 2006, 2009 and reported risky drinking patterns prior to that pregnancy. Multinomial logistic regression was used to determine which risky drinking patterns were most likely to continue into pregnancy. Results: When reporting risky drinking patterns prior to pregnancy only 6% of women reported weekly drinking only, whereas 46% reported binge drinking only and 48% reported both. Women in both binge categories were more likely to have experienced financial stress, not been partnered, smoked, used drugs, been nulliparous, experienced a violent relationship, and were less educated. Most women (46%) continued these risky drinking patterns into pregnancy, with 40% reducing these behaviors, and 14% completely ceasing alcohol consumption. Once pregnant, women who binged only prior to pregnancy were more likely to continue (55%) rather than reduce drinking (29%). Of the combined drinking group 61% continued to binge and 47% continued weekly drinking. Compared with the combined drinking group, binge only drinkers prior to pregnancy were less likely to reduce rather than continue their drinking once pregnant (OR = 0.37, 95% CI = 0.29, 0.47). Conclusions: Over a third of women continued risky drinking into pregnancy, especially binge drinking, suggesting a need to address alcohol consumption prior to pregnancy.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c2fb641ff087bfcc7dff7e20d096419",
  "timestamp": "2025-05-15T03:23:27.784945"
}