{
  "id": 252,
  "title": "Network based Enterprise Profiling with Semi-Supervised Learning",
  "abstract": "Enterprise evaluation provides indicators such as ratings and scores by analyzing the characteristics and capabilities of enterprises. The business performance, the level of credit risk, and the economic value of technology are quantitatively evaluated. Although the existing methods are well established, they need improvement in three aspects: fragmentation of information, interpretability of results, and objectivity of evaluation. First, existing methods selectively utilizes the information according to its own purpose. Second, it is hard for those results to understand the rationale of evaluation and the characteristics of enterprise. Third, unofficial information such as personal opinions or profit structures are included in the evaluation. Motivated by the limitations, we propose a machine learning-based enterprise evaluation method consisting of diversified quantification and semi-supervised learning. By quantifying various information, the analysis for identifying enterprise characteristics is primarily performed, and the results are derived as several remarkable features to improve interpret-ability. Then, by constructing the network, enterprises have compared each other, and they are objectively evaluated by label propagation on the enterprise network. The output is measured as a score, and later its distribution is binned into five grades to improve practicality and usefulness. The proposed method was applied to the dataset of 27,790 enterprises with 113 variables about financial and R&D information. The results show clear identification of enterprise characteristics with the high accuracy of evaluation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c4adcf0807ca33384bdf3255e9d72d5",
  "timestamp": "2025-05-15T01:48:30.799863"
}