{
  "id": 1714,
  "title": "Interpretable machine learning models for ESG stock prices under transition and physical climate risk",
  "abstract": "This study investigates the relationship between climate change risks, namely transition and physical risks, and their predictive effects on Environmental, Social, and Governance (ESG) stock prices. We assessed the performance of various machine learning models by analyzing daily time series data from January 2006 to July 2022. Our results indicate that incorporating climate risk variables significantly enhances the accuracy and effectiveness of these models in predicting ESG stock market prices, highlighting the crucial role of climate-related factors in financial modeling. To better understand the dependencies between the variables, we employ a novel copula-based dependence measure (qda) to quantify the deviation from independence in the dependency structure. In addition, we utilized explainable artificial intelligence (XAI) techniques such as SHAP plots to interpret the complex machine learning algorithms used in this study. These techniques reveal the significant impacts of variables, such as inflation, recession, pollution levels, and climate risk indices, on the SP 500 ESG index. From a policy perspective, our findings emphasize the need for policymakers to integrate climate change risks into stock market regulations and guidance, thereby enhancing market resilience and supporting informed decision-making among investors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c55174a139512f0604a21e0fd4d7137",
  "timestamp": "2025-05-15T02:06:52.641853"
}