{
  "id": 6874,
  "title": "Exploring the ability of self-report measures to identify risk of high treatment burden in chronic disease patients: a cross-sectional study",
  "abstract": "Background Effective self-management of chronic health conditions is key to avoiding disease escalation and poor health outcomes, but self-management abilities vary. Adequate patient capacity, in terms of abilities and resources, is needed to effectively manage the treatment burden associated with chronic health conditions. The ability to measure different elements of capacity, as well as treatment burden, may assist to identify those at risk of poor self-management. Our aims were to: 1. Investigate correlations between established self-report tools measuring aspects of patient capacity, and treatment burden; and 2. Explore whether individual questions from the self-report tools will correlate to perceived treatment burden without loss of explanation. This may assist in the development of a clinical screening tool to identify people at risk of high treatment burden. Methods A cross-sectional survey in both a postal and online format. Patients reporting one or more chronic diseases completed validated self-report scales assessing social, financial, physical and emotional capacity; quality of life; and perceived treatment burden. Logistic regression analysis was used to explore relationships between different capacity variables, and perceived high treatment burden. Results Respondents (n = 183) were mostly female (78%) with a mean age of 60 years. Most participants were multimorbid (94%), with 45% reporting more than five conditions. 51% reported a high treatment burden. Following logistic regression analyses, high perceived treatment burden was correlated with younger age, material deprivation, low self-efficacy and usual activity limitation. These factors accounted for 50.7% of the variance in high perceived treatment burden. Neither disease burden nor specific diagnosis was correlated with treatment burden. Conclusions This study supports previous observations that psychosocial factors may be more influential than specific diagnoses for multimorbid patients in managing their treatment workload. A simple capacity measure may be useful to identify those who are likely to struggle with healthcare demands.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c55f3eeff140b128d865f1835fe6bf4",
  "timestamp": "2025-05-15T03:02:41.167059"
}