{
  "id": 254,
  "title": "A Study on Early Warnings of Financial Crisis of Chinese Listed Companies Based on DEA-SVM Model",
  "abstract": "In the era of big data, investor sentiment will have an impact on personal decision making and asset pricing in the securities market. This paper uses the Easteconomy stock forum and Sina stock forum as the carrier of investor sentiment to measure the positive sentiment index based on stockholders' comments and to construct an evaluation index system for the public opinion dimension. In addition, the evaluation index system is constructed from four dimensions, which include operation, innovation, finance and financing, to evaluate the overall condition of listed companies from multiple perspectives. In this paper, the SBM model in the data envelopment analysis method is used to measure the efficiency values of each dimension of the multidimensional efficiency evaluation index system, and the efficiency values of each dimension are the multidimensional efficiency indicators. Subsequently, two sets of input feature indicators of the SVM model were established: one set contains traditional financial indicators and multidimensional efficiency indicators, and another set has only traditional financial indicators. The early warning accuracy of the two sets of input feature indicators was empirically analyzed based on the support vector machine early warning model. The results show that the early warning model incorporating multidimensional efficiency indicators has improved the accuracy compared with the early warning model based on traditional financial indicators. Then, the model was optimized by the particle swarm intelligent optimization algorithm, and the robustness of the results was tested. Moreover, six mainstream machine learning methods, including Logistic Regression, GBDT, CatBoost, AdaBoost, Random Forest and Bagging, were used to compare with the early warning effect of the DEA-SVM model, and the empirical results show that DEA-SVM has high early warning accuracy, which proves the superiority of the proposed model. The findings of this study have a positive effect on further preventing and controlling the financial crisis risk of Chinese-listed companies and promoting as well as facilitating the healthy growth of Chinese-listed companies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c680f7e209be2033843b3917c3cc3ec",
  "timestamp": "2025-05-15T01:48:30.807036"
}