{
  "id": 2282,
  "title": "Model-agnostic explainable artificial intelligence methods in finance: a systematic review, recent developments, limitations, challenges and future directions",
  "abstract": "The increasing integration of Artificial Intelligence (AI) and Machine Learning (ML)-algorithms that enable computers to identify patterns from data-in financial applications has significantly improved predictive capabilities in areas such as credit scoring, fraud detection, portfolio management, and risk assessment. Despite these advancements, the opaque, black box nature of many AI and ML models raises critical concerns related to transparency, trust, and regulatory compliance. Explainable Artificial Intelligence (XAI) aims to address these issues by providing interpretable and transparent decision-making processes. This study systematically reviews Model-Agnostic Explainable AI techniques, which can be applied across different types of ML models in finance, to evaluate their effectiveness, scalability, and practical applicability. Through analysis of 150 peer-reviewed studies, the paper identifies key challenges, such as balancing interpretability with predictive accuracy, managing computational complexity, and meeting regulatory requirements. The review highlights emerging trends toward hybrid models that combine powerful ML algorithms with interpretability techniques, real-time explanations suitable for dynamic financial markets, and XAI frameworks explicitly designed to align with regulatory standards. The study concludes by outlining specific future research directions, including the development of computationally efficient explainability methods, regulatory-compliant frameworks, and ethical AI solutions to ensure transparent and accountable financial decision-making.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7c80db32a4f025c1e77170413a89b294",
  "timestamp": "2025-05-15T02:13:31.783970"
}