{
  "id": 2863,
  "title": "AI-driven valuation: a new era for real estate appraisal",
  "abstract": "PurposeThis paper explores the emergence of artificial intelligence (AI) in real estate valuation, analysing its potential to enhance accuracy, efficiency and transparency in the appraisal process and examines the implications of this technological shift for various stakeholders.Design/methodology/approachThis research adopts a comprehensive literature review approach, drawing upon existing research in real estate, computer science and related fields. A systematic analysis of scholarly publications and industry trends was conducted to examine the underlying technologies, diverse applications, potential benefits, inherent limitations and future trends associated with AI-driven valuation models, including machine learning and deep learning methods.FindingsThe study reveals that AI-powered valuation models offer significant advantages over traditional appraisal methods, including enhanced accuracy, increased efficiency, reduced costs and improved risk management. However, critical challenges related to data bias, algorithmic transparency (the black box problem), and the need for human oversight must be addressed to ensure responsible and effective AI implementation.Originality/valueThis paper provides insights into the transformative potential of AI in real estate valuation for a wide range of stakeholders. Real estate professionals can gain a better understanding of how AI can enhance their decision-making processes, improve efficiency and mitigate risk. Appraisers will benefit from the paper's analysis of evolving skillsets required in the AI era, while lenders and investors will gain a clearer understanding of how AI-driven valuation can strengthen risk assessment and portfolio management. Policymakers can utilize this research to inform the development of ethical guidelines and regulations for AI adoption in real estate appraisal.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7caef1f48d3b71ec955910e965cf03d8",
  "timestamp": "2025-05-15T01:11:17.415896"
}