{
  "id": 9194,
  "title": "An analysis of risk management disclosures: Australian evidence",
  "abstract": "Purpose - Communication of risk management (RM) practices are a critical component of good corporate governance. Research, to date, has been of little benefit in informing regulators internationally. This paper seeks to contribute to the literature by investigating how listed Australian companies disclose RM information in annual report governance statements in accordance with the Australian Securities Exchange (ASX) corporate governance framework. Design/methodology/approach - To address this study's research questions and related hypotheses, the authors examine the top 300 ASX-listed companies by market capitalisation at 30 June 2010. For these firms, the authors identify, code and categorise RM disclosures made in the annual according to the disclosure categories specified in ASX Corporate Governance Principles and Recommendations (CGPR). The derived data are then examined using a comprehensive approach comprising thematic content analysis and regression analysis. Findings - The results indicate widespread divergence in disclosure practices and low conformance with the Principle 7 of the ASX CGPR. This result suggests that companies are not disclosing all material business risks possibly due to ignorance at the board level, or due to the intentional withholding of sensitive information from financial statement users. The findings also show mixed results across the factors expected to influence disclosure behaviour. While the presence of a risk committee (RC) (in particular, a standalone RC) and technology committee (TC) are found to be associated with some improvement in disclosure levels, the authors do not find evidence that company risk measures (as proxied by equity beta and the market-to-book ratio) are significantly associated with greater levels of RM disclosure. Also, contrary to common findings in the disclosure literature, factors such as board independence and expertise, audit committee independence and the usage of a Big-4 auditor do not seem to impact the level of RM disclosure in the Australian context. Research limitations/implications - The study is limited by the sample and study period selection as the RM disclosures of only the largest (top 300) ASX firms are examined for the fiscal year 2010. Thus, the findings may not be generalisable to smaller firms or earlier/later years. Also, the findings may have limited applicability in other jurisdictions with different regulatory environments. Practical implications - The study's findings suggest that insufficient attention has been applied to RM disclosures by listed companies in Australia. These results suggest RM disclosures practices observed in the Australian setting may not be meeting the objectives of regulators and the needs of stakeholders. Originality/value - The Australian setting provides an ideal environment to examine RM communication as the ASX has explicitly recommended RM disclosures areas in its principle- based governance rules since 2007 (Principle 7). This differs from other jurisdictions where such disclosure recommendations are typically not provided and provides us with a benchmark to examine the nature and quality of RM disclosures. Despite the recommendation, the authors reveal that low levels and poor RM communication are prevalent in the Australian setting and warrant further investigation.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7caeaba7307928636fd08b661b3b0c6c",
  "timestamp": "2025-05-15T03:26:26.005489"
}