{
  "id": 98,
  "title": "Multi-period mean-variance portfolio selection with real constraints based on machine learning",
  "abstract": "Machine learning has been widely applied to predict asset returns and can improve static portfolio selection model performance by handling complex financial information. However, investment is a dynamic process in the real world. This paper studies a multi-period portfolio selection problem based on machine learning. The mean and variance of the multi-period portfolio selection are calculated by the predicted returns, which are forecasted by Support Vector Regression, Elastic-Net, and eXtreme Gradient Boosting. By considering transaction costs, borrowing constraints, upper and lower bounds, cardinality constraints, and bankruptcy control, a novel multi-period mean-variance portfolio selection model with real constraints based on machine learning is proposed. Due to the transaction costs, cardinality constraints, and bankruptcy control, the proposed model is a non-linear mix-integer programming problem with path dependence, which is an NP-Hard problem. The solution can be obtained by Particle Swarm Optimization, Differential Evolution, Genetic Algorithm, and Immune Algorithm, respectively. The 39 assets of the Shanghai Stock Exchange (SSE), China, from January 1, 2013, until December 31, 2022, are collected as a case. The in-sample analysis explores the impact of parameters on the terminal wealth. The out-of-sample analysis evaluates the efficiency and advantages of the proposed model by comparing it with three benchmark models. Machine Learning reduces the prediction error of asset returns, and helps improve the effectiveness of multi-period investment. The proposed model is practical because it introduces realistic constraints and can be applied in stock and fund management.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7cb3257e405325f7f7727c20194b36c6",
  "timestamp": "2025-05-15T00:39:32.465492"
}