{
  "id": 2482,
  "title": "Resilience and Risk Factors Predict Family Stress Among Married Palestinians in Israel During the COVID-19 Pandemic",
  "abstract": "The present study examined effects of sociodemographic, risk, and resilience factors on marital, parental, and financial stress early in the COVID-19 pandemic. A cross-sectional online survey was conducted among 480 married Palestinians living in Israel, using self-report questionnaires. Descriptive statistics and bivariate correlations were computed. Then, hierarchical multiple regression analyses were conducted to predict each of the three stress measures. Finally, dominance analyses were conducted to compare the contributions of sociodemographic, risk, and resilience factors. The results showed considerable differences between predictors of marital and parental stress and predictors of financial stress. For marital and parental stress, resilience factors mainly family resilience were the strongest predictors, followed by risk factors and then sociodemographic characteristics. For financial stress, risk factors (mainly financial damage and prior stressful life events) were the strongest predictors, followed by sociodemographic characteristics and resilience factors (mainly individual resilience). These results suggest that family and individual resilience reduce marital and parental stress under difficult conditions, including the COVID-19 pandemic. Though resilience has been found to ameliorate financial stress to some extent, it appears that other measures are required to manage stress related to financial difficulties.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7cb39a2b4f44d4ea119602a0adc918cd",
  "timestamp": "2025-05-15T02:15:59.841623"
}