{
  "id": 1116,
  "title": "A Data-Driven Model on Google Earth Engine for Landslide Susceptibility Assessment in the Hengduan Mountains, the Qinghai-Tibetan Plateau",
  "abstract": "Amplifying landslide hazards in the backdrop of warming climate and intensifying human activities calls for an integrated framework for accurately evaluating landslide susceptibility at fine spatiotemporal resolutions, which is critical for the mitigation of increasingly high landslide disaster risks. Yet, dynamic landslide susceptibility mapping is still lacking. Using high-quality data, from 14,435 landslides and non-landslides, we developed an efficient holistic framework for evaluating landslide susceptibility, considering landslide-relevant internal and external factors based on cloud computing platform and algorithmic models, which enables dynamic updating of a landslide susceptibility map at the regional scale, particularly in regions with highly complicated topographical features such as the Hengduan Mountains, as considered in this study. We compared Classification and Regression Trees (CART), Support Vector Machines (SVM), and Random Forest (RF) classifiers to screen out the best portfolio model for landslide susceptibility mapping on the Google Earth Engine (GEE) platform. We found that the Random Forest (RF) classifier integrated with synergy mode had the best modeling performance, with 90.48% and 89.24% accuracy and precision, respectively. We also found that forests and grasslands had the controlling effect on the occurrence of landslides, while human activities had a notable inducing effect on the occurrence of landslides within the Hengduan Mountains. This study highlights the performance of the holistic landslide susceptibility evaluation framework proposed in this study and provides a viable technique for landslide susceptibility evaluation in other regions of the globe.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7cca44cfbe779436554cac320db80ee8",
  "timestamp": "2025-05-15T00:52:00.359979"
}