{
  "id": 8475,
  "title": "Differential Relationships Between Social Adversity and Depressive Symptoms by HIV Status and Racial/Ethnic Identity",
  "abstract": "Objective: Historically marginalized groups are likely to be exposed to social adversity, which predicts important mental health outcomes (e.g., depression). Despite the well-established relationship between adversity and poor health, few studies have examined how adversity differentially predicts mental health among people living with multiple, co-occurring marginalized identities or statuses. The current study fills this gap by examining whether relationships between social adversity and depressive symptoms differed between those living with or without a stigmatized disease (i.e., HIV) and/or marginalized racial/ethnic identity (i.e., African American). Method: A community sample of men and women (N = 149) completed questionnaires assessing demographics and depressive symptoms. Additionally, a composite index of social adversity was derived from measures of perceived discrimination, socioeconomic status, financial restriction to receiving medical care, and perceived neighborhood characteristics. Multiple regression was used to test whether relationships between adversity and depressive symptoms differed as a function of HIV status and racial/ethnic identity. Results: A significant 3-way interaction between social adversity, HIV status, and racial/ethnic identity indicated that there was a direct relationship between adversity and depressive symptoms for HIV-positive (HIV+) African Americans but not for HIV-negative (HIV-) African Americans, HIV+ Caucasians, or HIV-Caucasians. Further, HIV+ African Americans evidenced a significantly greater relationship between adversity and depressive symptoms compared with HIV-African Americans, but not compared with other groups. Conclusions: The findings suggest that HIV+ African Americans may be at risk for higher depressive symptoms amid adversity, highlighting the importance of evaluating intersectional identities/statuses in the context of mental health.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ccb80a83285e120da0cfec303475741",
  "timestamp": "2025-05-15T03:19:21.280856"
}