{
  "id": 1751,
  "title": "Systemic Financial Risk Arising From Residential Flood Losses",
  "abstract": "Direct damage from flooding at residential properties has typically been categorized as insured, with liabilities accruing to insurers, or uninsured, with costs accruing to property owners. However, residential flooding can also expose lenders and local governments to financial risk, though the distribution of this risk is not well understood. Flood losses are not limited to direct damages, but also include indirect effects such as decreases in property values, which can be substantial, though are rarely well quantified. The combination of direct damage and property value decrease influences rates of mortgage default and property abandonment in the wake of a flood, creating financial risk. In this research, property-level data on sales, mortgages, and insurance claims are used in combination with machine learning techniques and geostatistical methods to provide estimates of flood losses that are then utilized to evaluate the risk of default and abandonment in eastern North Carolina following Hurricane Florence (2018). Within the study area, Hurricane Florence generated $366M in observed insured damages and an estimated $1.77B in combined uninsured damages and property value decreases. Property owners, lenders, and local governments were exposed to an additional $562M in potential losses due to increased rates of default and abandonment. Areas with lower pre-flood property values were exposed to greater risk than areas with higher valued properties. Results suggest more highly resolved estimates of a flooding event's systemic financial risk may be useful in developing improved flood resilience strategies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ccb437ec670e9f923b4f13c4dc8f611",
  "timestamp": "2025-05-15T02:06:52.746016"
}