{
  "id": 2095,
  "title": "The impact of climate risk disclosure on financial performance, financial reporting and risk management: evidence from Egypt",
  "abstract": "Where Egypt stand with climate related-risk disclosures and why stakeholders and organizations require such information? This research aims to measure the climate risk disclosure level in Egyptian companies and to investigate its determinants. As unfavorable climatic circumstances create systemic risk for businesses throughout the whole global economy, this research examine how the disclosure of climate change risks affects the financial performance, financial reporting, and risk management. Few studies analyze how climate-related risk affects the financial performance of publicly traded companies in Egypt. This research applies regression models using both quantitative and qualitative methodologies. The information was gleaned from the 2019 through 2022 financial statements of 25 publicly traded companies. According to statistical analysis, there is a significant positive association between the financial performance, financial reporting, and risk management of industrial organizations and the disclosure of climate change. The findings show that the financial markets require precise, thorough, and high-quality information about the effects of climate change. This encompasses the threats and chances posed by increasing temperatures, climate-related legislation, and new technology in our rapidly evolving global environment.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7cd056d0fa5bd843f1c208ae134d7883",
  "timestamp": "2025-05-15T02:10:59.078837"
}