{
  "id": 1236,
  "title": "Construction of logistics financial security risk ontology model based on risk association and machine learning",
  "abstract": "Previous research on logistics financial risk pre-warning and pre-control focuses on the linear causal relationship between risk and risk events. In fact, risk events in logistics financial field are often caused by multiple risk factors, which are directly or indirectly related to these risk factors. Therefore, it is helpful for the healthy development of logistics finance to find out the related risks of each logistics financial risk event and screen and control them one by one. This paper proposes OntoLFR (Logistics Financial Risk Ontology), and constructs the logistics financial risk ontology model to adapt to the variability, complexity and relevance of risk in early warning and pre-control. Then, based on the risk source association inference rules obtained by knowledge association analysis, Apriori algorithm is adopted to conduct association analysis on the risk hidden danger database, and the acquired association rules are reintroduced into the knowledge ontology database of risk event source to realize self-learning and self-correction of the knowledge ontology database. Taking the risk event (RW_risk) of the financing enterprise to escape, the feasibility of using the logistics financial risk ontology model for risk-related reasoning and analysis is verified.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7cd95d44fd14f6f3a5087a3e40b73b70",
  "timestamp": "2025-05-15T02:00:30.566667"
}