{
  "id": 5930,
  "title": "A Quantitative General Population Job Exposure Matrix for Occupational Noise Exposure",
  "abstract": "Occupational noise exposure is a known risk factor for hearing loss and also adverse cardiovascular effects have been suggested. A job exposure matrix (JEM) would enable studies of noise and health on a large scale. The objective of this study was to create a quantitative JEM for occupational noise exposure assessment of the general working population. Between 2001-2003 and 20092010, we recruited workers from companies within the 10 industries with the highest reporting of noise-induced hearing loss according to the Danish Working Environment Authority and in addition workers of financial services and children day care to optimize the range in exposure levels. We obtained 1343 personal occupational noise dosimeter measurements among 1140 workers representing 100 different jobs according to the Danish version of the International Standard Classification of Occupations 1988 (DISCO 88). Four experts used 35 of these jobs as benchmarks and rated noise levels for the remaining 337 jobs within DISCO 88. To estimate noise levels for all 372 jobs, we included expert ratings together with sex, age, occupational class, and calendar year as fixed effects, while job and worker were included as random effects in a linear mixed regression model. The fixed effects explained 40% of the total variance: 72% of the between-jobs variance, -6% of the between workers variance and 4% of the within-worker variance. Modelled noise levels showed a monotonic increase with increasing expert score and a 20 dB difference between the highest and lowest exposed jobs. Based on the JEM estimates, metal wheel-grinders were among the highest and finance and sales professionals among the lowest exposed. This JEM of occupational noise exposure can be used to prioritize preventive efforts of occupational noise exposure and to provide quantitative estimates of contemporary exposure levels in epidemiological studies of health effects potentially associated with noise exposure.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7cde4c3bfb055e4216e40c8e530f4b19",
  "timestamp": "2025-05-15T02:53:03.067109"
}