{
  "id": 332,
  "title": "Dynamic multi-period sparse portfolio selection model with asymmetric investors' sentiments",
  "abstract": "Asymmetric investors' sentiments on returns and risks play an important role in updating the portfolio strategies in multi-period portfolio selection problems. By introducing the Prospect Theory to measure the asymmetric investors' sentiments, a dynamic sentiment-adjusted model (DSAM) is proposed to sparse portfolio selection problem over multiple periods, in which the objective is to minimize the risk of the portfolio. As we focus on the sparse portfolio, a l(0) constraint is added to our model. The l(0) constraint represents that we can only purchase at most k securities from N candidate securities, in which k is a small number compared to N. Since the objective function of the sparse portfolio with l(0) constraint is NP-hard, and could not be solved by the Deep Learning algorithms. The stochastic neural networks algorithm with re-parametrisation trick (SNNrP) is introduced to solve the DSAM. The back-testing framework of our paper includes a multi-period portfolio selection model, in which asymmetric investors' sentiments are modeled to iterate investors' expected return level each period. In the back-testing framework, we conduct the experiments for different investment periods with different investors' sentiments. The experimental results for the Nasdaq and CSI 300 data sets show that, on average, compared with the traditional Mean-variance model, the terminal return and risk obtained by the DSAM model outperforms by 9% and 11.75%.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d19ac3ef422ccfdcd5d94bfe11b8644",
  "timestamp": "2025-05-15T00:34:44.405838"
}