{
  "id": 3238,
  "title": "Impact of Alternative Fuel Blending Components on Fuel Composition and Properties in Blends with Jet A",
  "abstract": "One challenge in the deployment of alternative aviation fuels is the lengthy fuel approval process, which costs millions of dollars and can take many years as the exact effect of these alternative options on engine and framework is still an unknown. A candidate aviation fuel needs to pass the tests as deemed necessary by the ASTM D4054 Standard Practice. The fuel manufacturer faces the risk of not receiving the ASTM certification after significant financial and time investment, which currently acts as a considerable hindrance to broadening the alternative aviation fuel options in commercial and military aircraft. Approval tests are based on the fuel properties and fuel performance as there is currently a knowledge gap on fuel chemical composition-property correlations. Therefore, the aim of this study was to accomplish the first step in this target, i.e., to obtain a detailed chemical composition of four approved blending components (FT-SPK, HEFA, SIP, and ATJ) and their mixtures with Jet A using GC X GC-TOF/MS and GC x GC-FID. Infrared spectroscopy and principal components analysis were utilized as additional techniques to demonstrate the differences among the blending components and Jet A, further utilizing their infrared spectral features. Moreover, the main physiochemical properties were measured, such as distillation profile, density, viscosity, flash point, freezing point, and net heat of combustion. Lastly, the impact of the differences in chemical composition on these main fuel properties was discussed.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d210b7bee2634be6a68ffb68dea380c",
  "timestamp": "2025-05-15T02:24:05.155902"
}