{
  "id": 9186,
  "title": "Adopting social health insurance in Nepal: A mixed study",
  "abstract": "ObjectiveThe Social Health Insurance Program (SHIP) shares a major portion of social security, and is also key to Universal Health Coverage (UHC) and health equity. The Government of Nepal launched SHIP in the Fiscal Year 2015/16 for the first phase in three districts, on the principle of financial risk protection through prepayment and risk pooling in health care. Furthermore, the adoption of the program depends on the stakeholders' behaviors, mainly, the beneficiaries and the providers. Therefore, we aimed to explore and assess their perception and experiences regarding various factors acting on SHIP enrollment and adherence. MethodsA cross-sectional, facility-based, concurrent mixed-methods study was carried out in seven health facilities in the Kailali, Baglung, and Ilam districts of Nepal. A total of 822 beneficiaries, sampled using probability proportional to size (PPS), attending health care institutions, were interviewed using a structured questionnaire for quantitative data. A total of seven focus group discussions (FGDs) and 12 in-depth interviews (IDIs), taken purposefully, were conducted with beneficiaries and service providers, using guidelines, respectively. Quantitative data were entered into Epi-data and analyzed with SPSS, MS-Excel, and Epitools, an online statistical calculator. Manual thematic analysis with predefined themes was carried out for qualitative data. Percentage, frequency, mean, and median were used to describe the variables, and the Chi-square test and binary logistic regression were used to infer the findings. We then combined the qualitative data from beneficiaries' and providers' perceptions, and experiences to explore different aspects of health insurance programs as well as to justify the quantitative findings. Results and prospectsOf a total of 822 respondents (insured-404, uninsured-418), 370 (45%) were men. Families' median income was USD $65.96 (8.30-290.43). The perception of insurance premiums did not differ between the insured and uninsured groups (p = 0.53). Similarly, service utilization (OR = 220.4; 95% CI, 123.3-393.9) and accessibility (OR = 74.4; 95% CI, 42.5-130.6) were found to have high odds among the insured as compared to the uninsured respondents. Qualitative findings showed that the coverage and service quality were poor. Enrollment was gaining momentum despite nearly a one-tenth (9.1%) dropout rate. Moreover, different aspects, including provider-beneficiary communication, benefit packages, barriers, and ways to go, are discussed. Additionally, we also argue for some alternative health insurance schemes and strategies that may have possible implications in our contexts. ConclusionAlthough enrollment is encouraging, adherence is weak, with a considerable dropout rate and poor renewal. Patient management strategies and insurance education are recommended urgently. Furthermore, some alternate schemes and strategies may be considered.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d2436303bd850954852d821d7682ae3",
  "timestamp": "2025-05-15T03:26:25.976403"
}