{
  "id": 6575,
  "title": "Retinopathy in Persons without Diabetes The Handan Eye Study",
  "abstract": "Purpose: To describe the prevalence and associations of retinopathy in a population-based nondiabetic sample of rural Chinese. Design: Population-based cross-sectional study. Participants: We included 6830 Han Chinese aged >= 30 years from 13 villages of Yongnian County, Handan City, Hebei Province, China. Methods: All participants underwent a standardized interview and extensive examinations including retinal photography, measurement of blood pressure (BP) and fasting plasma glucose (FPG). Diabetes mellitus was defined as either FPG >= 7.0 mmol/l, use of diabetic medication or a physician diagnosis of diabetes. Photographic grading of retinopathy followed the modified Early Treatment Diabetic Retinopathy Study classification system. Logistic regression models were used to assess associations of retinopathy. Main Outcome Measures: Any retinopathy. Results: The prevalence of retinopathy among participants without diabetes was 13.6% (95% confidence interval [CI], 12.6-14.6%). The age and gender standardized prevalence of retinopathy in the Chinese adult population (aged 30+ years) without diabetes was estimated to be 12.1% (95% CI 11.1-12.9%). Independent risk factors associated with retinopathy were age (odds ratio [OR], 1.02; 95% CI 1.01-1.03 per year increase), male gender (male vs. female, OR 1.27; 95% CI 1.08-1.49), higher FPG (OR 1.30; 95% CI 1.11-1.53 per mmol/l increase), higher systolic BP (OR 1.15; 95% CI 1.05-1.27 per 10 mmHg increase) and higher diastolic BP (OR 1.16; 95% CI 1.09-1.22 per 10 mmHg increase). Conclusions: Retinopathy was common among rural Chinese adults without diabetes. Its association with FPG and BP suggests that early microvascular damage is occurring at high normal levels of blood glucose and BP. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2010; 117: 531-537 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d2b5636d6fdae2e613f2125e01880dd",
  "timestamp": "2025-05-15T02:59:36.912660"
}