{
  "id": 3998,
  "title": "Individual factors explain neighbourhood variations in accidents to children under 5 years of age",
  "abstract": "Previous studies have identified possible neighbourhood-level influences on the risk of injuries to preschool children, but none have had sufficient data at both household and area level to explain these neighbourhood effects. We used data from the Avon Longitudinal Study of Parents and Children. which recruited over 14,062 children at birth in the former county of Avon, UK, and collected information about accidents, as well as extensive social, health and developmental data throughout the first 5 years of life. This information was combined with census and geographical data in order to identify neighbourhood influences on accident risks and then attempt to explain these using multilevel regression modelling. A small but statistically significant amount of between-neighbourhood variance in accident risk was found, with neighbourhood intraclass correlation coefficients of 0.82% for any accident, and 0.84% for accidents resulting in injury requiring medical attention. This was entirely accounted for by a variety of child, parental and household level variables. Independent risk factors for both outcomes were children who were developmentally more advanced or displayed greater conduct and behavioural problems, mothers who were of younger age, who were without work, who were smokers, whose partners were unemployed or drank alcohol excessively, and households in which there had recently been adverse life events, or which were under financial stress. The mother's perceptions of neighbourhood quality also explained some of the risks for any accident, but not for medically attended accidents, and this was a variable that operated at the level of individual households rather than at the level of neighbourhoods. The implications of this study are that differences in accident risk between neighbourhoods are explained by geographical clustering of similar types of children, families and households. Interventions should focus more on parental factors and household social circumstances than on the physical environment or community based risks. However, many of these factors are those most resistant to modification Without broader societal change. (C) 2008 Elsevier Ltd. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d2d23b425e5f224db9b87258143e3b1",
  "timestamp": "2025-05-15T02:31:58.692129"
}