{
  "id": 4893,
  "title": "Multiasset financial bubbles in an agent-based model with noise traders? herding described by an n-vector ising model",
  "abstract": "We present an agent-based model (ABM) of a financial market with n > 1 risky assets, whose price dynamics result from the interaction between rational fundamentalists and trend-following imitative noise traders. The interactions and opinion formation of the noise traders are described by an extended O(n) vector model, which generalizes the Ising model used previously in ABMs with a single risky asset. Efficient rejection-free transition probabilities are derived to describe realistic investment decisions at the microlevel of individual noise traders. The ABM is validated by testing for several characteristics of financial markets such as volatility clustering and fat tails of the distribution of returns. Furthermore, the model is able to account for the development of endogenous bubbles and crashes. We distinguish three different regimes depending on the traders' propensity to imitate others. In the subcritical regime of the O(n) vector model, the traders' opinions are idiosyncratic and no bubbles emerge. Around the critical value of the O(n) vector model, cross-sectionally asynchronous bubbles emerge. Above the critical value, small random price fluctuations may be amplified by noise traders herding into a given asset, which then impels fundamentalists to reequilibrate their more valuable portfolios that have become unbalanced, thus pushing the prices of the other assets upward. The resulting transient increase of the momenta of these assets triggers a reorientation of the noise traders' portfolios that further amplifies the burgeoning bubbles. We have thus identified a mechanism by which the cautious risk-adverse contrarian rebalancing strategy of fundamentalists leads to systemic risks in the form of cascades of bubbles spreading the whole financial market.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d2f2d9c0778f8928e4a92d0f6a75eca",
  "timestamp": "2025-05-15T02:42:04.884124"
}