{
  "id": 8175,
  "title": "Sustainability Reporting as a Mixture of CSR and Sustainable Development. A Model for Micro-Enterprises within the Romanian Forestry Sector",
  "abstract": "In the last decades, the issue of the behavior geared towards society and the environment of small and medium-sized enterprises (SMEs) has created a new niche for economic researches. Most studies point out that entities operating in the forestry sector, despite having difficulties in applying valid corporate social responsibility (CSR) instruments, are concerned about the role they play in society. Therefore, they tend to develop their business by giving importance to the principles of sustainable development. The aim of the paper was to propose an econometric model to report the sustainability of non-financial performance for the companies operating in the forestry field. The main objectives of the study focused on defining and analyzing the studied problem through the specialized literature, defining and conceptualizing the statistical model in order to identify the risk factors and vulnerability, influencing the forestry sector in Romania. In this context, based on a sample of 248 Romanian active companies in the forestry sector in four distinct sectors, we calculated a number of indicators specific to the forestry sector in order to identify the risks and vulnerabilities and analyze the entities associated with this sector. Our research led us to the conclusion that, as far as the forestry sector is concerned, the companies that operate in Statistical classification of economic activities in the European Community (NACE) 240 and NACE 210 have registered superior results compared to the average in regards to the vulnerability of the sector, while those that operate in NACE 220 and NACE 230 focus mostly on those vulnerabilities regarding the risk zone of their sustainable development. The study could be useful both to stakeholders by giving them the possibility to identify those entities, classified according to the NACE code, taking into account the sector vulnerabilities and the risks associated with the profile market, as well as to the state that could influence through economic policies the sectors in which vulnerabilities are manifested.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d46b4e65052e60ae4184d5b32a12803",
  "timestamp": "2025-05-15T03:16:17.366942"
}