{
  "id": 7569,
  "title": "Construction of a volatility index from exchange-traded dollar-rupee options",
  "abstract": "Purpose This paper aims to propose the implied volatility index for the US dollar-Indian rupee pair (INRVIX). The study seeks to examine whether INRVIX truly reflects future USDINR (US Dollar-Indian rupee) volatility and signals profitable currency trading strategies. Design/methodology/approach Two measures of INRVIX are constructed and compared: a model-free version based on the methodology adopted by the Chicago Board of Options Exchange (CBOE) and a model-dependent version constructed from Black-Scholes-Merton-implied volatility. The proposed INRVIX is computed by tweaking some parameters of the CBOE methodology to ensure compatibility with the microstructure of the Indian currency derivatives market. The volatility forecasting ability of INRVIX is compared to that of a generalized autoregressive conditional heteroscedasticity (1,1) model. Ordinary least squares regression is used to examine the relationship between n-day-ahead USDINR returns and different quantiles of INRVIX. Findings Results indicate that INRVIX based on the model-free approach reflects ex post volatility in a better manner than its model-dependent counterpart, although neither measure is found to be an unbiased and efficient forecast. Subsample analysis across tranquil and turbulent periods corroborates the results. The volatility forecasting performance of INRVIX is found to be better than that of forecasts based on historical time-series. These results are consistent with similar studies of developed market currencies. The study does not find any significant relationship between extreme levels of INRVIX and the profitability of trading strategies based on such levels, which is contrary to results from the equity options market. Practical implications Foreign exchange volatility affects the costs of international trade and the external sector competitiveness of Indian multinationals. It is a significant risk factor for financial institutions and traders in the financial markets. An implied VIX for the USDINR could serve as an indicator of expected foreign exchange risk. It could thus provide a signal for a possible intervention in the forex market by the regulator. Regulators could introduce volatility derivative contracts based on the INRVIX. Such contracts would enable hedging of the pure volatility risk of dollar-rupee exposure. Thus, the study has practical implications for investors, hedgers, regulators and academicians alike. Originality/value To the author's knowledge, this is one of a few studies to construct an implied VIX for an emerging currency like the rupee. The study is based on up-to-date sample data that includes the recent COVID-19 market crash. A novel contribution of this paper is that in addition to examining whether INRVIX contains information about future USDINR volatility, and it also examines the signalling power of INRVIX for currency trading strategies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d4f022c61b8a490423fb07303e7ab05",
  "timestamp": "2025-05-15T03:10:05.517484"
}