{
  "id": 4330,
  "title": "The Impact of Inbound and Outbound Open Innovations: Empirical Evidence for SMEs across Europe",
  "abstract": "The concept of open innovation has reinforced the importance of external knowledge and cooperation in enhancing firms' innovation performance. The literature on open innovation suggests that large firms are more likely to open up the innovation processes than small firms. However, open innovation is equally relevant for SMEs, as a complementary innovation activity to firms' absorptive capacity. This study examines the effect of both inbound and outbound open innovation practices on innovation performance of small and medium-sized enterprises (SMEs) across 28 European countries. Studies focusing on SMEs usually investigate open innovation activities in one or few countries. By investigating open innovation processes in SMEs across Europe, our study is the most comprehensive quantitative analysis of the impacts of various open innovation activities on SME innovation performance. Hypotheses derived from the open innovation literature are empirically tested on a cross-sectional data of 620 SMEs in manufacturing, Information and Communication Technology (ICT) and service sectors. A novelty of the study is the classification of countries depending on their innovation performance measured and published in annual European Innovation Scoreboards. Furthermore, only very recently researchers begin to explore open innovation outside high-tech industries. This study investigates how open innovation affects innovation performance of SMEs in high-and low-tech industries, ICT and service sectors. The extent of opening up of the innovation process and its impact on innovation performance vary between micro, small and medium-sized firms, between those firms operating in national innovation systems more conducive to innovation and those in less innovative countries, and between high-technology and low-technology industries. Overall, customer involvement is found to have a positive impact on SME innovation performance, whereas participation in innovation networks and clusters has an adverse effect. Moreover, licensing-out is positively related to innovation performance in firms located in countries whose national innovation systems are more conducive to innovation. The findings are relevant for both managers and policy makers across Europe. From managerial perspective, empirical evidence indicate that certain open innovation activities have a positive influence on innovation performance, such as customer involvement, while a few have no or even negative impact on the output of innovation processes, such as participation in innovation clusters and networks. Furthermore, it provides evidence that SMEs across Europe adopt a portfolio approach to innovation, internalizing innovation through absorptive capacity as well as organising open innovation activities. These findings are consistent with the stylised fact advanced in the literature on absorptive capacity, that opening up the innovation process by exploiting sources of external knowledge is a complementary process to firms' absorptive capacity. Moreover, our findings suggest that policy makers should adopt a policy mix fostering both absorptive capacity and open innovation activities. However, a policy design should take into account heterogeneity of SMEs with respect to their firm, industry and country specific characteristics.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d5c35917f6231be8a9fece12b7a8500",
  "timestamp": "2025-05-15T01:25:50.607097"
}