{
  "id": 7968,
  "title": "Association Between Community Social Capital and Hospital Readmission Rates",
  "abstract": "Hospital readmissions remain frequent, and are partly attributable to patients' social needs. The authors sought to examine whether local community levels of social capital are associated with hospital readmission rates. Social capital refers to the connections among members of a society that foster norms of reciprocity and trust, which may influence the availability of support for postdischarge recovery after hospitalization. Associations between hospital-wide, risk-stratified readmission rates for hospitals in the United States (n = 4298) and levels of social capital in the hospitals' service areas were examined. Social capital was measured by an index of participation in associational activities and civic affairs. A multivariate linear regression model was used to adjust for hospital and community factors such as hospital financial performance, race, income, and availability of heath care services. Results showed that higher social capital was significantly associated with lower readmission rates (P < .01), a finding that held across income-stratified analyses as well as sensitivity analyses that included hospital performance on process quality measures and hospital community engagement activities. A hospital is unlikely to be able to influence prevailing levels of social capital in its region, but in areas of low social capital, it may be possible for public or philanthropic sectors to buttress the types of institutions that address nonmedical causes of readmission.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d75a0034d4f750faf5a6c78b265b5d5",
  "timestamp": "2025-05-15T03:14:07.153246"
}