{
  "id": 5094,
  "title": "Lifecourse socioeconomic circumstances and multimorbidity among older adults",
  "abstract": "Background: Many older adults manage multiple chronic conditions (i.e. multimorbidity); and many of these chronic conditions share common risk factors such as low socioeconomic status (SES) in adulthood and low SES across the lifecourse. To better capture socioeconomic condition in childhood, recent research in lifecourse epidemiology has broadened the notion of SES to include the experience of specific hardships. In this study we investigate the association among childhood financial hardship, lifetime earnings, and multimorbidity. Methods: Cross-sectional analysis of 7,305 participants age 50 and older from the 2004 Health and Retirement Study (HRS) who also gave permission for their HRS records to be linked to their Social Security Records in the United States. Zero-inflated Poisson regression models were used to simultaneously model the likelihood of the absence of morbidity and the expected number of chronic conditions. Results: Childhood financial hardship and lifetime earnings were not associated with the absence of morbidity. However, childhood financial hardship was associated with an 8% higher number of chronic conditions; and, an increase in lifetime earnings, operationalized as average annual earnings during young and middle adulthood, was associated with a 5% lower number of chronic conditions reported. We also found a significant interaction between childhood financial hardship and lifetime earnings on multimorbidity. Conclusions: This study shows that childhood financial hardship and lifetime earnings are associated with multimorbidity, but not associated with the absence of morbidity. Lifetime earnings modified the association between childhood financial hardship and multimorbidity suggesting that this association is differentially influential depending on earnings across young and middle adulthood. Further research is needed to elucidate lifecourse socioeconomic pathways associated with the absence of morbidity and the presence of multimorbidity among older adults.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d7599371d05a269ce6301efe44e7b1d",
  "timestamp": "2025-05-15T02:44:11.045603"
}