{
  "id": 9311,
  "title": "Prevalence and determinants of meeting minimum dietary diversity among children aged 6-23 months in three sub-Saharan African Countries: The Demographic and Health Surveys, 2019-2020",
  "abstract": "BackgroundDietary diversity is an indicator of nutritional adequacy, which plays a significant role in child growth and development. Lack of adequate nutrition is associated with suboptimal brain development, lower school performance, and increased risk of mortality and chronic diseases. We aimed to determine the prevalence and determinants of meeting minimum dietary diversity (MDD), defined as consuming at least five out of eight basic food groups in the previous 24-h in three sub-Saharan African countries. MethodsA weighted population-based cross-sectional study was conducted using the most recent Demographic and Health Surveys (DHS). MDD data were available between 2019 and 2020 for three sub-Saharan African countries (Gambia, Liberia, and Rwanda). The study population included 5,832 children aged 6-23 months. A multivariable logistic regression model was developed to identify independent factors associated with meeting MDD. ResultsOverall, the weighted prevalence of children who met the MDD was 23.2% (95% CI: 21.7-24.8%), ranging from 8.6% in Liberia to 34.4% in Rwanda. Independent factors associated with meeting MDD were: age of the child (OR) = 1.96, 95% CI: 1.61, 2.39 for 12-17 months vs. 6-11 months], mothers from highest households' wealth status (OR = 1.86, 95% CI: 1.45-2.39) compared with the lowest, and mothers with secondary/higher education (OR = 1.69, 95% CI: 1.35-2.12) compared with those with no education. Mothers who were employed, had access to a radio, and those who visited a healthcare facility in the last 12 months were more likely to meet the MDD. There was no significant association between the child's sex and the odds of fulfilling the MDD. ConclusionsThere is substantial heterogeneity in the prevalence of MDD in these three sub-Saharan African countries. Lack of food availability or affordability may play a significant role in the low prevalence of MDD. The present analysis suggests that policies that will effectively increase the prevalence of meeting MDD should target poor households with appropriate materials or financial assistance and mothers with lower literacy. Public health interventions working with sectors such as education and radio stations to promote health education about the benefits of diverse diets is a critical step toward improving MDD in sub-Saharan Africa and preventing undernutrition.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7d7edf180faa20d941ea47c20c21cc48",
  "timestamp": "2025-05-15T03:27:25.144873"
}