{
  "id": 7207,
  "title": "The ties that bind: The relationship between caregiver burden and the neuropsychological functioning of TBI survivors",
  "abstract": "Advances in medical and assistive technology have increased the likelihood of survival following a traumatic brain injury (TBI). Consequently, families frequently must provide care to individuals with TBI. Because they are rarely prepared for the associated demanding medical needs and financial burden, family caregivers are at risk for physical and emotional problems, which can negatively influence their individual and family functioning. Whereas scholars have examined the influence of survivor functioning on caregiver burden, few have explicitly recognized that caregiver burden also influences survivor functioning. Results of a multivariate linear regression suggest that, in a sample of 51 pairs of TBI survivors and their caregivers living in Colombia, survivors receiving care from a family member who reported a higher level of burden had poorer objective neuropsychological functioning than those receiving care from a family member who reported a lower level of burden, after controlling for survivor education and history of occupational therapy. Therefore, a family-focused approach might maximize intervention effectiveness, especially for Latin American and Hispanic families, which tend to be characterized by a strong sense of familism. The emphasis on family can create problems in a healthcare system that views the individual as the primary unit.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7da7b7273560735dd74ce27409ca5eb0",
  "timestamp": "2025-05-15T03:06:01.317940"
}