{
  "id": 9222,
  "title": "Bovine tuberculosis breakdown duration in cattle herds: an investigation of herd, host, pathogen and wildlife risk factors",
  "abstract": "Background. Despite rigorous controls placed on herds which disclose ante-mortem test positive cattle to bovine tuberculosis, caused by the infection of Mycobacterium bovis, many herds in Northern Ireland (NI) experience prolonged breakdowns. These herds represent a considerable administrative and financial burden to the State and farming community. Methods. A retrospective observational study was conducted to better understand the factors associated with breakdown duration, which was modelled using both negative binomial and ordinal regression approaches. Results. Six explanatory variables were important predictors of breakdown length in both models; herd size, the number of reactors testing positive in the initial SICCT test, the presence of a lesioned animal at routine slaughter (LRS), the count of M. bovis genotypes during the breakdown (MLVA richness), the local herd-level bTB prevalence, and the presence of herds linked via management factors (associated herds). We report that between 2008 and 2014, mean breakdown duration in NI was 226 days (approx. seven months; median: 188 days). In the same period, however, more than 6% of herds in the region remained under movement restriction for more than 420 days (13 months); almost twice as long as the mean. The MLVA richness variable was a particularly important predictor of breakdown duration. We contend that this variable primarily represents a proxy for beef fattening herds, which can operate by purchasing cattle and selling animals straight to slaughter, despite prolonged trading restrictions. For other herd types, the model supports the hypothesis that prolonged breakdowns are a function of both residual infection within the herd, and infection from the environment (e.g. infected wildlife, contiguous herds and/or a contaminated environment). The impact of badger density on breakdown duration was assessed by including data on main sett (burrow) density. Whilst a positive association was observed in the univariate analysis, confounding with other variables means that the contribution of badgers to prolonged breakdowns was not clear from our study. We do not fully reject the hypothesis that badgers are implicated in prolonging bTB breakdowns via spillback infection, but given our results, we posit that increased disease risk from badgers is unlikely to simply be a function of increasing badger density measured using sett metrics.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7dad413be55272f070c36929cfacf346",
  "timestamp": "2025-05-15T03:26:54.510531"
}