{
  "id": 6803,
  "title": "Determinants of Poverty and Their Variation Across the Poverty Spectrum: Evidence from Hong Kong, a High-Income Society with a High Poverty Level",
  "abstract": "This study aims to investigate into the determinants of poverty in Hong Kong. Previous research on poverty, which usually adopted a logistic regression model to examine individuals' probabilities of being poor, could not adequately reveal the heterogeneity in experiences among people across the poverty spectrum, therefore has limited policy effort to address diverse needs of individuals struggling with poverty. In the present study, this concern is addressed by using a quantile regression model to examine the differential effects of the determinants of poverty across the poverty spectrum. Data were drawn from the Hong Kong Panel Survey for Poverty Alleviation (n=1668). Logistic regression indicated that being elderly, being female, not having a partner, from a single-parent household, not being employed, living in public rental housing, have lower educational attainment, and have poor self-rated health, increased the probability of being poor. Informational support was a protective factor of poverty, while several negative life events, such as having family member(s) with disabilities/chronic diseases and having financial burden, were risk factors of poverty. Quantile regression analysis was adopted to further examine the extent to which determinants of poverty unfold across poverty spectrum, which was captured by five groups of extremely poor, deeply poor, at the poverty line, near poverty and marginally poor. Quantile regression indicated that people living across the poverty spectrum were similarly affected by not having a partner, living in single-parent households and not working. However, extremely poor and deeply poor were more adversely affected by old age than those near poverty and marginally poor. It is also discovered that public rental housing buffered the poverty risks more in those who lived in deep poverty than those who were near poverty and marginally poor. University education protected the near poverty and marginally poor to a larger extent than those who were extremely poor and deeply poor. Information support also buffered the poverty risks, and people living across the poverty spectrum were equally benefited from it.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7dc3a01e91130a14cdfbc0a0694053df",
  "timestamp": "2025-05-15T03:01:31.478256"
}