{
  "id": 8586,
  "title": "Biotechnology firms, signals, and venture capital investment",
  "abstract": "Purpose: Biotechnology has gained such prominence in the past years that approximately 50% of new drugs developed worldwide are of biotechnological origin. Some of the Covid-19 vaccines are a good example of this development. However, biotechnology R&D projects are characterized by high costs, prolonged development times, and a high degree of uncertainty and failure. Only few types of financial agents undertake such risky investments, among which are venture capital firms. In this paper, we analyse the signals that influence suchlike venture capital investment decisions. The very high level of risk, which differentiates biotechnology firms from other technology companies, justifies an analysis focused solely on biotechnology firms.Design/methodology: Hypotheses about the effectiveness of these signals are validated by means of a probit regression with panel data on a sample of 210 biotechnology companies established in Spain over a ten-year period.Findings: A positive and negative signalling effect has been found for some of the phenomena analysed, which validate the proposed model.Research limitations/implications: A convenience sample has been used for methodological reasons. Some phenomena that could have some effect on the venture capital investment decisions have not been possible to observe.Practical implications: It can be crucial for biotechnology firms for their managers to know which characteristics make these firms attractive to venture capital firms. Additionally, it is important to be aware of signals that, instead of favouring investment decisions, deter them.Originality/value: This is the first study conducted for the Spanish industry to focus on the first venture capital investment - rather than the typical focus on the amount invested-as an event that mitigates the information asymmetry level, and which includes also a distinction between four types of strategic alliance, the use of a probit regression with panel data, and a quantitative analysis on the biotech industry.As the Spanish biotechnology and venture capital industries differ from those established in other European countries, this work offers new elements of analysis, description, and comparison of these industries. In addition, the construction of a database on a sample of 210 Spanish biotechnology firms is unprecedented and can be used for future research.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7dc92104e61537adc635aa42ebd03dbe",
  "timestamp": "2025-05-15T03:20:22.233434"
}