{
  "id": 4040,
  "title": "The mediating role of intellectual capital on the nexus between diversification, financial stability and efficiency of commercial banks in Ethiopia",
  "abstract": "PurposeThe main objective of this study is to analyze the mediating role of intellectual capital in the relationship between diversification, financial stability, and efficiency of the banking sector in Ethiopia.Design/methodology/approachSecondary data for this study was obtained from audited financial statements of 17 Ethiopian commercial banks for a decade starting in 2013. A descriptive and explanatory research design with a quantitative research approach was employed. The seemingly unrelated Hierarchical regression analysis is used to estimate diversification's effect on banks' financial stability and efficiency, considering the interaction between diversification and intellectual capital as a mediating variable.FindingsThe Mediation analysis reveals that asset diversification improves the financial stability of commercial banks when mediated by intellectual efficiency. Investment diversification negatively impacts risk-adjusted return on asset and Z score. Intellectual capital significantly enhances commercial banks' efficiency and financial stability in Ethiopia and mediates the relationship between geographic diversification, financial stability, and efficiency. The mediation analysis also indicates that intellectual capital significantly mediates the relationship between income diversification and efficiency.Practical implicationsThis study highlights the importance of intellectual capital and promotes its strategic allocation by management and regulatory bodies to enhance the financial stability and operational effectiveness of the banking industry in Ethiopia.Originality/value To the best of the researcher's knowledge, this study is one of the rare attempts to investigate the mediating role of intellectual capital on the nexus between diversification, financial stability, and efficiency of commercial banks in Ethiopia.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7dd5cedb266a48b314eb31e0a2b7c3e3",
  "timestamp": "2025-05-15T02:32:27.557046"
}