{
  "id": 7322,
  "title": "Low housing quality, unmet social needs, stress and depression among low-income smokers",
  "abstract": "Smokers are at greater risk of multiple health conditions that are exacerbated by environmental hazards associated with low housing quality. However, little is known about the prevalence of low housing quality among low-income smokers. Using correlations and logistic regression, we examined associations among eight housing quality indicators - pests, water leaks, mold, lead paint, and working smoke detectors, appliances, heating, and air conditioning - and between housing quality and social needs, depressive symptoms, perceived stress, sleep problems, and self-rated health in a community-based sample of 786 low-income smokers from 6 states. Most participants were female (68%), and White (45%) or African-American (43%). One in four (27%) completed less than high school education, and 41% reported annual pre-tax household income of less than $10,000. Housing quality problems were common. Most participants (64%) reported at least one problem in their home, and 41% reported two or more problems, most commonly pest infestations (40%), water leaks (22%), lack of air conditioning (22%) and mold (18%). Lack of heat and air conditioning were correlated, as were water leaks and mold. Using logistic regression analyses controlling for participant demographic characteristics, we found that reporting more housing quality problems was associated with greater odds of worse mental and physical health outcomes. Multiple health threats, including housing quality, depressive symptoms, stress, poor sleep, and financial strain may be mutually reinforcing and compound the health consequence of smoking. Future research should seek to replicate these findings in other samples, and examine associations longitudinally to better understand causality.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7dd51f4aeb065f241f3dfa63b5c9dfe1",
  "timestamp": "2025-05-15T03:07:31.858640"
}