{
  "id": 4897,
  "title": "Association of measured quality with financial health among US hospitals",
  "abstract": "Background High-quality care is a clear objective for hospital leaders, but hospitals must balance investing in quality with financial stability. Poor hospital financial health can precipitate closure, limiting patients' access to care. Whether hospital quality is associated with financial health remains poorly understood. The objective of this study was to compare financial performance at high-quality and low-quality hospitals. Methods We performed a retrospective observational cohort study of U.S. hospitals using the American Hospital Association and Hospital Compare datasets for years 2013 to 2018. We used multilevel mixed-effects linear and logistic regression models with fixed year effects and random intercepts for hospitals to identify associations between hospitals' measured quality outcomes-30-day hospital-wide readmission rate and the patient safety indicator-90 (PSI-90)-and their financial margins and risk of financial distress in the same year and the subsequent year. Our sample included 20,919 observations from 4,331 unique hospitals. Results In 2018, the median 30-day readmission rate was 15.2 (interquartile range [IQR] 14.8-15.6), the median PSI-90 score was 0.96 (IQR 0.89-1.07), the median operating margin was -1.8 (IQR -9.7-5.9), and 750 (22.7%) hospitals experienced financial distress. Hospitals in the best quintile of readmission rates experienced higher operating margins (+0.95%, 95% CI [0.51-1.39], p < .001) and lower odds of distress (odds ratio [OR] 0.56, 95% CI [0.45-0.70], p < .001) in the same year as compared to hospitals in the worst quintile. Hospitals in the best quintile of PSI-90 had higher operating margins (+0.62%, 95% CI [0.17-1.08], p = .007) and lower odds of financial distress (OR 0.70, 95% CI [0.55-0.89], p = .003) as compared to hospitals in the worst quintile. The results were qualitatively similar for the same-year and lag-year analyses. Conclusion Hospitals that deliver high-quality outcomes may experience superior financial performance compared to hospitals with poor-quality outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7de646642e05eb58075c9372b7d8dca7",
  "timestamp": "2025-05-15T02:42:04.907769"
}