{
  "id": 7535,
  "title": "Postpartum depression in India: a systematic review and meta-analysis",
  "abstract": "Objective To provide an estimate of the burden of postpartum depression in Indian mothers and investigate some risk factors for the condition. Methods We searched PubMed (R), Google Scholar and Embase (R) databases for articles published from year 2000 up to 31 March 2016 on the prevalence of postpartum depression in Indian mothers. The search used subject headings and keywords with no language restrictions. Quality was assessed via the Newcastle-Ottawa quality assessment scale. We performed the meta-analysis using a random effects model. Subgroup analysis and meta-regression was done for heterogeneity and the Egger test was used to assess publication bias. Findings Thirty-eight studies involving 20 043 women were analysed. Studies had a high degree of heterogeneity (f = 96.8%) and there was evidence of publication bias (Egger bias = 2.58; 95% confidence interval, CI: 0.83-4.33). The overall pooled estimate of the prevalence of postpartum depression was 22% ( 95% CI: 19-25). The pooled prevalence was 19% (95% CI: 17-22) when excluding 8 studies reporting postpartum depression within 2 weeks of delivery. Small, but non-significant differences in pooled prevalence were found by mother's age, geographical location and study setting. Reported risk factors for postpartum depression included financial difficulties, presence of domestic violence, past history of psychiatric illness in mother, marital conflict, lack of support from husband and birth of a female baby. Conclusion The review shows a high prevalence of postpartum depression in Indian mothers. More resources need to be allocated for capacity-building in maternal mental health care in India.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7e10b9c70a7d5419545ef19d822ef302",
  "timestamp": "2025-05-15T03:09:36.896106"
}