{
  "id": 5920,
  "title": "Socioeconomic inequalities in alcohol-related harm in adolescents: a prospective cohort study of 68,299 Danish 15-19-year-olds",
  "abstract": "Background Evidence shows that similar levels of alcohol consumption lead to greater harm in adults with low so-cioeconomic position (SEP) compared to high SEP. We investigated if SEP is associated with alcohol-related hospital contacts in adolescents, and whether differences in risk can be explained by differences in levels of alcohol consumption, drinking pattern, and substance use. Methods This is a prospective cohort study of 68,299 participants aged 15-19 years old from the Danish National Youth Cohort 2014. SEP was operationalised as parent educational level, family income and perceived financial strain in the family. Data were linked to national registers and participants were followed up for five years from 2014 to 2019. Outcomes were hospital contacts due to alcohol. Multilevel Poisson regression was used to estimate incidence rates (IR) and incidence rate ratios (IRR).Findings During 280,010 person years of follow-up, 872 participants had an alcohol-attributable hospital contact; intoxications (n = 778, 89%) were the most common diagnosis. Low as compared to high SEP was associated with higher IRR of alcohol-attributable hospital contacts for all three SEP measures. The adjusted IRR of harm was 1.73 (95% CI: 1.29-2.33) for elementary school as the highest parent education compared to longer parent education and 1.57 (95% CI: 1.30-1.89) for family financial strain compared to those without financial strain. Adjustment for weekly alcohol intake, drinking pattern and substance use did not substantially change results. Cubic spline analysis of the association between family income and alcohol-attributable hospital contacts revealed a dose-response relationship with decreasing risk of alcohol-related harm with higher income.Interpretation Our findings suggested that alcohol-related harm is more common in socioeconomically disadvantaged adolescents despite similar levels of alcohol consumption, regardless of differences in drinking pattern or substance use. Future preventive strategies should prioritise young adolescents, including those who are most disadvantaged.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7e24484aa5f9b0808d13cc9765be824e",
  "timestamp": "2025-05-15T02:53:03.016325"
}