{
  "id": 5134,
  "title": "A Novel Assessment of Delayed Neutron Detector Data in CANDU Reactors",
  "abstract": "A common opportunity for nuclear power plant operators is ensuring that routinely collected data are fully leveraged. Exploiting data analytics can enable improvements in anomaly detection and condition monitoring by identifying previously unseen data trends and correlations without major financial investment. One such opportunity is in facilitating the detection of fuel defects by augmenting the delayed neutron (DN) monitoring system deployed in the majority of Canada deuterium uranium (CANDU) reactors. In this paper, we demonstrate using archive data that the detection of fuel defects can be accelerated using this system in combination with the use of a deeper historical dataset and the introduction of a smoothing algorithm. The current defect identification process relies on the analysis of data of high variance and is subject to the judgment of a domain expert, resulting in variable defect identification periods. The proposed approaches seek to mitigate this and alleviate the variable identification time. Initial results presented here show that for an initial batch of 30 defects, identification periods can be meaningfully reduced compared to the current process, with defects potentially visible on an average of 11.4days earlier. By shortening this identification period, fuel containing defects can be scheduled for earlier removal, reducing the risk of statutory shutdown obligations, protecting personnel, and promoting industry best practice. Exploring a historical dataset identifies previously undocumented trends and we discuss the potential to produce correlations with other reactor parameters. The application of this knowledge can lead to opportunities in the use of machine learning algorithms and, ultimately, more accurate predictions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7e3735d8eac6c1549985f9059eca6615",
  "timestamp": "2025-05-15T02:44:43.853907"
}