{
  "id": 3776,
  "title": "RETRACTED: The impact of corporate social responsibility on financial distress: empirical evidence (Retracted Article)",
  "abstract": "Purpose The present study aims to explore the role of corporate social responsibility (CSR) on the likelihood of financial distress for a sample of 139 Pakistan Stock Exchange (PSX) listed firms throughout 2008-2019. Design/methodology/approach Panel logistic regression (PLR) and the dynamic generalized method of moments (GMM) estimator are used to examine the impact of CSR on financial distress. The investment in CSR measures through a multidimensional financial approach which comprises the sum of the contribution made by the company in the form of charitable donation, employees' welfare and research and development, whereas the Altman Z-score and ZM-Score are used as an indicator of financial distress. The higher the Z-score lower will be the probability of financial distress, whereas the higher ZM score shows a greater probability of financial distress risk. Findings The authors find a significant negative impact of CSR on financial distress in both PLR and GMM models. This finding is consistent with the stakeholder view of CSR, as an investment in CSR not only aligns the interest between shareholders and stakeholders but also mitigates the risk of financial distress as well. Research limitations/implications Like other studies, the present study is not free from limitations. First, financial firms skipped from the sample, although literature witnesses a lot of studies highlight the financial firms' commitment to achieving CSR goals. Second, financial distress occurs in different stages, the authors fail to establish linkage CSR engagements at different stages of CSR. In the future, researchers can make a valuable addition by covering these missing links in present studies. Practical implications The findings of this study provide more insight to corporate managers and investors about the association between the quality of investment in CSR and the degree of financial distress, concerning Pakistani firms. Furthermore, this study contributes to the existing literature by adding new evidence from developing countries such as Pakistan which are helpful for regulatory bodies and policymakers in the formulation of long-term CSR strategies to manage financial distress. Originality/value The study extends the body of existing literature on CSR and the likelihood of financial distress in Pakistan. The results suggest that policymakers may pay special attention to the quality of CSR while predicting corporate financial distress.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7e370fdf1b62eb48032a44e91f4850da",
  "timestamp": "2025-05-15T02:29:59.140695"
}