{
  "id": 476,
  "title": "Maturity grading of jujube for industrial applications harnessing deep learning",
  "abstract": "PurposeTo develop and examine an efficient and reliable jujube grading model with reduced computational time, which could be utilized in the food processing and packaging industries to perform quick grading and pricing of jujube as well as for the other similar types of fruits.Design/methodology/approachThe whole process begins with manual analysis and collection of four jujube grades from the jujube tree, in addition to this jujube image acquisition was performed utilizing MVS which is further followed by image pre-processing and augmentation tasks. Eventually, classification models (i.e. proposed model, from scratch and pre-trained VGG16 and AlexNet) were trained and validated over the original and augmented datasets to discriminate the jujube into maturity grades.FindingsThe highest success rates reported over the original and augmented datasets were 97.53% (i.e. error of 2.47%) and 99.44% (i.e. error of 0.56%) respectively using Adam optimizer and a learning rate of 0.003.Research limitations/implicationsThe investigation relies upon a single view of the jujube image and the outer appearance of the jujube. In the future, multi-view image capturing system could be employed for the model training/validation.Practical implicationsDue to the vast functional derivatives of jujube, the identification of maturity grades of jujube is paramount in the fruit industry, functional food production industries and pharmaceutical industry. Therefore, the proposed model which is practically feasible and easy to implement could be utilized in such industries.Originality/valueThis research examines the performance of proposed CNN models for selected optimizer and learning rates for the grading of jujube maturity into four classes and compares them with the classical models to depict the sublime model in terms of accuracy, the number of parameters, epochs and computational time. After a thorough investigation of the models, it was discovered that the proposed model transcends both classical models in all aspects for both the original and augmented datasets utilizing Adam optimizer with learning rate of 0.003.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7e44aca36bf0a6c6cc71b6b574cedae2",
  "timestamp": "2025-05-15T01:32:30.177064"
}