{
  "id": 2945,
  "title": "What influences real estate volatility in Hong Kong? An ARMA-GARCH approach",
  "abstract": "Purpose This paper aims to examine real estate price volatility in Hong Kong. Monthly data on housing, offices, retail and factories in Hong Kong were analyzed from February 1993 to February 2019 to test whether volatility clusters are present in the real estate market. Real estate price determinants were also investigated. Design/methodology/approach Autoregressive conditional heteroscedasticity-Lagrange multiplier test is used to examine the volatility clustering effects in these four kinds of real estate. An autoregressive and moving average model-generalized auto regressive conditional heteroskedasticity (GARCH) model was used to identify real estate price volatility determinants in Hong Kong. Findings There was volatility clustering in all four kinds of real estate. Determinants of price volatility vary among different types of real estate. In general, housing volatility in Hong Kong is influenced primarily by the foreign exchange rate (both RMB and USD), whereas commercial real estate is largely influenced by unemployment. The results of the exponential GARCH model show that there were no asymmetric effects in the Hong Kong real estate market. Research limitations/implications This volatility pattern has important implications for investors and policymakers. Residential and commercial real estate have different volatility determinants; investors may benefit from this when building a portfolio. The analysis and results are limited by the lack of data on real estate price determinants. Originality/value To the best of the authors' knowledge, this paper is the first study that evaluates volatility in the Hong Kong real estate market using the GARCH class model. Also, this paper is the first to investigate commercial real estate price determinants.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7e65575f66e2eeb4ca8bf0846693b2b4",
  "timestamp": "2025-05-15T01:12:09.100247"
}