{
  "id": 9138,
  "title": "Impact of Diabetic Retinopathy on Vision-Specific Function",
  "abstract": "Objective: To assess the influence of the spectrum of diabetic retinopathy (DR) on vision-specific function in an Asian population. Design: Population-based cross-sectional study. Participants: Persons aged 40 to 80 years of Malay ethnicity in Singapore. Methods: The Singapore Malay Eye Study was a population-based, cross-sectional study of 3280 Asian Malays (78.7% response rate). Five end points were considered: (1) any DR, (2) macular edema (ME), (3) clinically significant macular edema (CSME), (4) vision-threatening DR (VTDR), and (5) DR severity levels ranging from none to proliferative diabetic retinopathy (PDR). Vision function was assessed using the Vision-Specific Functioning Scale validated using Rasch analysis. Main Outcome Measures: Vision-specific functioning score. Results: Of 357 diabetic participants in the study, 23.2% had any DR, 5.6% had ME, 5.0% had CSME, 10.6% had VTDR, and 6.2% had PDR. In linear regression models adjusting for age, gender, stroke, diabetic risk factors, and socioeconomic factors, poorer vision-specific function was associated independently with any DR (beta, -0.21; P<0.05), ME (beta, -0.48; P<0.05), CSME (beta, -0.42; P<0.05), VTDR (beta, -0.64; P<0.05), and PDR (beta, -0.92; P<0.001). When controlling further for presenting visual acuity, VTDR (beta, -0.37; P<0.01) and PDR (beta, -0.61; P = 0.002) were the only 2 DR categories independently associated with poorer vision-specific function and PDR. Persons with VTDR and PDR were 6 to 12 times more likely to report lower participation in daily living activities than those without these DR levels. Conclusions: People with VTDR and PDR have substantial difficulty undertaking vision-specific daily activities. These findings reinforce the importance of preventative efforts targeted at the earliest DR stages to prevent progression to later stages of DR. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2010;117:757-765 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7e7246697b2f17adc2e393da29ce054c",
  "timestamp": "2025-05-15T03:25:54.614492"
}