{
  "id": 7314,
  "title": "Predictors of attendance at the first follow-up and poor visual outcome after paediatric cataract surgery in Kinshasa for the years 2001-2021",
  "abstract": "BackgroundAbout 90% of blind children come from low- and middle-income countries. The main cause of childhood blindness is cataract. Cataract surgery can improve vision, but regular follow-up is necessary. Low attendance at follow-up is a medical and statistical challenge, as missing information can lead to biased results. Two research questions arise: what social factors influence attendance at first follow-up? What social factors influence a poor outcome of visual acuity at first follow-up?MethodsAn observational cohort study was conducted, and the total base population was analysed. The study includes children who received cataract surgery at Saint Joseph Hospital (Kinshasa, Democratic Republic of the Congo) from 2001 to 2021. Cox regression was used to examine attendance at the first follow-up (n = 1100 operated eyes), ordinal logistic regression to analyse visual acuity at the first follow-up (n = 699 operated eyes), both clustered by patient identification number. Due to the high number of missing values, multiple imputation was performed as a sensitivity analysis.ResultsFemale sex, young age, very good visual acuity after surgery, and disease in both eyes led to lower attendance at follow-up. Poor visual acuity outcome at follow-up was associated with female sex, young age, poor financial situation, blindness after surgery and nystagmus.ConclusionsAs regular follow-up is crucial for an improved visual acuity outcome, it is recommended that special attention needs to be paid to the groups identified in our analysis to better integrate them into follow-up. In particular, the higher risk of poor outcome in younger children is surprising and requires further analysis.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7e783b6034cd97eee57df3a06beabc2b",
  "timestamp": "2025-05-15T03:07:31.830892"
}