{
  "id": 3416,
  "title": "The impact of fundamental factors and sentiments on the valuation of cryptocurrencies",
  "abstract": "The valuation of cryptocurrencies is important given the increasing significance of this potential asset class. However, most state-of-the-art cryptocurrency valuation methods only focus on one of the fundamental factors or sentiments and use out-of-date data sources. In this study, a robust cryptocurrency valuation method is developed using up-to-date datasets. Using various panel regression models and moving-window regression tests, the impacts of fundamental factors and sentiments in the valuation of cryptocurrencies are explored with data covering from January 1, 2009 to April 30, 2023. The research shows the importance of sentiments and suggests that the fear and greed index can indicate when to make a cryptocurrency investment, while Google search interest in cryptocurrency is crucial when choosing the appropriate type of cryptocurrency. Moreover, consensus mechanism and initial coin offering have significant effects on cryptocurrencies without stablecoins, while their impacts on cryptocurrencies with stablecoins are insignificant. Other fundamental factors, such as the type of supply and the presence of smart contracts, do not have a significant influence on cryptocurrency. Findings from this study can enhance cryptocurrency marketisation and provide insightful guidance for investors, portfolio managers, and policymakers in assessing the utility level of each cryptocurrency.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7e836ba7b23276ee3a82cc6ccd2c1b9e",
  "timestamp": "2025-05-15T01:16:55.515177"
}