{
  "id": 8143,
  "title": "Delayed sleep-wake phase disorder in young adults: prevalence and correlates from a national survey of Norwegian university students",
  "abstract": "Background: Delayed sleep-wake phase disorder (DSWPD) during adolescence has been linked to impaired health and poor functioning. However there is a dearth of knowledge about DSWPD in young adulthood. We seek to contribute knowledge on the prevalence and correlates of DSWPD in this age group. Methods: Data were drawn from a 2018 national survey of students in higher education in Norway (the SHoT-study). All 162,512 fulltime students in Norway were invited to participate and 50,054 students (69.1% women) aged 18-35 years were included (response rate = 30.8%). DSWPD was assessed by self-report, and was operationalized according to the criteria for DSWPD in the most recent edition of the International Classification of Sleep Disorders. Correlates of DSWPD were examined by validated self-report instruments covering a wide range of demographic and health domains. Results: The overall prevalence of DSWPD was 3.3%, and significantly higher in male (4.7%) than female (2.7%) students. DSWPD was associated with being single, having financial difficulties, having divorced parents, being overweight/obese, and physical inactivity. Students with DSWPD had more sleep problems during weekdays, and higher levels of somatic and mental health problems. Students with DSWPD also had an elevated risk of self-harm-related thoughts and behaviors as well as suicidality. Conclusion: DSWPD remains a significant problem among young adults, and the high symptom load across health domains indicates that suggests a need for existing evidence-based approaches to be scaled for college students who present with DSWPD. (C) 2020 Elsevier B.V. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ea173624a5a2781163c8a35239b3fb7",
  "timestamp": "2025-05-15T03:15:38.423269"
}