{
  "id": 9380,
  "title": "How much are patients willing to pay for spine surgery? An evaluation of attitudes toward out-of-pocket expenses and cost-reducing measures",
  "abstract": "BACKGROUND CONTEXT: With rising healthcare expenditures in the United States, patients and providers are searching to maintain quality while reducing costs.PURPOSE: The aim of this study was to investigate patient willingness to pay for anterior cervical discectomy and fusion (ACDF), degenerative lumbar spinal fusions (LF), and adult spine deformity (ASD) surgery.STUDY DESIGN/SETTING: A survey was developed and distributed to anonymous respondents through Amazon Mechanical Turk (MTurk).METHODS: The survey introduced 3 procedures: ACDF, LF, and ASD surgery. Respondents were asked sequentially if they would pay at each increasing price option. Respondents were then presented with various cost-saving methods and asked to select the options that made them most uncomfortable, even if those would save them out-of-pocket costs.RESULTS: In total, 979 of 1,172 total responses (84%) were retained for analysis. The average age was 36.2 years and 44% of participants reported a household income of $50,000 to 100,000. A total of 63% used Medicare and 13% used Medicaid. A total of 40% stated they had high levels of financial stress. A total of 30.1% of participants were willing to undergo an ACDF, 30.3% were willing to undergo a LF, and 29.6% were willing to undergo ASD surgery for the cost of $3,000 (p=.98). Regression demonstrated that for ACDF surgery, a $100 increase in price resulted in a 2.1% decrease in willingness to pay. This is comparable to degenerative LF surgery (1.8% decrease), and ASD surgery (2%). When asked which cost-saving measures participants were least comfortable with for ACDF surgery, 60% stated Use of the older generation implants/devices (LF: 51%, ASD: 60%,), 61% stated Having the surgery performed at a community hospital instead of at a major academic center (LF: 49%, ASD: 56%), and 55% stated Administration of anesthesia by a nurse anesthetist (LF: 48.01%, ASD: 55%). Conversely, 36% of ACDF patients were uncomfortable with a Video/telephone postoperative visit to cut costs (LF: 51%, ASD: 39%). CONCLUSIONS: Patients are unwilling to contribute larger copays for adult spinal deformity correction than for ACDF and degenerative lumbar spine surgery, despite significantly higher procedural costs and case complexity/invasiveness. Patients were most uncomfortable forfeiting newer generation implants, receiving the operation at a community rather than an academic center, and receiving care by physician extenders. Conversely, patients were more willing to convert postoperative visits to telehealth and forgo neuromonitoring, indicating a potentially poor understanding of which cost-saving measures may be implemented without increasing the risk of complications.(c) 2023 Elsevier Inc. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7eafff5e068db2f548d90021cc9ac51a",
  "timestamp": "2025-05-15T03:28:17.573497"
}