{
  "id": 4798,
  "title": "The measurement of muccessful management via a net profit maximization model with ten factors and financial accounting disclosure policy-case of vinamilk in F&B industry in Vietnam",
  "abstract": "When a firm has better disclosure policy of financial accounting information it will attract more investment. Many factors affecting accounting information disclosure policy include firm size, leverage, industry characteristics, investor types, etc. And good financial accounting data disclosure will help to reduce risk level of firms. At micro level, cost and net sale factors will affect net profit while at macro levels, risk free rate and exchange rate will impact. According to Nikkei Asian Review, Vinamilk (VNM) is the only brand in F&B industry and the domestic industry leader which ranked 25th among 300 listed companies in the List of ASIA300 Power Performers. It leads the organic trend in milk industry and has made very positive contributions to the overall achievements of economic and social values. Good business management requires us to consider the impacts of multi macro and micro factors on net profit, both internal and external factors, and it contributes to promoting business plan and economic policies for economic growth and stabilizing business operation. By data collection method through statistics, analysis, synthesis, comparison, quantitative analysis to generate qualitative comments and discussion; using econometric method to perform regression equation and evaluate quantitative results, the article analyzed and evaluated the impacts of ten (10) macroeconomic factors such as: stock price, VNIndex, risk free rate, lending rate, cost, sale, inflation, GPD growth, S&P500, exchange rate, etc. on net profit of a leading milk listed company, Vinamilk (VNM) in Vietnam in the 10-year period of 2010-2019, both positive and negative sides. From that regression model and analysis, it will draw leadership features, strengths of this industrial leader. The results of quantitative research, in a ten factor model, show that the decrease in GDP growth and risk free rate, inflation and increase in net sale will have a significant effect and increase VNM net profit, with the highest impact coefficient, the second is decreasing cost. This research finding and recommended policy also can be used as reference in policy for F&B system in many developing countries.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7eb04a6262b4ad60d711bd6d3861dbc3",
  "timestamp": "2025-05-15T02:41:00.898489"
}