{
  "id": 38,
  "title": "Portfolio rebalancing based on a combined method of ensemble machine learning and genetic algorithm",
  "abstract": "Purpose - This paper presents a combined method of ensemble learning and genetics to rebalance the corporate portfolio. The primary purpose of this paper is to determine the amount of investment in each of the shares of the listed company and the time of purchase, holding or sale of shares to maximize total return and reduce investment risk. Design/methodology/approach - To achieve the goals of the problem, a two-level combined intelligent method, such as a support vector machine, decision tree, network Bayesian, k-nearest neighbors and multilayer perceptron neural network as heterogeneous basic models of ensemble learning in the first level, was applied. Then, the majority vote method (weighted average) in the second stage as the final model of learning was collectively used. Therefore, the data collected from 208 listed companies active in the Tehran stock exchange () from 2011 to 2015 have been used to teach the data. For testing and analysis, the data of the same companies between 2016 and 2020 have been used. Findings - The results showed that the method of combined ensemble learning and genetics has the highest total stock portfolio yield of 114.12%, with a risk of 0.905%. Also, by examining the rate of return on capital, it was observed that the proposed method has the highest average rate of return on investment of 110.64%. As a result, the proposed method leads to higher returns with lower risk than the purchase and maintenance method for fund managers and companies and predicts market trends. Research limitations/implications - In the forthcoming research, there were no limitations to obtain research data were easily extracted from the site of Tehran Stock Exchange Technology Management Company and Rahvard Novin software, and simulation was performed in MATLAB software. Practical implications - In this paper, using combined machine learning methods, companies' stock prices are predicted and stock portfolio optimization is optimized. As companies and private organizations are trying to increase their rate of return, so they need a way to predict stock prices based on specific indicators. It turned out that this algorithm has the highest stock portfolio return with reasonable investment risk, and therefore, investors, portfolio managers and market timers can be used this method to optimize the stock portfolio. Social implications - The homogeneous and heterogeneous two-level hybrid model presented in the research can be used to predict market trends by market timers and fund managers. Also, adjusting the portfolio with this method has a much higher return than the return on buying and holding, and with controlled risk, it increases the security of investors' capital, and investors invest their capital in the funds more safely. And will achieve their expected returns. As a result, the psychological security gained from using this method for portfolio arrangement will eventually lead to the growth of the capital market. Originality/value - This paper tries to present the best combination of stock portfolios of active companies of the Tehran Stock Exchange by using the two-level combined intelligent method and genetic algorithm.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ebafe214e4eb766960252de2716a6db",
  "timestamp": "2025-05-15T00:38:16.326346"
}