{
  "id": 4546,
  "title": "A Big Data framework to analyze risk factors of diabetes outbreak in Indian population using a MapReduce algorithm",
  "abstract": "Increase in burden of chronic disease is hurting the economic and the prosperity of the country with the global risk, financial loss with increased expenditure, loss of productivity and likely to affect India's economic development adversely over the next couple of decades. Instantaneous measures are to be taken to create awareness to thwart epidemic among Indian Population. A Big Data unified data analysis and evaluation framework is proposed to analyze the awareness of risk factors of Diabetes among young, middle-aged Indian population. As a first phase data acquisition is done from heterogeneous data sources with different formats (Xml, Log files, Text document, Whats app, Emails) using Scoop. The data acquired is converted from different structure to a structured format using ETL and Text mining engine, Diabetic corpus is formed using with the reference of the food chart and the domain consultant for further processing its stored in HDFS. The data analysis is done as a MapReduce task using machine learning algorithms and the results are visualized. The results show devastating effects on the middle aged Indian population. High intake of refined carbohydrate foods and significant reduction of physical activity resulted in many younger generations being more prone to endemic diabetes. Rapid nutrition transition due to westernized diet and lifestyle increase the rate of diabetes. More than half of the young adolescents are more prone to diabetes. Extensive studies and clinical evidences show that type-2 diabetes is almost preventable through lifestyle changes and food habits. To hold back the growing outbreak of diabetes, the primary prevention must be through advertise of a healthy diet, food nutrition value and good physical activity as a global public policy priority.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ebef5d80511538127592cdd054607ba",
  "timestamp": "2025-05-15T02:38:20.424125"
}