{
  "id": 95,
  "title": "Evaluating growth options as sources of value for pharmaceutical research projects",
  "abstract": "The financial value of research projects is difficult to assess because they are highly uncertain. Often, the result is either an overly conservative approach to strategic innovation, based on net present value analyses, or an overly aggressive approach based on optimistic qualitative portfolios. R&D project evaluation requires recognizing threats as well as opportunities from uncertain events, and incorporating flexibility in managerial action in response to them. Real options pricing analysis is a widely discussed tool for evaluating such managerial flexibility. The limitation of options pricing lies in its requirement for complete financial markets, in which a replicating asset can be found that reproduces (or, at least, is correlated with) the project's payoffs in all possible states of the world. However, the major risks of research projects are typically project specific and cannot be replicated in external markets. In this situation, a decision tree is a better tool to represent managerial options during execution of the project, and to evaluate its value. A decision tree is equivalent to options pricing for risks that can be priced in the financial markets (if trading of securities is explicitly included), and moreover, it can incorporate risks and flexibility that are not traded in financial markets. Using decision trees, we demonstrate a quantitative evaluation of compound growth options from research at BestPharma, a large international pharmaceutical company. A growth option is a future opportunity that may arise from a current R&D investment. The growth option may not be related to the primary purpose of the R&D project, or not even be directly foreseeable. Kester (1984) has argued that growth options may account for a large part of project value. BestPharma faced the problem of choosing among several strategic research initiatives. They developed a decision tree representation of the projects, which helped to provide transparency about project value and strategic options. Most importantly, carefully thinking through the tree helped to identify growth options, represented by additional branches in the tree, and to quantify that they represented major sources of value.",
  "year": 2001,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ee39c17b83fa24a6990cddf5f0e74dc",
  "timestamp": "2025-05-15T01:28:03.986461"
}