{
  "id": 648,
  "title": "Prediction Models Using Decision Tree and Logistic Regression Method for Predicting Hospital Revisits in Peritoneal Dialysis Patients",
  "abstract": "Hospital revisits significantly contribute to financial burden. Therefore, developing strategies to reduce hospital revisits is crucial for alleviating the economic impacts. However, this critical issue among peritoneal dialysis (PD) patients has not been explored in previous research. This single-center retrospective study, conducted at Chang Gung Memorial Hospital, Chiayi branch, included 1373 PD patients who visited the emergency room (ER) between Jan 2002 and May 2018. The objective was to predict hospital revisits, categorized into 72-h ER revisits and 14-day readmissions. Of the 1373 patients, 880 patients visiting the ER without subsequent hospital admission were analyzed to predict 72-h ER revisits. The remaining 493 patients, who were admitted to the hospital, were studied to predict 14-day readmissions. Logistic regression and decision tree methods were employed as prediction models. For the 72-h ER revisit study, 880 PD patients had a revisit rate of 14%. Both logistic regression and decision tree models demonstrated a similar performance. Furthermore, the logistic regression model identified coronary heart disease as an important predictor. For 14-day readmissions, 493 PD patients had a readmission rate of 6.1%. The decision tree model outperformed the logistic model with an area under the curve value of 79.4%. Additionally, a high-risk group was identified with a 36.4% readmission rate, comprising individuals aged 41 to 47 years old with a low alanine transaminase level <= 15 units per liter. In conclusion, we present a study using regression and decision tree models to predict hospital revisits in PD patients, aiding physicians in clinical judgment and improving care.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7eea07d7a0e3ed061f109cfa410b4d0d",
  "timestamp": "2025-05-15T01:53:24.908831"
}