{
  "id": 9033,
  "title": "Factors Associated With Mental Health Symptoms During the COVID-19 Pandemic in Hong Kong",
  "abstract": "Background: The COVID-19 pandemic has led to an increasing mental health burden. We examined the factors associated with mental health symptoms in Chinese general adults in Hong Kong. Methods: We conducted a dual-frame (landline and mobile) survey on Chinese adults aged 18 years or older in April 2020. Shortage of preventive materials, perceptions of the outbreak (each item range 1-5), and reduction in income were assessed. Mental health symptoms measured included stress (Perceived Stress Scale-4, range 0-16), anxiety (General Anxiety Disorders-2, range 0-6, cutoff >2), and depressive symptoms (Patient Health Questionnaire-2, range 0-6, cutoff >2). Results were weighted by the general population distribution. Associations were analyzed by multivariable linear (for stress) and logistic (for anxiety and depressive symptoms) regression adjusting for sociodemographic and health-related covariates, including confirmed or in close contacts of confirmed cases, chronic disease, self-rated health, and smoking and alcohol drinking behavior. Results: Of the 1,501 participants (52.5% female, 55.0 aged 30-59 years), the average stress score was 7.20 (SD 2.12). 218 (15.8%) and 206 (14.8%) participants had anxiety and depressive symptoms, respectively. Shortage in facemasks (20.8%), alcohol-based hand sanitizers (13.9%), and cleaning products (7.3%) was reported. Participants generally disagree with the perception of at risk of getting infected in the coming 6 months (mean 2.2, SD 1.1), but tended to agree with the perception of worry that the people around pose a threat to them (mean 3.6, SD 0.9) and the outbreak has greatly affected their daily life (mean 3.7, SD 0.9). 59.3% employed participants had income reduction and 6.2% had become unemployed since the outbreak. Stress, anxiety, and depressive symptoms were more prevalent in those with shortages of preventive materials and negative perceptions of the outbreak (all P < 0.05). Reduction in income and unemployment were associated with more mental health symptoms (all P < 0.05). Conclusions: Shortage of preventive materials, negative perceptions, financial loss, and unemployment were prevalent during the outbreak and found in association with higher stress and more anxiety and depressive symptoms. Further research and urgent actions are warranted to relieve stress and promote mental health, targeting the many risk factors identified by our study.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7eec0a000cbe4a26c8b3ca6db596a3a8",
  "timestamp": "2025-05-15T03:24:54.897258"
}