{
  "id": 8558,
  "title": "Rehabilitation Intensity and Patient Outcomes in Skilled Nursing Facilities in the United States: A Systematic Review",
  "abstract": "Objective. Exponential increases in rehabilitation intensity in skilled nursing facilities (SNFs) motivated recent changes in Medicare reimbursement policies, which remove financial incentives for providing more minutes of physical therapy, occupational therapy, and speech therapy. Yet, there is concern that SNFs will reduce therapy provision and patients will experience worse outcomes. The purpose of this systematic review was to synthesize current evidence on the relationship between therapy intensity and patient outcomes in SNFs. Methods. PubMed, Medline, Scopus, Embase, CINAHL, PEDro, and COCHRANE databases were searched. English-language studies published in the United States between 1998 and February 14, 2020, examining the relationship between therapy intensity and community discharge, hospital readmission, length of stay (LOS), and functional improvement for short-stay SNF patients were considered. Data extraction and risk of bias were performed using the American Academy of Neurology Classification of Evidence scale for causation questions. American Academy of Neurology criteria were used to assess confidence in the evidence for each outcome. Results. Eight observational studies met inclusion criteria. There was moderate evidence that higher intensity therapy was associated with higher rates of community discharge and shorter LOS. One study provided very low-level evidence of associations between higher intensity therapy and lower hospital readmissions after total hip and knee replacement. There was low-level evidence indicating higher intensity therapy is associated with improvements in function. Conclusions. This systematic review concludes with moderate confidence that higher intensity therapy in SNFs leads to higher community discharge rates and shorter LOS. Future research should improve quality of evidence on functional improvement and hospital readmissions. Impact. This systematic review demonstrates that patients in SNFs may benefit from higher intensity therapy. Because new policies no longer incentivize intensive therapy, patient outcomes should be closely monitored to ensure patients in SNFs receive high-quality care.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7eeeeca8bc7e7d58b6b75db836ef0baa",
  "timestamp": "2025-05-15T03:19:52.238573"
}