{
  "id": 9298,
  "title": "Impact of Credit Constraints on Financial Performance of Small and Medium Size Enterprises",
  "abstract": "Small and medium-sized enterprises (SMEs) are fundamental to national economic development through poverty alleviation and employment creation. However, credit constraints severely challenge small and medium-sized enterprises' (SMEs) performance. Therefore, this study aims to establish the link between credit constraints and the financial performance of SMEs. The paper further examines whether the differences in performance between constrained and unconstrained firms can contribute to poverty reduction. To this end, the endogenous switching regression was applied to the cross-sectional data from a firm-level survey involving 520 SMEs from Cameroon. The paper considered four credit constraint categories: risk, quantity, price, and transaction cost. Results reveal that 74% of SMEs are credit constrained, and the majority (43%) are quantity constrained. Interestingly, risk and price-constrained SMEs are mainly more profitable than unconstrained SMEs, while quantity and transaction-cost-constrained SMEs are less profitable than their counterparts. Consequently, the impact on poverty reduction is equally varied. The scholarly and policy implications of the study are that alleviating credit constraints among SMEs does not always augment the profitability of the SMEs and contributes towards poverty eradication. Les petites et moyennes entreprises (PME) sont fondamentales pour le developpement economique national grace a l'allegement de la pauvrete et ala creation d'emplois. Cependant, les contraintes de credit posent des problemes assez severes ala performance des petites et moyennes entreprises (PME). Par consequent, cette etude vise a etablir le lien entre les contraintes de credit et la performance financiere des PME. Le document examine en outre si les differences de performance entre les entreprises contraintes et non contraintes peuvent contribuer a la reduction de la pauvrete. A cette fin, la regression de commutation endogene a ete appliquee aux donnees transversales d'une enquete au niveau de l'entreprise impliquant 520 PME du Cameroun. L'etude considere quatre categories de contraintes de credit : risque, quantite, prix et cout de transaction. Les resultats revelent que 74% des PME sont contraintes par le credit, et la majorite (43%) sont contraintes en quantite. Fait interessant, les PME contraintes par le risque et le prix sont generalement plus rentables que les PME non contraintes, tandis que les PME contraintes en quantite et en cout de transaction sont moins rentables que leurs homologues. Par consequent, l'impact sur la reduction de la pauvrete est egalement varie. Les implications academiques et politiques de l'etude sont que l'allegement des contraintes de credit parmi les PME n'augmente pas toujours la rentabilite des PME, et il contribue a l'eradication de la pauvrete. Las pequenas y medianas empresas (PYMEs) son fundamentales para el desarrollo economico nacional mediante la reduccion de la pobreza y la creacion de empleo. Sin embargo, las restricciones de credito complican severamente el rendimiento de las pequenas y medianas empresas (PYMEs). Por lo tanto, este estudio tiene como objetivo establecer el vinculo entre las restricciones de credito y el rendimiento financiero de las PYMEs. El articulo examina ademas si las diferencias en el rendimiento entre las empresas restringidas y no restringidas pueden contribuir a la reduccion de la pobreza. A este fin, aplicamos la regresion de conmutacion endogena a los datos transversales de una encuesta a nivel de empresa que involucro a 520 PYMEs de Camerun. El articulo considera cuatro categorias de restriccion de credito: riesgo, cantidad, precio y costo de transaccion. Los resultados revelan que el 74% de las PYMEs estan restringidas por el credito, y la mayoria (43%) estan restringidas por la cantidad. Curiosamente, las PYMEs restringidas por el riesgo y el precio son generalmente mas rentables que las PYMEs no restringidas, mientras que las PYMEs restringidas por la cantidad y el costo de transaccion son menos rentables que sus contrapartes. En consecuencia, el impacto en la reduccion de la pobreza es igualmente variado. Las implicaciones academicas y politicas del estudio son que aliviar las restricciones de credito entre las PYMEs no siempre aumenta la rentabilidad de las PYMEs, y que contribuye a la erradicacion de la pobreza.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ef7bdf9e67098ecf563d017daac8763",
  "timestamp": "2025-05-15T03:27:25.039617"
}