{
  "id": 6091,
  "title": "Self-reported Participation Restrictions Among Male and Female Veterans With Traumatic Brain Injury in Veterans Health Administration Outpatient Polytrauma Programs",
  "abstract": "Objectives: To identify areas of most restricted self-reported participation among veterans with traumatic brain injury (TBI), explore associations among participation restriction and clinical characteristics, and examine differences in participation restrictions by sex. Design: Retrospective cross-sectional design. Setting: National VA Polytrauma System of Care outpatient settings. Participants: Veterans with a confirmed TBI event (N=6065). Interventions: Not applicable. Main Outcome Measure(s): Mayo-Portland Participation Index (M2PI), a 5-point Likert-type scale with 8 items. Total score was converted to standardized T score for analysis. Results: The sample consisted of 5679 male and 386 female veterans with >= 1 clinically confirmed TBI events (69% white; 74% with blast exposure). The M2PI items with greatest perceived restrictions were social contact, leisure, and initiation. There were no significant differences between men and women on M2PI standardized T scores. Wilcoxon rank-sum analyses showed significant differences by sex on 4 items: leisure, residence, employment, and financial management (all P<.01). In multinomial logistic regression on each item controlling for demographics, injury characteristics, and comorbidities, female veterans had significantly greater relative risk for part-time work and unemployment on the employment item and significantly less risk for impairment on the residence and financial management item. Conclusions: There was no significant difference between men and women. Veterans on M2PI standardized T scores, which masks differences in response patterns to individual items. Clinical teams should be encouraged to discuss perceived restrictions with patients and target these areas in treatment planning. Future work is needed to investigate the psychometric properties of the M2PI by biological sex. Published by Elsevier Inc. on behalf of the American Congress of Rehabilitation Medicine",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f15ae01ca34235a4768fc7aa094dc22",
  "timestamp": "2025-05-15T02:54:38.840141"
}