{
  "id": 6706,
  "title": "ESG RISK RATING AND COMPANY VALUATION: THE CASE OF THE WARSAW STOCK EXCHANGE",
  "abstract": "This research investigates whether investors on the Warsaw Stock Exchange are willing to pay a premium to invest in large companies with a relatively more favourable environmental, social and governance (ESG) risk profile. The theory is that lower exposure to ESG risks and better ESG risk management practices are perceived by investors as a signal of potentially lower financial uncertainty and improved ability of companies to grow future earnings. The analysis was conducted for companies included in the mWIG40 and WIG20 indices. The relationship between market ratios reflecting company valuation, such as price to net book value and enterprise value to EBITDA, and their ESG risk ratings was modelled using regression models. Those were estimated using ordinary and generally least squares techniques. Although ESG management practices are still at a relatively early stage of implementation in Central Europe (including Poland), the results of the analysis confirm a strong negative relationship between the severity of ESG risks and the relative valuation of the company, accompanied by the existence of significant valuation differences across industries. Of particular note is the impact of a favourable ESG risk rating on a higher Enterprise Value to EBITDA ratio. This ratio is important because it is very often used as a valuation basis in corporate buy -sell transactions. The research confirms that investors are willing to pay more for companies that have built business models that are less vulnerable to future ESG risks and have a quality management culture. As a result, the research provides evidence that consciously investing in climate risk mitigation and improving corporate governance practices in large companies pays off for shareholders.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f18bd1c171f85a8bad23842782970d0",
  "timestamp": "2025-05-15T03:00:35.536120"
}