{
  "id": 6723,
  "title": "Do Uncertainties in US Affect Bitcoin Returns? Evidence from Time Series Analysis",
  "abstract": "The study attempts to add to the existing literature on the relationship between uncertainties and Bitcoin by determining the direction of the relationship between Economic Policy Uncertainty (EPU), Geopolitical Risk (GPR), Political Risk (PR) and Bitcoin returns. This is to ascertain if Bitcoin hedges and is a safe haven asset against uncertainties. We employed the use of Ordinary Least Square (OLS), Autoregressive Distributive Lag (ARDL) and Quantile Regression (QR) to achieve the research objective. Having discovered the existence of structural breaks after conducting the Zivot-Andrews unit root for structural breaks, the analysis was divided into full sample period, first sub-period and the second sub-period. Findings show that EPU, GPR and PR hedge and play the role of safe haven against uncertainties in the United States (US). We found that EPU exerts positive influence against Bitcoin returns while GPR and PR negatively influence Bitcoin returns. The result further shows that Bitcoin returns hedges against EPU in the lower and middle quantiles while Bitcoin returns hedges against PR only in the lower quantile. The study therefore concludes that uncertainty and risk in the US influence bitcoin returns. It supports the hedging ability and safe haven properties of bitcoin, emphasising that bitcoin returns react more to EPU US than GPR US and PR US, therefore recommending investment experts and financial analysts focus more on EPU US than GPR US and PR US.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f3cbbcce25b0ecd24434e1a3fcf2943",
  "timestamp": "2025-05-15T03:01:03.533655"
}