{
  "id": 5803,
  "title": "Socio-economic factors linked with mental health during the recession: a multilevel analysis",
  "abstract": "Background: Periods of financial crisis are associated with higher psychological stress among the population and greater use of mental health services. The objective is to analyse contextual factors associated with mental health among the Spanish population during the recession. Methodology: Cross-sectional, descriptive study of two periods: before the recession (2006) and after therecession (2011-2012). The study population comprised individuals aged 16+ years old, polled for the National Health Survey. There were 25,234 subjects (2006) and 20,754 subjects (2012). The dependent variable was psychic morbidity. Independent variables: 1) socio-demographic (age, socio-professional class, level of education, nationality, employment situation, marital status), 2) psycho-social (social support) and 3) financial (GDP per capita, risk of poverty, income per capita per household), public welfare services (health spending per capita), labour market (employment and unemployment rates, percentage of temporary workers). Multilevel logistic regression models with mixed effects were constructed to determine change in psychic morbidity according to the variables studied. Results: The macroeconomic variables associated with worse mental health for both males and females were lower health spending per capita and percentage of temporary workers. Among women, the risk of poor mental health increased 6% for each 100(sic) decrease in healthcare spending per capita. Among men, the risk of poor mental health decreased 8% for each 5-percentage point increase in temporary workers. Conclusions: Higher rates of precarious employment in a region have a negative effect on people's mental health; likewise lower health spending per capita. Policies during periods of recession should focus on support and improved conditions for vulnerable groups such as temporary workers. Healthcare cutbacks should be avoided in order to prevent increased prevalence of poor mental health.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f3ccc73db39e736d133c3df9aa9519e",
  "timestamp": "2025-05-15T02:51:30.107019"
}