{
  "id": 3868,
  "title": "Nonlinear bidirectional multiscale volatility transmission effect between stocks and exchange rate markets in the selected African countries",
  "abstract": "This paper investigates the multiscale bidirectional volatility spillover effect between the national stocks and exchange rate markets in four African countries - Nigeria, South Africa, Egypt and Morocco. Our computations involve the wavelet transformation of the empirical series, creation of the regime-dependant conditional volatilities via MS-GARCH model and measurement of the volatility spillover effect in the quantile regression framework. We find an evidence of the bidirectional volatility spillover effect, but the volatility impact from exchange rate market to stock market is stronger in all the African countries, except Nigeria. Regarding the direction from stocks to exchange rate, we report that volatility spillover effect is the strongest in South Africa, because Johannesburg stock exchange is the most developed and liquid market. As for the reverse direction, the spillover effect is recorded in longer time-horizons in the Egyptian and Moroccan cases, which indicates to flow-oriented model, while for South Africa, the effect is found in shorter time-horizons, which is in line with the portfolio-balance theory. In South Africa, investors should protect themselves against exchange rate risk in shorter time-horizons, in Morocco and Egypt in longer time-horizons, while in Nigeria, hedging against exchange rate is not needed.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f4e13126a786d4bb59e5362cfb73a53",
  "timestamp": "2025-05-15T01:21:41.371816"
}