{
  "id": 5552,
  "title": "Herding Behavior in Developed, Emerging, and Frontier European Stock Markets during COVID-19 Pandemic",
  "abstract": "The behavior of market participants often does not rely on market signals, but replicates the investment decisions of other parties. The convergence of their investment behavior leads to the emergence of herd behavior with negative implications for financial stability. Moreover, this phenomenon may be even more pronounced in times of crisis. Although herding is an interesting topic which invites the interest of academic researchers, it still has not been sufficiently studied in terms of comparing the herd effect between differently developed stock markets. The first objective of this research was to determine the herd behavior during the COVID-19 pandemic using static and rolling regression analysis. The second objective was to investigate whether the herd behavior was triggered by the pandemic, while the third objective was to compare the differences in herd behavior between differently developed European stock markets. The results show that this phenomenon is most pronounced in emerging markets, followed by frontier markets and developed markets. Therefore, the results of this study are of particular importance for individual and institutional investors to achieve efficient risk diversification and for financial authorities to establish rules and avoid an increase in herd behavior.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f53887ad4d16ca73909d8edb249ae64",
  "timestamp": "2025-05-15T02:48:51.377634"
}