{
  "id": 7080,
  "title": "Nationally Representative Readmission Factors in Patients with Claudication and Critical Limb Ischemia",
  "abstract": "Background: Hospital readmissions are associated not only with increased mortality, morbidity, and costs but also, with current health-care reform, tied to significant financial and administrative penalties. Some studies show that patients undergoing vascular surgery may have higher than average readmission rates. The recently released Nationwide Readmission Database (NRD) is the most comprehensive national source of readmission data, gathering discharge information from 22 geographically dispersed states, accounting for 51.2% of the total U.S. resident population and 49.3% of all U.S. hospitalizations. The aim of this study is to use the power of the NRD and obtain nationally representative readmission information for patients admitted with claudication or critical limb ischemia (CLI) who underwent revascularization procedures. Methods: The NRD was queried for all patients admitted for claudication (International Classification of Diseases Ninth Revision [ICD-9] 440.21) or CLI (ICD-9 440.22-440.24) and who underwent percutaneous transluminal angioplasty, peripheral bypass, or aortofemoral bypass. Patient demographics, comorbidities, length of stay (LOS), mortality, readmission rates, and associated costs were collected. Univariable and multivariable logistic regression analysis was implemented on claudication and CLI groups on all outcomes of interest. The most common readmission diagnosis codes and diagnosis groups were also identified. Results: A total of 92,769 patients were admitted for peripheral vascular disease (33,055 with claudication and 59,714 with CLI). The 30-day readmission/any readmission rate was 8.97%/ 21.49% and 19.26%140.36%, for claudication and CLI, respectively. Significant differences were found for claudication and CLI, respectively, on initial cost of admission ($18,548 vs. $29,148, P < 0.001), readmission costs ($14,726 vs. $17,681 P < 0.001), LOS (4 days vs. 9 days, P < 0.001), days to readmission (73 days vs. 59 days, P < 0.001), mortality during initial admission (256 vs. 1,363, P < 0.001), and mortality during any admission (538 vs. 3,838, P < 0.001). Univariate and multivariate logistic regression analysis found that claudication, CLI, angioplasty, peripheral bypass, aortofemoral bypass, female sex, age >65, Charlson Comorbidity Index, LOS, and primary expected payer status were all significant predictors of 30-day and overall readmissions at varying degrees. The 5 most common disease readmission groups found were other vascular procedures (12.6%), amputation of lower limb except toes (6.3%), sepsis (5.4%), heart failure (4.9%) and postoperative or other device infections (4.8%). Of the abovementioned groups, the 4 most common diagnoses included other postoperative infections, sepsis, atherosclerosis of native arteries with gangrene, and other complications due to other vascular device, implant, or graft. Conclusions: Our results demonstrate that there is a significant difference in readmission rates, cost, and morbidity between patients admitted for claudication and CLI. Furthermore, based on regression analysis, there are multiple other clear risk factors associated with worse clinical and economic outcomes. Further study is needed to predict which patients will require increased vigilance during their hospital stay to prevent readmissions and worse outcomes.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f681757e85af2678f7ed01ecae722ed",
  "timestamp": "2025-05-15T03:05:03.411494"
}