{
  "id": 598,
  "title": "Multidimensional Modeling of Physical Fatigue using Soft Computing Intelligence",
  "abstract": "Introduction: Physical fatigue is one of the major risk factors for work-related musculoskeletal disorders and has many life and financial costs. The impact of physical/biomechanical, psychosocial, environmental, and individual risk factors on muscle fatigue is undeniable. The aim of this study is to model the phenomenon of muscle fatigue (as output) in the hand in work environments based on these risk factors (as input) using soft computing methods. Material and Methods: In the first step, associated risk factors of fatigue for 156 subjects (in three job categories) were assessed using Copenhagen environmental, psychosocial, demographic, and Man-TRA tools. Then, the Roman-Liu equation and mean square amplitude of acceleration waves were used to measure fatigue with a dynamometer and a three-axis accelerometer, respectively. Finally, according to the nature of risk factors and the phenomenon of fatigue, six categories (24 methods) of supervised machine learning (SML) based on classification were selected. MatLab software (MatLab R2017b, The Mathworks Inc., MA, U.S.A.) was used to fit the models using SML. Results: The best-fitted models in the first and second half of the work shift were obtained using support vector machine methods. Physical risk factors had a significant impact on physical fatigue. After filtering low-priority risk factors, in the first half of the work shift, the most optimal model had an accuracy of 71.8%, precision of 72.5%, sensitivity of 76.9%, specificity of 70.8%, and discrimination power equal to 73%. In the second half of the work shift, the accuracy, precision, sensitivity, and specificity of the optimized model were 60.3%, 57.5%, 50%, and 46.9%, respectively, and the discrimination power was obtained at about 62%. Conclusion: The fitted models for hand fatigue had acceptable performance in both sections of the shift but can still be optimized. Therefore, it is necessary for future studies to improve the quality of input and output data and include other dimensions affecting fatigue such as cognitive workload and type of work shift in future models.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f72d8c9d86ecb85290e083357663c30",
  "timestamp": "2025-05-15T01:52:49.522073"
}