{
  "id": 6122,
  "title": "Bankruptcy filings, flooding, real estate prices and Leading Index",
  "abstract": "Purpose Flood damage to uninsured single-family homes shifts the entire burden of costly repairs onto the homeowner. Homeowners in the United States and in much of Europe can purchase flood insurance. The Netherlands and Asian countries generally do not offer flood insurance protection to homeowners. Uninsured households incur the entire cost of repairing/replacing properties damaged due to flooding. Homeowners' policies do not cover damage caused by flooding. The paper examines the link between personal bankruptcy and the severity of flooding events, property prices and financial condition levels. Design/methodology/approach A fully modified ordinary least squares (FMOLS) regression model is developed which uses personal bankruptcy filings as its dependent variable during the years 2000 through 2018. This time-series model considers the association between personal bankruptcy court filings and costly, widespread flooding events. Independent variables were selected that potentially act as mitigating factors reducing bankruptcy filings. Findings The FMOLS regression results found a significant, positive association between flooding events and the total number of personal bankruptcy filings. Higher flooding costs were associated with higher bankruptcy filings. The Home Price Index is inversely related to the bankruptcy dependent variable. The R-squared results indicate that 0.65% of the movement in the dependent variable personal bankruptcy filings is explained by the severity of a flooding event and other independent variables. Research limitations/implications The severity of the flooding event is measured using dollar losses incurred by the National Flood Insurance program. A macro-case study was undertaken, but the research results would have been enhanced by examining local areas and demographic factors that may have made bankruptcy filing following a flooding event more or less likely. Practical implications The paper considers the impact of the natural disaster flooding on bankruptcy rates filings. The findings may have implications for multi-family properties as well as single-family housing. Purchasing flood insurance generally mitigates the likelihood of severe financial risk to the property owner. Social implications Natural flood insurance is underwritten by the federal government and/or by private insurers. The financial health of private property insurers that underwrite flooding and their ability to meet losses incurred needs to be carefully scrutinized by the insured. Originality/value Prior studies analyzing the linkages existing between housing prices, natural disasters and bankruptcy used descriptive data, mostly percentages, when considering this association. The study herein posits the same questions as these prior studies but used regression analysis to analyze the linkages. The methodology enables additional independent variables to be added to the analysis.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f7a00422ea6a64b8d86ae65866c977f",
  "timestamp": "2025-05-15T02:55:12.837761"
}