{
  "id": 1473,
  "title": "From intuition to intelligence: a text mining-based approach for movies' green-lighting process",
  "abstract": "Purpose The purpose of this paper is to develop a predictive model for box office performance based on the textual information in movie scripts in the green-lighting process of movie production. Design/methodology/approach The authors use Latent Dirichlet Allocation to determine the hidden textual structure in movie scripts by extracting topic probabilities as predictors for classification. The extracted topic probabilities are used as inputs for the predictive model for the box office performance. For the predictive model, the authors utilize a variety of classification algorithms such as logistic classification, decision trees, random forests, k-nearest neighbor algorithms, support vector machines and artificial neural networks, and compare their relative performances in predicting movies' market performance. Findings This approach for extracting textual information from movie scripts produces a valuable typology for movies. Moreover, our modeling approach has significant power to predict movie scripts' profitability. It provides a superior prediction performance compared to previous benchmarks, such as that of Eliashberg et al. (2007). Research limitations/implications This work contributes to literature on predicting the box office performance in the green-lighting process and literature regarding suggesting models for the idea screening stage in the new product development process. Besides, this is one of the few studies that use movie script data to predict movies' financial performance by proposing an approach to integrate text mining models and machine learning algorithms with movie experts' intuition. Practical implications First, the authors' approach can significantly reduce the financial risk associated with movie production decisions before the pre-production stage. Second, this paper proposes an approach that is applicable at a very early stage of new product development, such as the idea screening stage. The authors also introduce an online-based movie scenario database system that can help movie studios make more systematic and profitable decisions in the green-lighting process. Third, this approach can help movie studios estimate movie scripts' financial value. Originality/value This study is one of the few studies to forecast market performance in the green-lighting process.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f891a793db7bdd57e83892ae1d04a08",
  "timestamp": "2025-05-15T02:03:39.715947"
}