{
  "id": 4681,
  "title": "FTX fiasco and global equity markets: evidence from event study approach",
  "abstract": "PurposeThis study aims to investigate the impact of FTX bankruptcy on the global stock markets, including both the developed and emerging markets, as per the Morgan Stanley Capital Investment (MSCI) country classification. Design/methodology/approachUsing the daily closing prices for leading stock market indices of all 47 countries in the MSCI market classification, comprising 23 developed markets and 24 emerging markets, the event study methodology is used to examine the impact of the event on developed markets, emerging markets and overall global equity markets. FindingsThe study finds heterogeneous effects of the event on different countries. Results indicate that overall global equity markets experienced a statistically significant positive cumulative average abnormal returns of 15.8533% in the complete event window of 28 days from t - 7 to t + 20. The authors conclude that traditional global equity markets can be used as a hedge against potential financial risk posed by unfavorable events in the cryptocurrency markets and have safe haven properties. Practical implicationsThe study emphasizes the global financial system's interconnectedness and the potential of traditional equity markets to hedge risks in the cryptocurrency market. The findings are relevant for investors seeking portfolio diversification and mitigating their exposure to potential risks in the cryptocurrency market. Originality/valueTo the best of the authors' knowledge, the present study is the earliest attempt to comprehensively examine the impact of the bankruptcy of the world's fourth largest cryptocurrency exchange, FTX, on the global equity markets.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f94a116d97e2e979a187afcc0b46ff4",
  "timestamp": "2025-05-15T02:39:57.484596"
}