{
  "id": 7399,
  "title": "Does disease outbreak news impact equity, commodity and foreign exchange market? Investors' fear of the pandemic COVID-19",
  "abstract": "Purpose Market volatility is subject to good or bad news and even responses to fake news and policy changes. In this piece of work, the authors consider the effects of the recent COVID-19 pandemic event on the global equity market, commodities and FX market, measured in terms of the investors' fear index. Design/methodology/approach In this empirical work, the authors employ time series-based regression models followed by augmented dummy regressions and growth of the COVID-19. Findings COVID-19-induced investors' fear appears to be higher in the equity segment for the first time since the market crash of 1987 and the global financial crisis of 2008-2009. Furthermore, this disease outbreak shock has been more pronounced in terms of crude oil prices. Besides, a market participant in the commodity and FX market has paid a disproportionate premium to protect such pandemic development. Findings show that Options act as the best hedge against an uncertainty like COVID-19 and that option-based implied volatility is the best measure of investors' fear and market volatility. Practical implications This study has practical implications for the financial markets, e.g. (1) Contagious disease outbreak news matters for the equity, commodity, and foreign exchange markets - empirical outcome validates the theory of market efficiency valid for the Options. (2) Option's implied volatility is the best indicator of investor fear measured for the unprecedented economic news. Further implication holds for the policymakers and society, e.g. (1) The unavailability of short-selling could be one plausible reason for increased uncertainty and volatility; hence, policymakers should look upon this issue at the exchange level. (2) Any market needs multiple lines of risk management, effective price discovery and attractive liquidity. Originality/value The study is novel in terms of presenting market behavior amid COVID-19 across global equity markets and commodities and FX markets.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f96f5e71a986e7ffacc31e8205d924f",
  "timestamp": "2025-05-15T03:08:00.863386"
}