{
  "id": 8279,
  "title": "Exploration of preterm birth rates associated with different models of antenatal midwifery care in Scotland: Unmatched retrospective cohort analysis",
  "abstract": "Objectives: preterm birth represents a significant personal, clinical, organisational and financial burden. Strategies to reduce the preterm birth rate have had limited success. Limited evidence indicates that certain antenatal care models may offer some protection, although the causal mechanism is not understood. We sought to compare preterm birth rates for mixed-risk pregnant women accessing antenatal care organised at a freestanding midwifery unit (EMU) and mixed-risk pregnant women attending an obstetric unit (OU) with related community-based antenatal care. Methods: unmatched retrospective 4-year Scottish cohort analysis (2008-2011) of mixed-risk pregnant women accessing (i) EMU antenatal care (n=1107); (ii) combined community-based and OU antenatal care (n=7567). Data were accessed via the Information and Statistics Division of the NHS in Scotland. Aggregates analysis and binary logistic regression were used to compare the cohorts' rates of preterm birth; and of spontaneous labour onset, use of pharmacological analgesia, unassisted vertex birth, and low birth weight. Odds ratios were adjusted for age, parity, deprivation score and smoking status in preg nancy. Findings: after adjustment the mixed risk' FMU cohort had a statistically significantly reduced risk of preterm birth (5.1% [n=57] versus 7.7% [n=583]; AOR 0.73 [95% CI 0.55-0.981; p=0.034). Differences in these secondary outcome measures were also statistically significant: spontaneous labour onset (FMU 83.9% versus OU 74.6%; AOR 1.74 195% CI 1.46-2.081; p < 0.001); minimal intrapartum analgesia (FMU 53.7% versus OU 34.4%; AOR 2.17 195% CI 1.90-2.491; p < 0.001); spontaneous vertex delivery (FMU 71.9% versus OU 63.5%; AOR 1.46 195% CI 1.32-1.781; p < 0.001). Incidence of low birth weight was not statistically significant after adjustment for other variables. There was no significant difference in the rate of perinatal or neonatal death. Conclusions: given this study's methodological limitations, we can only claim associations between the care model and or chosen outcomes. Although both cohorts were mixed risk, differences in risk levels could have contributed to these findings. Nevertheless, the significant difference in preform birth rates in this study resonates with other research, including the recent Cochrane review of midwife-led continuity models. Because of the multiplicity of risk factors for preform birth we need to explore the salient features of the FMU model which may be contributing to this apparent protective effect. Because a randomised controlled trial would necessarily restrict choice to pregnant women, we feel that this option is problematic in exploring this further. We therefore plan to conduct a prospective matched cohort analysis together with a survey of unit practices and experiences. (C) 2015 Elsevier Ltd. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7f9f77e785d99e652bb7214d49b71fde",
  "timestamp": "2025-05-15T03:17:21.514797"
}