{
  "id": 4316,
  "title": "MODELING OF THE INFLUENCE OF CLIENT CAPITAL FACTORS ON INCOME OF BANKING INSTITUTIONS",
  "abstract": "The article defines the essence of client capital, its specifics and significance for the economic activity of banking institutions. Features of the client's capital which characterize it as a rather steady system of the elements allowing to form reliable, long-term and mutually beneficial relations of bank establishment with clients are considered. The structural components of the client capital of banking institutions are identified, which include: brand; business reputation; the presence of insiders in partner institutions; availability of large corporate clients; availability of a stable deposit resource base; a developed network of channels for the sale of banking products and services and more. The main factors of client capital influencing the formation of total income of banks are determined, for which correlation analysis is used. A quantitative assessment of the relationship between the effectiveness of banking and components of client capital is conducted including: the number of active payment cards; the number of operating ATMs and payment terminals of banks; amounts of attracted deposits and loans provided to bank customers. A regression model of dependence of banks' income on the most significant factors, which are the number of payment cards of a banking institution; the amount of deposits and the size of the bank's client loan portfolio is built. On the basis of the constructed model, the coefficients of elasticity are calculated to establish the factors, the impact of which will increase the efficiency of banking institutions. Based on the constructed model the directions of increase of efficiency of use of the client capital of banking institutions are offered. To widely implement digital banking, it is necessary to: improve the payment security system for both buyers and sellers of banking products and services; improve the legal regulation of digital banking; creation of conditions for mass implementation of the digital signature system; development and implementation of new non-traditional banking services, more adapted to the electronic way of providing services. To improve the customer policy of banks it is necessary to: expand the range of deposit accounts of legal entities and individuals for a period on-demand; develop new types of deposits and their diversification for all categories of depositors and improve the quality of their services; stimulate the attraction of deposit resources through greater interest rate differentiation; use an individual approach to clients; introduce effective measures to attract deposits mainly for time deposits.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7fa73f91a4f18206171eb68f1ef7ede7",
  "timestamp": "2025-05-15T01:25:50.535366"
}