{
  "id": 306,
  "title": "Model Uncertainty and Pricing Performance in Option Valuation",
  "abstract": "The objective of this article is to evaluate the performance of the option pricing model at the cross-sectional level. For that purpose, the authors propose a statistical framework, in which they in particular account for the uncertainty associated with the reported pricing performance. Instead of a single figure, the authors determine an entire probability distribution function for the loss function that is used to measure the performance of the option pricing model. This method enables them to visualize the effect of parameter uncertainty on the reported pricing performance. Using a data-driven approach, the authors confirm previous evidence that standard volatility models with clustering and leverage effects are sufficient for the option pricing purpose. In addition, they demonstrate that there is short-term persistence but long-term heterogeneity in cross-sectional option pricing information. This finding has two important implications. First, it justifies the practitioner's routine to refrain from time series approaches and instead estimate option pricing models on a cross section by cross section basis. Second, the long-term heterogeneity in option prices pinpoints the importance of measuring, comparing, and testing the option pricing model for each cross section separately. To the authors' knowledge no statistical testing framework has previously been applied to a single cross section of option prices. They propose a method that addresses that need. The proposed framework can be applied to a broad set of models and data. In the empirical part of the article, they show by means of example, an application that uses a discrete time volatility model on S&P 500 index options.",
  "year": 2019,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7fa9a10ec9e417d3e5ed7af09cb61a10",
  "timestamp": "2025-05-15T01:30:46.277202"
}