{
  "id": 2989,
  "title": "Cyber Threats Classifications and Countermeasures in Banking and Financial Sector",
  "abstract": "The banking and financial sector has always been a prime target for cyber threats due to the critical nature of the information they handle. With the increasing dependence on technology and digital transformation, the sector is facing more complex and sophisticated threats from cybercriminals. The banking sector serves as the backbone of a country's economy, interlinked with various other sectors like petroleum, mining, health, and industry. Any significant damage to the banking sector can send shockwaves through the entire economic landscape. Therefore, cyber threat classifications play a crucial role in risk management and provide a valuable framework for understanding and responding to cyber threats. Understanding the potential impact of a cyber-attack helps organisations assess the risks they face and develop appropriate risk mitigation strategies. The purpose of this research paper is to provide a comprehensive analysis of cyber threats in the banking and financial sectors, including identifying common threats, their nature and character to help in classification. One of the significant contributions of this research paper is to classify cyber threats to the banking and financial sectors based on their severity and technicality. This classification helps to identify the appropriate countermeasures required to mitigate the risks of each type of threat. Furthermore, the paper explores the technical, non-technical, organizational countermeasures and the legal and regulatory measures used to protect financial transactions from cyber threats. This research work delves into the challenges and limitations of cyber threat classifications, focusing specifically on those confronting the banking and financial sector in their pursuit of robust cybersecurity. Additionally, it analyses recent trends and developments in the field, highlighting the evolving nature of cyber threats to banking. The most significant challenge is the rapidly evolving nature of cyber threats, making it challenging to keep up with the latest trends and technologies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7fb0b23f2fb8c9b162558660830a9787",
  "timestamp": "2025-05-15T02:21:19.269201"
}