{
  "id": 7472,
  "title": "Development and evaluation of a simple predictive model for falls in acute care setting",
  "abstract": "Aims and ObjectivesTo develop a simple and reliable assessment tool for predicting falls in acute care settings. BackgroundFalling injures patients, lengthens hospital stay and leads to the wastage of financial and medical resources. Although there are many potential predictors for falls, a simple and reliable assessment tool is practically necessary in acute care settings. DesignA retrospective cohort study. MethodsThe current study was conducted for participants who were admitted to a teaching hospital in Japan. Fall risk was assessed by the modified Japanese Nursing Association Fall Risk Assessment Tool consisting of 50 variables. To create a more convenient model, variables were first limited to 26 variables and then selected by stepwise logistic regression analysis. Models were derived and validated by dividing the whole dataset into a 7:3 ratio. Sensitivity, specificity, and area under the curve for the receiver-operating characteristic curve were evaluated. This study was conducted according to the STROBE guideline. ResultsSix variables including age > 65 years, impaired extremities, muscle weakness, requiring mobility assistance, unstable gait and psychotropics were chosen in a stepwise selection. A model using these six variables with a cut-off point of 2 with one point for each item, was developed. Sensitivity and specificity >70% and area under the curve >.78 were observed in the validation dataset. ConclusionsWe developed a simple and reliable six-item model to predict patients at high risk of falling in acute care settings. Relevance to Clinical PracticeThe model has also been verified to perform well with non-random partitioning by time and future research is expected to make it useful in acute care settings and clinical practice. Patient or Public ContributionPatients participated in the study on an opt-out basis, contributing to the development of a simple predictive model for fall prevention during hospitalisation that can be shared with medical staff and patients in the future.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7fc00542033c23dce854c9fe207415bf",
  "timestamp": "2025-05-15T03:09:07.237662"
}