{
  "id": 9081,
  "title": "Relationship between Precarious Employment and Unmet Dental Care Needs among Korean Workers: A Longitudinal Panel Study",
  "abstract": "Background and Objectives: Precarious workers experience certain conditions, such as low income, instability in employment, and lack of social security. Precarious employment has increased barriers to the use of dental care services, resulting in more unmet dental care needs. The aim of this study was to identify unmet dental care needs among precarious workers in Korea's labor market, using data from the Korea Health Panel Survey (2011-2017). Materials and Methods: Based on job and income security criteria, four groups were formed: Group A (individuals with job and income security), Group B (individuals reporting job security with income insecurity), Group C (individuals reporting job insecurity with income security), and Group D (individuals with job and income insecurity). We measured self-reported unmet dental need or the inability to receive necessary dental care owing to the past economic burdens. Panel logistic regression analyses were performed to determine the effect of precarious employment on unmet dental care needs for all participants. Results: Approximately 16% of the respondents reported having unmet dental care needs. Unmet dental care needs owing to economic reasons were higher among male workers in groups C and D than among male workers in Group A. In particular, male workers aged 50 years and above in Group B were 3.36 times more likely to have unmet dental care needs than those in Group A. In Group D, female workers showed a high probability of having dental care needs owing to economic reasons. Moreover, female workers aged 18-49 years witnessed an increase in unmet dental care needs. Conclusions: Korean workers with unstable employment and/or income are at a higher risk of having unmet dental care needs owing to financial factors. The findings suggest an urgent need to implement robust national health insurance policies to improve efforts aimed at reducing unmet dental care needs that potentially decreases the disparity in oral health among precariously employed workers. Furthermore, it is necessary to implement comprehensive labor market policies such as sickness benefits for those in precarious employment.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7fc5ca792b9d0a103b322dc266b9981d",
  "timestamp": "2025-05-15T03:25:27.695055"
}