{
  "id": 3383,
  "title": "Do audit efforts increase the future equity value of client firm?",
  "abstract": "Purpose - The purpose of this study is to examine the association between additional audit efforts and clients' future equity value. The study hypothesizes that auditors' additional audit efforts directly increase clients' stock return performance. Additionally, this study expects that the additional audit effort lowers the likelihood of audit failure and improves accounting information quality, thereby indirectly increasing clients' future equity return performance. Design/methodology/approach - The regression and portfolio return tests are conducted using observations from 2003 to 2016. This study uses the abnormal audit hours as a proxy for additional audit effort using mandatorily disclosed audit hour data from Korean listed firms. The study also conducts mediation analyses to examine the causal intermediate steps that link audit effort to client equity return performance. Findings - The paper documents a significant and positive association between abnormal audit hours and clients' subsequent years' stock return performance and Tobin's Q. This finding is accentuated for clients audited by Big N auditors or with greater demand for superior audit service. This finding is robust after controlling for various proxies of accounting quality. The portfolio return tests also find evidence that investors cannot fully perceive the value of audit efforts. A battery of additional tests does not alter the main findings. Practical implications - The results provide implications for investors and policymakers by emphasizing the importance of audit efforts in value-creation. Moreover, this study's findings suggest that auditors' assurance, insurance and information roles are all the important drivers of this value-creation. Originality/value - This study highlights a prominent feature of audit effort that enhances the value of auditees.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ff42fb024a45c90ab51b8e6d0d57cad",
  "timestamp": "2025-05-15T01:16:22.222726"
}