{
  "id": 1586,
  "title": "Management of financial risks in Slovak enterprises using regression analysis",
  "abstract": "Research background: Financial risk management is the task of monitoring financial risks and managing their impact. Financial risk is often perceived as the risk that a company may default on its debt payments. The issue of the debt, default or prosperity of the company are presented in the article as one of the ways of the risk management. A prediction of corporate default is an inseparable element of the risk management. Mainly the consequences of risk are the engine of research and development of methods and models, which enable to predict economic and financial situation in specific conditions of global economies. Purpose of the article: The main aim of the presented article is to assess financial risks of Slovak entities, realized by the identification of significant factors and determinants affecting the prosperity of Slovak companies. Methods: To conduct the research we have used the data of Slovak enterprises, obtained from annual financial reports covering the year 2015 and the calculated financial ratios of profitability, activity, liquidity and indebtedness that may affect the financial health of the company were applied in the regression analysis. Realizing the multiple regression analysis, the statistically significant determinants that affect the future financial development of the company are identified. as well its the regression model of the bankruptcy prediction. Findings & Value added: In the research aimed at the management of financial risks in Slovak enterprises, IA e focused on the revelation of significant economic risk factors using multiple regression. I he results suggest that the most significant predictors are net return on capital, cash ratio, quick ratio, current ratio, net working capital, RE/TA ratio, current debt ratio, financial debt ratio and current assets turnover based on which the decision about the future company default can be made. These factors are significant enough to manage financial risks and to affect the profitability and prosperity of the company.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "7ffda6290fbf0dff29e333ec56527886",
  "timestamp": "2025-05-15T02:05:08.161207"
}