{
  "id": 6197,
  "title": "Cognitive function and cognitive decline among older rural Chinese adults: the roles of social support, pension benefits, and medical insurance",
  "abstract": "Objectives This study investigated whether social support, pension benefits, and medical insurance coverage are related to cognitive function and decline among older rural Chinese adults and whether depressive symptoms represented a pathway linking these factors with cognitive function. Methods Data are taken from three waves of the China Health and Retirement Longitudinal Study (N = 5,135). Cognitive function is assessed with episodic memory and depressive symptoms are assessed with the 10-item CESD Scale. Social support (intergenerational financial transfers, weekly contact with children, perceived availability of future support, and living arrangements), pension benefits, and medical insurance coverage are self-reported measures. Multilevel linear regression models are employed. Results Intergenerational financial transfers, perceived availability of future support, and pension income are associated with higher levels of cognitive function. Living with others, perceived availability of future support, medical insurance coverage, and pension income are associated with a slower risk of cognitive decline. Depressive symptoms mediated the association between perceived availability of future support, living with others, pension income and level of cognitive function and the link between perceived availability of future support, pension income, and cognitive decline. Conclusion The findings suggested these modifiable factors should be taken into account when screening older adults for possible cognitive impairment and decline. Early interventions may also be helpful by expanding social resources and reducing psychological distress.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8002f047cddf0e45ccdfb4552488f47a",
  "timestamp": "2025-05-15T02:55:44.605365"
}