{
  "id": 385,
  "title": "Advancing credit risk modelling with Machine Learning: A comprehensive review of the state-of-the-art",
  "abstract": "Ensuring financial stability necessitates responsible credit granting, so lending institutions maintain sufficient regulatory capital to withstand losses from defaults. Classification methods like Logistic Regression (LR) have long been the standard for estimating default likelihood, but they struggle with increasing operational demands and regulatory standards. Advances in Machine Learning (ML) now allow models to handle larger datasets with greater predictive power. Algorithms such as Decision Trees (DT), Support Vector Machines (SVM), and Neural Networks (NN), though not readily transferable to practical applications, have the potential to enhance the credit risk modelling process. While much of the literature on ML in credit risk focuses on sophisticated, experimental algorithms not yet ready for commercial use, few address the steps and nuances of model development. Our article fills this gap by systematically reviewing the literature on ML in consumer credit risk modelling, highlighting the current state of scientific knowledge. We analyze the frequent steps involved and demonstrate how ML's strengths can be leveraged throughout them. From pre-processing steps like data cleaning, transformation, and reduction, to variable selection and parameter optimization, our findings indicate that ML is becoming increasingly important in financial risk management. However, standardized modelling procedures are needed before complex ML classifiers can be commercially deployed. Meanwhile, although relatively interpretable ML models built around DTs and Random Forests (RF) do showcase increased performance in popular credit risk datasets, it is clear that the potential to benefit from ML spans further, with complex models enabling increased performance by aiding simpler, explainable classification algorithms.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8003f4683c6da7ab975eedeca755e0a3",
  "timestamp": "2025-05-15T01:50:14.055839"
}