{
  "id": 4469,
  "title": "Stress Exposure and Cardiovascular Disease Risk among US Black Women: Ethnicity and Nativity Intersections",
  "abstract": "Most health disparities and population health scholarship homogenizes Black women, masking within-group distinctions in their lived experience and health. Moreover, the stress literature tends to focus on the health consequences of one stressor (e.g., financial strain) or a single domain from which stressors emanate (e.g., family relationships). Filling these literature gaps, this study integrates stress theory and the intersectionality framework to investigate ethnicity and nativity status heterogeneity in cardiovascular disease risk factors (i.e., hypertension and obesity) and stress profiles of US Black women while also testing for interrelationships among social status, stress exposure, and health. Drawing from the National Survey of American Life (N = 2872), the analysis proceeded with binary logistic regression models to ascertain the associations among ethnic-nativity status, stress, and cardiovascular disease risk. Study results revealed higher rates of obesity for US-born Afro-Caribbean women, followed by US-born African American and foreign-born Afro-Caribbean women. US-born African American women, however, were at greatest risk for hypertension. Differential exposure to stressors inclusive of everyday discrimination, stressful life events, financial strain, and negative interactions with family members did not explain ethnic-nativity differences in hypertension and obesity. Nonetheless, the association between specific stressors and health differed by ethnic-nativity status. Theoretical and practical implications are discussed.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80038115615b0ee83809976215053cba",
  "timestamp": "2025-05-15T02:37:47.481443"
}