{
  "id": 4225,
  "title": "Land use systems and livelihoods in demographically heterogeneous frontier stages in the amazon",
  "abstract": "We investigate how Amazonian smallholders? land use systems coevolve with household-level demographic factors associated with changing livelihood strategies over the different stages of frontier development. Few micro-level studies have investigated this association, particularly due to the paucity of longitudinal data on cohorts of farm colonist households and plots. Cohort analysis is the only way to depict how the structural conditions affecting individual and household livelihood decisions differ from earlier to later stages of frontier development. Our methodological approach involves a unique dataset, based on a micro-level panel of farm households depicting 25 years of settlement in the municipality of Machadinho, in the Brazilian Amazon. We use descriptive statistics with paired t-tests, land use classification analysis, latent transition analysis, and longitudinal multinomial regressions to understand which cohorts of households thrived or failed and, most importantly, why and when. Splitting the data into panels of settlement cohorts helped us understand the effect of demographic life cycle markers on land use choices over the different stages of frontier development and the ability of farm households to adapt their livelihoods at the frontier over time. We found that, as the colonization frontier integrated into markets, the most successful original settlers were those who diversified their portfolio of capitals and livelihood strategies as a response to new local and regional market conditions. We also found a progressive change from land use systems based on subsistence agriculture to diversified land use systems that combine on-and off-farm activities. Livelihood diversification is key to preventing households from becoming trapped in a long-term deprivation trajectory, particularly when the frontier becomes more urban and market-oriented. This explains why land use has become progressively independent of household demographic dynamics in advanced stages. We contend that, as frontiers integrate into markets, diversification should not only be incentivized, but should also be used as a technical strategy to enhance access to subsidized rural credit, as it seems to increase farmers? likelihood to thrive and improve their resilience against shocks.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80259747ca6d21d4c11530e6045b8072",
  "timestamp": "2025-05-15T01:24:51.505746"
}