{
  "id": 3211,
  "title": "An exploration of financial toxicity among low-income patients with cancer in Central Texas: A mixed methods analysis",
  "abstract": "Objective Financial toxicity is of increasing concern in the United States. The Comprehensive Score for Financial Toxicity (COST) is a validated measure; however, it has not been widely utilized among low-income patients and may not fully capture financial toxicity in this population. Furthermore, the relationships between financial toxicity, quality of life (QOL), and patient well-being are poorly understood. We describe the experience of financial toxicity among low-income adults receiving cancer care. We hypothesized that higher financial toxicity would be associated with less income and lower quality of life. Qualitative interviews focused on the financial impact of cancer treatment. Method This study was conducted at a cancer clinic in Central Texas. Quantitative and qualitative data were collected in Fall and Spring 2018, respectively. The quantitative sample (N = 115) was dichotomized by annual income (<$15,000 vs. >$15,000). Outcomes included financial toxicity (COST), quality of life (FACT-G), and patient well-being (PROMIS measures: Anxiety, Depression, Fatigue, Pain Interference, and Physical Function). Associations between quality of life, patient well-being, and financial toxicity were evaluated using linear regression. Sequential qualitative interviews were conducted with a subsample of 12 participants. Results Patients with $15k across multiple measures. A multivariate linear regression found QOL (Beta = 0.17, 95% CI = 0.05, 0.29, p = 0.008) and insurance status (Beta = -3.79, 95% CI = -7.42, -0.16, p = 0.04), but not income, were significantly associated with financial toxicity. Three qualitative themes regarding patient's access to cancer care were identified: obtaining healthcare coverage, maintaining financial stability, and receiving social support. Significance of results Low-income patients with cancer face unique access barriers and are at risk for forgoing treatment or increased symptom burdens. Comprehensive assessment and financial navigation may improve access to care, symptom management, and reduce strain on social support systems.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "802fdfb79b0f3ea655463c2a6a933aba",
  "timestamp": "2025-05-15T02:23:33.629807"
}