{
  "id": 8318,
  "title": "The determinants of exchange rates and the movements of EUR/RON exchange rate via non-linear stochastic processes",
  "abstract": "Modeling exchange rate volatility became an important topic for research debate starting with 1973, when many countries switched to floating exchange rate system. In this paper, we focus on the EUR/RON exchange rate both as an economic measure and present the implied economic links, and also as a financial investment and analyze its movements and fluctuations through two volatility stochastic processes: the Standard Generalized Autoregressive Conditionally Heteroscedastic Model (GARCH) and the Exponential Generalized Autoregressive Conditionally Heteroscedastic Model (EGARCH). The objective of the conditional variance processes is to capture dependency in the return series of the EUR/RON exchange rate. On this account, analyzing exchange rates could be seen as the input for economic decisions regarding Romanian macroeconomics - the exchange rates being influenced by many factors such as: interest rates, inflation, trading relationships with other countries (imports and exports), or investments - portfolio optimization, risk management, asset pricing. Therefore, we talk about political stability and economic performance of a country that represents a link between the two types of inputs mentioned above and influences both the macroeconomics and the investments. Based on time-varying volatility, we examine implied volatility of daily returns of EUR/RON exchange rate using the standard GARCH model and the asymmetric EGARCH model, whose parameters are estimated through the maximum likelihood method and the error terms follow two distributions (Normal and Student's t). The empirical results show EGARCH(2,1) with Asymmetric order 2 and Student's t error terms distribution performs better than all the estimated standard GARCH models (GARCH(1,1), GARCH(1,2), GARCH(2,1) and GARCH(2,2)). This conclusion is supported by the major advantage of the EGARCH model compared to the GARCH model which consists in allowing good and bad news having different impact on the volatility. The EGARCH model is able to model volatility clustering, persistence, as well as the leverage effect.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "803dcb501c7751adf010326425d987ae",
  "timestamp": "2025-05-15T03:17:49.068490"
}