{
  "id": 1983,
  "title": "Modelling 30-day hospital readmission after discharge for COPD patients based on electronic health records",
  "abstract": "Chronic Obstructive Pulmonary Disease (COPD) is the third most common chronic disease in China with frequent exacerbations, resulting in increased hospitalization and readmission rate. COPD readmission within 30 days after discharge is an important indicator of care transitions, patient's quality of life and disease management. Identifying risk factors and improving 30-day readmission prediction help inform appropriate interventions, reducing readmissions and financial burden. This study aimed to develop a 30-day readmission prediction model using decision tree by learning from the data extracted from the electronic health record of COPD patients in Macao. Health records data of COPD inpatients from Kiang Wu Hospital, Macao, from January 1, 2018, to December 31, 2019 were reviewed and analyzed. A total of 782 hospitalizations for AECOPD were enrolled, where the 30-day readmission rate was 26.5% (207). A balanced dataset was randomly generated, where male accounted for 69.1% and mean age was 80.73 years old. Age, length of stay, history of tobacco smoking, hemoglobin, systemic steroids use, antibiotics use and number of hospital admission due to COPD in last 12 months were found to be significant risk factors for 30-day readmission of CODP patients (P < 0.01). A data-driven decision tree-based modelling approach with Bayesian hyperparameter optimization was developed. The mean precision-recall and AUC value for the classifier were 73.85, 73.7 and 0.7506, showing a satisfying prediction performance. The number of hospital admission due to AECOPD in last 12 months, smoke status and patients' age were the top factors for 30-day readmission in Macao population.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8042bc3c037097d83d0cf1a96cae4f0d",
  "timestamp": "2025-05-15T02:09:48.346097"
}