{
  "id": 5739,
  "title": "Insights into parents' perceived worry before and during the COVID-19 pandemic in Australia: inequality and heterogeneity of influences",
  "abstract": "Background Excessive worry is an invisible disruptive force that has adverse health outcomes and may advance to other forms of disorder, such as anxiety or depression. Addressing worry and its influences is challenging yet crucial for informing public health policy.MethodsWe examined parents' worries, influences, and variability before and during COVID-19 pandemic and across geography. Parents (n = 340) and their primary school-aged children from five Australian states completed an anonymous online survey in mid-2020. After literature review, we conceptualised the influences and performed a series of regression analyses.Results Worry levels and the variables contributing to parents' worry varied before to during the pandemic. The proportion of parents who were very worried all the time increased by 14.6% in the early days of the pandemic. During the pandemic, ethnic background modified parents' worry and parents' history of daily distress symptoms was a significant contributor (p < 0.05). Excessive exposure to news remained significant both before and during the pandemic. The primary predictor of parents' worry before COVID-19 was perceived neighbourhood safety, while the main predictor during COVID-19 was financial risk due to income change. Some variable such as neighbourhood safety and financial risk varied in their contribution to worry across geographical regions. The proportion of worried children was higher among distraught parents.Conclusion Parents' worry during the health pandemic was not triggered by the health risks factors but by the financial risk due to income change. The study depicts inequality in the impact of COVID-19 by ethnic background. Different policies and reported virus case numbers across states may have modified the behaviour of variables contributing to the geography of parents' worry. Exposure to stressors before the COVID-19 pandemic may have helped parents develop coping strategies during stressful events. Parents are encouraged to limit their exposure to stressful news. We advocate for parents-specific tailored policies and emphasise the need for access to appropriate mental health resources for those in need. Advancing research in geographical modelling for mental health may aid in devising much-needed location-targeted interventions and prioritising resources in future events.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "804b6843a02ffd729da017661e3613c6",
  "timestamp": "2025-05-15T02:50:53.914289"
}