{
  "id": 516,
  "title": "Forecast of Line Ice-coating Degree Using Circumfluence Index & Support Vector Machine Method",
  "abstract": "Forecast of line ice-coating plays an important role for reducing the damage of power grid from ice rain efficiently. Aiming at the climate feature and forecast purpose in Hunan area, forecasts for ice-coating number of days and ice-coating thickness are transformed into forecasts for ice-coating degree. According to the calculated ice-coating degree coefficient, ice-coating degree is indicated and divided. Because normal climate information and ice-coating forecast method are hard to satisfy the requirement of de-icing schedule and financial risk reducing, circumfluence indexes as atmosphere information and support vector machine (SVM) as forecast method are presented to forecast lines ice-coating degree. Through correlation analysis about 74 circumfluence indexes to ice-coating degree, correlation coefficient and associated correlation coefficient are calculated and listed. These 8 circumfluence indexes of higher coefficients are chosen as independent variables to be used to forecast the ice-coating degree in weeks or months. SVM models based on two kinds of kernel functions for forecasting ice-coating degree are built. Ice-coating samples and circumfluence indexes of 30 years are adopted in Hunan. The parameters of two kinds of SVM models are got through Particle Swarm optimization. The forecast results show that polynomial kernel function SVM model is more efficient and suitable than radial basis function to winter ice-coating forecast.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8067347f2b1acd94461104d9ee737603",
  "timestamp": "2025-05-15T01:52:12.186486"
}