{
  "id": 2067,
  "title": "Prediction and assessment of credit risk using an adaptive Binarized spiking marine predators' neural network in financial sector",
  "abstract": "The rapid advancement of technologies has pushed for additional enhancements to banking and other credit platforms. While assisting small and medium sized business in lowering financing costs, banks and credit platforms must take into account practical matters like, their own capital expenses and risk evaluation. Even though, there are several methods for credit risk assessment, no comprehensive literature reviews have provided sufficient accuracy and better results while implementing in banking sectors. To overcome these issues, this manuscript proposes credit risk assessment in the banking sector using an Adaptive Binarized Spiking Marine Predators Neural Network (ABSMPNN) for accurate identification of customer credit quality within a short period of time. The evaluation using the credit risk dataset from Kaggle leads to the decision to grant or reject the customer's loan application. The concentration phase of the Variable Color Harmony Algorithm (VCHA) effectively achieves the selection of the most relevant features from the noisy and irrelevant ones. The optimization of neural network parameters with Adaptive Marine Predators Algorithm (AMPA) has further improved the overall accuracy (98.9%) with minimization of loss function. The outcomes depict that the introduced model attains higher accuracy and lower computational period of credit risk evaluation when compared with state-of-the-art.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80684fc8cf007414d6e0da7da8f4f1df",
  "timestamp": "2025-05-15T02:10:58.940061"
}