{
  "id": 6777,
  "title": "Cost-Effectiveness of Annual Screening for Tuberculosis among Italian Healthcare Workers: A Retrospective Study",
  "abstract": "Background. In the past few years, healthcare workers (HCWs) have been considered at higher risk for tuberculosis (TB) infection than the general population. On the other hand, recent studies have reported a low conversion rate among these workers. Recently, the Center for Disease Control (CDC) updated its recommendations, suggesting that an annual screening should not be performed in the absence of a documented exposure but only in workers with high-risk duties or with job tasks in settings at high risk of tuberculosis contagion (e.g., departments of infectious or pulmonary diseases). In fact, some studies showed that annual tuberculosis screening for all the HCWs was not cost-effective in countries with a low incidence of TB. In this study, we evaluated the conversion rate and the cost-effectiveness of two different tuberculosis screening strategies in a large population of Italian HCWs. Methods. In our retrospective study, we reviewed data coming from a tuberculosis screening conducted on 1451 HCWs in a teaching hospital of Rome. All workers were evaluated annually by means of the Quantiferon test (QFT) for a five-year period. Then, the conversion rate was calculated. Results. We found a cumulative conversion rate of 0.6%. Considering the cost of the QFT test (48.26 euros per person), the screening of the HCWs resulted in a high financial burden (38,902.90 euros per seroconversion). Only one seroconversion would have been missed by applying the CDC updated recommendations, with a relevant drop of the costs: 6756.40 euros per seroconversion, with a global save of 296,075.10 euros. Conclusion: The risk of TB conversion among our study population was extremely low and it was related to the risk classification of the setting. Giving these results, the annual tuberculosis screening appeared to not be cost effective. We conclude that a targeted screening would be a better alternative in HCWs with a higher risk of TB exposure.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "807a259b40944cf0aeccc117ba86ac57",
  "timestamp": "2025-05-15T03:01:31.382831"
}