{
  "id": 255,
  "title": "Development of Demand Response Energy Management Optimization at Building and District Levels Using Genetic Algorithm and Artificial Neural Network Modelling Power Predictions",
  "abstract": "Demand Response (DR) is a fundamental aspect of the smart grid concept, as it refers to the necessary open and transparent market framework linking energy costs to the actual grid operations. DR allows consumers to directly or indirectly participate in the markets where energy is being exchanged. One of the main challenges for engaging in DR is associated with the initial assessment of the potential rewards and risks under a given pricing scheme. In this paper, a Genetic Algorithm (GA) optimisation model, using Artificial Neural Network (ANN) power predictions for day-ahead energy management at the building and district levels, is proposed. Individual building and building group analysis is conducted to evaluate ANN predictions and GA-generated solutions. ANN-based short term electric power forecasting is exploited in predicting day-ahead demand, and form a baseline scenario. GA optimisation is conducted to provide balanced load shifting and cost-of-energy solutions based on two alternate pricing schemes. Results demonstrate the effectiveness of this approach for assessing DR load shifting options based on a Time of Use pricing scheme. Through the analysis of the results, the practical benefits and limitations of the proposed approach are addressed.",
  "year": 2018,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80808b81bbe30ee82b449ae7ef4b7a22",
  "timestamp": "2025-05-15T01:30:19.007891"
}