{
  "id": 3348,
  "title": "Back So Soon? A Community Hospital Creates New Ways to Prevent Readmission",
  "abstract": "Purpose/Objectives: Readmission prevention is part of the hospital's strategic plan. Why? Reducing hospital readmissions decreases patient suffering. It also reduces the Centers for Medicare Et Medicaid Services financial penalty. But how do you do it? The hospital received a 2-year grant/investment from the Massachusetts Health Policy Commission to develop and implement creative, innovative ways of reducing readmissions. The goal was to reduce the 30-day readmission rate for two groups by 20%-adult high utilizers (4 or more admissions within a 12-month period) and adult discharges to post-acute care (PCA) services (skilled nursing facilities and home care agencies). Primary Practice Settings: The primary practice settings for the initiative were the hospital, skilled nursing facilities, a short-term rehabilitation hospital, and the patients' homes. The patients were initially selected according to risk criteria determined by the hospital and then followed in the post-acute venue via telephone call and/or visit. Findings/Conclusions: Enrollment consisted of 2,860 patients. The readmission rate for adult high utilizers fell from 40.1 % to 24.6 % (a 39% reduction). The PCA readmissions for both skilled nursing facilities and home health agencies fell from 12.9 % to 12.5 %-a small decrease. However, the overall PCA readmission rate for the CHART (Community Hospital Acceleration, Revitalization, and Transformation) program is significantly lower than the state's-the rate for home health agencies is 17.2% and for skilled nursing facilities is 20.0%-making the effort to reduce the readmission rate all the more challenging. The significant reduction in hospital readmissions is attributed to the work of the Readmission Prevention Team, which met daily to discuss patients. Team members shared perceptions on patient education, medication management, communication, and end-of-life care. The team developed innovative practices and protocols, which were then applied to the patients' care. Implications for Readmission Specialists Practice/Case Management: 1. Having the same case managers consistently work with assigned high utilizers led to better understanding the motivations of the patients and easing transitions of care. 2. Starting end-of-life discussions early and having them regularly helped patients and their families gradually move into acceptance of palliative care or hospice. 3. Using Motivational Interviewing techniques helped all focus on the patients' goals. 4. Using teach-back techniques ensured that the patients/families/caregivers truly understood the education. 5. Having a team approach allowed discussions that were broader and more creative.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80a6f1b3169ecba1b3df4c6e838004e1",
  "timestamp": "2025-05-15T02:25:13.753161"
}