{
  "id": 7077,
  "title": "Risk and uncertainty in portfolio characterisation",
  "abstract": "The definition and use of the terms risk and uncertainty vary widely in the oil and gas industry. Similarly, and partly as a consequence of this lack of consistency, the methods used for the evaluation of projects at the exploration, appraisal or development stages of maturity have also varied significantly. However, unless projects are evaluated in a consistent fashion, the application of portfolio analysis and optimisation techniques is impossible. Further, the use of such techniques in isolation may be inadequate to ensure that a portfolio aligns fully with an established corporate strategy. An essential stage in the process is therefore a consistent application of the terms risk and uncertainty. The SPE/WPC/AAPG resource classification system provides an ideal basis for this approach. An important conceptual step is to consider the portfolio as a collection of projects of different degrees of maturity rather than as individual prospects and fields, as has generally been the practice historically. Defined projects are the link between the petroleum accumulation and the decision-making process, including budget allocation. An individual project may, for example, constitute the drilling of an exploration well on a prospect, the development of a single reservoir or field, an incremental development for a producing field, or the integrated development of a group of fields. A project should be defined in terms of the basis on which a decision is made whether or not to proceed with that exploration or development activity (i.e. to make the commitment to spend money to implement that project). Each project can then be characterised in terms of (a) risk, the probability of the project achieving commercial production and hence revenue, and (b) uncertainty, being the range of estimated recoverable volumes and monetary values resulting from that financial commitment, should the project proceed. Project status categories, as defined within the context of the SPE/WPC/AAPG system and which reflect the level of maturity of each project, further enhance the classification of the portfolio and also help to ensure that recoverable volumes are categorised appropriately, particularly in making the distinction between reserves and contingent resources. By classifying and evaluating projects in this way, both the application of portfolio techniques and the decision-making process itself can be facilitated. (C) 2004 Elsevier B.V. All rights reserved.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80c227f010d82319e0ebfe9aa6be46a5",
  "timestamp": "2025-05-15T03:05:03.388986"
}