{
  "id": 1760,
  "title": "Market sentiment-aware deep reinforcement learning approach for stock portfolio allocation",
  "abstract": "The stock market currently remains one of the most difficult systems to model in finance. Hence, it is a challenge to solve stock portfolio allocation wherein an optimal investment strategy must be found for a curated collection of stocks that effectively maximizes return while minimizing the risk involved. Deep reinforcement learning approaches have shown promising results when used to automate portfolio allocation, by training an intelligent agent on historical stock prices. However, modern investors are actively engaging with digital platforms such as social media and online news websites to understand and better analyze portfolios. The overall attitude thus formed by investors toward a particular stock or financial market is known as market sentiment. Existing approaches do not incorporate market sentiment which has been empirically shown to influence investor decisions. In our paper, we propose a novel deep reinforcement learning approach to effectively train an intelligent automated trader, that not only uses the historical stock price data but also perceives market sentiment for a stock portfolio consisting of the Dow Jones companies. We demonstrate that our approach is more robust in comparison to existing baselines across standardized metrics such as the Sharpe ratio and annualized investment return. (C) 2021 Karabuk University. Publishing services by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80d53dacaaf5d83908e5961e304b2766",
  "timestamp": "2025-05-15T02:06:52.791267"
}