{
  "id": 8474,
  "title": "Rural Bypass for Elective Surgeries",
  "abstract": "Purpose: Rural bypass of Critical Access Hospitals (CAHs) for elective inpatient and outpatient surgical procedures has not been studied. Residents choosing to have their elective surgeries elsewhere, when the local CAH provides those surgical services, erode their rural hospital's financial base. The purpose of this research is to describe the elective surgical bypass rate, the procedures most commonly bypassed by rural residents, the distribution of volume among CAHs that offer elective surgical services, and factors predictive of bypass. Methods: A sample of elective surgery discharges was created from the 2011 Healthcare Cost and Utilization Project State Inpatient Databases and State Ambulatory Surgery Databases for Colorado, North Carolina, Vermont, and Wisconsin. Frequencies of procedures bypassed and CAH volume distribution were performed. Logistic regression was used to model factors associated with rural bypass for elective surgical care. Findings: The rural bypass rate for elective surgical procedures is 48.4%. Procedures bypassed most are operations on the musculoskeletal system, eye, and digestive system. Annual volume distribution for elective surgical procedures among CAHs varied widely. Patients who are younger, medically complex, at higher surgical risk, and have private insurance are at higher odds of bypass. Patients are also more likely to bypass low-volume hospitals. Conclusion: Rural hospitals should consider developing surgical services that are performed electively and on an outpatient basis that are attractive to a broader rural population. CAHs that already offer elective surgical procedures and yet who are still bypassed must examine the mutable factors that drive bypass behavior.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80e182628ce2caafa950ba2c8bc71537",
  "timestamp": "2025-05-15T03:19:21.279337"
}