{
  "id": 5935,
  "title": "KEY DETERMINANTS OF NONPERFORMING LOANS - EVIDENCE FROM SEE COUNTRIES",
  "abstract": "After the financial crisis, the focus in most banking systems have been the nonperforming loans (NPLs). The level of today's NPLs is connected to the period of the credit boom when loans were skyrocketing and the banks had lower criteria for credit risk rating and consequently approved loans to risky clients. High credit risk exposure from that period mirrored onto today's level of NPLs in certain banks. Many analytics find that asset quality is a statistically significant predictor of bank insolvency. The increase in NPLs in a bank can lead to bankruptcy and a loss in the efficiency of the banking sector. It is also one of the symptoms of a banking crisis. Despite the efforts of the banking sector and regulatory bodies, the level of NPLs in SEE countries has been high for a long period after the crisis with lately significant improvements. Managing NPLs is a banking sector problem, and managing those loans in less than an adequate way is dangerous for bank survival and it threatens to jeopardize the general stability of a financial system. Therefore, it is necessary to identify the factors influencing the emergence and the increase in NPLs. The author of this paper wants to point of the significance of the increase in NPLs after the financial crisis in SEE countries and the main goal of this research is to identify macroeconomic factors and bank-specific factors impacting NPLs of SEE countries. Although available literature on NPLs is quite extensive, this paper represents the first empirical research on the sample of SEE countries using aggregate data on the level of each observed country. The results lead to the conclusion that the macroeconomic factors are greater causers of NPL trends which is in contrary to bank-specific factors and that there is a proportional regression between NPLs by conduction analysis in affected countries and the rate of increase of GDP, and rate of inflation which can be seen from the statistically significant coefficients.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80e302f06e5518ff5e49ca7b54c6c263",
  "timestamp": "2025-05-15T02:53:03.077054"
}