{
  "id": 2850,
  "title": "Size Effect on the Ductile Fracture of the Aluminium Alloy 2024-T351",
  "abstract": "BackgroundReliably calibrated criteria are needed for an accurate prediction of fracture of various components. However, there is not always a sufficient amount of material available. Therefore, miniature testing provides an alternative that is researched together with the following calibration of the ductile fracture criteria and investigating the size effect.ObjectiveThe aim is to design miniature testing equipment and specimens for tensile testing, which covers various stress states. This is supplemented by the small punch test, which has the same specimen thickness, taken from the literature to broaden the portfolio for calibration. The second part deals with conducting the finite element analysis, which provided a basis for the calibration of the phenomenological ductile fracture criterion applicable to crack-free bodies to indicate the crack initiation.MethodsThe steel frame to test thin specimens is designed with optical measurement of deformations. The finite element method is used, within Abaqus and user subroutines, to simulate the tests to obtain the variables needed for the calibration. In addition, the calibration of the criterion using machine learning is explored.ResultsThe feasibility of the proposed experimental program is tested on the aluminium alloy 2024-T351. Moreover, the numerical simulations, which showed a good match with experiments in terms of force responses, adds to the knowledge of modelling in the scope of continuum damage mechanics.ConclusionsThe presented results provide a material basis for the aluminium alloy studied on a lower scale, while they broaden the testing possibilities and analyses the calibration strategies for the best failure predictability possible.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80ea4bf20981413b14bd78dac8580fd9",
  "timestamp": "2025-05-15T01:11:17.346125"
}