{
  "id": 1560,
  "title": "Examination of nursing home financial distress via Porter's five competitive forces framework",
  "abstract": "Background Nursing homes face increased risk of closure because of poor financial performance. Purpose Using resource dependency theory, Porter's Five Forces of Competition framework, and Altman's Z-score model, this study examines the relationship between market factors and nursing home financial distress. Methodology/Approach This study utilizes Medicare Cost Reports, LTCFocus, Certification and Survey Provider Enhanced Reporting, Online Survey Certification and Reporting, and the Area Health Resource File to examine an average of 10,454 nursing homes per year from 2000 to 2015. Using Porter's framework, market factors were conceptualized as the bargaining power of buyers and suppliers, threat of substitutes and new entrants, and industry rivalry. Organizational control variables include occupancy, payer mix, size, and chain affiliation. Data were analyzed using multinomial logistic regression with robust clustering, year, and state fixed effects. Results Distressed nursing homes (Relative Risk Ratios [RRR] = 0.991) were less likely to be in counties with higher Medicaid concentration. Distressed (RRR = 0.717) and at-risk-of-distress nursing homes (RRR = 0.807) were less likely to be in markets with home health agencies, and nursing homes at risk of distress (RRR = 1.005) were more likely to be in markets with a higher number of hospital-based skilled nursing facility beds compared to healthy organizations. The organizational-level variables, occupancy, payer mix, size, and chain affiliation had a significant impact on nursing home financial distress. Conclusions The effects of external market forces on nursing home financial distress were limited; however, organizational-level variables had a significant impact on nursing home financial distress. Practical Implications Study findings can inform policy makers on specific factors associated with nursing home financial distress and provide greater insight as it relates to designing new policies and interventions.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "80f8fe7091bbafbf9cf5b4a8cae3f2d8",
  "timestamp": "2025-05-15T02:04:20.145809"
}