{
  "id": 1020,
  "title": "Characterization of Interfacial Failure in Cemented Total Joint Replacements via Self-Sensing Bone Cement, Electrical Impedance Tomography, and Machine Learning",
  "abstract": "At an estimated cost of $8 billion annually in the United States, revision total joint replacement surgeries represent a substantial financial burden to the health care system. Fixation failures such as implant loosening and mechanical instability at the cement-to-bone interface are the main causes of long-term implant failure. Early and accurate diagnosis of cement-bone interface failure is critical to develop therapeutic strategies and reduce the risk of delayed revision surgery. Unfortunately, prevailing imaging modalities such as plain radiographs struggle to detect the precursors of implant failure and are often interpreted incorrectly. Our team has recently shown that modification of poly(methyl methacrylate) (PMMA) bone cement with low concentrations of conductive fillers makes it piezoresistive and therefore self-sensing. By electrical impedance tomography (EIT) it is possible to monitor load transfer across the PMMA using real-time electrical measurements, which are physiologically benign and would ultimately be cost-effective in a clinical setting. Herein, we demonstrate the use of machine learning with EIT in order to precisely characterize model failure events. In phantom tests, we introduce three defect types: loosening, vertical cracks, and horizontal cracks. We show that implant defect type can be classified with greater than 95% accuracy by combining principal component analysis (PCA) coupled with the k-nearest neighbor (KNN) algorithm and a two layer feed-forward neural network with three hidden neurons. These preliminary results show that the combination of smart materials, EIT, and machine learning may be a powerful tool for predicting and diagnosing failure in joint replacements.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8101eadee75b3b834ced2a9af164fc35",
  "timestamp": "2025-05-15T01:58:08.442704"
}