{
  "id": 377,
  "title": "Financial distress prediction: The case of French small and medium-sized firms",
  "abstract": "Financial distress prediction is a central issue in empirical finance that has drawn a lot of research interests in the literature. This paper aims to predict the financial distress of French small and medium firms using Logit model, Artificial Neural Networks, Support Vector Machine techniques, Partial Least Squares, and a hybrid model integrating Support Vector Machine with Partial Least Squares. Empirical results indicate that for one year prior to financial distress, Support Vector Machine is the best classifier with an overall accuracy of 88.57%. Meanwhile, in the case of two years prior to financial distress, the hybrid model outperforms Support Vector Machine, Logit model, Partial Least Squares, andArtificial Neural Networks with an overall accuracy of 94.28%. Distressed firms are found to be smaller, more leveraged and with lower repayment capacity. Moreover, they have lower liquidity, profitability, and solvency ratios. Besides the academic research contribution, our findings can be useful for managers, investors, and creditors. With respect to managers, our findings provide them with early warnings signals of performance deterioration in order to take corrective actions and reduce the financial distress risk. For investors, understanding the main factors leading to financial distress allows them to avoid investing in risky firms. Creditors should correctly evaluate the firm financial situation and be vigilant to signs of impending financial distress to avoid capital loss and costs related to counterpart risk. (C) 2017 Elsevier Inc. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8105580d4d296c0882b36d7b5487f33b",
  "timestamp": "2025-05-15T01:50:14.020455"
}