{
  "id": 6047,
  "title": "Impact of Noninterest Income on Bank Risk-Taking and Bank Lending Spread",
  "abstract": "This study investigates the impact of diversification between traditional margin income and nontraditional income (noninterest-based income) on bank risk-taking and bank lending spread for banks operating in Pakistan. Bank risk is measured with the nonperforming loan ratio and bank Z-score. Data of this study is obtained from financial statements, which are an annual publication of State Bank of Pakistan, for the period 2006-2016 for 52 banks in Pakistan. Panel regression with the generalized method of moments (GMM) estimator is employed. The study reveals that an increase in noninterest income increases bank risk-taking (spending on highly risky assets), as noninterest income is riskier than interest income. It is also revealed that banks with greater dependence on noninterest income may grant a loan with lower lending spread. These results have implications for the betterment of the banking system, regulatory authority, and stakeholders as well. From a regulatory perspective, the study provides guidelines for making rules and regulations to control and monitor the dependence on noninterest income as well as on interest income. Pakistan banks regulatory authority should focus on the increase in disclosure of the composition of noninterest income and this disclosure would increase understanding of changing environment of banking in Pakistan.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81065d9e97a0493f50d1f5abbbb932bf",
  "timestamp": "2025-05-15T02:54:03.486671"
}