{
  "id": 9066,
  "title": "Males Have Higher Rates of Peri-operative Mortality Following Surgery for Osteoporotic Vertebral Compression Fracture",
  "abstract": "In this study, we evaluated the association between sex and the incidence of postoperative mortality in the peri-operative period following surgical intervention for OVCF. We found no statistical association between surgical complications and patient sex. However, males exhibited higher rates of mortality and 30-day readmissions relative to females. Introduction Osteoporotic vertebral compression fractures (OVCF) contribute substantially to the financial burden of the US healthcare system. As the size of the elderly population grows, the number of fractures attributed to osteoporosis is expected to increase. Studies have shown that osteoporotic patients are at an increased risk for medical and surgical complications. The purpose of this study was to evaluate the association between sex and the incidence of postoperative mortality in the peri-operative period following surgical intervention for OVCF. Methods A retrospective analysis of the American College of Surgeons National Surgery Quality Improvement Project (ACS-NSQIP) database from 2007 to 2014 identified 1979 patients. Patients were grouped as male or female. Mortality within 30 days of surgery due to any cause, incidence of surgical complications, and 30-day readmission rates following surgery were tabulated. A multivariate logistic regression analysis was conducted to calculate odds ratios (OR) with correspondingpvalues and 95% confidence intervals. Results In total, 1979 patients met inclusion and exclusion criteria. Mortality within the 30 days following surgery for OVCF was statistically greater in men than in women (OR = 1.58;p= 0.050). The 30-day readmission rate was also statistically higher in men (OR = 1.41;p= 0.017). Neither minor (OR = 0.90;p= 0.560) nor major (OR = 1.14;p= 0.569) complications were statistically correlated with sex. On average, men underwent surgery for OVCF at a younger age than women. Conclusions Male patients undergoing surgery for OVCF have higher rates of peri-operative mortality and 30-day readmissions following surgery. Sex was not found to be associated with postoperative complications. Level of evidence: III",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "810ada2bccb66aa965a1da40b599b4dc",
  "timestamp": "2025-05-15T03:25:27.628737"
}