{
  "id": 7667,
  "title": "Investigating Critical Factors That Encourage Private Partners to Participate in Sports and Leisure Characteristic Town Public-Private Partnerships: Evidence from China",
  "abstract": "The Sports and Leisure Characteristic Town (SLCT) has become a reasonable strategy for enhancing the sustainability of new urbanization processes in rural China. Although the Chinese government has issued a series of policies to support the development of SLCTs, limited financial resources are a major obstacle. Thus, public-private partnerships (PPPs) have been increasingly encouraged for establishing SLCT projects. However, the factors that significantly influence private partners' willingness to participate in SLCT PPP projects remain unclear. The authors of this paper conducted expert interviews and questionnaire surveys concerning the SLCT PPP projects that have been implemented in China, identifying 23 factors that can be grouped into five major components using principal component factor analysis. Multiple linear regression was then performed to evaluate the relationships between factors and private partners' willingness to participate. The results indicated that the factors that critically influence private partners' willingness to participate include stakeholder factors, the internal factors of private partners, external environmental risk factors, the supporting measure factors of SLCTs, and the locational factors of SLCTs. This work also offers suggestions for encouraging private partners to participate in SLCT PPP projects. This study can provide a theoretical basis and practical guidance for government and private partners in order to help them implement sustainable SLCT PPP projects.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81251609c77461c821b9dbe0e1c0c087",
  "timestamp": "2025-05-15T03:11:04.496495"
}