{
  "id": 1779,
  "title": "Identifying the Role of Gold on Sustainable Investment in Indonesia: The DCC-GARCH Approach",
  "abstract": "This research investigated the performance of a dynamic portfolio that consists of sustainable/ethical stocks and gold. The main purpose of this study is to prove that the inclusion of gold in sustainable/ethical stocks portfolios could produce better performance. Therefore, the method used in this research, DCC-GARCH, was relaxing the basic assumptions in the theory of modern portfolio that is under the assumption of the normality of stock return and securities would have constant correlation. This research used data such as SRI-KEHATI Index (SKI) and Jakarta Islamic Index (JII) in Indonesia as a proxy for sustainable investments. Additionally, this research used gold from 2013 to 2019. This study is able to provide evidence regarding the ability of a dynamic portfolio to minimize the level of portfolio risk. However, this led a lower rate of return. Based on the OLS regression, gold is also proven as a weak safe haven for sustainable investment in Indonesia. Investors who believe in ethical investment may include gold in this time-varying approach when formulating the portfolio to reduce risk significantly. The inclusion of gold in portfolios could produce hedging effectiveness. Overall, this study supports some previous findings regarding the ability of gold as an instrument, which could reduce investment risk if involved in a portfolio.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8127ebbe95d2547c61ae91171ee057d3",
  "timestamp": "2025-05-15T00:59:23.044275"
}