{
  "id": 6724,
  "title": "Self-care management and risk factors for depressive symptoms among elderly outpatients in Taiwan",
  "abstract": "Background: Early detection and appropriate treatment interventions for depressive symptoms in the elderly are important issues for healthcare systems. However, few studies to date have focused on understanding self-care strategies to manage depressive symptoms among elderly people worldwide. The purpose of this study was to explore self-care management strategies and risk factors for depressive symptoms among elderly outpatients in Taiwan. Methods: A convenience sample of elderly persons (>= 65 years old; N = 1054) was recruited from outpatient clinics of two hospitals in northern Taiwan. Results: In our sample, the prevalence of depressive tendency was 16.3%. The majority of participants (70.1%) managed depressive symptoms with self-care strategies. The strategy most often used to relieve depressive symptoms was take a walk. The main information source for self-care strategies was self-learning. Depressive tendency in this sample was shown by logistic regression analysis to be significantly predicted by gender, marital status, perceived income adequacy, perceived health condition, stroke, and cancer. Conclusion: Elderly people need to be made more aware of strategies to self-manage depressive symptoms. Healthcare providers can decrease/prevent the first risk factor for depressive symptoms (poor perceived health status) by improving elders' perceived health and promoting their actual health. The second risk factor (poor perceived income adequacy) can be decreased/prevented by carefully assessing patients' financial situation during clinic visits and providing suitable referral for further assistance.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "812e1c5388ffa9020653babeb01fbaab",
  "timestamp": "2025-05-15T03:01:03.537646"
}