{
  "id": 1867,
  "title": "Understanding the Student Dropout in Distance Learning",
  "abstract": "This Research to Practice Full Paper introduces an approach for the early identification of students at risk of dropping out of their distance learning courses. Students dropout in university courses have long been a major issue leading to social, academic and financial impacts. Predictive modelling analysis has been used as a tool to identify at an early stage probable cases of dropout. In distance learning, this type of analysis is made possible mostly because of the increasing adoption rate of Virtual Learning Environments (VLEs) where data on the student academic activities can be continuously recorded. This paper discusses the design and validation of a Learning Analytics system fir early identification of students at risk of dropping out. The case study presented relies on data collected from two postgraduate courses as part of Brazils Open University. The methodology for the system design and validation comprises the steps to build an intelligent data pipeline. Jupyter Notebooks have been d used as the data science analysis environment in order to create data pipelines and have their performance evaluated. Results obtained from the validation of models built out of eight machine learning techniques show an average accuracy of 84% among the set of ML techniques tested. The highest accuracy is delivered by the Extra Trees classifier with 88%. Logistic Regression performed the worst performance with an accuracy of 79%.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8134d9094fdce860bb0194c1462a329f",
  "timestamp": "2025-05-15T02:08:38.925473"
}