{
  "id": 2817,
  "title": "Capital Adequacy Requirement, the Cost of Financial Intermediation and Risk Taking Behavior of the Indonesia Banking Sector",
  "abstract": "Basel I, II and III are strictly applied after the financial crisis in 1997 / 1998 and 2008 to ensure financial stability, among others by applying the minimum capital adequacy requirements that must be met by the bank in accordance with the risk profile. However, whether the impact of these requirements contributes positively to the Indonesian banking sector is still questionable, because some previous empirical studies have shown that strict capital requirements can force banks to increase their financial intermediation costs due to the rising capital cost. This study examines the relationship between minimum capital adequacy, the cost of financial intermediation and the risk-taking behavior of the Indonesia banking sector by using panel data from 45 commercial banks from 2012 to 2017. Using the Generalized Least Square (GLS) panel data regression, we find that the bank's capital ratio has a negative and significant relationship to the financial intermediation costs and risk-taking behavior of the Indonesia banking sector. We also find that the average return on equity of the Indonesia banking sector decreased during the observation period which shows that an increase in capital regulation position did not increase the cost of the banks' equity capital.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "813cbd584fe88eaa832d9886bd6f78c5",
  "timestamp": "2025-05-15T02:19:46.589716"
}