{
  "id": 4651,
  "title": "Role of respondents' education as a mediator and moderator in the association between childhood socio-economic status and later health and wellbeing",
  "abstract": "Background: Most research assessing the effect of childhood socioeconomic status (CSES) on health in adulthood has focused on cause-specific mortality. Low CSES is associated with mortality from coronary heart disease, lung cancer, and respiratory diseases in adulthood. But little evidence is available on the unique effect of different indicators of CSES on subjective measures of health and wellbeing in adulthood. Methods: Cross-sectional data from the last wave of The Tromso Study (n = 12,984) was used to assess the unique effect of three indicators of CSES (childhood financial conditions, mothers' education and fathers' education) on a range of subjective health measures: EQ-5D health dimensions, self-rated health, age-comparative self-rated health, as well as subjective wellbeing. Data was analyzed with the Paramed command in Stata. Log-linear regression was used for the subjective measures of health and wellbeing to estimate the natural direct effects (NDE's), natural indirect effects (NIE's), controlled direct effects (CDE's) and marginal total effects (MTE's) as risk ratios (RRs). Results: Low childhood financial conditions were associated with lower health and wellbeing in adulthood, independently of respondents' education. Among men, Low childhood financial conditions increased the risk (NDE) of being unhealthy on the composite EQ-5D by 22% (RR 1.22, 95% 1.14-1.31) and on subjective wellbeing by 24% (RR 1.24, 95% 1.18-1.30), while for women the risk increased by 16% (RR 1.16, 95% 1.10-1.23) and 26% (RR 1.26, 95% 1.19-1.33), respectively. Among men, the NDE of low mothers' education on age-comparative self-rated health increased by 9% (RR 1.09, 95% 1.01-1.16), while the NIE increased the risk by 3% (RR 1.03, 95% 1.01-1.04). The NDE of low mothers' education increased the risk on anxiety/depression among women by 38% (RR 1.38, 95% 1.13-1.69), whereas the NIE increased the risk by 5% (RR 1.05, 95% 1.02-1.08). Conclusions: Childhood financial conditions have a unique direct effect on a wide range of health and wellbeing measures. These findings apply to both men and women. Generally, parental education has an indirect effect on later health, but mothers' education may also have a long-term direct",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8142715b5b198f15686932d4016fc05d",
  "timestamp": "2025-05-15T02:39:27.017808"
}