{
  "id": 9393,
  "title": "A population-based case-control study of urinary bisphenol A concentrations and risk of endometriosis",
  "abstract": "Is bisphenol A (BPA) exposure associated with the risk of endometriosis, an estrogen-driven disease of women of reproductive age? Our study suggests that increased urinary BPA is associated with an increased risk of non-ovarian pelvic endometriosis, but not ovarian endometriosis. BPA, a high-volume chemical used in the polymer industry, has been the focus of public and scientific concern given its demonstrated estrogenic effects in vivo and in vitro and widespread human exposure. Prior studies of BPA and endometriosis have yielded inconsistent results and were limited by the participant sampling framework, small sample size or use of serum (which has very low/transient concentrations) instead of urine to measure BPA concentrations. We used data from the Women's Risk of Endometriosis study, a population-based case-control study of endometriosis, conducted among female enrollees of a large healthcare system in the US Pacific Northwest. Cases were women with incident, surgically confirmed endometriosis diagnosed between 1996 and 2001 and controls were women randomly selected from the defined population that gave rise to the cases, without a current or prior diagnosis of endometriosis. Total urinary BPA concentrations were measured in 143 cases and 287 population-based controls using single, spot urine samples collected after disease diagnosis in cases. Total urinary BPA concentration (free and conjugated species) was quantified using a high-performance liquid chromatography-mass spectrometry method. We estimated odds ratios (ORs) and 95% confidence intervals (CIs) using unconditional logistic regression, adjusting for urinary creatinine concentrations, age and reference year. We also evaluated the association by disease subtypes, ovarian and non-ovarian pelvic endometriosis, that may be etiologically distinct. We did not observe a statistically significant association between total urinary BPA concentrations and endometriosis overall. We did observe statistically significant positive associations when evaluating total urinary BPA concentrations in relation to non-ovarian pelvic endometriosis (second versus lowest quartile: OR 3.0; 95% CI: 1.2, 7.3; third versus lowest quartile: OR 3.0; 95% CI: 1.1, 7.6), but not in relation to ovarian endometriosis. Given the short elimination half-life of BPA, our study was limited by the timing of collection of the single urine sample, that occurred after case diagnosis. Thus, our BPA measurements may not accurately represent the participants' levels during the etiologically relevant time period for endometriosis development. In addition, since it was not feasible in this population-based study to surgically confirm the absence of disease, it is possible that some controls may have had undiagnosed endometriosis. By using population-based data, it is more likely that the controls represented the underlying frequency of BPA exposure in contrast to prior studies that used for comparison control women undergoing surgical evaluation, where the indication for surgery may be associated with BPA exposure. The significant associations observed in this study suggest that BPA may affect the normal dynamic structural changes of hormonally responsive endometrial tissue during the menstrual cycle, promoting the establishment and persistence of refluxed endometrial tissue in cases with non-ovarian pelvic endometriosis. Further research is warranted to confirm our novel findings in endometriosis subtypes that may be etiologically distinct. This work was supported by the National Institutes of Health, National Institute of Environmental Health Sciences (grant number R03 ES019976), the Eunice Kennedy Shriver National Institute of Child Health and Human Development (grant number R01 HD033792); US Environmental Protection Agency, Science to Achieve Results (STAR) (grant number R82943-01-0) and National Institute of Nursing Research (grant number F31NR013092) to KU for training support. This work was supported in part by the Intramural Research Program of the National Institutes of Health, National Institute of Environmental Health Sciences. The content is solely the responsibility of the authors and does not necessarily represent the official view of the National Institute of Child Health and Human Development, National Institute of Environmental Health Sciences, National Institute of Nursing Research or the National Institutes of Health. The authors have no actual or potential competing financial interests. Not applicable.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81443df97024aa434dbc0098f9f2e622",
  "timestamp": "2025-05-15T03:28:17.608182"
}