{
  "id": 3375,
  "title": "A FRAMEWORK FOR GOAL-BASED TRANSPORTATION ROUTING USING SOCIAL NETWORKING",
  "abstract": "To date, common road navigation systems have provided drivers with routing based on shortest distance, fastest time, waypoint analysis, and basic parameter searches. These routes are common to all drivers, and are neither easily customized nor updated in real-time. This project proposes that navigation should consider real-time data regarding weather, traffic, and specific driver patterns in a novel method using profiles of the vehicle, driver, and passengers. Profiles incorporate financial risk metrics, individual goals, and driving preferences. Considerations are given to optimize navigation toward travel cost (fuel, time), route uniqueness, and reduced risk of adverse events while in transit. Proposed navigation paths incorporate spatial and temporal patterns, and situation awareness of activity along projected paths may optimize the nodes to consider in the decision tree and road-network topology. Using Social Networking, data aggregation and computation efficiency can be achieved while also benefiting from identification of drivers with similar driving profiles, waypoints, and goals. The framework described in this research is for short and long term data collection, decision criteria, and calculation methods for driver-unique route proposals. Seven prospective data types (strata) are identified in the framework for all tags, attributes, and computations to be tracked socially, spatially, and/or temporally. Data not tracked in real-time is considered Non-Volatile, and may be updated periodically by service providers. Non-Volatile Data includes legal driving parameters, vehicle configuration, landmarks, topography, infrastructure locations, and population density. Volatile Data may include vehicle position, fuel pricing, weather, driver observations, traffic congestion, warnings and threats, and road conditions. Privacy and security are left to implementation. Significant emphasis is placed on existing models for risk and control objectives.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8148d3cb73dd4222278dc6e73b67d2b5",
  "timestamp": "2025-05-15T02:25:40.100999"
}