{
  "id": 3590,
  "title": "Predicting financial distress in emerging markets: the case of Indian small enterprises",
  "abstract": "The present study examines the factors leading to financial distress among small enterprises in India. The CMIE Database was used to extract data from 2008 to 2022. A total of 946 companies' data has been extracted; however, due to the missing data, 547 companies' data were used for the analysis. The Springate S-Score is used to classify firms as healthy or distressed, and the logit regression is used to predict the financial health of small firms by using financial ratios, firm-specific, and macroeconomic variables. The findings revealed that interest expense ratio, current ratio, leverage ratio, total asset turnover ratio, size of the company, book value of equity, GDP growth, inflation, and economic policy uncertainty have significance in predicting a small company's financial health position. Model 1 has an accuracy rate of 92.7 percent, and Model 2 corroborated the robustness of the findings. The present study addresses an essential requirement for understanding the economic health of small companies in emerging economies like India. At the same time, it provides valuable insights for small companies, investors, financial analysts, and policymakers to improve prediction accuracy and develop strategies to mitigate the risk. Impact statement: This study addresses a critical gap in financial distress prediction by focusing on small companies in emerging markets like India, which have been underrepresented in prior research. By integrating financial, firm-specific, and macroeconomic variables, the study develops highly accurate predictive models (Model 1: 92.47%, Model 2: 92.4%) that identify key drivers of financial instability, such as liquidity ratios, leverage, profitability, and external economic factors like GDP growth and inflation. The research holds significant academic and practical value. For financial institutions, the models enhance credit risk assessment for small businesses, while policymakers can leverage insights to design targeted support mechanisms. Small business owners gain actionable knowledge on financial health indicators, enabling proactive risk management. Additionally, the study underscores the importance of macroeconomic stability in safeguarding small enterprises, offering policymakers evidence-based strategies to mitigate economic volatility. This research bridges theory and practice to enhance small business resilience in emerging markets. By identifying key financial distress predictors, it equips stakeholders with actionable tools for informed decision-making and sustainable growth strategies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "814cf4cb37509a06d201be4a81c2ad3d",
  "timestamp": "2025-05-15T02:27:54.082405"
}