{
  "id": 9360,
  "title": "Association of social frailty, sarcopenia, and oral frailty with depressive symptoms in Chinese older adults: a cross-sectional study",
  "abstract": "Background Depressive symptoms are a serious health issue that can cause profound, lifelong suffering for people who are affected by it. This study aimed to evaluate the effect of sarcopenia, oral frailty, and social frailty on depressive symptoms among Chinese participants aged >= 60 years old in China. Methods This research utilized a cross-sectional design and used convenience sampling to select participants from Anhui Province, China. Demographic questionnaire, SARC-F (Strength, Assistance with walking, Rising from a chair, Climbing stairs, and Falls), OFI-8 (Oral Frailty Index-8), the HALFT (Help, Participation, Loneliness, Financial, Talk) scale, and PHQ-9 (Patient Health Questionnaire-9) were used to conduct the survey. A chi-square test was performed to evaluate the differences between categorical variables, spearman correlation analysis was used to find the correlation between depressive symptoms and factors. Four regression models were set up to evaluate the effect of factors on depressive symptoms and select the appropriate adjustment variables. Results Of 1453 participants, 33.5% had sarcopenia, 51.4% had oral frailty, 31.5% had pre-social frailty, 14.5% had social frailty, and 32.2% had depressive symptoms. Spearman correlation analysis indicated that depressive symptoms significantly correlated with sarcopenia (r = 0.415), oral frailty (r = 0.282), and social frailty (r = 0.410). In crude analysis, sarcopenia (OR = 0.179, 95%CI 0.141-0.227), oral frailty (OR = 3.946, 95%CI 3.101-5.021), pre-social frailty (OR = 4.449, 95%CI 3.401-5.818), and social frailty (OR = 12.552, 95%CI 8.833-17.837) were significantly associated with depressive symptoms in older adults. After adjusting for the covariates, sarcopenia (OR = 4.301, 95%CI 3.322-5.569), oral frailty (OR = 3.136, 95%CI 2.430-4.046), pre-social frailty (OR = 3.664, 95%CI 2.775-4.836) and social frailty (OR = 9.488, 95%CI 6.560-13.723) were significantly associated with depressive symptoms. (P <0.05). Conclusion This research indicated that sarcopenia, oral frailty, pre-social frailty, and social frailty, were significant and positively associated with depressive symptoms. These results provide clinicians with a reference for identifying high-risk older adults and give public health policymakers a scientific approach to taking targeted interventions. Future research should further explore the two-way relationship between these factors and depressive symptoms and assess the effectiveness of different interventions. This will help to improve the quality of life and mental health.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8152acf2a2e7485fc848eda3cc110e56",
  "timestamp": "2025-05-15T03:27:53.437137"
}