{
  "id": 3941,
  "title": "Are cryptocurrencies contagious to Asian financial markets?",
  "abstract": "Despite numerous studies on financial contagion over the last few decades, the definition of financial contagion is not universally accepted. Furthermore, economic studies on cryptocurrency are limited. This research presents a pioneering study investigating cryptocurrencies contagion in the Asian financial markets. We use three methods of measuring contagions. The first method adjusts the bias in the correlation coefficient. The second method identifies exceedances (extreme return) and performs a multinomial logistic regression to explain the coexceedances. Finally, we also use a vector autoregression (VAR) system. We documented evidence that the (unadjusted) correlation coefficients between five cryptocurrencies and thirteen Asian financial markets tended to be low in both high and low variance periods. After adjusting the bias in the correlation coefficient, we found that there was no longer evidence of a significant change in the magnitude of the propagation mechanism from five cryptocurrencies to Asian foreign exchange and stock markets. Using a multinomial logit analysis, we also acknowledged that cryptocurrencies tended to be statistically insignificant determinants for both positive and negative coexceedances. Our third contagion analysis using a VAR system further revealed that cryptocurrencies tended to be statistically insignificant determinants explaining the current Asian financial market change variables. Our results suggest that cryptocurrencies do not possess a systemic risk to the Asian financial markets.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "815f5a702e95aa14335099aa11844c23",
  "timestamp": "2025-05-15T02:31:28.439918"
}