{
  "id": 7980,
  "title": "Corporate Default Prediction Model: Evidence from the Indian Industrial Sector",
  "abstract": "The unprecedented pandemic COVID-19 has impacted businesses across the globe. A significant jump in the credit default risk is expected. Credit default is an indicator of financial distress experienced by the business. Credit default often leads to bankruptcy filing against the defaulting company. In India, the Insolvency and Bankruptcy Code (IBC) is the law that governs insolvency and bankruptcy. As reported by the Insolvency and Bankruptcy Board of India (IBBI), the number of companies filing for bankruptcy under IBC is on a rise, and the industrial sector has witnessed the maximum number of bankruptcy filings. The present article attempts to develop a credit default prediction model for the Indian industrial sector based on a sample of 164 companies comprising an equal number of defaulting and nondefaulting companies. A total of 120 companies are used as training samples and 44 companies as the testing samples. Binary logistic regression analysis is employed to develop the model. The diagnostic ability of the model is tested using receiver operating characteristic curve, area under the curve and annual accuracy. According to the study, return on assets, current ratio, debt to total assets ratio, sales to working capital ratio and cash flow to total assets ratio is statistically significant in predicting default. The findings of the study have significant implications in lending and investment decisions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81661367a4c73c819d544f7d053eedaf",
  "timestamp": "2025-05-15T03:14:07.186936"
}