{
  "id": 8099,
  "title": "Beliefs About Anal Cancer among HIV-Infected Women: Barriers and Motivators to Participation in Research",
  "abstract": "Background: Infection with the human immunodeficiency virus (HIV) remains associated with a greater risk of anal cancer, despite widespread use of combination antiretroviral therapy. Evidence concerning the acceptability of anal cancer screening gives little attention to women. Because HIV-infected women have a high prevalence of depression and history of sexual trauma, understanding acceptability among this group is critical. Purpose: We sought to assess barriers and motivators to participation in anal cancer screening research among a racial/ethnically diverse HIV-infected female population. Methods: We conducted a survey based on the Health Belief Model to identify characteristics of women willing to participate in anal cancer screening research (n = 200). Bivariate analyses examined associations between willingness to participate and sociodemographics, clinical characteristics, and health beliefs. Logistic regression modeled willingness to participate in research. Main Findings: Of the women who participated, 37% screened positive for depression, 43% reported a high trauma history, and 36% screened positive for posttraumatic stress disorder. Overall, 65% reported willingness to participate in research. Those likely to participate were older, reported intravenous drug use as their HIV risk factor, and had a history of prior high-resolution anoscopy (HRA) compared with those unwilling to participate. The most commonly reported barrier to anal Pap testing was fear of pain. In adjusted analyses, a lack of fear of pain and prior experience with HRA significantly predicted willingness to participate. Conclusions: Findings suggest that, to increase participation in anal Pap and HRA-related research for HIV-infected women, a single approach may not be adequate. Rather, we must harness patients' previous experiences and address psychosocial and financial concerns to overcome barriers to participation. Copyright (C) 2015 by the Jacobs Institute of Women's Health. Published by Elsevier Inc.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8167c5ca9ed97009707f4113890d7ef3",
  "timestamp": "2025-05-15T03:15:09.419302"
}