{
  "id": 5049,
  "title": "How strong are the causal relationships between Islamic stock markets and conventional financial systems? Evidence from linear and nonlinear tests",
  "abstract": "Past studies suggest that the Islamic finance system is only weakly linked or even decoupled from conventional markets. If this statement is true, then this system may provide a cushion against potential losses resulting from probable future financial crises. In this article, we make use of heteroscedasticity-robust linear Granger causality and nonlinear Granger causality tests to examine the links between the Islamic and global conventional stock markets, and between the Islamic stock market and several global economic and financial shocks. Our findings reveal evidence of significant linear and nonlinear causality between the Islamic and conventional stock markets but more strongly from the Islamic stock market to the other markets. They also show potent causality between the Islamic stock market and financial and risk factors. This evidence leads to the rejection of the hypothesis of decoupling of the Islamic market from their conventional counterparts, thereby reduces the portfolio benefits from diversification with Sharia-based markets. A striking result shows a connection between the Islamic stock market and interest rates and interest-bearing securities, which is inconsistent with the Sharia rules. The results also suggest that modeling Islamic stock markets should be done within a nonlinear VAR system and not through a regression equation. (C) 2013 Published by Elsevier B.V.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8169b90dca11e5d718354303b4f08a0d",
  "timestamp": "2025-05-15T02:43:40.235259"
}