{
  "id": 6718,
  "title": "Perceived Barriers in Accessing Health Care and the Risk of Pregnancy Complications in Indonesia",
  "abstract": "Background: Accessing immediate health care during pregnancy is key to preventing and treating pregnancy-related complications, which are the leading cause of maternal morbidity and mortality. As the largest archipelago country in the world, Indonesia faces the challenges of disparity in access to healthcare services across geographical regions and socioeconomic groups. Objective: This study aims to assess the relationship between perceived barriers to accessing health care and the risk of pregnancy-related complications among women of reproductive age in Indonesia. Methods: Data from a nationally representative sample of 15,021 last births within 5 years preceding the 2017 Indonesia Demographic and Health Survey were analyzed to examine barriers in accessing health care and the risk of having complications during pregnancy. The statistical model of logistic regression was used to investigate the effect of barriers on the risk of pregnancy complications, and results were presented as odds ratios (ORs) with 95% confidence intervals (CIs). Results: The majority of women in Sumatra and Maluku-Papua regions encountered physical, cultural, and financial barriers to accessing health care. The results indicate significantly higher odds of having complications in mothers who had distance barriers (OR: 1.46, 95% CI: 1.20-1.77), relative to mothers who reported no barriers, after adjusting for women's characteristics. Conclusion: The findings suggest that it is necessary to tackle specific physical barriers by providing more developed health-care systems in rural and geographically isolated areas, to bring health services closer to home.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "816ffbbfb1d530a3b73f77fe5c899e41",
  "timestamp": "2025-05-15T03:01:03.527619"
}