{
  "id": 1766,
  "title": "Safe haven properties of industrial stocks against ESG in the United States: Portfolio implication for sustainable investments",
  "abstract": "This study explores the safe haven role of industry sectors classified by the Global Industry Classification Standards (GICS) for global Environmental, Social, and Governance (ESG) stocks in the United States. Our study applies the novel cross-quantilogram and quantile time-frequency connectedness approach for daily time series data from November 2019 to October 2023. Our findings confirm that industry sectors, mainly financials, industrial, communication, information technology, energy, consumer staples, and consumer discretionary, are the safe haven avenues at down, normal, and up market conditions; however, these safe haven avenues vanish for the long-term investment horizon. We also explore the risk spillover patterns for the total time domain and the decomposed spillover level for the short- and long-term spillovers. Our connectedness finding shows that the net transmitters and net receiver patterns are similar for the extreme markets but dramatically change for the normal markets. Finally, based on the portfolio rebalancing strategy, the returns of our portfolio, comprised of industry sectors and the ESG index, outperform the overall market. Moreover, our portfolio yields lower negative returns and a higher Sharpe ratio when compared with the overall market returns. These findings confirm the benefits of diversification by reducing downside portfolio risk. This study is primarily relevant for socially responsible portfolio and risk management investors.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8178b356024f7461c98beb27ced32d71",
  "timestamp": "2025-05-15T00:59:22.960137"
}