{
  "id": 3899,
  "title": "The long-term effects of cancer survivorship on household assets",
  "abstract": "Background Less is known about the impact of cancer on household assets and household financial portfolio during which cancer survivors face higher mortality risk. Economic theory predicts that cancer survivors would deplete their wealth in such a way that meets immediate financial needs for treatment and that hedges the risk of anticipated medical expenses associated with recurrence. Building upon this prediction, we examine long-term changes in household assets in response to cancer diagnosis among middle-aged and elderly Americans (age >= 50). Results Using the 2000-2014 waves of the Health and Retirement Study, we estimated the household fixed effects regression that regresses household assets on time elapsed since cancer diagnosis (<= 2 years, > 2 but <= 4 years, > 4 but <= 6 years, and > 6 but <= 8 years). Regression estimates were adjusted for demographic characteristics, general health condition, employment outcomes, and household economic attributes. Household assets were measured by total net worth as well as the amount of savings held in each asset category. The loss of household assets attributable to cancer was estimated to be $125,832 in 2015 dollars per household with a cancer patient. This change came from statistically significant reductions in investment assets, miscellaneous savings, real estate equity, and business equity, and increases in unsecured debt. We also found 17.2-28.0% increases in cash and cash-equivalent assets from + 2 years since diagnosis through the rest of the study periods. The accumulation of cash was observed for both the well-insured group (multiple coverages) and those with limited insurance (single coverage). Conclusions The results showed evidence of both asset depletion and precautionary accumulation of liquid assets among cancer survivors, which reduces risk exposure of household financial portfolio. Our findings highlighted that household asset is an important source of liquidity to finance cancer care and to absorb the expected expenditure risk associated with cancer recurrence. We also showed that health insurance provides limited coverage of health risks associated with cancer.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8188ba498008d22dc53809306fdf3bd9",
  "timestamp": "2025-05-15T02:30:58.382345"
}