{
  "id": 748,
  "title": "FINANCIAL CAPABILITY AND TECHNOLOGY IMPLICATIONS FOR ONLINE SHOPPING",
  "abstract": "To promote online shoppers' long-term interest, consumers need to have the knowledge and ability to avoid problems with financial issues. Financial capability helps to put consumers on the path to a sustainable financial future. However, previous studies only focused on financial capability in a financial context. To handle personal finance systematically and successfully in an online setting, this study extends an enhanced understanding of how financial capability on online consumer behaviour. Based on the data of 690 respondents collected by a face-to-face from eight main regions in Albania, this study employed principal components analysis and logistic regression in order to investigate the effect of consumers' financial capabilities and technology use on the decision to purchase online. The outcome of this study firstly identifies six dimensions of financial capabilities, namely, digital banking usage, financial service risk, financial advice, payment risk, risk tolerance, and financial attitude. Secondly, the finding revealed that individuals who use smartphones and administrate a social media account, are more likely to involve in purchasing through online channels. Moreover, the decision to purchase online is more prone for those individuals who manifest high levels in digital banking usage, financial advice, prior bank experience and technology usage, and low levels in attitude towards payment risk and attitude towards risk tolerance. This paper offers useful insights concerning the determinants of online purchasing by combining individuals' financial capability, technology and social media usage along with its demographic characteristics. In term of practical contribution, this study provides a useful model by incorporating for measuring and managing consumers' financial capability to enhance their involvement and to reduce their cognitive dissonance in the online shopping context. This study also contributes to the accumulated knowledge and encourages consumers to use digital banking and consult their financial issues when purchasing online.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8191bf28086ab924877f0bf0b9b569d5",
  "timestamp": "2025-05-15T01:54:34.110136"
}