{
  "id": 655,
  "title": "Quantifying credit portfolio sensitivity toasset correlations with interpretablegenerative neural networks",
  "abstract": "We propose a novel approach for quantifying the sensitivity of credit portfolio value-at-risk to asset correlations with the use of synthetic financial correlation matrixesgenerated with deep learning models. In previous work, generative adversarial net-works (GANs) were employed to demonstrate the generation of plausible correlationmatrixes that capture the essential characteristics observed in empirical correlationmatrixes estimated on asset returns. Instead of GANs, we employ variational autoen-coders (VAEs) to achieve a more interpretable latent space representation and toobtain a generator of plausible correlation matrixes by sampling the VAE's latentspace. Through our analysis, we reveal that the VAE's latent space can be a use-ful tool to capture the crucial factors impacting portfolio diversification, particularlyin relation to the sensitivity of credit portfolios to changes in asset correlations. AVAE trained on the historical time series of correlation matrixes is used to generatesynthetic correlation matrixes that satisfy a set of expected financial properties. Our analysis provides clear indications that the capacity for realistic data augmentationprovided by VAEs, combined with the ability to obtain model interpretability, canprove useful for risk management, enhancing the resilience and accuracy of modelswhen backtesting, as past data may exhibit biases and might not contain the essentialhigh-stress events required for evaluating diverse risk scenarios.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "819aa544978c5123377a8581c7e656fc",
  "timestamp": "2025-05-15T01:40:51.203832"
}