{
  "id": 3786,
  "title": "Catastrophic Health Expenditure in Patients with Lower-Extremity Orthopaedic Trauma",
  "abstract": "Background:Health-care expenditures are a leading contributor to financial hardship in the United States. Traumatic orthopaedic injuries are unpredictable and result in substantial expense. Our objectives were to quantify the catastrophic health expenditure (CHE) risk of patients with orthopaedic trauma and to examine the impact of insurance status, socioeconomic status, sex, and race on CHE.Methods:We identified all isolated lower-extremity orthopaedic trauma cases at a safety-net, Level-1 trauma center from 2018 to 2020. We queried an institutional charge database to obtain total hospital charges, insurance status, and ZIP Code to determine out-of-pocket (OOP) expenditures. To evaluate financial hardship, we calculated the CHE risk as defined by the World Health Organization's threshold of OOP expenditures, >= 40% of estimated household post-subsistence income.Results:In our cohort of 2,535 patients, 33% experienced a risk of CHE. A risk of CHE was experienced by 99% of patients who were uninsured, 35% of patients with private insurance, 2% of patients with Medicare, and 0% of patients with Medicaid. Multivariable regression modeling showed that patients who were uninsured were significantly more likely to experience a risk of CHE compared with patients with private insurance (odds ratio, 107.68 [95% confidence interval, 37.20 to 311.68]; p < 0.001).Conclusions:One-third of patients with lower-extremity orthopaedic trauma experience a risk of CHE, with patients who are uninsured facing a disproportionately higher risk of CHE compared with patients who are insured. Our results suggest that the expansion of public insurance options may provide substantial financial protection for those at the greatest risk for CHE.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "819c49b0f27541240976dd408c9a3b65",
  "timestamp": "2025-05-15T02:29:59.170943"
}