{
  "id": 7490,
  "title": "Nonlinear temperature-suicide association in Japan from 1972 to 2015: Its heterogeneity and the role of climate, demographic, and socioeconomic factors",
  "abstract": "It has been reported that suicide is associated with ambient temperature; however, the heterogeneity in this association and its underlying factors have not been extensively investigated. Therefore, we investigated the spatial and temporal variation in the temperature-suicide association and examined climatic, demographic, and socioeconomic factors that may underlie such heterogeneity. We analyzed the daily time-series data for the suicide counts and ambient temperature, which were collected for the 47 prefectures of Japan from 1972 to 2015, using a two-stage analysis. In the first stage, the prefecture-specific temperature-suicide association was estimated by using a generalized linear model. In the second stage, the prefecture-specific associations were pooled, and key factors explaining the spatial and temporal variation were identified by using mixed effects meta-regression. Results showed that there is an inverted J-shape nonlinear association between temperature and suicide; the suicide risk increased with temperature but leveled off above 24.4 degrees C. The nationwide relative risk (RR) for the maximum suicide temperature versus 5th temperature percentile (2.9 degrees C) was estimated as 1.26 (95% CI: 1.22, 1.29). The RRs were larger for females than for males (1.32 vs. 1.22) and larger for elderly people (>= 65 y) than for the non-elderly (15-64 y) (1.51 vs. 1.18). The RRs were larger for rural prefectures, which are characterized by smaller population, higher proportions of females and elderly people, and lower levels of financial capability and the proportion of highly educated people. The RRs were also larger in colder and less humid prefectures. These findings may help in understanding the potential mechanism of the temperature-suicide association and projecting the future risk of suicide under climate change.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81a53e86429c3016409d622df463dce2",
  "timestamp": "2025-05-15T03:09:07.307022"
}