{
  "id": 3708,
  "title": "Collaborative planning of multi-energy systems integrating complete hydrogen energy chain",
  "abstract": "Under the global low-carbon target, hydrogen is essential to address uneven energy spatial distribution and seasonal energy imbalances. However, the issues of insufficient energy interaction between different links (e.g., production, storage, and application) of hydrogen in planning models hinder the full hydrogen exploitation. This study proposes the concept of a complete hydrogen energy chain covering the energy flows of all the links and optimizes the hydrogen chain-based energy system's bottom-up long-term investment strategy. It aims to facilitate the transfer of multiple energy flows across time and space for renewable energy efficient consumption. Firstly, a hydrogen chain-based fast clustering optimization method is proposed to deal with high-dimensional data to achieve a fast solution for large-scale long-term planning. Secondly, a high-resolution collaborative planning model of the multi-energy systems integrating the complete hydrogen energy chain is proposed, considering the renewable energy spatiotemporal distribution characteristics and annual hourly operation. Finally, this study thoroughly examines the optimal portfolio selection of different hydrogen technologies based on the differences in cost, flexibility, and efficiency. Taking Northeast China in 2050 as an example, the results show that: The proposed model reduces CO2 emissions by 60 % with 30 % additional cost in Pareto analysis. At zero-carbon emissions, integrating the complete hydrogen energy chain reduces the renewable energy curtailment by 97.0 %. Meanwhile, the energy system prefers the electrolysis cells with the highest energy efficiency and the fuel cells with the fastest dynamic response. This study provides future energy system planning guidance for countries or regions to realize low-carbon targets.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81df8f6737a9cf64587b25695a74a2c3",
  "timestamp": "2025-05-15T01:20:03.431322"
}