{
  "id": 4335,
  "title": "How does excess cash affect corporate financial performance?",
  "abstract": "PurposeThis article analyzes the moderating role of investment opportunities, business risk and agency costs in shaping the nexus between excess cash and corporate performance.Design/methodology/approachThis research uses dynamic regression models (two-step system generalized method of moments) to analyze the data related to 200 Turkish companies listed on Borsa Istanbul (BIST) for the years between 2009 and 2020.FindingsThe findings indicate that when excess cash increases, the financial performance deteriorates only for firms with lower investments compared to firms with more investments. In addition, investment contributes to better financial performance for firms that hold cash surplus, whereas the influence of investment is insignificant for firms that have insufficient cash. Agency costs of equity exacerbate the adverse impact of excess cash on financial performance while agency costs of debt mitigate this effect. Excess cash reduces the financial performance of highly leveraged firms. However, this impact becomes insignificant when debt ratio decreases. The findings also show that investment has more significant role than business risk in building the precautionary motive to hold cash.Research limitations/implicationsThe findings of this article are limited to the Turkish market. Future research is still needed in other emerging markets to compare the results and reveal more about the effect of excess cash on firm performance, and how other factors can change this effect.Practical implicationsThe findings verify the increased significance of excess cash in the presence of investment opportunities and difficulties in accessing external funds. Nevertheless, the role of the equity related agency problem in reducing the benefits of cash surplus confirms the necessity of policies that support corporate governance, especially in emerging markets.Originality/valueThis article, according to the knowledge of author, is the first to examine the role of agency costs associated with debt and equity, and the compound effect of investment opportunities and business risk on the nexus between excess internal funds and corporate financial performance in emerging markets.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81e91a779ca296dfcabf06dfc4f06844",
  "timestamp": "2025-05-15T02:36:05.199533"
}