{
  "id": 8138,
  "title": "Who is reported missing from Canadian hospitals and mental health units?",
  "abstract": "Purpose International literature on missing persons suggests that a significant volume of missing person cases originate from hospitals and mental health units, resulting in considerable costs and resource demands on both police and health sectors (e.g., Bartholomew et al., 2009; Sowerby and Thomas, 2017). In the Canadian context, however, very little is known about patients reported missing from these locations - a knowledge deficit with profound implications in terms of identifying and addressing risk factors that contribute to this phenomenon. The present study is one such preliminary attempt to try to fill a significant research and policy gap. Design/methodology/approach The authors draw on data from a sample of 8,261 closed missing person reports from a Canadian municipal police service over a five-year period (2013-2018). Using multiple logistic regression, the authors identify, among other factors, who is most likely to be reported missing from these locations. Findings Results reveal that several factors, such as mental disabilities, senility, mental illness and addiction, are significantly related to this phenomenon. In light of these findings, the authors suggest that there is a need to develop comprehensive strategies and policies involving several stakeholders, such as health care and social service organizations, as well as the police. Originality/value Each year, thousands of people go missing in Canada with a large number being reported from hospitals and mental health units, which can be burdensome for the police and health sectors in terms of human and financial resource allocation. Yet, very little is known about patients reported missing from health services - a knowledge deficit with profound implications in terms of identifying and addressing risk factors that contribute to this phenomenon. This manuscript seeks to remedy this gap in Canadian missing persons literature by exploring who goes missing from hospitals and mental health units.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81ec9afba44bb30f968530e0f6282af6",
  "timestamp": "2025-05-15T03:15:38.398768"
}