{
  "id": 9259,
  "title": "Interaction of sleep quality and psychosocial stress on obesity in African Americans: the Cardiovascular Health Epidemiology Study (CHES)",
  "abstract": "Background: Compared with whites, sleep disturbance and sleep deprivation appear more prevalent in African Americans (AA). Long-term sleep deprivation may increase the risk of obesity through multiple metabolic and endocrine alterations. Previous studies have reported contradictory results on the association between habitual sleep duration and obesity. Accordingly, we aimed to assess whether sleep quality and duration are inversely associated with body mass index (BMI) and obesity and test whether these associations are modified by psychosocial stress, known to influence sleep quality. Methods: A sample of 1,515 AA residents of metropolitan Atlanta, aged 30-65 years, was recruited by a random-digit-dialing method in 2007-08. The outcome obesity was defined by BMI (kg/m(2)) continuously and categorically (BMI >= 30 versus BMI < 30). Global sleep quality (GSQ) score was computed as the sum of response values for the seven components of the Pittsburgh Sleep Quality Index (PSQI) scale. GSQ score was defined as a continuous variable (range 0-21) and as tertiles. The general perceived stress (GPS), derived from the validated Cohen scale, was categorized into tertiles to test the interaction. Chi-square tests, correlation coefficients and weighted multiple linear and logistic regression were used to assess the associations of GSQ, GPS and obesity. Results: The mean (standard deviation) age was 47.5 (17.0) years, and 1,096 (72%) were women. GSQ score categorized into tertiles was associated with BMI. Among women, after multivariable adjustment that included age, gender, physical activity, smoking status, education, total family income, financial stress and history of hypertension, hypercholesterolemia, diabetes and myocardial infarction, obesity was associated with sleep quality as assessed by GSQ continuous score, [odds ratio, OR (95% C.I.): 1.08 (1.03 - 1.12)], and with a worse sleep disturbance subcomponent score [OR (95% C.I.): 1.48 (1.16 - 1.89)]. Among all participants, stress modified the association between obesity and sleep quality; there was an increased likelihood of obesity in the medium stress category, OR (95% C.I.): 1.09 (1.02 - 1.17). Conclusion: Sleep quality was associated with obesity in women. The association of sleep quality with obesity was modified by perceived stress. Our results indicate the need for simultaneous assessment of sleep and stress.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81fb079a478a7178fdba77fee20deaa8",
  "timestamp": "2025-05-15T03:26:54.626801"
}