{
  "id": 2687,
  "title": "The US Banking System: Does the Size of the Institution Matter to Its Economic-Financial Situation?",
  "abstract": "This paper analyzes the relationship between the size of the entities in the US banking system and their economic-financial situation. The objective of this study is to group different economic and financial variables of the entities together into factors that characterize the US banking system and identify how the factors vary according to the size of the entities. To do this, we start from the values taken by 32 economic-financial and regulatory ratios, obtained directly from the Federal Deposit Insurance Corporation (FDIC), for a period between the first quarter of 1990 and the penultimate of 2016. With this data it is performed a factorial analysis that allows synthesizing the 32 variables in 7 factors and, at the same time, obtaining relationships between these variables and the size and between themselves. Finally, through a neural network, the previous factors are hierarchized according to the influence that the size of the entities exerts on them. Among the conclusions reached, it should be noted that the loan structure is the factor that best classifies the size. It also determines the existence of a negative profitability solvency relationship with larger entities, (Assets > $250 B.) and smaller ones (Assets < $100 M.), as well as demonstrating the existence of moral hazard and the need for regulation that limits said risk (because the largest entities are the least solvent and assume the most risks).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81ffdb4b060fe06fe91d505ebac9842f",
  "timestamp": "2025-05-15T02:18:06.192490"
}