{
  "id": 5093,
  "title": "Financial Insecurity and Food Insecurity among US Children with Secondhand and Thirdhand Smoke Exposure",
  "abstract": "Objectives: Smokers with financial and food insecurity may find it difficult to quit smoking and reduce their children's tobacco smoke exposure (TSE). The objective was to examine the associations between child TSE and financial and food insecurity among U.S. school-aged children. Methods: We examined the 2018-2019 National Survey of Children's Health data on 17,484 children 6-11 years old. Children were categorized into TSE groups: (1) No TSE: did not live with a smoker; (2) thirdhand smoke (THS) exposure alone: lived with a smoker who did not smoke inside the home; or (3) secondhand smoke (SHS) and THS exposure: lived with a smoker who smoked inside the home. We conducted weighted logistic, ordinal, and linear regression analyses to assess the relationships between child TSE status and financial and food insecurity, adjusting for covariates. Results: Overall, 13.1% and 1.8% of children had THS exposure alone and SHS and THS exposure, respectively. Compared to children with no TSE, children with THS exposure alone were at 2.17 increased odds (95% CI = 1.83, 2.58, p < 0.001) and children with SHS and THS exposure were at 2.24 increased odds (95% CI = 1.57, 3.19, p < 0.001) of having financial insecurity. Children with THS exposure alone were at 1.92 increased odds (95% CI = 1.58, 2.33, p < 0.001) and children with SHS and THS exposure were at 2.14 increased odds (95% CI = 1.45, 3.16, p < 0.001) of having food insecurity. Conclusions: Children with TSE are at increased risk of experiencing financial and food insecurity. When developing tobacco interventions, a holistic approach to tobacco control that addresses ways to decrease financial and food hardships may improve outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "81ff1087e63d79d84a24aa41023c5acb",
  "timestamp": "2025-05-15T02:44:11.043084"
}