{
  "id": 8861,
  "title": "Assessment of malaria treatment interventions: a critical analysis of government initiatives and causes of treatment failure at Port Loko Government Hospital, Sierra Leone",
  "abstract": "BackgroundMalaria remains a significant public health challenge, particularly in sub-Saharan Africa, where it accounts for high morbidity and mortality rates. Sierra Leone, including Port Loko District, continues to experience a high burden of malaria despite government interventions. This study evaluates the existing government interventions for malaria treatment at Port Loko Government Hospital, examining the socio-economic determinants contributing to malaria treatment failure.MethodsThe study employed a cross-sectional study design with a quantitative approach, involving 150 health workers and 150 women of childbearing age. A purposive stratified random sampling technique was used to ensure diverse representation. Primary data were collected using structured questionnaires, while secondary data were extracted from the District Health Information System (DHIS) and hospital records. Data were analysed using SPSS version 28.0, applying descriptive statistics (frequencies, percentages, means and SD) and inferential analyses (Chi-square tests and binary logistic regression) to assess associations between socio-economic factors and treatment-seeking behaviours.ResultsFindings revealed that 90% of health workers were aware of malaria interventions, but only 68% reported high adherence to treatment guidelines. Among women of childbearing age, 40% sought malaria treatment at drug stores or pharmacies due to financial constraints, and a significant association was observed between socio-economic status and healthcare-seeking behaviour (2 = 9.32, df = 4, p = 0.05). Despite the fact that 73.3% reported the use of long-lasting insecticidal nets (LLINs), malaria prevalence remained high, suggesting additional risk factors beyond bed net usage.ConclusionThis study highlighted persistent challenges in malaria control, including inadequate healthcare access, non-adherence to treatment regimens, and socio-economic constraints. Policy recommendations include strengthening malaria treatment adherence programmes, improving healthcare accessibility, and enhancing community-based malaria prevention strategies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8200265b9c5d2c3ada96c90305fdde73",
  "timestamp": "2025-05-15T03:22:57.964834"
}