{
  "id": 2651,
  "title": "IPO underpricing: a comparative analysis of risk factor disclosures in the financial and non-financial sectors",
  "abstract": "PurposeThis study aims to identify mutually exclusive risk categories and determine whether these categories effectively capture the potential impact of risk disclosures on the initial returns of initial public offerings (IPOs) in the financial and non-financial sectors.Design/methodology/approachData were collected from 131 Indian IPO prospectuses (104 non-financial and 27 financial) issued between 2015 and 2021. Content analysis was performed to identify mutually exclusive risk categories, and the effects of these categories on initial IPO returns were assessed by regression analysisFindingsThe findings revealed that risk factor disclosures have a significant impact on underpricing, but not all risk factors are relevant. In the current study, in the financial sector, IPO underpricing was mostly driven by technological and competitive risk factors. In the non-financial sector, underpricing was predominantly influenced by operating risk and compliance risk factors.Research limitations/implicationsThe limitations of this study include the use of sentence-based context analysis, which does not assess the quality of risk disclosures. The statistical data reduction technique used to generate mutually exclusive risk categories may also be a limitation.Practical implicationsThis research has the potential to assist companies in standardizing the disclosure of risks within IPO prospectuses. The insights gained can inform market regulators in designing policies aimed at aiding investors in formulating investment strategies, ultimately enhancing transparency and clarity regarding information disclosure. Moreover, the findings offer valuable guidance to investors in selecting IPOs aligned with their risk tolerance levels.Social implicationsFrom a societal perspective, this study represents advancements by guiding regulators towards developing and regulating standardized, mutually exclusive risk factors. Such measures can aid investors in enhancing their decision-making perspectives regarding IPOs, promoting a more informed and confident investment environment.Originality/valueThis study is a pioneering attempt to address knowledge gaps by identifying distinct categories of risk disclosures in IPO prospectuses and examining their potential influence on IPO underpricing in the financial and non-financial sectors in India.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8205bdda0b766f5acedeb4405e460eb4",
  "timestamp": "2025-05-15T02:17:32.280698"
}