{
  "id": 9239,
  "title": "Effect of flood on the cutaneous leishmaniasis incidence in northeast of Iran: an interrupted time series study",
  "abstract": "IntroductionCutaneous Leishmaniasis (CL) is a zoonosis infection which is endemic in more than 100 countries in Asia, Africa, Europe and America. It was estimated that nearly 20 thousand of new cases are reported in Iran annually. This study aimed to investigate the impact of floods on the incidence of leishmaniasis in Golestan province (northeast of Iran) over nine years, from 2015 to 2023.MethodsInterrupted Time Series Analysis (ITSA) is a study design used to study the effects of an intervention, disaster, or natural event on occurrence of a disease over time. In March 2019, a major flood occurred in Golestan Province, and it had a particularly strong effect on the Gonbad Kavous county (region 1). The trend of CL incidence before and after the flood was assessed using ITSA. In addition, the flood impact on CL incidence was compared between Gonbad Kavous county (region 1) with other counties (13 counties, as the region 2).ResultsThroughout the study, a total of 8953 cases were identified with 2148 (24%) infected with leishmaniasis before the flood and 6805 (76%) after that. A comparison of leishmaniasis between the two regions before and after the flood revealed a significant increase in Gonbad Kavous County following the flood. Also, in the multivariate regression analysis, the average difference in the baseline occurrence level before the flood in regions 1 and 2 was 30.3 per 105 population, which was statistically significant. Additionally, the average difference in the occurrence of leishmaniasis after the flood between the two regions was 37.3 cases per 105 population. The difference in trend of incidence between the two regions increased to 30.4 per 105 population after the flood, compared to 5.5 per 105 before the flood. Also, the long-term trend difference after the flood between the two regions has reached 27.3 per 105 population.DiscussionNatural disasters such as floods, earthquakes, and climate change can increase the spread of diseases such as leishmaniasis. Some interventional strategies are needed to decrease the risk of leishmaniasis outbreaks in flooded areas. Besides informing the community, allocating more financial resources for healthcare activities is essential. Environmental and individual protective activities, regular waste collection and disposal, and combating reservoirs and vectors are particularly crucial.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "820fd4c92e0109e09d41b282e483005b",
  "timestamp": "2025-05-15T03:26:54.575078"
}