{
  "id": 7833,
  "title": "Inverse Relation of Total Serum Bilirubin to Coronary Artery Calcification Score Detected by Multidetector Computed Tomography in Males",
  "abstract": "Background: Serum total bilirubin has been suggested to have potential anti-inflammatory and antioxidant effects on the vasculature, acting against plaque formation and subsequent atherosclerosis. This study was designed to assess the association of serum total bilirubin with coronary artery calcification (CAC). Hypothesis: Individuals with higher bilirubin level would be less likely to develop CAC. Methods: Male subjects (N = 3408) underwent evaluation of CAC by cardiac computed tomography. Correlation and logistic regression analysis were performed to assess the relationships between CAC score and other variables. Results: Subjects with a higher CAC score had significantly lower total bilirubin level (P = 0.001). Total bilirubin level was negatively correlated with CAC score (r = -0.052, P = 0.002). A 0.1-mg/dL increase in bilirubin was associated with a reduced odds ratio (OR) of the risk by 29.2% for a CAC score above 100 (OR: 0.708, 95% confidence interval: 0.542-0.927, P = 0.012) after adjustment for several variables. Bilirubin was inversely correlated with high-sensitivity C-reactive protein (hsCRP) (r = -0.117, P < 0.001). Conclusions: This study demonstrated an independent inverse association between serum total bilirubin and CAC score in males. Low serum bilirubin concentration would be useful as a potential risk factor for CAC in males. Additionally, reduced hsCRP may be 1 of the mechanisms for how bilirubin reduces CAC. (C) 2012 Wiley Periodicals, Inc. Additional Supporting Information may be found in the online version of this article. Zheng-Yun Zhang, MD, and Lu-Qin Bian, MD, contributed equally to this work. The authors have no funding, financial relationships, or conflicts of interest to disclose.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82156d38d195323e8b2e300c049cf54b",
  "timestamp": "2025-05-15T03:12:36.463069"
}