{
  "id": 8695,
  "title": "Access to care in the Baltic States: did crisis have an impact?",
  "abstract": "Background: In 2009, brief but deep economic crisis profoundly affected the three Baltic States: Estonia, Latvia and Lithuania. In response, all three countries adopted severe austerity measures with the shared goal of containing rising deficits, but employing different methods. Aims: In this article, we analyze the impact of the economic crisis and post-crisis austerity measures on health systems and access to medical services in the three countries. Methods: We use the EU-SILC data to analyze trends in unmet medical need in 2005-2012, and apply log-binomial regression to calculate the risk of unmet medical need in the pre- and post- crisis period. Results: Between 2009 and 2012 unmet need has increased significantly in Latvia (OR: 1.24, 95% confidence interval (CI): 1.15-1.34) and Estonia (OR: 1.98, 95% CI: 1.72-2.27), but not Lithuania (OR: 0.84. 95% CI: 0.69-1.04). The main drivers of increased unmet need were inability to afford care in Latvia and long waiting lists in Estonia. Conclusion: The impact of the crisis on access to care in the three countries varied, as did the austerity measures affecting their health systems. Estonia and Latvia experienced worsening access to care, largely exacerbating already existing barriers. The example of Lithuania suggests that deterioration in access is not inevitable, once health policies prioritise maintenance and availability of existing services, or if there is room for reducing existing inefficiencies. Moreover, better financial preparedness of health systems in Estonia and Lithuania achieved some protection of the population from increasing unmet need due to the rising cost of medical care.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "821fb1927e2ff527be1d29f8cee58f4c",
  "timestamp": "2025-05-15T03:21:24.704008"
}