{
  "id": 6248,
  "title": "Establishing Academic Burnout's Relationship with Problematic Internet Use and Specific Health-Risk Behaviours: A Cross-sectional Study of Finnish Higher Education Students",
  "abstract": "Problematic Internet use is recognised as an emerging public health issue, particularly among young adults. Yet, there is scarce information on problematic Internet use as a predictor for academic burnout. This study aimed to identify academic burnout's association with both problematic Internet use and specific health-risk behaviour among higher education students. We analysed the population-based cross-sectional survey data (with post-stratification weighting) of Finnish higher education students. Data was collected in 2021 (n = 6258; age 18-34). Regression analyses were used to investigate academic burnout's relationship with problematic Internet use and health-risk behaviours. The results revealed that female gender, learning difficulties, the use snus (the Swedish-type of moist snuff), problematic Internet use, online shopping, and perceived loneliness were significantly and positively associated with academic burnout. In addition, a higher number of study credits earned, self-perceived good health, and a satisfactory financial level were significantly and inversely associated with academic burnout. The findings suggest that screening students for problematic behaviour and offering support for those in need are likely to be effective at increasing academic well-being among higher education students.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "822ed72e39c3a23fca61105d6f6cda49",
  "timestamp": "2025-05-15T02:56:11.011207"
}