{
  "id": 28,
  "title": "Financial hedging in energy market by cross-learning machines",
  "abstract": "The recent price volatility in the energy market highlights the importance of financial hedging and the need of its incorporation into an investor's set of portfolio strategies. Realizing the rapid advancement of artificial intelligence, our study empirically examines the use of machine learning models for hedging price risk associated with the holding of energy-based financial product. From a technical perspective, kernel regression and support vector machine are trained to estimate the time-varying optimal hedge ratio given the observed price movement and other factors. The estimated hedge ratio is then employed to guide the price hedging strategy of the crude oil contracts traded in the commodity exchanges. The two machine approaches' hedging effectiveness against price risk is also compared with those of the un-hedged portfolio as well as a well-studied econometric time series approach. Our results indicate that the two forms of learning machines substantially outperform time series model and no-hedging over the out-of-sample period but neither machine dominates another across all testing scenarios. Given these mixed results between kernel regression and support vector machine, we propose and develop a kernel-supervised support vector machine to take advantage of the complementary nature of the two machine learning approaches and enhance the supervised learning process through hierarchical/sequential infusion of information. Cross-learning empirical testing shows that the proposed cross-learning machine is more effective in hedging than individual kernel regression and support vector machine. Furthermore, our study evaluates the impact of incorporating the coefficient of absolute risk aversion and the transaction costs to machine learning models. In general, cross-learning machine outperforms others in all tested scenarios.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8241496b508f4b11f52558a94604b8b5",
  "timestamp": "2025-05-15T01:46:03.796762"
}