{
  "id": 8292,
  "title": "Participant and narrative characteristics associated with host community members sharing experiences of peacekeeper-perpetrated sexual exploitation and abuse in the Democratic Republic of Congo",
  "abstract": "Introduction Peacekeeper-perpetrated sexual exploitation and abuse (SEA) in the Democratic Republic of Congo (DRC) account for 36% of the global reports of formal SEA allegations to the UN between 2007 and 2021. However, formally reported SEA represents only a fraction of that which occurs, and community experiences of peacekeeper-perpetrated SEA are likely different than those reflected in official UN documents. Methods Using mixed-methods, cross-sectional data collected in the DRC in 2018, we used descriptive analysis and multivariate Poisson regression with robust error estimates to examine the participant and narrative characteristics associated with sharing an experience about peacekeeper-perpetrated SEA. Results Participants in Bukavu (adjusted relative risk (aRR) 0.85, 95% CI 0.79 to 0.91) and Kalemie (aRR 0.75, 95% CI 0.69 to 0.81) were less likely to share narratives about sexual interactions, while civilian UN personnel (aRR 1.16, 95% CI 1.00 to 1.34) were slightly more likely to be implicated in narratives about sexual interactions. Narratives in which the outcome was deemed fair to the woman/girl were more likely to be about sexual interactions (aRR 1.07, 95% CI 1.02 to 1.12). Both the regression analysis and the participants' interpretation of the shared narratives illustrated the significant role poverty played in SEA, suggesting that the outcomes of sexual interactions may have been deemed fair since affected women/girls were perceived to have benefited financially/materially. Conclusion There is significant variation between host communities in the likelihood of sharing narratives about SEA, which could prove useful for informing more targeted SEA prevention initiatives. Narratives about sexual interactions with UN personnel were more often deemed to have fair outcomes for the affected women/girls, likely related to ongoing poverty in host communities and perceived financial/material gain. These findings highlight how extreme poverty may impact perceptions around informed consent as well as fairness and require further study. Perceptions around fair outcomes would disincentivise formal reporting, which needs to be considered when devising community-based complaint networks.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82481a072230e70f67ea3e66cdffe425",
  "timestamp": "2025-05-15T03:17:21.548390"
}