{
  "id": 163,
  "title": "Stochastic jump diffusion process informed neural networks for accurate American option pricing under data scarcity",
  "abstract": "Pricing American options under jump diffusion models, such as the Merton model, presents significant challenges due to the early exercise feature and underlying price discontinuities. This paper introduces the PINN Merton model, a Physics-Informed Neural Network (PINN) framework that embeds the Merton partial integro differential equation (PIDE) into its loss function for American options pricing. By integrating sparse market data with financial physics, the model achieves robust pricing accuracy with limited training samples. We provide a rigorous derivation of the Merton PIDE from the L & eacute;vy process and prove the convergence of PINN Merton to the true option price under standard assumptions. Empirical evaluations on SPY and AAPL option datasets from June 2023 to September 2024 demonstrate that PINN Merton significantly outperforms traditional parametric models (e.g., Binomial Tree, Merton Jump Diffusion), data-driven baselines (e.g., Transformer, Neural Network, XGBoost), and PINN under the Black-Scholes formula (PINN BS), particularly in data-scarce scenarios. With only 200 training samples, PINN Merton achieves best performance, yielding an R2 of 0.9899 for SPY Calls (vs. 0.9654 for traditional Binomial Tree and 0.9617 for PINN BS), R2 of 0.9933 for SPY Puts (vs. 0.9924 for transformer), and R2 of 0.9897 for AAPL Calls (vs. 0.9822 for transformer), respectively. These results underscoring the model's effectiveness and generalizability across option types and underlying assets.",
  "year": 2025,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8257ffd580a1e9ca4cbbc72c5324c62b",
  "timestamp": "2025-05-15T01:29:09.027768"
}