{
  "id": 7488,
  "title": "Hardship financing, productivity loss, and the economic cost of illness and injury in Cambodia",
  "abstract": "BackgroundFinancial risk protection is a core dimension of universal health coverage. Hardship financing, defined as borrowing and selling land or assets to pay for healthcare, is a measure of last recourse. Increasing indebtedness and high interest rates, particularly among unregulated money lenders, can lead to a vicious cycle of poverty and exacerbate inequity.MethodsTo inform efforts to improve Cambodia's social health protection system we analyze 2019-2020 Cambodia Socio-economic Survey data to assess hardship financing, illness and injury related productivity loss, and estimate related economic impacts. We apply two-stage Instrumental Variable multiple regression to address endogeneity relating to net income. In addition, we calculate a direct economic measure to facilitate the regular monitoring and reporting on the devastating burden of excessive out-of-pocket expenditure for policy makers.ResultsMore than 98,500 households or 2.7% of the total population resorted to hardship financing over the past year. Factors significantly increasing risk are higher out-of-pocket healthcare expenditures, illness or injury related productivity loss, and spending of savings. The economic burden from annual lost productivity from illness or injury amounts to US$ 459.9 million or 1.7% of GDP. The estimated household economic cost related to hardship financing is US$ 250.8 million or 0.9% of GDP.ConclusionsSuch losses can be mitigated with policy measures such as linking a catastrophic health coverage mechanism to the Health Equity Funds, capping interest rates on health-related loans, and using loan guarantees to incentivize microfinance institutions and banks to refinance health-related, high-interest loans from money lenders. These measures could strengthen social health protection by enhancing financial risk protection, mitigating vulnerability to the devastating economic effects of health shocks, and reducing inequities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "828751119534c6619ee0e6fab26d7655",
  "timestamp": "2025-05-15T03:09:07.299837"
}