{
  "id": 2302,
  "title": "Sleepiness Moderates the Associations between Personality and Financial Risk Tolerance and Spending Habits among College Students",
  "abstract": "ObjectivesPersonality and sleep characteristics are related to financial attitudes and behaviors. However, to our knowledge no study has examined how personality and sleep may be conjointly associated with these financial outcomes. The present study examined sleepiness as a moderator of the associations between college students' personality traits and financial risk tolerance and spending habits.MethodsUndergraduates (N = 177, 77% women, 78% White) self-reported their personality traits and sleepiness using well-established questionnaires. Financial attitudes and behaviors were assessed via students' self-reported responses to a set of scenarios assessing risk tolerance as well as their spending habits over the prior two weeks.ResultsMultiple regression analyses were run. Across five significant two-way interactions, high levels of sleepiness exacerbated risk for greater financial risk tolerance and higher spending among those characterized by high open-mindedness and low neuroticism, whereas low sleepiness increased protection for lower risk tolerance and less spending among those high in agreeableness and conscientiousness.ConclusionsSleepiness may act as both a vulnerability and protective factor in relations between personality and financial attitudes and behaviors. Improvements in sleepiness, which is modifiable via intervention, may have significant implications for individuals' financial well-being.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8288e0fa4388a06dd7436040fc81fe0c",
  "timestamp": "2025-05-15T02:13:31.891024"
}