{
  "id": 8214,
  "title": "Universal rapid screening for methicillin-resistant Staphylococcus aureus in the intensive care units in a large community hospital",
  "abstract": "Background: Health care-associated methicillin-resistant Staphylococcus aureus (HA-MRSA) infections constitute a significant risk for hospitalized patients. This study evaluates the costs and effects of comprehensive and state-mandated MRSA screening for intensive care unit (ICU) patients and subsequent contact precautions on the rate of HA-MRSA. Methods: A pre- and postimplementation study was conducted in a 24-bed medical intensive care unit (MICU) and a 15-bed surgical intensive care unit (SICU) at an acute care 536-bed community hospital. This study used computerized records for all patients admitted to ICUs. Costs were estimated from financial records. Results: HA-MRSA infection rates did not decline after implementation of ICU screening. Regression analysis demonstrated that patients admitted from skilled nursing facilities, assisted living, and similar facilities were 12 times more likely to screen positive for MRSA as compared with patients admitted from home. The costs to identify each MRSA positive patient were $1,650 and $953 for comprehensive and state-mandated periods, respectively. Conclusion: In low prevalence hospitals without MRSA outbreaks, it is recommended that MRSA screening be conducted on patients admitted from skilled nursing and similar facilities because they are most likely to be colonized with MRSA. Results do not support mandates to conduct screening on all patients admitted to critical care units. Copyright (C) 2013 by the Association for Professionals in Infection Control and Epidemiology, Inc. Published by Elsevier Inc. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "828cd672c1629ccdbab411d9cb414d22",
  "timestamp": "2025-05-15T03:16:48.842763"
}