{
  "id": 2553,
  "title": "INFORMATION ANALYTICAL PROVISION IN FORMATION OF INNOVATIONAL PROJECTS PORTFOLIO OF ENTERPRISES IN THE CONTEXT OF SAFETY-ORIENTED MANAGEMENT",
  "abstract": "It is devoted to the research of methodological approaches aimed at the objective assessment of cost aspects, means and results of implementation of management and technological decisions while balancing the portfolio of innovative projects. It is established that the project portfolio management mechanism is aimed at reconciling project implementation goals with the tactical and strategic orientations of the enterprise with parallel balancing of project budgets and determining the mutual impact of each of them. The article deals with the approach of forming a portfolio of industrial enterprises innovation projects in the aspect of strengthening its market positions on the basis of security-oriented management. Based on the use of multivariate analysis, a model of influence indicators on the level of economic security of the enterprise has been developed. The using of the hierarchy method algorithm in formulating of recommendations for the selection of innovative projects on the criterion of economic security preserving is justified. The characteristics of the of communication features between economic security and the reputation of the enterprise have been determined and given. The closeness of relationship between the level of economic security and its reputation by using the correlation analysis was assessed. The authors identify the directions of balancing the project portfolio according to the criterion of ensuring a rational level of economic security and in conditions of preventive reputation strengthening. It is proposed to set the priorities of the criteria based on the results of correlation-regression analysis on the impact of factors on the enterprise's economic security, namely: target efficiency, cost performance, security of financing, investment efficiency, reactive performance. The result of the method application is the formation of strategic recommendations for the selection of innovative projects on the criterion of maintaining economic security.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "828d9b0617a05ba13983023c0ae6192a",
  "timestamp": "2025-05-15T01:08:10.769114"
}