{
  "id": 9227,
  "title": "Incidence and Risk Factors for Patient-related Short-term Cancellation of Elective Arthroscopic Surgery: A Case-matched Study",
  "abstract": "Introduction: Short-term cancellation of elective ambulatory orthopaedic surgery can result in disruption to the process flow of the operating room, with resultant negative financial implications for the health system. The risk factors for patient-related short-term cancellations within 24 hours of the surgical date have not been well defined. Methods: A retrospective review of a single orthopaedic surgery electronic internal database was done to identify all cancellations from January 1, 2016, through December 31, 2019, which were made within 24 hours of the surgical date. Inclusion criteria included elective arthroscopic procedures canceled solely for patient-related issues. Any cancellation for surgeon-related or ambulatory center-related reasons was excluded. Demographic patient and surgical data, including insurance type, employment status, previous history of cancellation for the same surgery, socioeconomic status based on the Area Deprivation Index, and surgery type, were tabulated. Each cancellation was matched 1:2 with noncanceled cases based on the anatomic site of the arthroscopy scheduled. Multivariable logistic regression was used to examine associations of patient demographic and medical characteristics with surgical cancellation. Results: There were 4,715 total arthroscopic procedures done during the study period, of which 126 (2.7%) were canceled within 24 hours of the surgery date. The mean age of the canceled cases was 44.9 +/- 16.1 years (range, 14 to 77 years), with 46 females (43%) included. The presence of MRI of the involved joint within 6 months of surgery (adjusted odds ratio [aOR], 0.39, 95% confidence interval [CI], 0.17 to 0.91) and current employment (aOR, 0.56, 95% CI, 0.33-0.94) were independently predictive of noncancellation. Current smokers were more likely to cancel within 24 hours of surgery (aOR, 2.63, 95% CI, 1.4-4.9). Finally, having previously canceled the same surgery was significantly associated with a current surgical cancellation (P = 0.004). Discussion: Identification of the factors associated with short-term patient-related cancellation of elective arthroscopy may serve as the basis for preoperative interventions aimed specifically at those more likely to cancel. In turn, these interventions can minimize preventable cancellations.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "829235a64634419d3a7e7535379aac95",
  "timestamp": "2025-05-15T03:26:54.522759"
}