{
  "id": 1209,
  "title": "Mapping stock market dynamics: A tripartite neural network approach using modified grid search for stock market prediction",
  "abstract": "The challenge of stock market prediction still persists for investors, researchers, portfolio managers, and a diverse array of stakeholders. This study aims to investigate the effectiveness of artificial neural networks, deep neural networks, and long-term memory models in predicting stock market indices. The study encompasses daily index prices of Nifty 50, S&P 500, and Euronext 100, along with macroeconomic data and technical indicators from January 2015 to September 2023, containing 2201 observations for each market. When evaluated using different metrics, the results indicate better performance of artificial neural network models than deep neural networks and long short-term memory models in most cases. The results from the validation set, test set, and an extra holdout set indicate better performance of artificial neural networks in the context of the Nifty 50 index. In the case of the S&P 500, the deep neural network performed well on validation set results, and artificial neural networks performed better than other models in the test set and holdout set predictions. In the case of Euronext 100, the deep neural network again performed better on the validation set; however, the Long short-term memory model outperformed other models with better predictions on testing and holdout set data. The study also applies a modified grid search approach to find the optimal hyperparameters, where the hyperparameters from the simpler model, i.e., artificial neural network using a conventional grid search approach, were used in more complex models like deep neural network and long short-term memory model.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "829409f6a0259a5b9059c7b8b564a74d",
  "timestamp": "2025-05-15T00:53:09.894078"
}