{
  "id": 9026,
  "title": "Toward Scalable Artificial Intelligence in Finance",
  "abstract": "Innovation in Artificial Intelligence (AI) continues to produce a wealth of techniques, mostly coming from the inductive form of AI also known as Machine Learning (ML). The majority of NIL algorithms is industry-neutral and business process agnostic. ML innovation is propelled by publicly available research, which gets harvested into Open Source for wide distribution through software and Cloud vendors. Ongoing Al technology work creates an immense source of assets for data-driven modeling, delivered as software libraries. However, the application of these assets for data monetization in finance does not happen with nearly comparable success or speed. The latter challenge is commonly known as the scalability problem of AI. As new techniques continue to grow vigorously, the investment from large finance institutions to cost-effectively produce applications for a variety of lines-of-business (LoBs) and business processes will increase. The availability of ML capabilities on Public (loud is a way for enterprises to increase productivity by benefiting from the best AI assets available from providers and startups. But data is constrained in terms of location, access and use in most finance competences by either laws or internal Governance, Risk and Compliance (CRC) rules. Legal limitations include, and go beyond, Privacy Acts, impacting non-retail processes where AI techniques must be explained in layperson language to decision-makers and regulators before field deployment. The latter is not yet achieved satisfactorily. Lastly, a large percentage of AI projects fail, in part due to unsuitable ML modeling for analytics and forecasting problems in finance. The variety and complexity of human behavior present in most finance processes calls for understanding AI at a level of cognitive depth that has no precedent in other industries. It is imperative that AI be approached so that finance competence and functional specificity are embedded a-priori into ML techniques and not as use-case afterthoughts. For acceleration of AI assessments, it is critical that ML techniques available in software implement models readily aligned to finance problems. This paper presents an approach to building an Architecture for Artificial Intelligence (AI) in Finance by focusing on analytics and forecasting for business-to-business operations. This AI Architecture hinges on three axes and their interplay: Design Dimensions, Modeling Building-Blocks and Work-Practice. The goal is to support finance practitioners navigate the plethora of AI . options more effectively and accelerate data monetization. While ML techniques in data analytics and forecasting apply to many scenarios, this paper focuses on selected competences in Banking, Financial Markets and Chief Finance Officer (CFO) operations. The architecture and method introduced in this paper is a first step toward a service practice. We harvest from our work carried out in banks, asset management firms and CEO lines-of-business as well as R&D experiences in new finance technologies for over one decade. As with any other architecture and deployment methodology, this work requires further harvesting, more information technology tools and sharing experiences across practitioners. It is hoped that finance organizations could adopt these new capabilities in their own Centers of Excellence or other internal organizations leading data-driven transformation and monetization across the firm.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8298295cf2bf6420140b2c5bafc3ede7",
  "timestamp": "2025-05-15T03:24:54.885067"
}