{
  "id": 3285,
  "title": "What is the best energy-delivery system for hand-held stope drilling and associated equipment in narrow-reef hard rock mines?",
  "abstract": "Changing mining conditions, legislative issues, rising costs, and the constrained supply of skills and electricity in South Africa, have been some of the criteria forcing mine operators and engineers to review the traditional use of compressed air to power underground hand-held drilling operations in narrow-stope, hard-rock mines. In answering the question, 'What is the best way to power this mine?', they have resorted to trade-off studies with results of limited usefulness, because they are site-specific, and use only a few comparative parameters, based on a small data set. This paper aims to provide definitive, objective, and quantitative decision-making approaches to evaluating alternative energy-delivery systems for stoping in narrow-reef hard rock mines, based on primary and relevant criteria. These include quantifiable criteria such as capital expenditure, operating costs, resulting financial returns, energy and water usage, production performance, life-of-mine, etc. Other important criteria with qualitative aspects are integrated. These are safety, health, and environmental concerns, legislative requirements, business risk, technology change, etc. The paper begins with a review of decision-making processes available, and proposes the use of the analytical hierarchy process (AHP) method as a multiple-criteria decision-making tool and the decision tree based on milestone-driven uncertainties, to validate the selection of the energy delivery system. The results of a multiple-criteria questionnaire completed by a variety of industry experts and professionals, such as production and operation managers, consultants, suppliers, and techno-financial analysts, are discussed. The evaluation indicates the potential for hydropower to be the best solution for narrow-reef hard rock mines, based on current information, mine design layout and production.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82a808b48fe761a83c87915a3e2b94a4",
  "timestamp": "2025-05-15T02:24:39.678262"
}