{
  "id": 8039,
  "title": "Risk Factor Analysis for Mastectomy Skin Flap Necrosis Implications for Intraoperative Vascular Analysis",
  "abstract": "Introduction: Skin flap necrosis after mastectomy can be a devastating complication significantly affecting patient outcomes. Routine vascular analysis (fluorescein or laser angiography) of mastectomy skin flaps in all patients has been advocated but is of questionable cost-effectiveness. The purpose of this study was to identify the incidence and causative risk factors for mastectomy skin flap necrosis and thereby calculate the fiscal reality of intraoperative vascular screening. Methods: This is an institutional review board-approved retrospective study of all patients from 2007 to 2013 who underwent mastectomy related to breast cancer. Skin flap necrosis was defined as major if it necessitated return to the operating room. Data analysis was done for determination of causative factors of necrosis, including age, body mass index, smoking, previous irradiation, coronary artery disease, chronic obstructive pulmonary disorder, hypertension, gastroesophageal reflux disease, hyperlipidemia, obstructive sleep apnea, asthma, diabetes, thyroid disease, history of lumpectomy, and breast reduction or augmentation. During this time, intraoperative vascular screening was not done. Results: Five hundred eighty-one patients underwent 616 mastectomies with a total of 34 necrotic events (5.5%)-16 major and 18 minor. Analyses via Student t tests, univariate analyses, chi(2) testing, and logistic regression showed that history of smoking was the only patient factor associated with postoperative necrosis (P = 0.008). More frequently represented in the necrosis group, but without statistical significance, are previous lumpectomy (P = 0.069) and immediate reconstruction (P = 0.078). For the entire study period, the actual cost to the hospital for major necrotic events was $7,123.10 or $445.19 for each of the 16 major necrotic events and $209.50 for all 34 necrotic events. Per-patient cost-effective screening would need to be less than $11.54 for all patients, $100.33 for highest risk patients (smokers), and $21.65 for highest risk patients (smokers, previous lumpectomy, and immediate reconstruction). Conclusions: Vascular screening other than clinical judgment of all patients is not cost effective. However, intraoperative vascular evaluation of high-risk patients is recommended before reconstruction and/or closure. These financial data that incorporate true costs and revenue can guide the use of newer, more expensive technology such as laser angiography and can be extrapolated to other institutions.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82ce488952557bbd52af9e615f496ce1",
  "timestamp": "2025-05-15T03:14:37.354106"
}