{
  "id": 3914,
  "title": "Characterization of Obesity in Severe Asthma in the German Asthma Net",
  "abstract": "BACKGROUND: Asthma is increasingly recognized as heterogeneous, characterized by different endotypes, with obesity not only a distinct phenotype but a risk factor for severe asthma.OBJECTIVE: We sought to understand the associations of obesity with relevant parameters of severe asthma, including asthma control, disease burden, and lung function.METHODS: The German Asthma Net registry is a multicenter international real-life registry capturing long-term follow-up data. This analysis included 2213 patients (52 +/- 16 years, 58% female, 29% with obesity [body mass index double dagger 30 kg/m2], 4.2 +/- 4.3 exacerbations/year). The primary analysis assessed relationships between BMI and variables through univariate tests, followed by a multiple regression model. Secondary outcomes regarded clinically relevant variables in relation to weight groups.RESULTS: Patients with obesity were more frequently female, more likely to have depression and gastroesophageal reflux, and suffered from worse asthma control, lower quality of life, reduced static lung volumes, more pronounced hypoxemia, and higher blood neutrophil counts, all statistically significant. Blood eosinophils, exhaled nitric oxide, and total IgE were independent of obesity. In the multiple regression analysis, obesity was significantly associated with more frequent reflux and depression, reduced static lung function values, older age, poor asthma control, and long-acting muscarinic antagonist therapy, and inversely associated with bronchiectasis and nonsmoking status.CONCLUSION: In this large, well-characterized cohort, we identified the association of obesity with a significantly higher disease burden and a similar portfolio of inflammation type 2 markers in patients with and without obesity; therefore, patients with obesity seem similarly eligible for the treatment with biologics targeting these disease endotypes. (c) 2023 American Academy of Allergy, Asthma & Immunology (J Allergy Clin Immunol Pract 2023;11:3417-24)",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82d4ae24a56ebb61f6d0d58b38801579",
  "timestamp": "2025-05-15T01:22:11.850642"
}