{
  "id": 7568,
  "title": "Symptoms of Mental Health Conditions and Their Predictors Among U.S. Adults During the First Year of the COVID-19 Pandemic",
  "abstract": "Background/Objectives: This study examined the impact of the COVID-19 pandemic on mental health among U.S. adults during its first year, using monthly surveys from March to November 2020. Methods: The primary outcome was the Patient Health Questionnaire four-item (PHQ-4) measure of anxiety and depressive symptoms. Univarite and bivariate analyses were used to provide foundational understanding of key variables. Parametric and non-parametric correlation analyses were conducted to observe the relationship between COVID-19 impacts or risk factors and the frequency of anxiety/depressive symptoms. A series of regression models were fit to assess the impact of pandemic stressors on PHQ-4 scores. Results: There was a statistically significant increase in mean PHQ-4 scores and the proportion of respondents with moderate to severe symptoms (PHQ-4 = 6+) between March-June and July-November 2020. Factors such as fear of contracting the virus, health concerns, and lifestyle disruptions had statistically significant impacts on mental health outcomes; however, these effects were more modest than estimates reported elsewhere. Financial strain, particularly among lower-income households and those experiencing job loss, showed stronger associations with increased anxiety and depressive symptoms, but the overall impact on population-level mental health was limited due to the small proportion severely affected financially. Using regression models, we found that demographic factors and pandemic stressors collectively explained about 21% of the variance in anxiety and depressive symptoms. Conclusions: This study provides a nuanced understanding of the pandemic's mental health impact, suggesting that while certain subgroups were more affected, the overall population level increase in anxiety and depression was less pronounced than previously assumed.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82d9a78256cec24f9363bcd3265dbb65",
  "timestamp": "2025-05-15T03:10:05.515997"
}