{
  "id": 21,
  "title": "Predicting the Risk Level of a Loan Based on the Customer's Personal Factors Using Machine Learning Models",
  "abstract": "Banks are the backbone of the global financial structure, and one of the keyways these organizations generate income is loan interest. If customers default on these loans, it can turn a gain into a significant loss for the bank, making it crucial to determine the risk of default before granting a loan. Machine learning algorithms can be a great tool for quickly and accurately determining if a loan should be granted. In this study, six machine learning models, namely Decision Tree, Random Forest, Support Vector Machine (SVM), Multi-layer Perceptron (MLP) Artificial Neural Network, Naive Bayes, and a stacking ensemble model were trained to make predictions of the risk level associated with a loan using a dataset containing twenty factors commonly included in a loan application. Among these models, the stacking ensemble model produced the best results with an accuracy of 78.75%, but the Random Tree model was more efficient and produced similar results with an accuracy of 78.15%. We observed that factors like credit amount, checking status, age of the customer, duration of the loan, and purpose of the loan were the most significant predictors of credit risk. The outcome of this study provides further evidence that machine learning models can be valuable tools in the loan approval process.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82e82197d12050269c28b2e33c31d5a2",
  "timestamp": "2025-05-15T01:46:03.772719"
}