{
  "id": 2390,
  "title": "FORWARD AND SPOT EXCHANGE RATES IN A MULTI-CURRENCY WORLD",
  "abstract": "Separate literatures study violations of uncovered interest parity (UIP) using regression-based and portfolio-based methods. We propose a decomposition of these violations into a cross-currency, a between-time-and-currency, and a cross-time component that allows us to analytically relate regression-based and portfolio-based facts and to estimate the joint restrictions they put on models of currency returns. Subject to standard assumptions on investors' information sets, we find that the forward premium puzzle (FPP) and the dollar trade anomaly are intimately linked: both are driven almost exclusively by the cross-time component. By contrast, the carry trade anomaly is driven largely by cross-sectional violations of UIP. The simplest model that the data do not reject features a cross-sectional asymmetry that makes some currencies pay permanently higher expected returns than others, and larger time series variation in expected returns on the U.S. dollar than on other currencies. Importantly, conventional estimates of the FPP are not directly informative about expected returns because they do not correct for uncertainty about future mean interest rates. Once we correct for this uncertainty, we never reject the null that investors expect high-interest-rate currencies to depreciate, not appreciate. JEL Codes: F31, G12, G15.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82e97bcc5c5188015e30ecb624de38aa",
  "timestamp": "2025-05-15T01:06:38.007079"
}