{
  "id": 1744,
  "title": "Forecasting international financial stress: The role of climate risks",
  "abstract": "We study the predictive value of climate risks for subsequent financial stress in a sample of daily data running from October 2006 to December 2022 of thirteen countries, which include China, ten European Union (EU) countries, the United Kingdom (UK), and the United States (US). The climate risk indicators are the result of a text -based approach which combines the term frequency -inverse document frequency and the cosine -similarity techniques. Given the persistence of financial stress as well as the importance of spillover effects of financial stress from other countries, we use random forests, a machine -learning technique tailored to handle many predictors, to estimate our forecasting models. Our findings show that climate risks tend to have a moderate impact, albeit in several cases statistically significant, on predictive accuracy, which tends to be stronger, in our cross-section of countries, on a daily than at a weekly or monthly forecast horizon of financial stress. Furthermore, the predictive value of climate risks for financial stress is heterogeneous across the countries in our sample, implying that a univariate forecasting model appears to be better suited than a corresponding multivariate one. Finally, the predictive value of climate risks for financial stress appears to be stronger in several countries at the lower conditional quantiles of financial stress.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82f0e75e8306eec14a1e0f6138232845",
  "timestamp": "2025-05-15T02:06:52.712215"
}