{
  "id": 7685,
  "title": "Effect of cardiovascular prevention strategies on incident coronary disease hospitalisation rates in Spain; an ecological time series analysis",
  "abstract": "Objective To assess the overall population impact of primary prevention strategies (promotion of healthy lifestyles, prevention of smoking and use of vascular risk drug therapy) of coronary disease in Spain. Design Ecological time series analysis, 1982-2009. Setting All public and private hospitals in Spain. Participants General population. Outcome Incident coronary disease hospitalisation as derived from official hospital discharge data. Methods Annual hospitalisation rates were modelled according to nationwide use of statins, antihypertensive, antidiabetic and antiplatelet drugs, and prevalences of smoking, obesity and overweight. Additive generalised models and mixed Poisson regression models were used for the purpose, taking year as the random-effect variable and adjusting for age, sex, prevalence of vascular risk factors and the number of hospital beds in intensive and coronary care units. Results Across 28years and 671.5 million person-years of observation, there were 2986834 hospitalisations due to coronary disease; of these, 1441980 (48.28%) were classified as incident. Hospitalisation rates increased from 1982 to 1996, with an inflection point in 1997 and a subsequent 52% decrease until 2009. Prevalences of smoking, obesity, overweight and use of vascular risk drug therapy were significantly associated with hospitalisation rates (p<0.001): incidence rates ratios (95% CI) for the fourth versus the first quartile were 1.46 (1.42 to 1.50), 1.80 (1.78 to 1.83), 1.58 (1.55 to 1.60) and 0.57 (0.51 to 0.63), respectively. These variables accounted for 92% of interannual variability. Conclusions After decades of continuous rises, hospitalisation due to incident ischaemic heart disease has been cut by half, an achievement associated with the decline in smoking and the increase in vascular risk drug therapy. These results indicate that these two primary prevention strategies have been effective at a population level, thanks to an appropriate balance between financial and health goals, something that should be left intact despite the current economic crisis. Future strategies ought to lay special stress on excessive body weight prevention.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82f480fdc660ff0b108f3c704b489a20",
  "timestamp": "2025-05-15T03:11:04.547673"
}