{
  "id": 6006,
  "title": "Rural social-ecological systems vulnerability evolution and spatial-temporal heterogeneity in arid environmental change region: A case study of Minqin Oasis, northwestern China",
  "abstract": "Theoretical and methodological approaches of social-ecological system's vulnerability provide a new perspective for the sustainable development of arid areas. However, the spatial distribution heterogeneity of internal ele-ments of vulnerability has always been ignored in current academic research and policy practice. Especially in low-exposure but high-vulnerability areas, it is more urgent to explore the vulnerability-causing factors and construct the response capacity. Therefore, according to the concept of vulnerability and its internal element relationship, this study proposes an analysis method for the spatial-temporal heterogeneity of exposure risk and vulnerability. With the aid of GIS, while assessing the spatial-temporal evolution of the overall vulnerability of the Minqin Oasis since the comprehensive management of Shiyang River Basin, we pay more attention to the spatial-temporal heterogeneity of the internal elements of vulnerability. Then applying the stepwise regression and geographically weighted regression, the article further analyzed the intrinsic reasons for spatial-temporal heterogeneity of SES's vulnerability and exposure risk. The results are as follows. 1) The vulnerability in Min-qin County from 2008 to 2016 was relatively low and showed an evolutionary trend of increased and then decreased. In addition, the vulnerability area was high in the Quanshan and Dam Districts and low in the Lake District; 2) the spatial-temporal heterogeneity of system exposure risk and vulnerability was significant and gradually reduced; and 3) the five main factors affecting spatial-temporal heterogeneity of the vulnerability of SES in Minqin Oasis include: per capita cultivated area, disaster-affected area, domestic water consumption, financial savings, and afforestation area. Finally, we proposed targeted recommendations for effective adaptive management and sustainable development for exposure-vulnerability heterogeneous regions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82f549e1eec1835b3ffaa50cf58f1f55",
  "timestamp": "2025-05-15T02:53:33.500818"
}