{
  "id": 9223,
  "title": "Loss of job-related right to healthcare associated with employment turnover: challenges for the Mexican health system",
  "abstract": "Background: The Mexican health system segments access and right to healthcare according to worker position in the labour market. In this contribution we analyse how access and continuity of healthcare gets interrupted by employment turnover in the labour market, including its formal and informal sectors, as experienced by affiliates to the Mexican Institute of Social Security (IMSS) at national level, and of workers with type 2 diabetes (T2DM) in Mexico City. Methods: Using data from the National Employment and Occupation Survey, 2014, and from IMSS electronic medical records for workers in Mexico City, we estimated annual employment turnover rates to measure the loss of healthcare access due to labour market dynamics. We fitted a binary logistic regression model to analyse the association between sociodemographic variables and employment turnover. Lastly we analysed job-related access to health care in relation to employment turnover events. Results: At national level, 38.3% of IMSS affiliates experienced employment turnover at least once, thus losing the right to access to healthcare. The turnover rate for T2DM patients was 22.5%. Employment turnover was more frequent at ages 20-39 (38.6% national level; 28% T2DM) and among the elderly (62.4% national level; 26% T2DM). At the national level, higher educational levels (upper-middle, OR = 0.761; upper, OR = 0.835) and income (5 minimum wages or more, OR = 0.726) were associated with lower turnover. Being single and younger were associated with higher turnover (OR = 1.413). T2DM patients aged 40-59 (OR = 0.655) and with 5 minimum wages or more (OR = 0.401) experienced less turnover. Being a T2DM male patient increased the risk of experiencing turnover (OR = 1.166). Up to 89% of workers losing IMSS affiliation and moving on to other jobs failed to gain job-related access to health services. Only 9% gained access to the federal workers social security institute (ISSSTE). Conclusions: Turnover across labour market sectors is frequently experienced by the workforce in Mexico, worsening among the elderly and the young, and affecting patients with chronic diseases. This situation needs to be prospectively addressed by health system policies that aim to expand the financial health protection during an employment turnover event.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "82f616c491e76ba904eba6591085e2af",
  "timestamp": "2025-05-15T03:26:54.513048"
}