{
  "id": 2607,
  "title": "Green financial risk management based on intelligence service",
  "abstract": "Risk management is an important issue of green finance, and it is also a prominent issue of green economic development. The resolution of green financial risk will help protect the interests of all stakeholders and promote the development of green finance. This study suggests that intelligence service provides new ideas and ways for green financial risk management. Applying intelligence service to green financial risk management will contribute to the sustainable development of green finance and enrich the theoretical system of intelligence science. This study first builds an intelligence service system of green financial risk management from five aspects: intelligence demand, intelligence collection, intelligence processing, intelligence application, and intelligence tracking. A questionnaire is designed based on this system. The first batch of green finance pilot cities in China (Ganjiang, Gui'an, Guangzhou, Huzhou, Quzhou, Changji, Hami, and Karamay) are investigated. This study uses a regression model to analyze the data and analyzes the intelligence service status of green financial risk management in pilot cities. The research divides those green finance pilot cities into eastern, central, and western regions. It shows obvious differences in the intelligence service elements in the eastern, central, and western regions of green financial risk management. The eastern region pays more attention to the three elements of intelligence demand, intelligence application, and intelligence tracking when carrying out green financial risk management. In the process of green financial risk management in the western region, there are obvious deficiencies in the two elements of intelligence collection and intelligence processing, which may be due to the lack of advanced digital equipment and effective digital resource. The central region lies between the eastern and western regions on intelligence service of green financial risk management. Based on the above results, this study proposes that establishing an intelligence center, sharing intelligence resources, improving digital technology, and updating intelligence cases can enhance the effectiveness of intelligence service in the risk management of green finance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "83178e4e881374c34c69f0043f8c3cdf",
  "timestamp": "2025-05-15T02:17:01.808268"
}