{
  "id": 6027,
  "title": "Repeatedly measured material and behavioral factors changed the explanation of socioeconomic inequalities in all-cause mortality",
  "abstract": "Objectives: We examined whether using repeatedly measured material and behavioral factors contributed differently to socioeconomic inequalities in all-cause mortality compared to one baseline measurement. Study Design and Setting: Data from the Dutch prospective GLOBE cohort were linked to mortality register data (1991-2013; N = 4,851). Socioeconomic position was measured at baseline by educational level and occupation. Material factors (financial difficulties, housing tenure, health insurance) and behavioral factors (smoking, leisure time physical activity, sports participation, and body mass index) were self-reported in 1991, 1997, and 2004. Cox proportional hazards regression and bootstrap methods were used to examine the contribution of baseline-only and time-varying risk factors to socioeconomic inequalities in mortality. Results: Men and women in the lowest educational and occupational groups were at an increased risk of dying compared to the highest groups. The contribution of material factors to socioeconomic inequalities in mortality was smaller when multiple instead of baseline-only measurements were used (25%-65% vs. 49%-93%). The contribution of behavioral factors was larger when multiple measurements were used (39%-51% vs. 19%-40%). Conclusion: Inclusion of time-dependent risk factors contributes to understanding socioeconomic inequalities in mortality, but careful examination of the underlying mechanisms and suitability of the model is required. (C) 2017 Elsevier Inc. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "832c69fc5d8e02b0001d9cfa64d20fc5",
  "timestamp": "2025-05-15T02:54:03.366623"
}