{
  "id": 5843,
  "title": "Auditor choice in Italian non-listed firms",
  "abstract": "Purpose - This paper aims to investigate auditor choice in those Italian non-listed firms adopting the traditional model of corporate governance. In Italy, non-listed firms can choose between two types of auditor: the Board of Statutory Auditors (BSA), that is the statutory auditors, or an external auditor. At the same time, a BSA conducts the administrative auditing for all companies with equity exceeding (sic)120,000. Design/methodology/approach - The paper estimates a logistic regression model of firm auditor choice between an external auditor and the BSA, which incorporates variables proxying for both agency conflict and organizational complexity effects. Findings - The results show that of the potential agency factors, only board independence drives auditor choice, whereas organizational complexity and risk factors including firm size, investment in inventories, subsidiary status and complexity drive auditor choice. These results may be explained in the administrative audit role of the BSA, which monitors both day-by-day firm operations and the financial statements preparation project. Stakeholders as a result are reassured that, in general, their interests are protected. Finally, it was found that legal form and voluntary International Financial Reporting Standards compliance exert an impact on auditor choice. Originality/value - The paper provides support for an internal yet independent auditing body such as the Italian BSA as a wider model for corporate governance in European non-listed firms (OECD, 2004 and 2015). The BSA as an administrative and financial auditing body made up solely of independent highly qualified professionals can work within the firm on an operational basis, and in so doing can increase stakeholder protection.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8339e32a8d947a4e55b83975ddc1f091",
  "timestamp": "2025-05-15T02:51:58.616424"
}