{
  "id": 67,
  "title": "Numerical solving of the generalized Black-Scholes differential equation using Laguerre neural network",
  "abstract": "Reasonable pricing of options in the financial derivatives market is crucial. For American options, or when volatility and interest rate are not constant, it is often difficult to obtain analytical solutions to the Black-Scholes (BS) equation. In this paper, the Laguerre neural network was proposed as a novel numerical algorithm with three layers of neurons for solving BS equations. The validity period and stock price are the input of the network, and the option price is the only output layer. Laguerre functions are used as the activation function of the neuron in the hidden layer. The BS equation and boundary conditions are set as penalty function, the training points are uniformly selected in the domain, and the improved extreme learning machine algorithm is used to optimize the network connection weights. Three experiments calculated the numerical solutions of BS equations for European options and generalized option pricing models. Compared with existing algorithms such as the finite element method and radial basis function neural network, the numerical solutions obtained by Laguerre neural network have higher accuracy and smaller errors, which illustrates the feasibility and superiority of the proposed method for solving BS equations. (C) 2021 Elsevier Inc. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "83630869e3a1b5612d7c9b4a9902e14c",
  "timestamp": "2025-05-15T01:28:03.894983"
}