{
  "id": 7739,
  "title": "Disease mapping: Geographic differences in population rates of interventional treatment for prostate cancer in Australia",
  "abstract": "Background Treatment decisions for men diagnosed with prostate cancer depend on a range of clinical and patient characteristics such as disease stage, age, general health, risk of side effects and access. Associations between treatment patterns and area-level factors such as remoteness and socioeconomic disadvantage have been observed in many countries.Objective To model spatial differences in interventional treatment rates for prostate cancer at high spatial resolution to inform policy and decision-making.Methods Hospital separations data for interventional treatments for prostate cancer (radical prostatectomy, low dose rate and high dose rate brachytherapy) for men aged 40 years and over were modelled using spatial models, generalised linear mixed models, maximised excess events tests and k-means statistical clustering.Results Geographic differences in population rates of interventional treatments were found (p<0.001). Separation rates for radical prostatectomy were lower in remote areas (12.2 per 10 000 person-years compared with 15.0-15.9 in regional and major city areas). Rates for all treatments decreased with increasing socioeconomic disadvantage (radical prostatectomy 19.1 /10 000 person-years in the most advantaged areas compared with 12.9 in the most disadvantaged areas). Three groups of similar areas were identified: those with higher rates of radical prostatectomy, those with higher rates of low dose brachytherapy, and those with low interventional treatment rates but higher rates of excess deaths. The most disadvantaged areas and remote areas tended to be in the latter group.Conclusions The geographic differences in treatment rates may partly reflect differences in patients' physical and financial access to treatments. Treatment rates also depend on diagnosis rates and thus reflect variation in investigation rates for prostate cancer and presentation of disease. Spatial variation in interventional treatments may aid identification of areas of under-treatment or over-treatment.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "836cba0c0f764afaaf94f867fadf9c8a",
  "timestamp": "2025-05-15T03:11:38.540833"
}