{
  "id": 4963,
  "title": "RISK FACTORS' PREDICTION MODEL FOR THE INVESTMENT EVALUATION",
  "abstract": "The article deals with the issue of increasing the competitiveness of enterprises and their long-term sustainability based on the efficiency of investment processes. Implementing new approaches to the company's decision-making processes will allow companies to overcome the pitfalls of the market environment created by the post-COVID period and the current energy crisis that has affected the world markets after the conflict between Ukraine and Russia. The article aims to verify the application of the methodology for increasing the competitiveness of enterprises based on the use of a model creating a fusion of traditional and sophisticated tools. The analyses carried out are based on the investment decisions of a real company operating in the Slovak Republic's territory in the production and supply of security products. Mathematical modelling and Monte Carlo simulation are based on the company's accounting and operational financial outputs (profit and loss statement, balance sheet). The methodology is based on mathematical modelling through static traditional financial approaches and their verification through sensitivity analysis, regression analysis and Monte Carlo simulation based on distributional distributions of risk factors. The output is the assessment of risk factors and their significance for the criterion value Net Present Value (NPV).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8370ce5fe3966a7d609b1a82ddc74c61",
  "timestamp": "2025-05-15T02:43:06.656199"
}