{
  "id": 4056,
  "title": "Simulation-based mine extraction sequencing with chance constrained risk tolerance",
  "abstract": "Technical and financial uncertainties present significant risks to the profitability and efficiency of mining operations. Unexpected realizations (e.g., price or grade) may result in catastrophic consequences. This phenomenon forces mining industries to use probabilistic decision-making tools to assess, mitigate, and manage the risks associated with these uncertainties. In this context, mining operations need robust schedules, which are insensitive to market changes and/or unexpected grade realizations. The mine production scheduling problem consists of three sub-problems: extraction sequencing (timing), ore-waste discrimination (classification) and production rates (utilization). The solutions to these problems are generated under significant parameter uncertainties. This paper proposes an extraction sequencing approach in which the net present value of a mining project is, for a given risk tolerance, maximized and the actual risk tolerance is then verified through Monte-Carlo simulations. The risk tolerance is a measure of uncertainty and that secures the project net present value with a given probability. Risk tolerance is derived through the use of standard deviations of block economic values in the medium of multiple grade and economic images of orebody. The proposed approach is demonstrated on a case study using gold mine data. The results of the case study show that the proposed approach, combining chance-constrained programming and Monte-Carlo simulation, can be used to solve the mine extraction sequencing problem in an uncertain financial and technical environment.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8388566023bd86f62cf0d2723407f126",
  "timestamp": "2025-05-15T02:32:27.637602"
}