{
  "id": 9009,
  "title": "The effect of urban heat islands on pediatric asthma exacerbation: How race plays a role",
  "abstract": "Background: Climate change disproportionately affects marginalized communities as seen with the urban heat island phenomenon. This is an example of environmental racism as it stems from past governmental policy: redlining. Environmental racism also leads to health inequities, as seen with asthma in Black communities. Studies have shown the relationship between the urban heat island phenomenon and asthma exacerbation; however, there is a gap in the data regarding racial differences and pediatric cases. The combination of urban heat, environmental racism, and asthma susceptibility creates a hazardous relationship in which Black children are at greater risk of asthma-related negative health outcomes. Purpose: The purpose of this study was to explore how the relationship between urban heat islands and pediatric asthma exacerbations differs in Black communities compared to White communities and to provide insight for policy makers in creating greater environmental and health equity. Methods: A quantitative ecologic study was conducted within the five boroughs of New York City in which the area was divided into 42 neighborhoods. Demographics, ambient air temperature, asthma emergency department (ED) visits, and covariate data were collected from various open data sources. Then, both Pearson partial correlation and a multiple linear regression were conducted utilizing IBM SPSS software. Results: There was a statistically significant positive correlation between asthma ED visits and percent of Black residents, r (35) = 0.41, p < .05, and a statistically significant negative correlation between asthma ED visits and the percent of White residents, r (35) = -0.44, p < .01. Similarly, multiple regression analysis showed that the percent of non-Hispanic Black residents and ambient air temperatures statistically significantly predicted the rate of asthma ED visits at F (3,38) = 22.354, p < .001. The adjusted R2 for the model was 0.61, p < .001. Discussion: Black communities are further impacted by asthma than White communities-and it seems like it is mostly due to race and its implications, including low socioeconomic status. Additionally, providing data on the correlation between urban heat islands and pediatric asthma exacerbations has great significance. Urban populations are projected to increase to approximately 68% by 2050. With more of the population susceptible to urban heat, it is imperative to address this relationship sooner rather than later. There are also long-term effects of persistent childhood asthma relating to education, physical health, mental health, intellectual development, and maternal health. Finally, there is a notable financial impact of pediatric asthma.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "839d6a65b5ae3d2d67dc9a2d55efd5d3",
  "timestamp": "2025-05-15T03:24:26.422080"
}