{
  "id": 2030,
  "title": "Democracies Linked To Greater Universal Health Coverage Compared With Autocracies, Even In An Economic Recession",
  "abstract": "Despite widespread recognition that universal health coverage is a political choice, the roles that a country's political system plays in ensuring essential health services and minimizing financial risk remain poorly understood. Identifying the political determinants of universal health coverage is important for continued progress, and understanding the roles of political systems is particularly valuable in a global economic recession, which tests the continued commitment of nations to protecting their health of its citizens and to shielding them from financial risk. We measured the associations that democracy has with universal health coverage and government health spending in 170 countries during the period 1990-2019. We assessed how economic recessions affect those associations (using synthetic control methods) and the mechanisms connecting democracy with government health spending and universal health coverage (using machine learning methods). Our results show that democracy is positively associated with universal health coverage and government health spending and that this association is greatest for low-income countries. Free and fair elections were the mechanism primarily responsible for those positive associations. Democracies are more likely than autocracies to maintain universal health coverage, even amid economic recessions, when access to affordable, effective health services matters most.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "83b8cb7cfd6d5b5be6c842b9e59e7495",
  "timestamp": "2025-05-15T02:10:25.732369"
}