{
  "id": 8698,
  "title": "Deployment-related quarantining-a risk or resilience factor for German military service members? A prospective analysis during the third-fifth waves of COVID-19",
  "abstract": "Background: Mandatory deployment-related quarantining added further constraints on soldiers during the pandemic. Contrary to overwhelming research documenting an adverse impact of quarantining on mental health, no adverse short-term mental health effects of pre-deployment quarantining for German soldiers were identified. Therefore, we are interested in a potentially delayed onset, the impact of an additional post-deployment quarantine, and quarantine-associated risk and resilience factors predicting mental health post-deployment.Methods: In a prospective research design, 928 German soldiers enrolled in the study at the in-processing of pre-deployment quarantine between February 2021 and March 2022. Every German military service member undergoing pre-deployment quarantine could participate. The soldiers were between 18 and 64 years old; 87.5% identified as male and 12.5% as female. Self-reported mental health (Mini-SCL), perceived social support (FSozU-K22), and perceived unit cohesion were assessed three to five times: at the beginning and the end of pre-deployment quarantine (Nt1 = 928, Nt2 = 907), if still mandatory-at the beginning and the end of post-deployment quarantine (Nt3 = 143 and Nt4 = 132), and 3 months post-deployment, on average 7 to 8 months later than pre-deployment quarantine (Nt5 = 308). The analyzed quarantine-associated risk and resilience factors were informedness about COVID-19, infection risk, quarantine benefit, clarity of quarantine protocol, need for intimacy/bonding, norms, stigma, practicality, financial disadvantages, boredom, and health-promoting leadership.Results: Despite four different mental health trajectories identified, repeated measures ANOVAs revealed a significant improvement in mental health post-deployment (F[2,265] = 21.54, p < 0.001), a small decrease in social support (F[2,266] = 16.85, p < 0.001), and no significant changes in unit cohesion (F[2,264] = 0.482, p = 0.618) 3 months post-deployment. Using stepwise regression, 24% of variance in mental health symptomatology post-deployment is predicted pre-deployment by a clear quarantine protocol, unit cohesion, intimacy/bonding, and social support (F[4,263] = 22.23, p < 0.001). In total, 30% of mental health at the end of post-deployment quarantine is predicted by stigma and a clear quarantine protocol (F[2,99] = 22.22, p < 0.001).Conclusion: Although no overall adverse impact of quarantining on mental health was found, it is recommended to address perceived stigma and clearly communicate the quarantine protocol, and to further follow up on the perceived decrease in social support.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "83eb42229b65d66a8b4655a8152f387d",
  "timestamp": "2025-05-15T03:21:24.715038"
}