{
  "id": 9252,
  "title": "Decision-making for birth location among women in Pakistan: evidence from national survey",
  "abstract": "Background: Pakistan ranks 149th in the maternal mortality ratio (MMR) and has failed to keep pace with other countries in the region, except Afghanistan, with respect to health indicators. Home deliveries are linked to a higher risk of maternal death; therefore, discouraging home deliveries is imperative to improve maternal health. This study provides a holistic view and analyses factors affecting home birth decisions within the context of maternal socio-demographic characteristics in Pakistan. Methods: The study exploits the latest data from the Pakistan Demographic and Health Survey (2012-2013), which includes a nationally representative sample of 13,558 women aged 15-49 years. However, the sample was reduced to 6977 women who had given birth in the 5 years preceding the survey. Statistical techniques, including bi-variate and multivariate logistic regression, were used to analyse the data. The dependent variable was dichotomous and coded as 0 for home deliveries and 1 for deliveries at a health facility. The dependent variable was constructed based on information regarding the most recent birth in the 5 years preceding the survey. Results: The study reveals that giving birth at home is highly prevalent among mothers in Pakistan (Baluchistan, 74%; Khyber-Pakhtunkhwa, 53%; Gilgit Baltistan, 46%; Punjab, 45% and Sindh, 34%) because of their difficulty obtaining permission to visit a health facility, financial barriers, the distance to health facilities and transportation. Substantial variation is observed when geo-demographic characteristics are considered. Higher home childbirth rates have been recorded in rural areas compared with those in urban areas (OR 1.32; p = 0.000). The likelihood of home birth is highest (OR 2.67; p = 0.000) among women in Baluchistan province and lowest (OR 0.48; p = 0.000) among mothers in Punjab province. After controlling for all odds ratios and demographic characteristics, the parents' education levels remain a significant factor (p = 0.000) that affects women's decisions to deliver at home rather than at a health facility. Conclusion: The study findings provide a better understanding of why women prefer to give birth at home. These results can help policymakers to introduce appropriate interventions to increase the number of deliveries at health facilities. These findings are expected to reduce maternal and neonatal mortality in Pakistan.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "83f35e1692a9c74cd6e1c5eb8be9cb3e",
  "timestamp": "2025-05-15T03:26:54.605082"
}