{
  "id": 9381,
  "title": "Using Preanesthesia Clinic Visits to Improve Advance Directives Completion: An Interrupted Time Series Analysis",
  "abstract": "BACKGROUND: Advance directives documentation can increase the likelihood that patient's wishes are respected if they become incapacitated. Unfortunately, completion rates are suboptimal overall, and disparities may exist, especially for vulnerable groups. We assessed whether implementing an initiative to standardize advance directives discussions during preanesthesia visits was associated with changes in rates of advance directives completion over time, and whether the association depends on race, insurance type, or income.METHODS: We conducted a before-after interrupted time series evaluation between January 1, 2015 and June 30, 2019 in a single-center, outpatient preanesthesia clinic. Participants were adults who visited the preanesthesia clinic at Cleveland Clinic and had >1 comorbidity before a noncardiac surgery of either medium or high risk. The intervention in March of 2017 consisted of training staff to help patients complete and witness advance directives documents during visits. We measured advance directives completion, by race, payor, and income (using the 2019 Federal Poverty Line). We assessed the confounder-adjusted association between intervention (pre versus post) and proportion of patients completing advanced directives over time using segmented regression to compare slopes between periods and assess changes at start of the intervention. We used similar models to assess whether changes depended on race, insurance type, or income level.RESULTS: We included 26,368 visits from 22,430 patients. We analyzed financial status for 16,788 visits from 14,274 patients who had address data. There were 11,242 (43%) visits preintervention and 15,126 (57%) visits postintervention. Crude completion rates for advance directives increased from 29% to 78%, with odds of completion an estimated 18 times higher than preintervention (odds ratio [95% CI] of 18 [16-21]; P < 0.001). Regarding race, Black patients had lower completion rates preintervention than White patients, although the gap steadily closed after the intervention (P = .001). Postintervention, both race groups immediately increased, with no difference in amount of increase (P = .17) or postintervention change in slope difference (P = .17). Regarding insurance, patients with Medicaid had lower preintervention completion rates than those with private. Intervention was associated with increases in both groups, but the difference in slopes (P = .43) or proportions (P = .23) between the groups did not change after intervention. Regarding the Federal Poverty Line, the completion rate gap between those below (<100%) and above (139%-400%) narrowed by approximately half (0.51: 95% CI, 0.27-0.98; P = .04).CONCLUSIONS: Standardizing advance directives discussions during preanesthesia visits was associated with more patients completing advance directives, particularly in vulnerable patient groups.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "840bba1033e1d80d63e90fd9f746178f",
  "timestamp": "2025-05-15T03:28:17.574496"
}