{
  "id": 5470,
  "title": "Step-wise multi-grained augmented gradient boosting decision trees for credit scoring",
  "abstract": "Credit scoring is an important financial tool for banks to determine whether to issue the loan to potential borrowers. Ensemble algorithms, which mainly can be divided into bagging ensembles and boosting ensembles, have shown great promise for credit scoring. However, some problems need to be further addressed: (1) Bagging-type algorithms enrich the feature diversity while keep the training target unchanged. However, these methods acting as feature augmentation process that highly rely on the training targets may increase the statistical similarity of the prediction results. (2) Though boosting-type ensemble algorithms avoid the problem of high prediction similarity, boosting algorithms always work on the original credit features leading to the lack of feature diversity. (3) A more intelligent credit risk management system should well balance the accuracy and its interpretability. Based on the above considerations, in this study, a step-wise multi-grained augmented gradient boosting decision trees (mg-GBDT) is proposed for credit scoring. In the proposed method, a multi-grained scanning is introduced for feature augmentation, which enriches the input feature of GBDT; the GBDT-based step-wisely optimization mechanism ensures low-deviation of credit scoring; besides, the proposed method inherits the good interpretability of tree-based structure, which provides intuitive reference results for policy-makers. Experiments on 6 credit datasets show that the proposed method outperforms classic GBDT. Moreover, numerical results indicate that mg-GBDT provides an alternative to neural network-based feature enhancement. Finally, the global interpretation results and the visualized decision path demonstrate that mg-GBDT can be a good choice for accurate credit scoring interpretation.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "841bfd3e62be8588aba3268730c73451",
  "timestamp": "2025-05-15T02:48:23.575424"
}