{
  "id": 7958,
  "title": "Pairs trading across Mainland China and Hong Kong stock markets",
  "abstract": "Motivated by the rationale that market inefficiency arises from a combination of less than fully rational demand and limits to arbitrage, this paper investigates the profitability of pairs trading across Mainland China and Hong Kong on highly liquid large-cap and midcap stocks from January 1996 to July 2017. We have three main findings. First, we find that pairs trading constrained within each market generates no significant abnormal returns. However, if investors can trade across Mainland China and Hong Kong, pairs trading is profitable after adjusting for risk and transaction costs, where the annualized abnormal return is 9% over the full sample. Second, by using a rolling-window regression, we find that the profitability of the strategy is time-varying. The bootstrap simulations suggest that the decline in profitability of the strategy since 2012 is due to random chance rather than poor ability of identifying mispriced stocks. However, the vast majority of profitable periods reflect the strategy's ability to choose profitable stocks rather than random chance. Third, the profitability of the strategy is somewhat sensitive to market conditions, most notably, the strategy is more profitable during longer term market turbulence. Overall, our empirical findings are consistent with the Adaptive Market Hypothesis in that the integration of financial markets and market conditions determine the level of market efficiency.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8423599e4fc3b9cc3d80403b81305ee8",
  "timestamp": "2025-05-15T03:13:30.736195"
}