{
  "id": 4497,
  "title": "Financial responsibility, financial context, and ambulatory blood pressure in early middle-aged African-American women",
  "abstract": "Background: African-American women have excess rates of elevated blood pressure (BP) and hypertension compared to women of all other racial/ethnic backgrounds. Several researchers have speculated that race and gender-related socioeconomic status (SES) stressors might play a role. Objective: To examine the association between a novel SES-related stressor highly salient among AfricanAmerican women, financial responsibility for one's household, and 48-h ambulatory BP. We further examined whether aspects related to African-American women's financial context (e.g., single parenthood, household income, marital status) played a role. Methods: Participants were N = 345 employed, healthy African-American women aged 30-46 from diverse SES backgrounds who underwent 48-h ambulatory BP monitoring. Linear regression analyses were conducted to examine associations between self-reported financial responsibility and daytime and nighttime BP, adjusting for age, SES and other sociodemographics, cardiovascular risk factors, financial strain and depressive symptoms. Interactions between financial responsibility and single parenthood, household income, and marital/partnered status were tested. Results: In age-adjusted analyses, reporting financial responsibility was associated with higher daytime systolic (beta = 4.42, S.E. = 1.36, p = 0.0013), and diastolic (beta = 2.82, S.E. = 0.98, p = 0.004) BP. Associations persisted in fully adjusted models. Significant associations were also observed for nighttime systolic and diastolic BP. There were no significant interactions with single parenthood, household income, nor marital/partnered status. Conclusion: Having primary responsibility for one's household may be an important driver of BP in early middleaged African-American women, independent of SES, financial strain, and across a range of financial contexts. Future studies examining prospective associations are needed, and policy interventions targeting structural factors contributing to financial responsibility in African-American women may be warranted.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "842a034be9c87016c2fe17633694c81f",
  "timestamp": "2025-05-15T02:37:47.562210"
}