{
  "id": 1367,
  "title": "Study on Capital Risk Assessment Model of Real Estate Enterprises Based on Support Vector Machines and Fuzzy Integral",
  "abstract": "As the main intermediary of financial transaction, the Real Estate enterprises are the weatherglass of state's economic condition. Real Estate enterprises also play an important role in reducing economical risk and the unstable factor, guarantying the national economy healthily. The Real Estate enterprises itself undertakes various types risk in the operation, including credit risk, fluid risk, capital risk and policy risk and so on. Capital risk holds the special important status in each kind of risk, which is the most primary factor that causes Real Estate enterprises bankrupt. Traditional capital risk evaluating methods always only estimate the risk factors which exist in corporate itself, while seldom consider the influence which the enterprises' deposit, loan structure and capital risk condition bring upon. These methods lead to the absence of the assessment subject and results in inevitable systematic error. In this essay, support vector machines (SVM) and fuzzy integral is introduced. The result of basing on voting ensemble SVM, single SVM, fuzzy nerve network and basing on fuzzy integral ensemble SVM are compared in the essay. support vector machines and fuzzy integral is better than three of others. We can conclude from figures and tables that the result of basing on fuzzy integral support vector machines is satisfaction.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "84352db7f7d76ef82a67b547586b8930",
  "timestamp": "2025-05-15T02:02:22.648845"
}