{
  "id": 7847,
  "title": "Rates and predictors of readmission after minor lower extremity amputations",
  "abstract": "Objective: One goal of the Patient Protection and Affordable Care Act is to reduce hospital readmissions, with financial penalties applied for excessive rates of unplanned readmissions within 30 days among Medicare beneficiaries. Recent data indicate that as many as 24% of Medicare patients require readmission after vascular surgery, although the rate of readmission after limited digital amputations has not been specifically examined. The present study was therefore undertaken to define the rate of unplanned readmission among patients after digital amputations and to identify the factors associated with these readmissions to allow the clinician to implement strategies to reduce readmission rates in the future. Methods: The electronic medical and billing records of all patients undergoing minor amputations (defined as toe or transmetatarsal amputations using International Classification of Diseases, Ninth Revision, codes) from January 2000 through July 2012 were retrospectively reviewed. Data were collected for procedure-and hospital-related variables, level of amputation, length of stay, time to readmission, and level of reamputation. Patient demographics included hypertension, diabetes, hyperlipidemia, smoking history, and history of myocardial infarction, congestive heart failure, peripheral arterial disease, chronic obstructive pulmonary disease, and cerebrovascular accident. Results: Minor amputations were performed in 717 patients (62.2% male), including toe amputations in 565 (72.8%) and transmetatarsal amputations in 152 (19.5%). Readmission occurred in 100 patients (13.9%), including 28 (3.9%) within 30 days, 28 (3.9%) between 30 and 60 days, and 44 (6.1%) >60 days after the index amputation. Multivariable analysis revealed that elective admission (P < .001), peripheral arterial disease (P < .001), and chronic renal insufficiency (P = .001) were associated with readmission. The reasons for readmission were infection (49%), ischemia (29%), nonhealing wound (19%), and indeterminate (4%). Reamputation occurred in 95 (95%) of the readmitted patients, including limb amputation in 64 (64%) of the patients (below knee in 58, through knee in 2, and above knee in 4). Conclusions: Readmission after minor amputation was associated with limb amputation in the majority of cases. This study identified a number of nonmodifiable patient factors that are associated with an increased risk of readmission. Whereas efforts to reduce unplanned hospital readmissions are laudable, payers and regulators should consider these observations in defining unacceptable rates of readmission. Further, although beyond the scope of this study, it is not unreasonable to assume that pressure to reduce readmission rates in the population of patients with extensive comorbidity may induce practitioners to undertake amputation at a higher level initially to minimize the risk of readmission for reamputation and associated financial penalties and thus deprive the patient the chance for limb salvage.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8449469b95ced8b317eec8eecca88d4e",
  "timestamp": "2025-05-15T03:12:36.534049"
}