{
  "id": 4084,
  "title": "The relationship between political instability and stock market performance: An analysis of the MSCI index in the case of Pakistan",
  "abstract": "The stock market is the barometer of the economy that reflects the overall health and direction of the economic development and is affected by different factors including social, environmental and political. It is important to investigate the effect of the political instability on the stock market performance, especially on emerging economies. Therefore, we aim to study the relationship between political instability and stock market performance in Pakistan. To meet our objectives, we used past data from 1996 to 2021. Data are collected from the DataStream data base. MSCI indices are used as the proxy for the Stock market performance of the selected country. World governance six indicators are used in the study as the explanatory variable concentrating the political instability index as the main explanatory variable. Regression analysis is used but two-way robustness analysis was done for the accuracy of the findings through GMM methods and taking GDP as another endogenous variable. Our findings shows that the political stability has significant positive impact on the stock market performance while, political instability has negative impact on stock market performance. Moreover, other governance indicators has a significant positive impact on performance. However, political instability disrupts the operations and economical activities that leads to decrease the investor confidence and also decrease the foreign investment with the increment of the risk in the country. Moreover, our study has some implications for investors to develop the diversified portfolio to minimize the risk and policy makers can increase their foreign direct investment within the economy by controlling the political instability.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "844b00807458b66e504676c924f9ec83",
  "timestamp": "2025-05-15T01:23:27.441389"
}