{
  "id": 8510,
  "title": "Prevalence and factors associated with suicidal behaviors among domestic workers",
  "abstract": "BackgroundDue to urbanization and changes in family structure, the need for domestic workers has surged in many developing countries, including Rwanda. While being employed as a domestic worker presents financial benefits to many of them and their dependents, it also comes with risks and difficulties that might harm the domestic worker's mental health.AimThis study aimed to determine the prevalence and factors associated with suicidal behaviors (i.e., suicidal ideations, plans, and attempt(s)) among domestic workers in Rwanda.MethodIn this cross-sectional study, data was captured from 884 domestic workers in Kigali, Rwanda. Suicidal ideation was measured using questions from the General Health Questionnaire (GHQ-28), while suicide attempts and plans were measured using questions adopted from previous studies in the region. The methods used/plan to attempt suicide were also captured from individuals with a recent history of suicide plan/attempt(s). Three separate regression models were employed to ascertain the factors associated with suicidal behaviors.ResultsThe prevalence of past-year suicidal behaviors was 32.5% for suicidal ideations, 9.5% for suicide plans, and 7.8% for suicidal attempts. Being female and having a chronic medical illness were linked to a higher risk of participating in any form of suicidal behavior. Suicidal ideations were less likely to occur among those who attained secondary education. However, more years of working as a domestic worker were associated with an increased likelihood of suicidal ideations. Having more than five dependents at work increased the likelihood of experiencing suicidal plans or attempts among domestic workers. For those who attempted suicide, overdosing with medications/drugs was the most common method of attempting.ConclusionDomestic workers have prevalent suicide behaviors, especially among females and those with a chronic medical illness, more years of work experience, and those with many household members at work. Based on the present study, for domestic workers at risk, there is a critical need for focused mental health interventions and support networks in various sectors of the domestic labor force.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "846be57c32000dd800b0628e950e38e6",
  "timestamp": "2025-05-15T03:19:21.393479"
}