{
  "id": 5308,
  "title": "Connecting psychosocial and personality characteristics with mental health outcomes. An Italian co-twin control study",
  "abstract": "Exposure to stressful life events is common, and it is linked to increased psychological issues. As most likely people respond to stressors depending on environmental and genetic factors, we assessed in a twin study the association of some personal characteristics such as resilience and self-perception with anxiety, depression and stress in the late Covid pandemic period, to verify the underlying genetic and shared familial components. With this design, the strength of the associations was compared between individual-level and intrapair-level analyses. From June 2020 to December 2021, the Italian Twin Registry conducted a three-wave longitudinal study among adult twins using validated questionnaires, and 1,763 adult twins participated in the study (mean age 46 years, 67 % females, 70 % monozygotic). A regression-based within-pair differences model was applied to control for genetic and shared environmental confounding. Results showed that anxiety was linked negatively with resilience, social support and perceived health, and positively with risk perception and hypochondria. Depression was associated negatively with resilience, social support and perceived health, and positively with financial concern and hypochondria. Stress was associated negatively with resilience and perceived health, and positively with financial concern, risk perception and hypochondria.These results suggest potential etiological effects of the above-mentioned risk factors. While our findings need to be confirmed by longitudinal studies, they propose potential etiological models for mental disorders, indicating that addressing in the clinical practice factors such as self-perception, personality traits (resilience), environmental resources (social support), and comorbid disorders (hypochondria) could have therapeutic benefits while treating certain common mental disorders.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "847144a9b139c9237a020ae8cbb0038d",
  "timestamp": "2025-05-15T02:46:16.288688"
}