{
  "id": 5878,
  "title": "Determinants of Catastrophic Health Expenditure and Its Impact on Poverty in Deltaic Country: Evidence From Bangladesh",
  "abstract": "Universal health coverage, including financial risk protection, remains a critical challenge in low- and middle-income countries like Bangladesh, where out-of-pocket (OOP) healthcare payments often lead to financial distress, especially in climate-vulnerable regions. Addressing this gap, the study examines the determinants of catastrophic health expenditure (CHE) and its impact on poverty in seven climatic zones of Bangladesh. Using a probit and fixed-effects regression models with longitudinal data from 75,840 households spanning 2000-2016, the study identified a rising incidence of CHE, particularly in coastal regions, which resulted in the annual impoverishment of 9% of the population (14.5 million individuals nationally). Key findings revealed that female-headed households, larger family size, the presence of children, elderly individuals, reproductive women, chronic illness, lower economic status, and rural areas exacerbated CHE, while higher education, earning capacity, access to electricity, safe water, and sanitation reduced its occurrence. To support the Sustainable Development Goals (SDGs), particularly SDG 1 (no poverty), SDG 3 (good health and well-being), and SDG 13 (climate action), policymakers and development partners are urged to promote prepayment healthcare systems, invest in social protection programs, and develop alternative financing mechanisms to alleviate CHE and its poverty implications, thereby advancing equitable and sustainable development.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8477cfb3077c63dcf69dc7644cda1979",
  "timestamp": "2025-05-15T02:52:31.394510"
}