{
  "id": 6101,
  "title": "Does CEO age matter in auditor choice and audit pricing? The role of CEO dominance",
  "abstract": "PurposeThis study examines the impact of the age of the chief executive officer (CEO) on the demand for audit quality, as reflected in auditor choice and audit fees. Furthermore, the study investigates whether CEO dominance moderates the association between CEO age, auditor choice and audit fees.Design/methodology/approachUsing a sample of 14,066 firm-year observations from 2000 to 2017, the study employs logistic regression and ordinary least squares (OLS) regressions to estimate the research models. The study also employs various techniques to address the endogeneity issue in the findings.FindingsUsing industry specialist auditors and brand name (Big 4) auditors as proxies, the study finds that firms with older CEOs are more likely to appoint higher-quality auditors. The study also finds that firms with older CEOs pay higher audit fees than firms with younger CEOs, which is likely to be due to increased demand for higher-quality audits and to risk aversion among older CEOs. In addition, the study finds that CEO dominance attenuates the positive association of CEO age with auditor choice and audit fees. The findings are found to be robust in our analyses, which address the endogeneity issue with firm fixed effects, two-stage least squares (2SLS) regression and entropy balancing. In addition, the study provides evidence that the positive association between CEO age and audit pricing persists when firms replace younger CEOs with older CEOs.Research limitations/implicationsThe study's findings suggest that the United States (US) Securities and Exchange Commission (SEC) and the Public Company Accounting Oversight Board (PCAOB) may need to be more cautious when monitoring financial statements from firms with younger CEOs.Originality/valueThis study contributes to a growing stream of research investigating the links between managers' idiosyncratic age differences and the quality of financial reporting and corporate decisions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8479c2d091a1b277b85d878e0ed5575d",
  "timestamp": "2025-05-15T02:54:39.099151"
}