{
  "id": 4719,
  "title": "Financial knowledge and responsible credit card behavior: exploring mediators and moderators",
  "abstract": "PurposeUnder the background of low consumer financial knowledge and accumulated credit card liabilities, this study investigates the relationship between financial knowledge and responsible credit card behavior using data from the 2019 China Household Finance Survey (CHFS). From the perspective of consumer economic well-being, this study defines accruing credit card debt to buy houses and cars when loans with lower interest rates are available as irresponsible credit card behavior.Design/methodology/approachThis study uses probit regressions to examine the association between financial knowledge and responsible credit card behavior because the dependent variable is a dummy variable. To alleviate endogeneity problems, this study uses instrument variables and Heckman's two-step estimation. Furthermore, to explore the potential mediators in this process, this study follows the stepwise regression method. Finally, this study introduces interaction terms to examine whether this association differs in different groups.FindingsThe results indicate that financial knowledge is conducive to increasing the probability of responsible credit card behavior. Mediating analyses reveal that the roles of financial knowledge occur by increasing the degree of concern for financial and economic information and the propensity to plan. Moderating analyses show that the effects of financial knowledge on responsible credit card behavior are stronger among risk-averse consumers and in regions with favorable digital access.Originality/valueThis study measures responsible credit card behavior from the perspective of the consumer's well-being, which enriches practical implications for consumer finance. Furthermore, this study explores the potential mediators influencing the process of financial knowledge that affects responsible credit card behavior and identifies moderators to conduct heterogeneous analyses, which helps comprehensively understand the nexus between financial knowledge and credit card behavior. By achieving these contributions, this study helps to curb the adverse effects of irresponsible credit card behavior on consumers' well-being and the economic system and helps policymakers promote financial knowledge to fully prevent irresponsible credit card behavior.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "849bf8da962887e27c77b0602b867c81",
  "timestamp": "2025-05-15T02:40:27.867837"
}