{
  "id": 2552,
  "title": "New product performance advantages for extending large, established fast moving consumer goods (FMCG) brands",
  "abstract": "Purpose - This paper aims to investigate how the current size and structure of a branded product portfolio impacts new product performance for fast-moving consumer goods (FMCG), testing the long-standing proposition that extending a firm's brand and product portfolio too far is a dangerous proposition that may damage the market performance of the firm's new product launches. Design/methodology/approach - Aspects associated with brand size and structure that may impact new product performance are operationalized along two key dimensions: within-category (scale) and cross-category (scope). The impact of the brand's scale and scope on the sales performance of newly commercialized products by the brand is empirically investigated in the context of FMCG. Over 2,000 new products launched in 2009 and 2010 across 31 food and non-food FMCG product categories in the USA are included in the regression-based analysis. Findings - The authors find strong evidence that brands with broader within-category scale and cross-category scope overall are associated with more successful new product introductions, and that these influences generally are driven more by increased product trial than by repeat or persistence. The authors argue that the higher new product performance observed for more established and proliferated brands may be attributed to advantages of firm product development abilities and product acceptance by the marketplace. Originality/value - The current results serve to temper the strong cautions set forth in much of the marketing literature about the dangers of overextending the firm's brand and product portfolio. These results also suggest that future research should be conducted to further understand more nuanced implications of how best to grow the scale and scope of the firm's brand and product portfolio.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "84b40dbfa8365a72d171750bca2edad4",
  "timestamp": "2025-05-15T01:08:10.767111"
}