{
  "id": 8063,
  "title": "Non-fungible Tokens as an Alternative Investment: Evidence from CryptoPunks",
  "abstract": "The Non-fungible Token (NET) market has experienced extraordinary growth since the beginning of 2021. This has attracted attention from investors who are seeking alternative investments. However, the investment performance of the NFT market has not been investigated yet. This paper explores NFTs as an alternative investment. More specifically, it investigates the NFT collection CryptoPunks as an investment option with the focus on evaluating the investment performance, assessing the variables that determine prices, calculating the portfolio diversification potential, and comparing the investment performance to other financial assets. Therefore, a quantitative study with secondary data is conducted using the hedonic regression method. Data on CryptoPunks and other asset types are retrieved from different public domains. The time frame that is observed is 1 June 2018 until 31 May 2021. The CryptoPunk data set includes 11,864 transactions with information on the collectible and the sale. lhe results indicate that CryptoPunks would have been the best investment over the past three years with an average monthly return of 34.19% and a standard deviation of 61.76%. Next to that, the Sharpe ratio indicates a good retum-risk trade-off One other main finding is that the rarity of the attributes and type of the CryptoPunk has a positive effect on prices. Besides that, CryptoPunks has portfolio diversification potential due to relatively low correlation with other asset classes. This paper provides one of the first statistical explorations of NFTs from an economic perspective. The paper also examines the potential of NFTs as an alternative investment asset. The paper concludes that (based on the period studied) NFT collectibles can be a viable investment, with good returns, and a diverse risk profile that is uncorrelated from other benchmark assets, such as art, treasury bills, and major cryptocurrencies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "84ca348dfddbaa5617e4d77abde07433",
  "timestamp": "2025-05-15T03:15:09.291455"
}