{
  "id": 3106,
  "title": "Role of financial constraints and risk-taking on the relationship between financial reporting quality and investment efficiency: emerging and frontier markets' perspective",
  "abstract": "PurposePrior evidence that financial reporting quality (FRQ) of publicly listed firms improves investment efficiency in developed markets leaves unaddressed questions of whether this relationship holds in emerging and frontier markets and what channels influence this relationship. This study aims to test the role of financial constraints faced by firms and managerial risk-taking on the association of FRQ and investment efficiency in 13,231 publicly listed firms in 24 emerging and frontier markets.Design/methodology/approachAvailable accounting data from 1998 to 2022 are collected for all listed firms across 41 industries in 24 countries. Causal relationships are tested using fixed-effect regression analysis, several additional tests and robustness checks are applied using alternative proxies and concerns for endogeneity are addressed using two-stage least square and system generalised method of moments analysis.FindingsFindings show that FRQ of firms in emerging and frontier markets positively affects investment efficiency, the affirmative impact of FRQ on investment efficiency is higher when firms are facing more financial constraints and when managerial risk-taking is lower and financial constraints and risk-taking have a more pronounced impact on the link between FRQ and investment efficiency in the under-investment scenario.Originality/valueThese findings contribute to the growing body of evidence, shedding light on the meticulous interplay between FRQ and investment efficiency in frontier and emerging markets. Specifically, the increased financial constraints encountered by firms and a more conservative approach to managerial risk-taking emerge as crucial factors complementing this relationship.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "84dc0945a65b3112c7624b4fbb27e34f",
  "timestamp": "2025-05-15T02:22:25.191591"
}