{
  "id": 9018,
  "title": "Sex disparity in childhood cancer in India: a multi-centre, individual patient data analysis",
  "abstract": "Background Sex disparity and its determinants in childhood cancer in India remain unexplored, with scarce information available through summary statistics of cancer registries. This study analysed the degree of sex bias in childhood cancer in India and its clinical and demographical associations.Methods In this retrospective, multicentre cohort study, we collected individual data of children (aged 0-19 years) with cancer extracted from the hospital-based records of three cancer centres in India between Jan 1, 2005, and Dec 31, 2019, and two population-based cancer registries (PBCRs; Delhi [between Jan 1, 2005, and Dec 31, 2014] and Madras Metropolitan Tumour Registry [between Jan 1, 2005, and Dec 31, 2017]). We extracted data on age, sex, and confirmed diagnosis of malignancy (according to the International Classification of Diseases-10 coding), and excluded participants if they were without a recorded diagnosis, had a benign diagnosis, had missing sex information, resided outside of India, or were a donor for haematopoietic stem cell transplantation (HSCT). The primary outcome was the male-to-female incidence rate ratio (MF-IRR) in the two PBCRs and the male-to-female ratios (MFR) from the hospital-based and the HSCT data. For PBCR data, MF-IRR was estimated by dividing the MFR by the total population at risk. MFR was analysed for patients seeking treatment at the cancer centres and for those undergoing HSCT. Logistic regression analyses were done to explore the association of clinical and demographical variables with sex of the patients seeking treatment and those undergoing HSCT in hospital-based data and multivariable analyses were done to determine independent sociodemographic predictors of sex bias. Annual time trends of MFR and MF-IRR during the 15-year study period were ascertained by time series regression analyses.Findings We included 11 375 children from PBCRs in the study. 26 891 children from hospital-based records were screened, and data from 22 893 (85middot1%) were included (including 514 who underwent HSCT). Residence details were missing for 257 (1middot1%) of 22 893 patients from hospital-based records. The crude MFR of children at diagnosis was in favour of boys: 2middot00 (95% CI 1middot92-2middot09) in the Delhi PBCR and 1middot44 (1middot32-1middot57) in Madras Metropolitan Tumour Registry. The MF-IRRs for cancer diagnosis were also skewed in favour of boys in both PBCRs (Delhi 1middot69 [95% CI 1middot61-1middot76]; Madras Metropolitan Tumour Registry 1middot37 [1middot26-1middot49]). The MFR for children seeking treatment from hospital-based records was 2middot06 (95% CI 2middot00-2middot12) in favour of boys. In subgroup analyses, the proportion of boys seeking treatment was higher in northern India than southern India (p<0middot0001); in private centres than in centres providing subsidised treatment (p<0middot0001); in patients with haematological malignancies than those with solid malignancies (p<0middot0001); in those residing 100 km or further from the hospital than those within 100 km of a hospital (p<0middot0001); and those living in rural areas than those living in urban areas (p=0middot0006). The MFR of 514 children who underwent HSCT was 2middot81 (95% CI 2middot32-3middot43) in favour of boys. Time trend analysis showed that MFR did not show any significant annual change in either the overall cohort or in any of the individual centres for hospital-based data; however, the analysis did show a declining MF-IRR in the Delhi PBCR from 2005 to 2014 (p=0middot031). Interpretation The sex ratio for childhood cancer in India has a bias towards boys at the level of diagnosis, which is more pronounced in northern India and in situations demanding greater financial commitment. Addressing societal sex bias and enhancing affordable health care for girls should be pursued simultaneously in India.Funding None.Copyright (c) 2022 Published by Elsevier Ltd. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "84f08be28b336d0bd904a7dfa45125b9",
  "timestamp": "2025-05-15T03:24:54.871620"
}