{
  "id": 8344,
  "title": "Effect of Regional Hospital Competition and Hospital Financial Status on the Use of Robotic-Assisted Surgery",
  "abstract": "IMPORTANCE Despite the lack of efficacy data, robotic-assisted surgery has diffused rapidly into practice. Marketing to physicians, hospitals, and patients has been widespread, but how this marketing has contributed to the diffusion of the technology remains unknown. OBJECTIVE To examine the effect of regional hospital competition and hospital financial status on the use of robotic-assisted surgery for 5 commonly performed procedures. DESIGN, SETTING, AND PARTICIPANTS A cohort study of 221 637 patients who underwent radical prostatectomy, total nephrectomy, partial nephrectomy, hysterectomy, or oophorectomy at 1370 hospitals in the United States from January 1, 2010, to December 31, 2011, was conducted. The association between hospital competition, hospital financial status, and performance of robotic-assisted surgery was examined. MAIN OUTCOMES AND MEASURES The association between hospital competition was measured with the Herfindahl-Hirschman Index (HHI), hospital financial status was estimated as operating margin, and performance of robotic-assisted surgery was examined using multivariate mixed-effects regression models. RESULTS We identified 221 637 patients who underwent one of the procedures of interest. The cohort included 30 345 patients who underwent radical prostatectomy; 20 802, total nephrectomy; 8060, partial nephrectomy; 134 985, hysterectomy; and 27 445, oophorectomy. Robotic-assisted operations were performed for 20 500 (67.6%) radical prostatectomies, 1405 (6.8%) total nephrectomies, 2759 (34.2%) partial nephrectomies, 14 047 (10.4%) hysterectomies, and 1782 (6.5%) oophorectomies. Use of robotic-assisted surgery increased for each procedure from January 2010 through December 2011. For all 5 operations, increased market competition (as measured by the HHI) was associated with increased use of robotic-assisted surgery. For prostatectomy, the risk ratios (95% CIs) for undergoing a robotic-assisted procedure were 2.20 (1.50-3.24) at hospitals in moderately competitive markets and 2.64 (1.84-3.78) for highly competitive markets compared with noncompetitive markets. For hysterectomy, patients at hospitals in moderately (3.75 [2.26-6.25]) and highly (5.30; [3.27-8.57]) competitive markets were more likely to undergo a robotic-assisted surgery. Increased hospital profitability was associated with use of robotic-assisted surgery only for partial nephrectomy in facilities with medium-high (1.67 [1.13-2.48]) and high (1.50 [0.98-2.29]) operating margins. With analysis limited to patients treated at a hospital that had performed robotic-assisted surgery, there was no longer an association between competition and use of robotic-assisted surgery. CONCLUSIONS AND RELEVANCE Patients undergoing surgery in a hospital in a competitive regional market were more likely to undergo a robotic-assisted procedure. These data imply that regional competition may influence a hospital's decision to acquire a surgical robot.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "84f46711b8d2024e1b1d585e4e4ce498",
  "timestamp": "2025-05-15T03:17:49.165951"
}