{
  "id": 171,
  "title": "New reinforcement learning based on representation transfer for portfolio management",
  "abstract": "Portfolio management is an important financial task, which helps to activate the capital market and boost investor confidence by finding a long -term profitable policy. Reinforcement learning is one of the most prospective method for this task. However, the policy learnt by reinforcement learning lacks robustness, because current studies cannot overcome the distribution shift between the dynamics of the current environment and the future environment. To better tackle this issue, we proposed a method that can align the distributions of different environment dynamics in a pre-trained representation space, thereby enhancing the robustness of the optimal policy in future environments. The key insight of this method is to only extract shared representation between the current and the future, which is the high -level latent information that spans across sequences. This information exists everywhere in the historical sequence, so it can be assumed that it will not disappear in the near future, thus align the distribution of different environment dynamics in this representation space. Such representations are learnt by encoding the current and the future into representations and maximizing their mutual information using probabilistic contrastive loss. Experiments demonstrates the superior performance and universality of our method.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "84fc71532f313344ba0a8a119bacc1b2",
  "timestamp": "2025-05-15T00:40:02.111529"
}