{
  "id": 2575,
  "title": "The directional spillover effects and time-frequency nexus between stock markets, cryptocurrency, and investor sentiment during the COVID-19 pandemic",
  "abstract": "PurposeThis paper aims to analyze the connectedness between Gulf Cooperation Council (GCC) stock market index and cryptocurrencies. It investigates the relevant impact of RavenPack COVID sentiment on the dynamic of stock market indices and conventional cryptocurrencies as well as their Islamic counterparts during the onset of the COVID-19 crisis.Design/methodology/approachThe authors rely on the methodology of Diebold and Yilmaz (2012, 2014) to construct network-associated measures. Then, the wavelet coherence model was applied to explore co-movements between GCC stock markets, cryptocurrencies and RavenPack COVID sentiment. As a robustness check, the authors used the time-frequency connectedness developed by Barunik and Krehlik (2018) to verify the direction and scale connectedness among these markets.FindingsThe results illustrate the effect of COVID-19 on all cryptocurrency markets. The time variations of stock returns display stylized fact tails and volatility clustering for all return series. This stressful period increased investor pessimism and fears and generated negative emotions. The findings also highlight a high spillover of shocks between RavenPack COVID sentiment, Islamic and conventional stock return indices and cryptocurrencies. In addition, we find that RavenPack COVID sentiment is the main net transmitter of shocks for all conventional market indices and that most Islamic indices and cryptocurrencies are net receivers.Practical implicationsThis study provides two main types of implications: On the one hand, it helps fund managers adjust the risk exposure of their portfolio by including stocks that significantly respond to COVID-19 sentiment and those that do not. On the other hand, the volatility mechanism and investor sentiment can be interesting for investors as it allows them to consider the dynamics of each market and thus optimize the asset portfolio allocation.Originality/valueThis finding suggests that the RavenPack COVID sentiment is a net transmitter of shocks. It is considered a prominent channel of shock spillovers during the health crisis, which confirms the behavioral contagion. This study also identifies the contribution of particular interest to fund managers and investors. In fact, it helps them design their portfolio strategy accordingly.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "84fe0c051a899485c2a6a6fa5728a4c4",
  "timestamp": "2025-05-15T01:08:10.911142"
}