{
  "id": 4619,
  "title": "Social isolation in Asian Americans: risks associated with socio-demographic, health, and immigration factors",
  "abstract": "Objectives The present study examined the factors associated with social isolation in Asian Americans. Three types of social isolation (social isolation from family, social isolation from friends, and overall social isolation), identified by the Lubben Social Network Scale-6, were examined with a sample of Asian Americans representing diverse ethnic groups (Chinese, Asian Indian, Korean, Vietnamese, Filipino, and other Asians) and a broad age range (18-98). Design Using data from the 2015 Asian American Quality of Life Survey (N = 2609), logistic regression models examined how each type of social isolation was predicted by sociodemographic (age, gender, ethnic origin, marital status, education, and perceived financial status), health-related (chronic medical conditions and self-rated health), and immigration-related (proportion of life in the United States and English proficiency) variables. Results The percentage of the sample that fell into the category of social isolation from family, social isolation from friends, and overall isolation ranged from 18.2% to 19.3%. At 36% in the friend category and 33% in the overall category, the Vietnamese sample showed a heightened risk of social isolation. Regression analyses indicated that, for both family and friend categories, individuals who were in the middle-aged group (40-59 years old) and who had limited English proficiency demonstrated higher odds of being isolated. Reflecting relational differences in family and friend networks, the risk associated with unmarried status was specific to social isolation from family, whereas having unmet financial needs was only associated with social isolation from friends. Conclusions The study findings expand our understanding of the multiple domains of social isolation in an understudied population and emphasize the importance of developing prevention and intervention programs to foster social connectedness among Asian Americans. Our findings on risk factors and ethnic variations help identify the groups to be prioritized in intervention efforts and suggest ways to approach them.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "850763e897acf911e355d3d50b53ed18",
  "timestamp": "2025-05-15T02:39:26.932511"
}