{
  "id": 4577,
  "title": "Understanding disparities and barriers associated with pediatric transplant evaluation and time to listing: Moving toward a more comprehensive picture",
  "abstract": "Background Delayed time to listing (TTL) for pediatric transplant patients is associated with increased risks of mortality and morbidity. The full range of health disparities, sociodemographic factors, and other barriers associated with delays in listing in the pediatric transplant candidate evaluation process has not been fully examined. Methods Retrospective chart reviews were conducted for 183 kidney, liver, and heart transplant candidates ages 0-18 who were referred for evaluation during 2012-2015. Demographic information and potential barriers (e g., social/medical factors, financial concerns) were gathered from pre-transplant evaluations and included in a comprehensive model to evaluate mechanisms that explain differences in TTL. Descriptive statistics, logistic regression models, Cox proportional hazards models, and path analysis were used for analyses. Results Candidates included 26.8% heart, 33.3% liver, and 39.9% kidney patients. The most common barrier to listing was financial (71.6%), followed by caregiver psychological or substance use (57.9%), and medical problems (49.7%). Higher age, kidney, and liver organ type (relative to the heart), and presence of social, medical, administrative/motivation, and financial barriers were all directly associated with longer TTL. Public insurance was indirectly associated with TTL through social, administrative/motivation, and financial barriers. Organ type was indirectly associated with TTL through financial barriers. Conclusions Results suggest social problems, administrative issues, and financial issues act as mechanisms through which insurance type and liver transplant candidates face increased risk of delays in transplant listing time. There are numerous clinical implications and interventions that are warranted to reduce TTL among pediatric transplant candidates with co-occurring barriers.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8511c1a0ebeba77397dbf2b35995b759",
  "timestamp": "2025-05-15T02:38:56.279741"
}