{
  "id": 4944,
  "title": "Evaluation of geriatric trauma in dogs with moderate to severe injury (6169 cases): A VetCOT registry study",
  "abstract": "Objective To examine geriatric classification as a predictor of survival in moderate to severely injured dogs denoted by animal trauma triage (ATT) scores >= 3 or modified Glasgow Coma Scale (mGCS) scores <= 14. Design Retrospective observational cohort study utilizing data collected between September 2013 and May 2019 with follow-up until death or hospital discharge. Setting Thirty-one trauma centers including university teaching hospitals and private referral centers. Animals A total of 6169 dogs entered into the Veterinary Committee on Trauma Registry with complete data entry including age, weight, outcome, mGCS (<= 14), and/or ATT (>= 3). Interventions None. Measurements and Main Results The effect of geriatric classification on survival was estimated using shared-frailty cox proportional hazard models. Model 1 dependent variables: death despite intervention or euthanasia due to grave prognosis. Model 2 dependent variables: death by euthanasia due to financial influence or combined influence of finances and grave prognosis. Model 3 evaluated interactions between geriatric classification and moderate versus severe trauma. The shared-frailty models controlled for contributing site as a random effect and other confounding variables, including trauma severity. Model 1: geriatrics had a significantly increased hazard risk (HR) for death (HR = 1.48, P < 0.0001). Model 2: geriatrics had an insignificant increased HR for death (HR = 1.34, P = 0.08). Model 3: geriatrics demonstrated significantly increased mortality risk with moderate level trauma. Additional Model 1 variables independently associated with mortality include ATT perfusion, neurologic, respiratory subscores, mGCS motor subscore, weight, and spinal trauma. Additional Model 2 variables independently associated with mortality include ATT perfusion subscore and neuter status. In general, statistical differences between cohorts were found with regard to lactate, PCV, total protein, and glucose. Conclusions Among moderately injured dogs who experienced death despite intervention or euthanasia due to grave prognosis, mortality risk is significantly higher in geriatrics as compared to nongeriatrics.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8518e31ed8bf2df8ca548da710e9073d",
  "timestamp": "2025-05-15T02:42:36.196183"
}