{
  "id": 9106,
  "title": "Frailty, cognitive impairment, and depressive symptoms in Chinese older adults: an eight-year multi-trajectory analysis",
  "abstract": "BackgroundFrailty, cognitive impairment, and depressive symptoms are closely interrelated conditions in the aging population. However, limited research has longitudinally analyzed the concurrent trajectories of these three prominent conditions in older adults in China. This study aimed to explore the eight-year trajectories of frailty, cognitive impairment, and depressive symptoms, and to identify individual-level and structural-level factors associated with the trajectories.MethodsFour waves of data from the China Health and Retirement Longitudinal Study (2011-2018) were used to identify 6,106 eligible older adults. The main measures included frailty by the frailty index constructed using 30 indicators, cognitive impairment by the summary score of immediate and delayed word recall, figure drawing, serial subtraction, and orientation, and depressive symptoms by the Center for Epidemiologic Studies Depression Scale. Multi-trajectory models identified the trajectories of frailty, cognitive impairment, and depressive symptoms over time. Multinomial logistic regression was employed to estimate the associations between individual-level capital factors and one structural factor (hukou and geographic residency) with the identified trajectories, adjusting for demographic characteristics.ResultsFour trajectories emerged: (1) worsening frailty, worsening cognitive impairment, depression (14.0%); (2) declining pre-frailty, declining cognition, borderline depression (20.0%); (3) pre-frailty, worsening cognitive impairment, no depression (29.3%); and (4) physically robust, declining cognition, no depression (36.7%). Using the physically robust, declining cognition, no depression as the reference, not working, no social activity participant, worse childhood family financial situation, and poorer adult health were most strongly associated with the worsening frailty, worsening cognitive impairment, depression trajectory; worse health during childhood had the highest association with the declining pre-frailty, declining cognition, borderline depression trajectory; less education, lower household consumption, and rural hukou had the greatest association with the increased likelihood of the pre-frailty, worsening cognitive impairment, no depression trajectory.ConclusionsFindings could inform the understanding of the interrelationship of frailty, cognitive impairment, and depressive symptoms in older adults in China and may help practitioners detect adults at risk for adverse trajectories to implement strategies for proper care.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "851beebb7867ebde57ac8668717ac08d",
  "timestamp": "2025-05-15T03:25:27.791332"
}