{
  "id": 2827,
  "title": "Interactive Socially Responsible Portfolio Selection: An Application to the Spanish Stock Market",
  "abstract": "During the late years, given the causes of the 2008 financial crisis, ethical, social, environmental and governance concerns have become relevant investment decision criteria for both individual and institutional investors. However, while a diverse set of models has been developed to support investment decision-making based on financial criteria, models including also socially responsible criteria are rather scarce. The model proposed in this paper is intended to be an individual investment decision making tool for stocks' portfolio selection, taking into account the subjective and individual preferences about different financial and socially responsible features of a particular investor. In this sense, the first problem to be solved is the measurement of the social responsibility degree of financial assets. In this work, we propose the construction of synthetic indicators based on the double reference point scheme. Once the social responsibility degree of the assets has been measured, multiple criteria portfolio selection model is formulated, which includes, together with the classical financial criteria, a social responsibility criterion based on the previously obtained synthetic indicators. The resulting model is solved using a mixed reference point - classification scheme. In order to illustrate the suitability of the synthetic indicators built, and the applicability of the proposed investment decision making model, an empirical study on a set of Spanish domiciled stocks is presented.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8521e221f2317a43fbf6ca3426fecbba",
  "timestamp": "2025-05-15T01:10:49.589002"
}