{
  "id": 2375,
  "title": "The Promotion and Optimization of Bank Financial Products Using Consumers' Psychological Perception",
  "abstract": "With the rapid economic growth and increased national income year by year, individuals and families have an increasingly greater demand for financial products. Banks' sales of financial products have become a new economic profit growth point for major banks. Based on consumers' psychological perception, the influencing factors of consumers' behavior in purchasing bank financial products are studied. The influencing factor model path of consumer purchase behavior is constructed to find out the factors affecting consumers' purchase of bank financial products and formulate appropriate promotion strategies according to the influencing factors. Through the research methods of literature analysis, small-scale in-depth interview, questionnaire surveys, and statistical analysis, this exploration selects four variables: independent variable, mediator, control variable, and dependent variable. They are influencing factors of purchasing bank financial products (perceived convenience, risk value of bank financial products, satisfaction of purchasing communication process), consumers' willingness to buy bank financial products, consumers' personal characteristics and consumers' behavior of purchasing bank financial products. Meanwhile, based on 196 valid questionnaires, regression analysis is carried out through a regression model. The results show that the three influencing factors of consumers' purchase of bank financial products-perceived convenience, risk value of bank financial products, and satisfaction with the purchase communication process significantly impact consumers' purchase of bank financial products. They can put forward specific promotion suggestions for banks. This exploration aims to study the optimization of bank financial product promotion strategy from the perspective of consumer psychological perception to provide a reference for subsequent related research.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8531caf6b80626acc509dfa436fe5d11",
  "timestamp": "2025-05-15T02:14:50.282089"
}