{
  "id": 9272,
  "title": "Assessment of Health Care Costs and Total Baclofen Use Associated With Targeted Drug Delivery for Spasticity",
  "abstract": "Background: Chronic spasticity causes significant impairment and financial burden. Oral baclofen, the first-line therapy, can have intolerable, dose-dependent side effects. Targeted drug delivery (TDD) through intrathecal baclofen delivers smaller amounts of baclofen into the thecal sac via an implanted infusion system. However, the health care resource utilization of patients with spasticity receiving TDD has not been studied extensively. Materials and Methods: Adult patients who received TDD for spasticity between 2009 and 2017 were identified using the IBM MarketScan & REG; data bases. Patients' use of oral baclofen and health care costs were examined at baseline (one year before implantation) and three years after implantation. A multivariable regression model using the generalized estimating equations method and a log link function was used to compare postimplantation costs with those at baseline. Results: The study identified 771 patients with TDD for medication analysis and 576 for cost analysis. At baseline, the median costs were $39,326 (interquartile range [IQR]: $19,526-$80,679), which increased to $75,728 (IQR: $44,199-$122,676) in year 1, decreased to $27,160 (IQR: $11,896-$62,427) in year 2, and increased slightly to $28,008 (IQR: $11,771-$61,885) in year 3. In multivariable analysis, the cost was 47% higher than at baseline (cost ratio [CR] 1.47, 95% CI: 1.32-1.63) in year 1 but was 25% lower (CR 0.75, 95% CI: 0.66-0.86) in year 2 and 32% lower (CR 0.68, 95% CI: 0.59-0.79) in year 3. Before implant, 58% of patients took oral baclofen, which decreased to 24% by year 3. The median daily baclofen dose decreased from 61.8 mg (IQR: 40-86.4) before TDD to 32.8 mg (IQR: 30-65.7) three years later. Conclusions: Our findings indicate that patients who undergo TDD use less oral baclofen, potentially reducing the risk of side effects. Although total health care costs increased immediately after TDD, most likely owing to device and implantation costs, they decreased below baseline after one year. The costs of TDD reach cost neutrality approximately three years after implant, indicating its potential for long-term cost savings.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8536e507f50065628b09a1bb67e6d8de",
  "timestamp": "2025-05-15T03:27:24.937060"
}