{
  "id": 2018,
  "title": "A comparative assessment of causal machine learning and traditional methods for enhancing supply chain resiliency and efficiency in the automotive industry",
  "abstract": "Efficient supplier escalation is crucial for maintaining smooth operational supply chains in the automotive industry, as disruptions can lead to significant production delays and financial losses. Many companies still rely on traditional escalation methods, which may lack the precision and adaptability offered by modern technologies. This study presents a comparative analysis of decision-making strategies for supplier escalation, evaluating causal machine learning (CML), traditional machine learning (ML), and current escalation practices in a leading German automotive company. The study employs an explanatory sequential mixed method, integrating the Analytical Hierarchy Process (AHP) with in-depth interviews with 25 industry experts. These methods are assessed based on several performance metrics: accuracy, business impact, explanation capability, human bias, stress test, and time-to-recover. Findings reveal that CML outperforms traditional ML and existing approaches, offering superior risk prediction, interpretability, and decision-making support Additionally, the research explores the internal acceptance of these technologies through the Technology Acceptance Model (TAM). The results highlight the transformative potential of CML in enhancing supply chain resilience and efficiency. By bridging the gap between predictive analytics and explainable AI, this research offers valuable guidance for firms seeking to optimize supplier management using advanced analytics.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "853b87af57b5a215d591db260cd8f57c",
  "timestamp": "2025-05-15T02:10:25.656311"
}