{
  "id": 7123,
  "title": "Trajectories of childhood adversity and the risk of depression in young adulthood: Results from the Avon Longitudinal Study of Parents and Children",
  "abstract": "Background The significance of the timing and chronicity of childhood adversity for depression outcomes later in life is unclear. Identifying trajectories of adversity throughout childhood would allow classification of children according to the accumulation, timing, and persistence of adversity, and may provide unique insights into the risk of subsequent depression. Methods Using data from the Avon Longitudinal Study of Parents and Children, we created a composite adversity score comprised of 10 prospectively assessed domains (e.g., violent victimization, inter-parental conflict, and financial hardship) for each of eight time points from birth through age 11.5 years. We used semiparametric group-based trajectory modeling to derive childhood adversity trajectories and examined the association between childhood adversity and depression outcomes at the age of 18 years. Results Among 9,665 participants, five adversity trajectories were identified, representing stable-low levels (46.3%), stable-mild levels (37.1%), decreasing levels (8.9%), increasing levels (5.3%), and stable-high levels of adversity (2.5%) from birth through late childhood. Approximately 8% of the sample met criteria for probable depression at 18 years and the mean depression severity score was 3.20 (standard deviation = 3.95, range 0-21). The risk of depression in young adulthood was elevated in the decreasing (odds ratio [OR] = 1.72, 95% confidence interval [CI] = 1.19-2.48), increasing (OR = 1.81, 95% CI = 1.15-2.86), and stable-high (OR = 1.80, 95% CI = 1.00-3.23) adversity groups, compared to those with stable-low adversity, when adjusting for potential confounders. Conclusions Children in trajectory groups characterized by moderate or high levels of adversity at some point in childhood exhibited consistently greater depression risk and depression severity, regardless of the timing of adversity.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "853f5fd62ea69a34ad64bcbc31b333f8",
  "timestamp": "2025-05-15T03:05:32.014021"
}