{
  "id": 5545,
  "title": "How uncertainty can determine corporate ESG performance?",
  "abstract": "Using Sino-Securities Environmental, social, and governance (ESG) ratings data, we examine how environmental uncertainty affects the ESG performance of Chinese A-share non-financial listed firms from 2008 to 2020. Our findings show that environmental uncertainty harms corporate ESG performance. In particular, when environmental uncertainty increases, a firm's ESG score and ESG ratings decline due to factors such as financial constraints and industry competition. We argue that as the environmental risk premium rises, it increases the real options value of postponing sustainable investment for a firm. Consequently, the firms tend to cut down their ESG investment by weighing the long-term benefits and short-term direct costs. The value of real options changes with the investment opportunities available to the firms and the financing constraints and competitive pressure changes the size of investment opportunities. We argue that higher financing constraints and industry competition restrict available investment opportunities and dilute the negative impact of environmental uncertainty on corporate ESG performance. These results add to the existing literature investigating the impact of uncertainty on corporate ESG performance and offer insights to regulators and enterprise managers. These results are robust to alternate proxies of ESG performance and alternate regression techniques.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "85426f528a6dfc19cfbe58186755a084",
  "timestamp": "2025-05-15T02:48:51.354200"
}