{
  "id": 5540,
  "title": "Capital structure in Brazilian credit unions: which factors are realy determinants?",
  "abstract": "Purpose - To assess the determinants of the capital structure of Brazilian credit unions.Theoretical framework - Capital structure represents one of the central topics in corporate finance theory and decisions about capital structure are among the most important in the strategic management of an organization. Based on the literature on non-financial firms and banks, and further grounded in the trade-off and pecking order theories, determinants that can explain the capital structure of credit unions were selected.Design/methodology/approach - The determinants were investigated for 889 Brazilian individual credit unions with information available at the Central Bank of Brazil from 2008 to 2021, totaling 10,132 annual observations, using panel data regression models.Findings - Capital structure is negatively influenced by profitability and risk, and positively by size. For tangibility, there is no evident influence. Furthermore, the pecking order theory is more suitable for the case of credit unions.Practical & social implications of research - The deepening of knowledge about determinants can help regulatory authorities in the development of public policies that aim to protect credit unions from systemic risk, promoting the growth of the sector, which plays an important role as an agent of social and economic development.Originality/value - This study is pioneering in that it presents results indicating that the determinants traditionally considered for non-financial companies and banks are also valid for credit unions, even though they are organizations with different characteristics from the rest.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "85484eb6c7d3fd01f096254395a3a123",
  "timestamp": "2025-05-15T02:48:51.342957"
}