{
  "id": 7058,
  "title": "Symptom profiles of women at risk of mood disorders: A latent class analysis",
  "abstract": "Background: Depression is the leading cause of disease burden among women worldwide. However, an understanding of symptom profiles among women at risk of mood disorders is limited. We determined distinct profiles of affective symptoms among high risk women, along with their distinguishing characteristics. Methods: Women were recruited from 17 clinical sites affiliated with the National Network of Depression Centers. They completed measures of depression (Patient Health Questionnaire - 9) and anxiety (Generalized Anxiety Disorder - 7) as well as questions regarding demographics, reproductive status, behavioral/mental health history, and life stress/adversity. Latent class analysis and multinomial logistic regression were used to identify and characterize symptom profiles. Results: 5792 women participated, ages 18 to 90 (M = 38). Three latent classes were identified: generally asymptomatic (48%), elevated symptoms of comorbid anxiety and depression (16%), and somatic symptoms (36%). Financial security and greater social support were protective factors that distinguished asymptomatic women. The profile of the class with elevated anxiety/depressive symptoms constituted a complex mix of adverse social determinants and potentially heritable clinical features, including a diagnosis of Bipolar Disorder. Women in the 3rd latent class were characterized by menstrual irregularity and a stronger expression of neurovegetative symptoms, especially sleep disturbance and fatigue. Limitations: Limitations included less than optimal racial diversity of our sample and reliance on self-report. Conclusions: Different symptom profiles may reflect distinct subtypes of women at risk of mood disorders. Understanding the etiology and mechanisms underlying clinical and psychosocial features of these profiles can inform more precisely targeted interventions to address women's diverse needs.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "854b461258e6768cb4a0aa7ef4b5aeb2",
  "timestamp": "2025-05-15T03:04:23.054482"
}