{
  "id": 4224,
  "title": "A mixed-method approach for modelling customer-centric mobile phone reverse logistics: application of social media data",
  "abstract": "Purpose Recently, reverse logistics (RL) has become more prominent due to growing environmental concerns, social responsibility, competitive advantage and high efficiency by customers because of the expansion of product selection and shorter product life cycle. However, effective implementation of RL results in some direct advantages, the most important of which is winning customer satisfaction that is vital to a firm's success. Therefore, paying attention to customer feedback in supply chain and logistics processes has recently increased so that manufacturers have decided to transform their RL into customer-centric RL. Hence, this paper aims to identify the features of a mobile phone which affect consumer purchasing behaviour and to analyse the interrelationship among them to develop a framework for customer-centric RL. These features are studied based on website analysis of several mobile phone manufacturers. The special focus of this paper is on social media data (Twitter) in an attempt to help the decision-making process in RL through a big data analysis approach. Design/methodology/approach A portfolio of mobile phone features that affect consumer's mobile phone purchasing decisions has been taken from website analysis by several mobile phone manufacturers to achieve this objective. Then, interrelationships between the identified features have been established by using big data supplemented with interpretive structural modelling (ISM). Apart from that, cross-impact matrix multiplication, applied to classification analysis, was carried out to graphically represent these features based on their driving power and dependence. Findings During the study, it has been observed from the ISM that the chip (F5) is the most significant feature that affects customer's buying behaviour; therefore, mobile phone manufacturers realize that this is to be addressed first. Originality/value The focus of this paper is on social media data (Twitter) so that experts can understand the interaction between mobile phone features that affect consumer's decisions on mobile phone purchasing by using the results.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "855488a7c6c8d52f912562d76e279c3d",
  "timestamp": "2025-05-15T01:24:51.503741"
}