{
  "id": 8898,
  "title": "Prosthetic treatment planning on the basis of scientific evidence",
  "abstract": "The objective of this report is to summarize the results on survival and complication rates of different designs of fixed dental prostheses (FDP) published in a series of systematic reviews. Moreover, the various parameters for survival and risk assessment are to be used in attempt to perform treatment planning on the basis of scientific evidence. Three electronic searches complemented by manual searching were conducted to identify prospective and retrospective cohort studies on FDP and implant-supported single crowns (SC) with a mean follow-up time of at least 5 years. Patients had to have been examined clinically at the follow-up visit. Failure and complication rates were analyzed using random-effects Poisson regression models to obtain summary estimates of 5- and 10-year survival proportions. Meta-analysis of the studies included indicated an estimated 5-year survival of conventional tooth-supported FDP of 93.8%, cantilever FDP of 91.4%, solely implant-supported FDP of 95.2%. combined tooth-implant-supported FDP of 95.5% and implant-supported SC of 94.5% as well as resin.. bonded bridges 87.7%. Moreover, after 10 years of function the estimated survival decreased to 89.2% for conventional FDP, to 80.3% for cantilever FDP, to 86.7% for implant-supported FDP, to 77.8% for combined tooth-implant-supported FDP, to 89.4% for implant-supported SC and to 65% for resin-bonded bridges. When planning prosthetic rehabilitations, conventional end-abutment tooth-supported FDP, solely implant-supported FDP or implant-supported SC should be the first treatment option. Only as a second option, because of reasons such as financial aspects patient-centered preferences or anatomical structures cantilever tooth-supported FDP, combined tooth-implant-supported FDP or resin-bonded bridges should be chosen.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "85638f1dca3e9569ee5029ae9a97dde5",
  "timestamp": "2025-05-15T03:23:27.863188"
}