{
  "id": 1407,
  "title": "Embedded Sensors, Communication Technologies, Computing Platforms and Machine Learning for UAVs: A Review",
  "abstract": "Unmanned aerial vehicles (UAVs) are increasingly becoming popular due to their use in many commercial and military applications, and their affordability. The UAVs are equipped with various sensors, hardware platforms and software technologies which enable them to support the diverse application portfolio. Sensors include vision-based sensors such as RGB-D cameras, thermal cameras, light detection and ranging (LiDAR), mmWave radars, ultrasonic sensors, and an inertial measurement unit (IMU) which enable UAVs for autonomous navigation, obstacle detection, collision avoidance, object tracking and aerial inspection. To enable smooth operation, UAVs utilize a number of communication technologies such as wireless fidelity (Wi-Fi), long range (LoRa), long-term evolution for machine-type communication (LTE-M), etc., along with various machine learning algorithms. However, each of these different technologies come with their own set of advantages and challenges. Hence, it is essential to have an overview of the different type of sensors, computing and communication modules and algorithms used for UAVs. This paper provides a comprehensive review on the state-of-the-art embedded sensors, communication technologies, computing platforms and machine learning techniques used in autonomous UAVs. The key performance metrics along with operating principles and a detailed comparative study of the various technologies are also studied and presented. The information gathered in this paper aims to serve as a practical reference guide for designing smart sensing applications, low-latency and energy efficient communication strategies, power efficient computing modules and machine learning algorithms for autonomous UAVs. Finally, some of the open issues and challenges for future research and development are also discussed.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "85797855839a106f788d570bbac7c116",
  "timestamp": "2025-05-15T00:55:28.464301"
}