{
  "id": 4894,
  "title": "Impact of bank competition on financial stability-a study on Indian banks",
  "abstract": "PurposeNowadays, the competition is not only emerging from within the banking sector, but nonbanking companies like nonbanking financial companies (NBFCs) and FinTech are also growing in size and numbers, offering innovative financial products and services, giving a stiff competition to Indian banks. Thus, this study aims to investigate whether competition from within and outside the banking sector enhances or reduces the financial stability of the banking industry. Design/methodology/approachThe study uses Herfindahl-Hirschman index to measure market share and Z score to measure financial stability. The study further examines the role of NBFCs and FinTech companies in impacting the financial stability by introducing variables like innovation, cybercrimes, systemically important institutions, etc. Thereafter, panel regression has been applied. FindingsEmpirical results show a positive relation of market share with financial stability, implying that increased competition in the Indian banking industry erodes the market power, adversely affecting the profit margins which encourages banks to take more risk and which may impact financial stability. The study shows a positive impact of innovation on financial stability which implies that the competition is acting as an enabler for banks. The authors find a negative relation of systemic important NBFCs with financial stability. The authors observe a negative association of cybercrimes with financial stability, reflecting that competition emerging from FinTech sector has exposed banks to new risks. Research limitations/implicationsThe policymakers should make sure that the competition of banks with other financial institutions, such as FinTech sector, remains healthy; otherwise, it can jeopardize the entire financial system. It is for the policymakers to define a boundary for FinTech sector, as the development of this sector has exposed the banking industry to new kinds of risks potential to create financial instability. The banks should do a comprehensive check on the company to which it is granting loans, and the government should amend laws. Though big banks have huge potential, consolidations can pose challenges at a macroeconomic level. Originality/valueFinTech firms are a new entrant in the financial world which are providing immense competition to the banking sector, and thus radically changing the entire financial system. Therefore, it is extremely vital to study and explore the role of NBFCs and the FinTech industry as the main variable to analyze bank competition, which to the best of the authors' knowledge is completely missing in the previous studies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "858a44598d480750b1d7437c13350a16",
  "timestamp": "2025-05-15T02:42:04.886611"
}