{
  "id": 8736,
  "title": "Validity and reliability of portable A-mode ultrasound in measuring body fat percentage: A systematic review with meta-analysis",
  "abstract": "The present Systematic Review with Meta-analysis study aimed to evaluate the validity and reliability of the Portable A-mode Ultrasound (P-US) for measuring body fat percentage (BF%). Only studies with participants of both genders which had assessed BF% using P-US compared to the reference standard were selected. Publications up until May 31, 2022 were searched in the MEDLINE, COCHRANE, Science Direct, Web of Science, LILACS, SciELO, PEDro, SPORT Discus, CINAHL and SCOPUS databases. QUADAS-2 was used to assess the risk of bias in the validity studies and QAREL was used for the methodological quality of reliability studies. The JAMOVI software program synthesized the results, from which the Pearson Correlation Coefficient (r) or the square root of the Multiple Linear Regression Determination Coefficient (R-2) were extracted for the validity studies, and the Mean of Errors of the Bland-Altman Test (ME) and the Confidence Interval (95%CI) with Upper and Lower Limits for the reliability studies. A total of 13 studies were included, generating 26 results for the quantitative synthesis, 14 for validity and 12 for reliability. Regarding the validity results, a strong correlation was identified between the equipment (r = 0.870 [0.845-0.895], P<0.001), with moderate and true heterogeneity (I-2 = 53.47%, P = 0.003), presenting publication bias. A small effect size was identified regarding the reliability results, overestimating the results due to chance between the devices (ME = 0.207 [-0.798-1.212], P = 0.686), with low heterogeneity also due to chance (I-2 = 19.44%, P = 0.253), with no publication bias. All of the evaluated studies showed some violation of the instruments, confirming the high risk of bias and the low methodological quality. There is concern with heterogeneity for the validity results explained by the subgroups' analysis. The P-US associated with anthropometric perimeters satisfactorily measures the BF% with samples greater than 100 participants, and males. The results in the reliability assessment show high agreement and high variability, greatly expanding the confidence interval, which should be viewed with reservations. This review received financial support from the Brazilian Air Force.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "858e788cfc5e5e5913b59bc445cb2ba9",
  "timestamp": "2025-05-15T03:21:56.618515"
}