{
  "id": 3646,
  "title": "The personal financial burden associated with idiopathic inflammatory myopathies",
  "abstract": "The economic burden of idiopathic inflammatory myopathies (IIMs) within the US is underexplored. We hypothesized that IIMs patients experience considerable personal financial burden due to risks of multi-specialist visits, chronic long-term care, costs associated with disability, medical treatment, and overall high spending costs within the US healthcare system.We surveyed members of Myositis Support and Understanding (MSU) (response rate 4.7 %), and of the 470 survey participants that self-reported with diagnoses of IIMs, we assessed financial burden using two validated measures: (1) Financial Worry Score, and (2) Financial Burden Composite Score (FBCS). We determined factors associated with increased FBCS using logistic and Poisson regression respectively. High financial worry was endorsed by 202 participants (43 %) and the average FBCS +/- SD was 1.8 +/- 1.9. The odds of financial worry among participants with Medicaid is 3.016 times the odds of financial worry among participants without Medicaid (p = 0.011), and the odds of financial worry among participants with private high-deductible insurance is 3.216 times the odds of financial worry among participants who do not have private high-deductible insurance (p =< 0.001). Given the link between personal financial burden and potential effects on patient outcomes, it is essential for physicians to consider patient financial health when determining management or treatment courses. Identifying specific risk factors that can further exacerbate personal financial burden can help physicians identify vulnerable patients to reduce financial hardship.(c) 2023 Elsevier B.V. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8599b919118beac89ee96009e4c540f2",
  "timestamp": "2025-05-15T02:28:29.385836"
}