{
  "id": 4254,
  "title": "Extent of Resection in Newly Diagnosed Glioblastoma: Impact of a Specialized Neuro-Oncology Care Center",
  "abstract": "Treatment of glioblastoma (GBM) consists of microsurgical resection followed by concomitant radiochemotherapy and adjuvant chemotherapy. The best outcome regarding progression free (PFS) and overall survival (OS) is achieved by maximal resection. The foundation of a specialized neuro-oncology care center (NOC) has enabled the implementation of a large technical portfolio including functional imaging, awake craniotomy, PET scanning, fluorescence-guided resection, and integrated postsurgical therapy. This study analyzed whether the technically improved neurosurgical treatment structure yields a higher rate of complete resection, thus ultimately improving patient outcome. Patients and methods: The study included 149 patients treated surgically for newly diagnosed GBM. The neurological performance score (NPS) and the Karnofsky performance score (KPS) were measured before and after resection. The extent of resection (EOR) was volumetrically quantified. Patients were stratified into two subcohorts: treated before (A) and after (B) the foundation of the Regensburg NOC. The EOR and the PFS and OS were evaluated. Results: Prognostic factors for PFS and OS were age, preoperative KPS, O-6-methylguanine-DNA-methyltransferase (MGMT) promoter methylation status, isocitrate dehydrogenase 1 (IDH1) mutation status and EOR. Patients with volumetrically defined complete resection had significantly better PFS (9.4 vs. 7.8 months; p = 0.042) and OS (18.4 vs. 14.5 months; p = 0.005) than patients with incomplete resection. The frequency of transient or permanent postoperative neurological deficits was not higher after complete resection in both subcohorts. The frequency of complete resection was significantly higher in subcohort B than in subcohort A (68.2% vs. 34.8%; p = 0.007). Accordingly, subcohort B showed significantly longer PFS (8.6 vs. 7.5 months; p = 0.010) and OS (18.7 vs. 12.4 months; p = 0.001). Multivariate Cox regression analysis showed complete resection, age, preoperative KPS, and MGMT promoter status as independent prognostic factors for PFS and OS. Our data show a higher frequency of complete resection in patients with GBM after the establishment of a series of technical developments that resulted in significantly better PFS and OS without increasing surgery-related morbidity.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "85a1008921a662b175f65440c80a483e",
  "timestamp": "2025-05-15T01:25:23.238259"
}