{
  "id": 9211,
  "title": "Awareness of, attitude toward, and willingness to participate in pay for performance programs among family physicians: a cross-sectional study",
  "abstract": "Background: The National Health Insurance Administration of Taiwan has introduced several pay-for-performance programs to improve the quality of healthcare. This study aimed to provide government with evidence-based research findings to help primary care physicians to actively engage in pay-for-performance programs. Methods: We conducted a questionnaire survey among family physicians with age-stratified sampling from September 2016 to December 2017. The structured questionnaire consisted of items including the basic demographics of the surveyee and their awareness of and attitudes toward the strengths and/or weaknesses of the pay-for-performance programs, as well as their subjective norms, and the willingness to participate in the pay-for-performance programs. Univariate analysis and multivariate logistic regression analysis were performed to compare the differences between family physicians who participate in the pay-for-performance programs versus those who did not. Results: A total of 543 family physicians completed the questionnaire. Among family physicians who participated in the pay-for-performance programs, more had joined the Family Practice Integrated Care Project [Odds ratio (OR): 2.70; 95% Confidence interval (CI): 1.78 similar to 4.09], had a greater awareness of pay-for-performance programs (OR: 2.37; 95% CI: 1.50 similar to 3.83), and a less negative attitude to pay-for-performance programs (OR: 0.50; 95% CI: 0.31 similar to 0.80) after adjusting for age and gender. The major reasons for family physicians who decided to join the pay-for-performance programs included believing the programs help enhance the quality of healthcare (80.8%) and recognizing the benefit of saving health expenditure (63.4%). The causes of unwillingness to join in a pay-for-performance program among non-participants were increased load of administrative works (79.6%) and inadequate understanding of the contents of the pay-for-performance programs (62.9%). Conclusions: To better motivate family physicians into P4P participation, hosting effective training programs, developing a more transparent formula for assessing financial risk, providing sufficient budget for healthcare quality improvement, and designing a reasonable profit-sharing plan to promote collaboration between different levels of medical institutions are all imperative.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "85b4c2f31877000994a603952787eecd",
  "timestamp": "2025-05-15T03:26:26.092985"
}