{
  "id": 1823,
  "title": "Risk from shortsightedness: the effect of managerial myopia on expected default probability",
  "abstract": "PurposeThis study aims to investigate whether managerial short-termism affects the expected default probability for a sample of Chinese-listed firms.Design/methodology/approachTo capture default, we utilize the expected default probability measure developed by Bharath and Shumway (2008). Textual analysis and machine learning techniques are used to construct the index of managerial myopia. We conduct ordinary least squares regression and employ a large sample of 33,164 firm-year observations from Chinese A-share listed firms spanning the years 2001-2021 to test our theoretical hypotheses. We further conduct mediation tests, moderating analysis, textual features analysis and analysis of actual default firms. In addition, we employ change regression, entropy-balanced/propensity score/closest assets matching analysis, two-stage least squares regression, two-stage residual intervention method and alternative estimation methods to address endogeneity concerns.FindingsFirst, there is a positive and statistically significant relationship between managerial myopia and expected default probability. Second, the mediation tests indicate that managerial myopia increases the expected default probability through operational risk and opportunistic agency channels. Third, the cross-sectional tests reveal that the positive association is less pronounced for firms with effective internal control systems, higher audit quality and more financial analyst coverage.Practical implicationsOur study reveals the need for comprehensive early warning mechanisms in the corporate bond market in China, in particular, through enhanced transparency of managerial incentive schemes and more rigorous disclosure requirements regarding short-term managerial decision-making. Furthermore, the findings of our study suggest the necessity of taking an integrated approach in developing regulatory frameworks that enable market intermediaries - including rating agencies, financial analysts and external auditors - to execute their monitoring functions with greater effectiveness.Originality/valuePrior research has examined the impact of managers' demographic characteristics on a range of corporate organizational outcomes; however, there have been few studies investigating the influence of managerial myopia on corporate financial risks. This study advances the literature on the determinants of default probability. It contributes to the limited and emerging studies on the role of managerial myopia by being the first to examine the effect of managerial myopia on expected default probability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "85b858bc631b7211ef8fe062f5b96e31",
  "timestamp": "2025-05-15T02:08:03.879412"
}