{
  "id": 1877,
  "title": "Risk prediction in financial management of listed companies based on optimized BP neural network under digital economy",
  "abstract": "In the era of Internet plus, the world economy is becoming more and more globalized and informationalized. China's enterprises are facing unprecedented opportunities for their operation and development. However, it is also facing the financial uncertainties brought about by the fluctuations of the general economic environment, and the company is facing increasing financial risks. The reason why most enterprises encounter a serious financial crisis or even close down in the later stage is that they do not pay full attention to the initial financial problems and do not take effective measures to deal with the crisis in time. Financial risk warning has become an important part of modern enterprise financial management. This paper mainly puts forward the optimized BP neural system as the financial early warning model and ensures its high prediction accuracy. In the research, the operation principle and related reasoning process of the model are described, its shortcomings are analyzed, and solutions are put forward. Through the financial risk analysis of listed companies from 2017 to 2020, we find that the correct rate of the prediction results of the financial distress of normal companies in the selected companies based on the optimized BPNN has reached more than 80%, which proves the effectiveness of the optimized BPNN.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "85e32a73b311bccac49dded49631483b",
  "timestamp": "2025-05-15T02:08:39.008376"
}