{
  "id": 6722,
  "title": "Economic impact of malaria-related hospitalizations in the United States, 2000-2014",
  "abstract": "Background: Despite its elimination in the early 1950s, about 1700 cases of malaria are reported in the US every year. Few studies have quantified the direct and indirect costs of imported malaria in the US. Methods: Disparities in the mean and total hospital days, hospital charges, and hospital costs for malaria related hospitalizations in the US by demographic, clinical, species, financial, geographic, and institutional characteristics were examined using the 2000-2014 Nationwide Inpatient Sample (NIS). Trends and potential predictors for length of stay and hospital charges and costs were identified using negative binomial regression and linear regression, respectively. Results: From 2000 to 2014, 22,029 malaria cases resulted in 95,948 hospital days for malaria-related hospitalizations, $176,391,466 in total hospital costs, and $555,435,849 in total charges. Mean charges increased significantly over the study period. Males, Blacks, and patients aged 25-44 years accounted for the highest direct and indirect costs. Older age and having severe malaria was associated with a longer length of stay. Older age, severe malaria, HIV infection, and longer lengths of stay were associated with higher charges and costs. Conclusions: Malaria resulted in substantial direct and indirect costs in the US. Primary and secondary prevention measures should be prioritized among high-risk groups to reduce the economic burden. Published by Elsevier Limited on behalf of King Saud Bin Abdulaziz University for Health Sciences.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "85ebd532d9aaf0295ecabe435acf3025",
  "timestamp": "2025-05-15T03:01:03.532645"
}