{
  "id": 5266,
  "title": "Dividend omissions and dividend cuts behaviour: a dynamic random-effect probit panel regression analysis",
  "abstract": "PurposeThe study aims to examine the dividend omissions and dividend cuts behaviour of manufacturing and non-financial services firms to identify the determinants of dividend omissions and dividend cuts.Design/methodology/approachThe study analyses the financial data of 3,546 firms from 2011 to 2020 (35,460 firm-year observations) using a dynamic random-effect probit panel regression model.FindingsThe results suggest that profitability, growth opportunity, leverage, liquidity, risk, extraordinary income, shareholding pattern and buyback are major determinants of dividend omissions. Similarly, dividend cut in the previous year, profitability, operating cash flow, risk and extraordinary income are major factors leading to dividend cuts.Research limitations/implicationsFirms which omit the dividend are less likely to start paying dividend in subsequent years, whereas firms which cut the dividend may increase dividend in later years. Also, profitability decreases for a significant number of firms post dividend omission and cut. This indicates that dividend omission is a more prominent signal than a dividend cut for the financial health of a firm.Practical implicationsThe determinants identified in the study enable analysts and portfolio managers to decide the propensity of dividend omission and cut even before actual announcements and can alleviate the significant loss in the portfolio. Also, managers and the board of directors would be able to monitor the firm's financial performance to avoid the situation leading to dividend omissions and cuts.Social implicationsThe study strongly recommends that firms should voluntarily pay dividends to shareholders to encourage the healthy participation of retail shareholders in the equity market and create a long-term win-win situation for all stakeholders in society. If a large number of firms continue not to pay the dividend, the study appeals to the regulators to intervene to protect shareholders' interests for the greater good of society.Originality/valueTo the best of author's knowledge, this is the first study to empirically identify the determinants of dividend omission and cut in the unique setting like India where dividend taxation had undergone a significant change.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8612fa33a77387dd9fe58af2cade7d1f",
  "timestamp": "2025-05-15T02:46:16.117884"
}