{
  "id": 8428,
  "title": "Stock returns, illiquidity and feedback trading",
  "abstract": "Purpose This study aims to examine the relation between illiquidity, feedback trading and stock returns for several European markets, using panel regression methods, during the financial and the sovereign debt crises. The authors' interest here lies twofold. First, the authors seek to compare the results obtained here under crisis conditions with those in the existing literature. Second, and of greater importance, the authors wish to examine the interaction between liquidity and feedback trading and their effect on stock returns. Design/methodology/approach The authors jointly model both feedback trading and illiquidity, which are typically considered in isolation. The authors use panel estimation methods to examine the relations across the European markets as a whole. Findings The key results suggest that in common with the literature, illiquidity has a negative impact upon contemporaneous stock returns, while supportive evidence of positive feedback trading is reported. However, in contrast to the existing literature, lagged illiquidity is not a priced risk, while negative shocks do not lead to greater feedback trading behaviour. Regarding the interaction between illiquidity and feedback trading, the study results support the view that greater illiquidity is associated with stronger positive feedback. Originality/value The study results suggest that when price changes are more observable, due to low liquidity, then feedback trading increases. Therefore, during the crisis periods that afflicted European markets, the lower levels of liquidity prevalent led to an increase in feedback trading. Thus, negative liquidity shocks that led to a fall in stock prices were exacerbated by feedback trading.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8635ad5ef6ca46dd2627b75ec09313e9",
  "timestamp": "2025-05-15T03:18:51.555850"
}