{
  "id": 1683,
  "title": "Indian institutional investor's portfolio concentration decision: skill and performance",
  "abstract": "Purpose-This study examined Indian institutional investors' holding data to understand their investment strategy (Portfolio Concentration/Diversification) and explored whether their skills were associated with their portfolio strategy and performance. The study introduced a new proxy to identify skilled investors by forecasting abnormal returns. Moreover, the study also highlighted where skilled Indian investors put their money for long-term investment.Design/methodology/approach-This study measures portfolio concentration based on the number of holdings, the Hirschman-Herfindahl index (HHI) and benchmarks adjusted industry concentration. The study introduced a new proxy to identify skilled investors. We measured Investors' performance with the help of Carhart's four factors model and examined the relationship between variables through various regression models.Findings-The study concluded a negative relationship between portfolio concentration and performance. However, skilled Indian investors get rewards from portfolio concentration decisions. It was found that skilled investors with few stocks and an industry concentration in their portfolio show a positive association between concentration and fund performance. Additionally, this study found Indian investors showing their faith in the financial sector for long-term investment.Originality/value-This study examined Indian institutional investors' portfolio concentration strategy and introduced a new proxy to measure investors' skills.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8635423c7358f84e82fadfbfe73e24a2",
  "timestamp": "2025-05-15T00:58:18.411325"
}