{
  "id": 8291,
  "title": "Association of Depressive Symptoms With Health Service Use and Catastrophic Health Expenditure Among Middle-Aged and Older Chinese Adults: Analysis of Population-Based Panel Data",
  "abstract": "Objectives: To determine the impact of depressive symptoms on health service use and catastrophic health expenditure, and whether it varied by per-capita household consumption, health insurance schemes, and physical comorbidities. Design: Population-based panel data analysis. Setting and Participants: Participants were 8585 adults aged 45 years and older in 2011, and had completed a follow-up survey in 2013, 2015, and 2018 from the China Health and Retirement Longitu-dinal Study (CHARLS). Methods: Depressive symptoms were assessed using the short form of the Center for Epidemiologic Studies Depression Scale. The number of outpatient visits and inpatient hospital days were used as proxies for health service use. When households' out-of-pocket spending on health was 40% or above its total expenditure, it was defined as a catastrophic health expenditure. With the panel data approach, random-effects negative binomial regression and logistic regression were used to analyze the effect of depressive symptoms on health service use and health care expenditure, respectively. Results: Depressive symptoms were associated with increased number of outpatient visits (incidence rate ratio 1.52; 95% CI 1.44-1.60) and days spent in the hospital as an inpatient (1.52; 1.43-1.62). Depressive symptoms were also associated with a significantly increased likelihood of catastrophic health expen-diture (odds ratio 1.54; 95% CI 1.43-1.66). Their effect on outpatient visits, inpatient hospital days, and catastrophic health expenditure persisted in different age, per-capita household consumption, and physical comorbidities groups, and across all health insurance programs. Conclusions and Implications: Depressive symptoms were risk indicators that can drive health service use and household financial stress. Given the rapidly aging population in China, there is an urgent need to integrate mental health care into routine physical examinations to alleviate the economic impacts of depressive symptoms on individuals in China. specifically for individuals with physical comorbidities and in poorer socioeconomic conditions. (c) 2022 Published by Elsevier Inc. on behalf of AMDA -The Society for Post-Acute and Long-Term Care Medicine.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8639852477cfcf6cfabcc9b894dd7680",
  "timestamp": "2025-05-15T03:17:21.545855"
}