{
  "id": 5554,
  "title": "Interpretable high-stakes decision support system for credit default forecasting",
  "abstract": "Methods for forecasting credit default have long been research focus for financial institutions. In this study, we propose an interpretable high-stakes decision support system for credit default forecasting called CDFS. Because of the high-stake nature of credit default prediction, the proposed CDFS adheres to the principle of people in the loop. The proposed CDFS comprises six modules: data processing, feature selection, data balancing, forecasting, evaluation, and interpretation. A feature selection method (permutation importance method), nine resampling methods, and six high-performance forecasting methods were employed in the proposed CDFS. The China Taiwan credit card default dataset and South Germany credit dataset were used to test the interpretability and predictive performance of the proposed CDFS. Experiments showed that the feature selection and data balancing modules of the CDFS effectively improve the prediction performance. A comparison with traditional logistic regression models demonstrated that the CDFS can provide decision-makers with satisfactory explanations for prediction results. In summary, the CDFS proposed in this study exhibited excellent predictive performance and satisfactory interpretability. This study contributes to improving the accuracy of credit default forecasting and reducing credit risk in financial institutions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "865cd11efd8f569edf50f139141658b3",
  "timestamp": "2025-05-15T02:48:51.381653"
}