{
  "id": 3039,
  "title": "Dynamic connectedness in the higher moments between clean energy and oil prices",
  "abstract": "Focusing on clean energy stocks and oil prices, we find that connectedness between these assets not only exists in volatility, but also at higher-order moments, such as skewness and kurtosis, which have been largely under studied in the existing literature. Estimating the connectedness using intra-day data, our initial static analyses suggest that the connectedness between the clean energy and oil markets is heterogenous across the moments and the shock transmitter/recipient role played by each market varies across moments. Further dynamic analyses indicate that higher-order moment connectedness is also time varying and appears to be stronger during uncertain market conditions. In addition, we identify day-of-the-week patterns of higher-order moment connectedness during high uncertainty periods, but these patterns appear to be reversed during low uncertainty periods. The employment of Markov switching regression models further corroborates the market uncertainties as the determinants of higher-order moment connectedness. As an important extension, we provide empirical evidence that including clean energy stocks in the investment portfolio can effectively hedge oil price risks and considering higher-order moments in constructing investment strategies adds extra value to investors. Our utility-based hedging strategy and minimum connectedness portfolio can offer higher utility gains and better risk-return trade-offs to those investors who are not infinitely risk-averse.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "866b4b786b063ea9e4a5e19ec9c0b4d2",
  "timestamp": "2025-05-15T01:12:43.159612"
}