{
  "id": 2856,
  "title": "The effect of consumption and production policies on circular economy business models: A machine learning approach",
  "abstract": "The circular economy (CE) is attracting increasing interest, as it can bring environmental, social, and economic benefits. However, policymakers and scholars appear to concentrate more on the production side of CE, while consumption, and particularly policies that affect consumption have received less attention and their effect is ambiguous. This paper investigates the effect of CE consumption policies on circular economy business models (CEBMs) in firms, but also examines the interplay this type of policies have with CE production policies to have a broader picture of the circular economy policy framework and the relevance of each type of policy on firms. While previous studies assume rational and passive consumer behavior, this paper borrows from a natural resource-based view and stakeholder theory, arguing that consumers have a proactive attitude toward the consumption of environmentally friendly products. Moreover, we use institutional theory as an analytical framework for modeling the effects of a particular policy framework on the CEBM. Our analysis combines classical econometric methods with machine learning approaches, employing data from the EU. The results show that CE policies aimed at promoting consumption have a direct and positive effect on CEBMs. This paper also confirms that a wide portfolio of CE policies on production and consumption has a greater effect on the development of CEBMs, due to the complementarity of CE consumption and production policies. Moreover, we show that in interaction with CE production policies, CE policies on consumption have an even greater effect on CEBMs in firms than would have been anticipated.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8680fcd5c9d584381d83ca5cd244dc13",
  "timestamp": "2025-05-15T01:11:17.397268"
}