{
  "id": 2242,
  "title": "Modelling the susceptibility of pine stands to bark stripping by Chacma baboons (Papio ursinus) in the Mpumalanga Province of South Africa",
  "abstract": "Context. Commercial pine (Pinus spp.) plantations in southern Africa have been subjected to bark stripping by Chacma baboons (Papio ursinus) for many decades, resulting in severe financial losses to producers. The drivers of this behaviour are not fully understood and have been partially attributed to resource distribution and availability. Aims. The study sought to develop a spatially explicit ecological-risk model for bark stripping by baboons to understand the environmental factors associated with the presence of damage in the pine plantations of the Mpumalanga province of South Africa. Methods. The model was developed in Random Forests, a machine learning algorithm. Baboon damage information was collected through systematic surveys of forest plantations conducted annually. Environmental predictors included aspects of climate, topography and compartment-specific attributes. The model was applied to the pine plantations of the study area for risk evaluation. Key results. The Random Forests classifier was successful in predicting damage occurrence (F-1 score = 0.84, area under curve (AUC) = 0.96). Variable predictors that contributed most to the model classification accuracy were related to pine-stand characteristics, with the age of trees being the most important predictor, followed by species, site index and altitude. Variables pertaining to the environment surrounding a pine stand did not contribute substantially to the model performance. Key conclusions. (1) The study suggests that bark stripping is influenced by compartment attributes; (2) predicted risk of bark stripping is higher in stands above the age of 5 years planted on high-productivity forestry sites, where site index (SI) is above 25; (3) presence of damage is not related to the proximity to natural areas; (4) further studies are required to investigate ecological and behavioural patterns associated with bark stripping.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "86821d502399144b21bf2dbcd6f024cb",
  "timestamp": "2025-05-15T02:12:51.049193"
}