{
  "id": 5340,
  "title": "The Impact of Cancer-Related Financial Toxicity on Reproductive Concerns and Family-Building Decision-Making in Post-Treatment Survivorship",
  "abstract": "Purpose: Adolescent and young adult (AYA) survivors are at-risk for cancer-related financial difficulties (i.e., financial toxicity [FT]). Family building after cancer often requires reproductive medicine or adoption with high costs; AYAs experience financial barriers to family building. This study evaluated the relationships among cancer FT, reproductive concerns, and decision-making processes about family building after cancer.Methods: AYA female (AYA-F) cancer survivors completed a cross-sectional survey including measures of FT, reproductive concerns, decisional conflict about family building, and decision-making self-efficacy. Differences across FT subgroups (i.e., no/mild, moderate, and severe FT) were tested. Linear regression evaluated the relationships between FT and reproductive concerns and decision-making processes.Results: Participants (N = 111) averaged 31.0 years (standard deviation [SD] = 5.49), 90% were nulliparous, and 84% were employed full/part-time. The overall FT levels were in the moderate range (M = 20.44, SD = 9.83); 48% worried quite a bit or very much about financial problems because of cancer. AYA-Fs reporting severe FT (24% of sample) experienced higher levels of reproductive concerns compared with those reporting no/mild and moderate FT. Those reporting moderate FT (46% of sample) reported greater decisional conflict about family-building options, compared with the no/mild FT subgroup. Both moderate and severe FT subgroups reported lower decision-making self-efficacy compared with the no/mild FT subgroup. In separate models controlling for covariates, greater FT related to higher levels of reproductive concerns (B = -0.39, p < 0.001), greater decisional conflict about family building (B = -0.56, p = 0.02), and lower decision-making self-efficacy (B = 0.60, p = 0.01).Conclusions: Given the high costs of reproductive medicine and adoption, fertility counseling pre- and post-treatment must address survivors' financial concerns and barriers.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8689ed7b88f35c19b05f3d906e7931b1",
  "timestamp": "2025-05-15T02:46:44.920834"
}