{
  "id": 1757,
  "title": "Does cognitive biased knowledge influence investor decisions? An empirical investigation using machine learning and artificial neural network",
  "abstract": "PurposeCurrent research in the field of behavioural finance has attempted to discover behavioural biases and their characteristics in individual investors' irrational decision-making. This study aims to find out how biases in information based on knowledge affect decisions about investments. Design/methodology/approachIn step one, through existing research and consultation with specialists, 13 relevant items covering major aspects of bias were determined. In the second step, multiple linear regression and artificial neural network were used to analyse the data of 337 retail investors. FindingsThe investment choice was heavily impacted by regret aversion, followed by loss aversion, overconfidence and the Barnum effect. It was observed that the Barnum effect has a statistically significant negative link with investing choices. The research also found that investors' fear of making mistakes and their tendency to be too sure of themselves were the most significant factors in their decisions about where to put their money. Practical implicationsThis research contributes to the expansion of the knowledge base in behavioural finance theory by highlighting the significance of cognitive psychological traits in how leading investors end up making irrational decisions. Portfolio managers, financial institutions and investors in developing markets may all significantly benefit from the information offered. Originality/valueThis research is a one-of-a-kind study, as it analyses the emotional biases along with the cognitive biases of investor decision-making. Investor decisions generally consider the shadowy side of knowledge management.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "868e8c0cbde23b99fe7672b6efd26f61",
  "timestamp": "2025-05-15T00:59:22.932513"
}