{
  "id": 5595,
  "title": "Research on farmers' households credit behavior and social capital acquisition",
  "abstract": "Farmer's credit is significant to growing the farmer's revenue and the progression of the rural economy. Several scholars have focused on the impact of social capital on the farmers' credit availability, but the research deduction is still not combined. In addition, credit behavior is an important element that researchers pay attention to. However, the study mainly focuses on the effects of social capital on the credit behavior of farmer households and its large positive effect, a scientific approach for measuring farmer households' social capital was presented. The strategy attempted to develop an empirical model of farmer households' loan behavior based on business performance and the role of social capital. Through regression analysis of the influence of social capital on the channels of farmer households' access to credit, it was determined that the error correlation coefficients of the credit by the formal channel and the informal channel were 0.153, 0.158, and 0.152, respectively, for the three models. The significance levels of the correlation coefficients were all greater than 1 percent, showing that the regression results were relatively accurate and passed the significance test. However, these results indicated that financial channels pay attention to farmers' credit and social capital acquisition to reduce the risk of advancing. Moreover, informal money lenders such as friends and relatives focused on the social capital of the farmer. The study is helpful for policymakers to make the strategies for the farmer to get credit behavior from financial institutions. Moreover, this study is beneficial in highlighting some limitations and giving future directions to researchers.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "86aa22410d36c1a99a1220b61e296a20",
  "timestamp": "2025-05-15T02:49:21.720802"
}