{
  "id": 4993,
  "title": "Mortality among lone mothers in Sweden:: a population study",
  "abstract": "Background An increasing number of lone mothers are experiencing financial and health disadvantages. Our aim was to assess mortality among lone mothers compared with mothers with partners. Methods In this population-based study, overall and cause-specific mortality, between 1991 and 1995, was estimated for 90 111 lone mothers and 622 368 mothers with partners from data collected in the Swedish Population and Housing Census 1990. We estimated relative risks by Poisson regression, adjusted for socioeconomic status, and, to handle health-selection effects, we adjusted for previous inpatient history from 1987 to 1990. Findings Lone mothers showed an almost 70% higher premature risk of death than mothers with partners. The excess risk remained significantly increased (relative risk 1.2 [95% CI 1.1-1.4]) after adjustments for socioeconomic status and previous severe somatic and psychiatric inpatient history. Increased mortality was especially pronounced for suicides (2.2 [1.5-3.1]), violence (3.0 [0.9-10.6]), and alcohol-related mortality (2.4 [1.4-4.1]) among mothers who were without a partner in 1985 and in 1990. Interpretation The increase of lone mothers in society shows financial, social, and health disadvantages. Nevertheless, the increased mortality risk of lone mothers seems to be partly independent of socioeconomic status and health selection into lone motherhood. For long-term lone mothers the risks may be underestimated when adjusting for selection bias by taking hospital discharge history into account, since these events may be part of the consequences of the stress of lone motherhood.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "86ad29e80062c6e7905fbe38bdef5bfd",
  "timestamp": "2025-05-15T02:43:06.794135"
}