{
  "id": 9307,
  "title": "Knowledge transfer and innovation in multinationals: a review of the literature using SCM-TBFO framework",
  "abstract": "Purpose - Business research has highlighted the importance of knowledge transfer and innovation in multinational firms for better performance outcomes. However, the existing body of literature is characterized by differentiated theories, antecedents and outcomes. This study aims to address this gap by adopting a systematic approach to analyze knowledge transfer and innovation literature from the perspective of multinational organizations. Design/methodology/approach - This study follows preferred reporting items for systematic reviews and meta-analyses (PRISMA) guidelines for conducting a systematic literature review. The study adopts a systematic approach for analyzing the literature using School of thought (S), Contexts (C), Methodologies (M), Triggers (T), Barriers (B), Facilitators (F) and Outcomes (O) framework (SCM-TBFO framework) devised for holistic literature review. The study analyzes 75 articles from reputed journals from 2000 to 2022. Findings - In general, knowledge transfer and innovation in multinationals is a relatively new area and is evolving rapidly. There are many opportunities to study the various perspectives that are included in the SCMTBFO framework. The key schools of thought included the evolutionary theory of innovation, institutional theory and internationalization theory. The studies had differing settings or contexts, including China, Europe, the USA and Taiwan. Further, key methodologies that were used included regression, case studies, structural equation modeling (SEM) and theoretical studies. Knowledge transfer and innovation triggers included competitive advantage, competitive pressure, constant requirements for better products and services, foreign direct investment (FDI) and globalization. Knowledge transfer and innovation facilitators were categorized into strategy-related facilitators, organization culture and orientation-related facilitators, and resource-related facilitators. Knowledge transfer and innovation barriers included autonomy, international knowledge dispersion, risk of knowledge leakage, search breadth, ambiguity and institutional voids. Key outcomes of knowledge transfer and innovation in multinationals included financial performance, innovation performance, knowledge flow, transfer effectiveness, patents and new product development. Originality/value- By synthesizing the literature, the study aims to provide an overview of the current state of research on knowledge transfer and innovation in multinationals. The study develops a holistic model for fostering knowledge transfer and innovation in multinationals. The proposed novel framework can also be applied to perform a holistic assessment of the current literature in various research domains. Further, the study suggests future theory development and research agendas. The study also provides implications for practitioners using the framework to achieve more desirable outcomes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "86dafdd87497690511fa926615473399",
  "timestamp": "2025-05-15T03:27:25.124934"
}