{
  "id": 4690,
  "title": "Process and intensity of internationalization of IT firms - Evidence from India",
  "abstract": "This paper provides insights and evidence related to the process and intensity of internationalization of firms in the Information Technology (IT) sector, which is the driving force of high economic growth in the Indian sub-continent during the last two decades. Research objectives were set as (i) to examine the existence of born global firms in the IT sector, (ii) to identify the process of internationalization adopted by firms in the IT industry, (Hi) to measure the intensity of internationalization of IT firms. The paper is based on data collected from annual financial reports of firms listed in the CNXIT Index of National Stock Exchange of India. Two clusters were extracted using hierarchical clustering method followed by k-means clustering to analyze the characteristics of the variables. We find that the firms in both clusters are true global firms with 66 and 85% of their income from foreign markets with a very high level of international intensity. Though the findings provide some evidence for the gradual internationalization of Indian IT firms; the empirical results indicate that firm age has no impact on internationalization. The results from our study also show that firms, especially in certain industries such as IT, do have access to information that reduces the risk aversion. (C) 2013 Elsevier Ltd. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "86ec6b64ec1bf47bfe298eba8fba8727",
  "timestamp": "2025-05-15T02:39:57.568618"
}