{
  "id": 4146,
  "title": "Corporate environmental performance-financial performance relationship in India using eco-efficiency metrics",
  "abstract": "Purpose The purpose of this study is to attempt to empirically examine the impact of disaggregate, eco-efficiency-based measures of corporate environmental performance (CEP) on corporate financial performance (CFP) of Indian companies. Further, recent theories contending a bidirectional causality between them is also explored. Design/methodology/approach Secondary data of 224 Indian S&P 500 companies from 2002 to 2011 are used to run panel data regression models for examining the impact of CEP measures on accounting-based CFP measures. Findings The empirical results are statistically significant and provide evidence for a positive association of eco-efficiency-based CEP metrics on CFP metrics, thereby supporting Porter's win-win hypothesis. Further, the results evidence a positive bi-directional causality between CEP and CFP for one period time lag signalling possibility of mutual reinforcement in CEP-CFP relationship. Research limitations/implications The study has used data for the period 2002-2011 and eco-efficiency metrics - energy, water and material efficiencies due to availability. Practical implications The results have implications to both corporate managers as well as policymakers across all industries for emphasizing on eco-efficiency-based (proactive) environmental sustainability initiatives to enhance both financial and environmental bottom lines. Originality/value The study contributes to scarce empirical literature analysing the impact of CEP on financial performance. To the best of authors's knowledge, event studies, portfolio studies and perceptual data-based empirical studies exist in India. This study is unique in that it examines long run effect of eco-efficiency-based CEP metrics which is pertinent in a rapidly growing emerging market - India, where, eco-efficiency is considered quintessential for sustainable development.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "86eea3035317111967d087eaf6007a11",
  "timestamp": "2025-05-15T01:24:25.321984"
}