{
  "id": 5075,
  "title": "Risk assessment of finishing beef cattle in feedlot: slaughter weights and correlation amongst input variables",
  "abstract": "The objective of this study was to evaluate the risk associated with finishing crossbred Charolais x Nellore steers in feedlot at different slaughter weights (425, 467 or 510 kg), considering or disregarding the correlation amongst random input variables. Data were collected from 2004 to 2010 and used in the simulation of the financial indicator Net Present Value (NPV). Animals slaughtered with 425, 467 or 510 kg were fed diets containing a roughage: concentrate ratio of 60: 40 for 30, 65 and 94 days, respectively. In the simulation of NPV, a Latin Hypercube type of sampling was used, running 2000 interactions. An analysis of stochastic dominance of first and second orders was carried out as well as the Kolmogorov-Smirnov asymptotic test (to check for differences between pairs of curves of cumulative distributions), followed by sensitivity analysis using stepwise multivariate regression. Simulations of NPV considering the correlation amongst the input variables produced more consistent estimates of this financial indicator than simulations that disregarded it. The risk analysis showed that 467 kg slaughter weight presented the lowest risk for finishing cattle in feedlots when compared with 425 and 510 kg. The most important variables influencing the NVP are the prices of feeder and finished steers, initial and final weights, concentrate and roughage costs, and minimum rate of attractiveness; therefore, farmers should pay particular attention to these variables when making the decision of whether or not to use feedlot to finish beef cattle.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "86faa737601d7bf9a0b5827b59e8cb5a",
  "timestamp": "2025-05-15T02:44:10.988264"
}