{
  "id": 9008,
  "title": "The Utilization of Industry Standards in the Optimization of Corporate Capital Structure",
  "abstract": "The use of debt offers a company many advantages by creating more investment opportunities and a possible rise in the shareholder's value. On the other hand, extensive use of debt may introduce a higher risk for the investors, which may increase the interest rate and/or bring credit restrictions on the company. Utilization of traditional or modern capital structure theories assumes the proactive approach of companies towards the process of capital structure optimization. Companies may, however, exert rather a passive approach based on the utilization of industry standards for corporate indebtedness. The business sector is seen as one of the most significant elements in determining the degree of financial leverage. The sense of the use of industry standards is that the debt-equity ratios appropriate for other firms in a similar branch should be appropriate for the company as well. Industry standards can serve as a useful benchmark If the particular company is out of line, it can be perceived as conspicuous on the market However, it may prove difficult for an ordinary company to find concrete sectoral recommendations on the debt ratio. The aim of this paper is to make a proposal for specific industry standards of indebtedness for 14 business sectors structured according to the classification of CZ-NACE. The proposal is based on the results of two independent studies conducted by the author of this contribution. The first study was focused on the indebtedness of Czech companies and its development between the years 2006 and 2011; it was based on panel data analysis. The second study was aimed at identification and analysis of trends in the selection of sources of corporate financing in the Czech Republic in a similar period; it was based on a capital structure analysis performed on a sample of 100 randomly selected companies within each business sector. The outcome of this paper is a proposal for industry standards that might serve as a benchmark of the maximal value of the corporate debt ratio within the particular sector.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "86fb59006d86acda82ad40d334d9056f",
  "timestamp": "2025-05-15T03:24:26.420576"
}