{
  "id": 988,
  "title": "Malicious Transaction Identification in Digital Currency via Federated Graph Deep Learning",
  "abstract": "With the rapid development of digital currencies in recent years, their anonymity provides a natural shelter for criminals. This problem resulting in various types of malicious transactions emerge in an endless stream, which seriously endangers the financial order of digital currencies. Many researchers have started to focus on this area and have proposed heuristics and feature-based centralized machine learning algorithms to discover and identify malicious transactions. However, these approaches ignore the existence of financial flows between digital currency transactions and do not use the important neighborhood relationships and rich transaction characteristics. In addition, centralized learning exposes a large amount of transaction feature data to the risk of leakage, where criminals may trace the actual users using traceability techniques. To address these issues, we proposes a graph neural network model based on federated learning named GraphSniffer to identify malicious transactions in the digital currency market. GraphSniffer leverages federated learning and graph neural networks to model graph-structured Bitcoin transaction data distributed at different worker nodes, and transmits the gradients of the local model to the server node for aggregation to update the parameters of the global model. GraphSniffer can realize the joint identification and analysis of malicious transactions while protecting the security of transaction feature data and the privacy of the model. Extensive experiments validate the superiority of the proposed method over the state-of-the-art.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "86fd738b1e38c03d37a532f0faaad94c",
  "timestamp": "2025-05-15T01:57:29.892857"
}