{
  "id": 2177,
  "title": "Using risk to target HPV vaccines in high-risk, low-resource organizations",
  "abstract": "Organizations in developed countries with limited financial resources may find it difficult to determine whether it is preferable to use these resources for HPV vaccination, management of HPV-related diseases, or a hybrid strategy, such as vaccinating only the highest risk individuals. We determined the organizational costs and clinical impacts of three different organizational approaches to female HPV vaccination in a low-resource setting, including vaccinating everyone, vaccinating no one, or vaccinating only those considered high-risk. To determine patients at highest risk, HPV risk factors were identified using information routinely gathered at the annual preventive maintenance visit. The three vaccination strategies were then compared using a decision tree analysis. The three strategies demonstrated very little difference in cost. However, the least expensive strategy was to vaccinate no one. In contrast, the strategy with the best clinical outcomes was for the organization to vaccinate everyone. Organizations with limited resources must decide how to best allocate these funds to provide the greatest clinical benefits. This study showed little difference in costs but improved clinical outcomes when using the universal HPV vaccination strategy. Thus, the improvement in clinical outcomes when vaccinating everyone may be worth the relatively small increase in cost of vaccinating everyone.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "87561c45c9784aa8b4b4aadf146ef6ce",
  "timestamp": "2025-05-15T02:12:17.370299"
}