{
  "id": 7597,
  "title": "Health Literacy, Self-Perceived Health, and Substance Use Behavior among Young People with Alcohol and Substance Use Disorders",
  "abstract": "Licit and illicit substance use is one of the major public health issues with severe negative health consequences for individuals and society. Health literacy is essential for improving one's health and navigation in the healthcare system. However, the evidence of health literacy in people with substance use disorders is limited. This study aims to examine health literacy and its socio-demographic, health-related, and substance use-related correlates in young people with alcohol (AUD) and substance use disorders (SUD). In this study, cross-sectional data of young people undergoing addiction treatment for AUD (N = 201, mean age 37.6) and SUD (N = 165, mean age 31.1) were used. Health literacy was assessed using the HLS-EU-Q47. Simple and multiple linear regression was performed to estimate the correlates of health literacy. In total, 37.8% of participants with AUD and 41.8% of SUD had limited health literacy. In participants with AUD, living condition factors, self-perceived health indicators, and frequency of alcohol use showed a significant effect on health literacy. In participants with SUD, financial factors, self-perceived health indicators, and injection sharing showed a significant effect. Increasing health literacy might contribute to improved health outcomes and decreased high-risk substance use-related behavior in people undergoing addiction treatment.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "877a15ccf5502baa86fda836832ea1ba",
  "timestamp": "2025-05-15T03:10:05.632230"
}