{
  "id": 6935,
  "title": "Age-Related Macular Degeneration and Incident Cardiovascular Disease: The Multi-Ethnic Study of Atherosclerosis",
  "abstract": "Objective: To determine whether age-related macular degeneration (AMD) is a risk indicator for coronary heart disease (CHD) and cardiovascular disease (CVD) events independent of other known risk factors in a multi-ethnic cohort. Design: Population-based prospective cohort study. Participants: A diverse population sample of 6233 men and women aged 45 to 84 years without known CVD from the Multi-Ethnic Study of Atherosclerosis (MESA). Methods: Participants in the MESA had retinal photographs taken between 2002 and 2003. Photographs were evaluated for AMD. Incident CHD and CVD events were ascertained during clinical follow-up visits for up to 8 years after the retinal images were taken. Main Outcome Measures: Incident CHD and CVD events. Results: Of the 6814 persons at risk of CHD, there were 893 participants with early AMD (13.1%) and 27 patients (0.5%) at baseline. Over a mean follow-up period of 5.4 years, there was no statistically significant difference in incident CHD or CVD between the AMD and non-AMD groups (5.0% vs. 3.9%, P = 0.13 for CHD and 6.6% vs. 5.5%, P = 0.19 for CVD). In Cox regression models adjusting for CVD risk factors, there was no significant relationship between presence of any AMD and any CHD/CVD events (hazard ratio 0.99; 95% confidence interval, 0.74-1.33; P = 0.97). No significant association was found between subgroups of early AMD or late AMD and incident CHD/CVD events. Conclusions: In persons without a history of CVD, AMD was not associated with an increased risk of CHD or CVD. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012;119:765-770 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "877d4e674d33040afd4adb24740ae853",
  "timestamp": "2025-05-15T03:03:13.465553"
}