{
  "id": 3349,
  "title": "VALIDITY OF CAPM & FAMA FRENCH THREE FACTOR MODEL IN THE INDIAN EQUITY MARKET",
  "abstract": "Purpose: The research paper attempts to check the validity of Capital Asset Pricing Model (CAPM) and Fama French Three Factor Model (FF3) in the context of the Indian stock market for the period 1998-2020. The primary objective was to ascertain which model explains the variation in equity returns for the companies listed on the S&P CNX 500 Index. The presence of market risk premium, size effect and value effect were also evaluated. Design/ Methodology/ Approach: For this purpose, the study used the Fama-Macbeth Methodology (1973) of two pass regression. Findings: A linear relation was found between the excess portfolio returns & the market beta. R-2 also improved while using Fama French Three Factor Model. Therefore, it was demonstrated that the three-factor model was better than CAPM at capturing the variation in stock returns. The market risk premium of CAPM independently failed to explain the variation in stock returns. However, when we consider the Fama French Three Factor Model, the size effect was found to be significant in the Indian equity markets; whereas the value effect existed but was not significant. This implied that investors could earn higher risk-adjusted returns by investing in the stocks of smaller companies and stocks of high BE/ME firms. It is noteworthy that the academicians prefer to use Fama French Three Factor Model due to its accuracy in predicting expected portfolio returns while the practitioners prefer Capital Asset Pricing Model because of its simplicity. Originality/Value: This study has been able to resolve the issue of relative efficacy of these two models in the Indian equity market whereas the other studies had provided conflicting results.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "877dff5a95385f0ad7742ca76acf8973",
  "timestamp": "2025-05-15T01:16:22.082677"
}