{
  "id": 6911,
  "title": "Implied Correlation Index: an Application to Economic Sectors of Commodity Futures and Stock Markets",
  "abstract": "An implied correlation index (ICI) measures the average correlation between all constituents of the portfolio. The concept of the index is similar to that of the S&P500 implied correlation index, but it is based on volatility estimation instead of option-implied volatility. The objective of the study is to examine the dynamics and properties of the implied correlation estimates within various economic sectors of the stock and commodity markets. We explore three commodity futures markets: metals, energy, agriculture, and five stock markets: basic materials, financials, industrials, oil & gas and technology over the period of 2006-2017. In order to capture the dynamic character of the implied correlation we propose to take into account the GARCH type approaches to calculate volatility and Value at Risk estimates of considered assets and use them in implied correlation estimates. We also found statistical properties of the implied correlation indices. The implied correlation for most sectors is both time-varying and market-state-dependent. Assets in stock sectors are on average much more dependent than assets in commodity sectors. The implied correlation exhibits clustering properties, long memory, asymmetry and co-movement with volatility. Using the Granger causality test we showed that the impact of ICI on volatility is highly statistically significant. These results provide some useful practical implications for investors and financial institution how to estimate and control time-varying dependence between the assets in the investment portfolio.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8781d2489a0ba71f3d33e689d78c5dbb",
  "timestamp": "2025-05-15T03:02:41.371641"
}