{
  "id": 6515,
  "title": "Predictors of MRI Leakage Among Patients Attributed to an Academic Medical Center Commercial Risk-Shared Insurance Contract",
  "abstract": "Purpose: For health care organizations engaged in risk-shared insurance contracts, leakage of advanced diagnostic imaging to imaging sites not affiliated with the risk-sharing organization may undermine performance on financial and quality metrics. The goal of this study was to identify factors that are predictive of leakage of MR' examinations among patients attributed to an academic health care organization's risk-shared commercial insurance contract. Methods: Administrative claims data from 2015 through 2016 for patients attributed to a single risk-shared commercial insurance contract at a large academic medical center (AMC) were analyzed. Primary outcome was MM leakage: an outpatient MRI study performed at a site not affiliated with the AMCs integrated health care system. Ordering provider alignment with the AMCs risk-shared insurance contract was categorized as strong, weak, or none. Multivariate regression analyses were conducted to evaluate the relationship between provider alignment and MRI leakage, while adjusting for selected covariates. Results: Among 8,215 patients meeting inclusion criteria, there were 13,272 MRI encounters. The overall proportion of leaked MRI studies was 12.7%. MRI studies ordered by providers with weak AMC alignment (odds ratio, 3.16; 95% confidence interval, 2.49-4.02) or no AMC alignment (odds ratio, 3.68; 95% confidence interval, 3.12-4.33) were more likely to leak than MRI studies ordered by providers with strong AMC alignment. Conclusions: An ordering provider with no alignment with an AMCs commercial risk-shared insurance contract was the strongest predictor of MRI leakage. Population health management initiatives aimed at reducing leakage should consider the impact of provider networks and clinical referral patterns that drive imaging utilization.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8791330f4e66c39514c1201f18b96f1c",
  "timestamp": "2025-05-15T02:59:07.396064"
}