{
  "id": 4540,
  "title": "The content of the audit report in the year prior to bankruptcy filing. Empirical evidence from Spain",
  "abstract": "This paper analyses empirically the content of the audit report of financially distressed firms in the year prior to bankruptcy filing, with a double purpose: to propose a classification of the content of audit reports and to examine the differences on the document depending on several features of the auditor and the audited firm. Using a sample of Spanish financially distressed companies from 2004 to 2014, results show that 13% are clean reports or reports that do not contain any disclosures, and qualifications are more frequent than matter paragraphs. Twenty-three per cent of paragraphs inform about filing for insolvency legal proceedings and 45% are related to going concern uncertainties. Additionally, there is evidence of significant differences in the content of the audit report depending on auditor size, industry and financial condition of the audited firm, the quarter on which the court order is imposed and the resolution of the bankruptcy procedure, whereas comments are independent from a change in auditor. Our evidence suggests the usefulness of the audit report in predicting financial distress risk, and this usefulness will be incremented due to the implementation of the new Audit Law in Spain, as it requires mentioning any financial risks when going concern uncertainties may exist.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "879eca370de282e1177a04c95f3e719a",
  "timestamp": "2025-05-15T02:38:20.400993"
}