{
  "id": 8954,
  "title": "The impact of government subsidy programs on equity in health financing",
  "abstract": "BackgroundIran government implemented the targeted subsidy plan in December 2010 to reduce energy consumption and inequality. In addition, the Health Transformation Plan was implemented by the Ministry of Health to reduce out-of-pocket payments. This study aimed to examine the impact of these two government subsidy programs on equity in health financing.MethodIn this study, data on 528,046 households were collected using household surveys during 14 years (2007-2020). The Fairness in Financial Contribution index and Catastrophic Health Expenditures index were calculated. Also, a Logistic regression model was performed by the applied software of Stata V.14 to examine the effects of the two mentioned policies and other socioeconomic characteristics of households on their exposure to Catastrophic Health Expenditures.ResultsThe FFC index was 0.829 and 0.795 respectively in 2007 and 2020. The trend analysis did not show significant changes in the FFC index between 2007 and 2020. TSP and HTP implementations do not reduce households' exposure to CHE significantly. Crowded households with more elder people, belonging to low-income deciles, without houses, and living in rural areas and deprived provinces, are more likely to be at risk of CHE. Health insurance coverage did not protect households from CHE. Highly educated and employed households were exposed to less CHE.ConclusionThe government subsidy programs have not been effective in improving FFC and reducing CHE indices. None of them has been able to realize the goal of the 6th National Development Plan of reducing CHE to 1%. The government should devise support packages for target households (households with more elderly people, lower incomes, without private houses, crowded, rural, and inhabited in deprived provinces), so they can protect households against CHE. Modifying and improving the quality of insurance coverage is strongly recommended due to its inefficiency.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "87abc6dc225d60a49fac32619e07c358",
  "timestamp": "2025-05-15T03:23:56.141759"
}