{
  "id": 4332,
  "title": "Banking on trust: exploring the relationship between Federal Reserve directors and financial institutions",
  "abstract": "PurposeThis study aims to analyze the risk profile of banks whose managers sit on Federal Reserve district bank boards in 2023. In particular, to analyze the impact tha Federal Reserve bank directors have on their own banks.Design/methodology/approachUse a matched sample approach to perform univariate analysis and multiple regression methodology to study whether banks whose managers sit on Federal Reserve Bank boards differ in risk profile from banks whose managers do not sit on Federal Reserve district boards.FindingsThere is limited evidence that banks managed by Fed directors have different capital ratios and leverage ratios relative to non-Fed director banks. There does appear to be a slight difference in the growth of Held-to-Maturity (HTM) Securities between the two samples. Specifically, banks managed by a Fed director saw their HTM portfolio grow over the study period, while banks managed by non-Fed directors reduced their HTM securities. Overall, the results suggest that bank directors on Federal Reserve district boards do so with no apparent detriment to the banks that they manage.Research limitations/implicationsResults of this study suggest that stakeholder director relationships are not associated with higher risk-taking at director banks. This study is unique in that, rather than looking at how director ties might influence the firm that they are on the board of, the focus here is how the firm (the Fed district, in this case) might influence director affiliations. Limitations include a small sample size (70 banks, including the matched sample), and data over a short time horizon. Additional measures of risk can also be analyzed in future research.Practical implicationsWhile there has been much speculation in the industry and in the press regarding the conflict of interest involving bank directors on Fed district boards, this research suggests there is little evidence of any risk differential involving these directors and their specialties to the Fed.Originality/valueThis study involves a unique approach to corporate governance analysis, whereby any conflict of interest that might exist between directors and the firm is studied from an alternate angle - in particular, whether the association with a regulator's board impacts the director firm's risk. Furthermore, with the recent events in the banking industry involving the collapse of several banks, including Silicon Valley, the notion that bank management participating on the boards of directors of their own regulator seemed a worthwhile question as to whether this diminished the safety and soundness of the banks that they run.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "87b4b33f94ae7a1993d3f8bf0288f4cf",
  "timestamp": "2025-05-15T01:25:50.609091"
}