{
  "id": 1305,
  "title": "Factors influencing the livelihood strategy choices of rural households in tourist destinations",
  "abstract": "Identifying the influence factors lie behind the livelihood choices of rural households are of crucial significance for improving the sustainable livelihoods of rural households in tourism regions. Five villages in Sa Pa District, Vietnam, were selected in this study, to conduct household surveys and interviews with 180 households. Based on this, a comprehensive approach, which includes multinomial/binary logistic regression, Ripley's function, and geographical detector, is applied to understand the households' capital endowment and factors lie behind their livelihood choices. Results show that for rural households, tourism livelihood yields the highest income, but the lack of diversity of livelihood activities may make tourism livelihood household more vulnerable to the external risk and shocks than balanced livelihood households. Different types of households are found to show clustering feature, with clustering degree ranking as: agricultural > balanced > tourism > labour. Households with more natural capital are less likely to choose livelihoods other than agriculture livelihood. And households with more financial capital are less likely to engage in agricultural livelihood. Both financial capital and social capital can facilitate engagement in balanced livelihood. And financial capital is key to tourism livelihood, and a barrier impeding agricultural households to participate in other livelihood activities.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "87b93d97bb039b6cf67f84bf820633d6",
  "timestamp": "2025-05-15T02:01:11.908888"
}