{
  "id": 3525,
  "title": "IPV Experiences and Financial Strain Over Time: Insights from the Blinder-Oaxaca Decomposition Analysis",
  "abstract": "Financial strain is one hardship faced by female survivors of intimate partner violence (IPV) that is often overlooked. This paper examined the relationships between multiple forms of abuse-with a focus on economic abuse-and financial strain. Guided by stress process model, this study tested two hypotheses: (1) economic abuse is associated with financial strain more than other types of IPV; and (2) decreased economic abuse relates to financial strain over time. The study sample consists of 229 female IPV survivors who participated in a longitudinal, randomized controlled study evaluating an economic empowerment curriculum. Results from regression models suggest that physical abuse and economic abuse were significantly and positively associated with the magnitude of financial strain. Oaxaca-Blinder decomposition was used to partition the mean differences of financial strain over time that was mainly attributed to the decrease in economic and physical abuse (78%). Particularly, the decrease of economic abuse contributed to over half (58%) of the decrease in financial strain over time. Advocates should assess survivors' risk of economic abuse, evaluate financial strain, and utilize financial safety planning skills to help survivors build economic security and independence. In addition, policy makers should address issues concerning economic security among female IPV survivors.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "87b909338b9316e35ddce543cf431526",
  "timestamp": "2025-05-15T02:27:19.083982"
}