{
  "id": 8986,
  "title": "The Association of Physical Activity with Glaucoma and Related Traits in the UK Biobank",
  "abstract": "Purpose: To examine the association of physical activity (PA) with glaucoma and related traits, to assess whether genetic predisposition to glaucoma modified these associations, and to probe causal relationships using Mendelian randomization (MR). Design: Cross-sectional observational and gene-environment interaction analyses in the UK Biobank. Two-sample MR experiments using summary statistics from large genetic consortia. Participants: UK Biobank participants with data on self-reported or accelerometer-derived PA and intraocular pressure (IOP; n = 94 206 and n = 27 777, respectively), macular inner retinal OCT measurements (n = 36 274 and n = 9991, respectively), and glaucoma status (n = 86 803 and n = 23 556, respectively). Methods: We evaluated multivariable-adjusted associations of self-reported (International Physical Activity Questionnaire) and accelerometer-derived PA with IOP and macular inner retinal OCT parameters using linear regression and with glaucoma status using logistic regression. For all outcomes, we examined gene-PA interactions using a polygenic risk score (PRS) that combined the effects of 2673 genetic variants associated with glaucoma. Main Outcome Measures: Intraocular pressure, macular retinal nerve fiber layer (mRNFL) thickness, macular ganglion cell-inner plexiform layer (mGCIPL) thickness, and glaucoma status. Results: In multivariable-adjusted regression models, we found no association of PA level or time spent in PA with glaucoma status. Higher overall levels and greater time spent in higher levels of both self-reported and accelerometer-derived PA were associated positively with thicker mGCIPL (P < 0.001 for trend for each). Compared with the lowest quartile of PA, participants in the highest quartiles of accelerometer-derived moderate -and vigorous-intensity PA showed a thicker mGCIPL by +0.57 mm (P < 0.001) and +0.42 mm (P = 0.005). No association was found with mRNFL thickness. High overall level of self-reported PA was associated with a modestly higher IOP of +0.08 mmHg (P = 0.01), but this was not replicated in the accelerometry data. No associations were modified by a glaucoma PRS, and MR analyses did not support a causal relationship between PA and any glaucoma-related outcome. Conclusions: Higher overall PA level and greater time spent in moderate and vigorous PA were not associated with glaucoma status but were associated with thicker mGCIPL. Associations with IOP were modest and inconsistent. Despite the well-documented acute reduction in IOP after PA, we found no evidence that high levels of habitual PA are associated with glaucoma status or IOP in the general population. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology 2023;130:1024-1036 (c) 2023 by the American Academy of Ophthalmology. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "87bcf102676da4aea9acb623e1b0e5cc",
  "timestamp": "2025-05-15T03:24:26.349046"
}