{
  "id": 7473,
  "title": "Day to Day and Environmental Risk Factors for Psychological Distress Among Healthcare Workers",
  "abstract": "The results of this study provide important qualitative and quantitative insight into health and hospital workers' experiences of distress during the COVID-19, with a focus on how workplace inequalities increased distress for vulnerable staff, including non-clinical workers. We offer suggested workplace interventions to improve mental health for health system employees. ObjectiveDespite a growing literature on mental health among clinical staff during COVID-19, factors shaping distress for nonclinical staff are understudied and may be driven by inequalities at work. We aimed to discuss the role of workplace factors in shaping psychological distress for a diverse group of clinical, nonclinical, and other health and hospital workers (HHWs).MethodsThis convergent parallel mixed-methods study with HHWs in a US hospital system included an online survey (n = 1127) and interviews (n = 73) collected from August 2020 to January 2021. We thematically analyzed interviews; findings informed log binomial regression estimating risk factors for severe psychological distress (Patient Health Questionnaire - 4 item version [PHQ-4] scores of 9 or greater).ResultsQualitatively, day-to-day stressors fostered fear and anxiety, and concerns about work environments manifest as betrayal and frustration with leadership. Distress was associated with burnout, financial concerns, and feeling betrayed or unsupported by the institution and leadership. Staff in service versus clinical roles had higher risk for severe distress (adjusted prevalence ratio = 2.04, 95% confidence interval = 1.13-2.66); HHWs receiving workplace mental health support had lower risk (adjusted prevalence ratio = 0.52, 95% confidence interval = 0.29-0.92.ConclusionsOur mixed-methods study underscores how the pandemic brought inequalities to the surface to increase distress for vulnerable HHWs. Workplace mental health activities can support HHWs now and during future crises.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "87d878e26895af6566534230f1fd466c",
  "timestamp": "2025-05-15T03:09:07.240627"
}