{
  "id": 7110,
  "title": "Economic study on the export of cape gooseberry produced by Colombian indigenous communities in post-conflict areas to Spain and Europe",
  "abstract": "Purpose The purpose of this study is to estimate and analyze the production and export viability of organic cape gooseberry to Spain, cultivated by indigenous communities in post-conflict areas. Design/methodology/approach Based on interviews with indigenous people who grow organic cape gooseberry in post-conflict areas and information from official platforms, the data are systematized, and a matrix of costs, expenses, productivity and income from the production and export of Cape gooseberry is calculated. Financial indicators of profitability are calculated: net profit, net present value (NPV) and internal rate of return (IRR). Finally, with a regression model, the trend of the behavior of the quantity and cost of Cape gooseberry exports from Colombia to Europe and Spain is estimated. Findings The production and export of organic cape gooseberry is profitable for indigenous communities in post-conflict areas, favored by a special price on the European market and by the use of family labor in cultivation, which improves the profitability of the product. Because of these factors, it is likely to become an alternative to partially replace illicit crops in post-conflict areas. Research limitations/implications This research was carried out in conflict areas, so conducting interviews in that territory put the integrity of the researchers at risk. Originality/value Studies known about organic cape gooseberry production reveal the benefits of the fruit for human health, but not the viability of production and export to Spain. This study demonstrates the financial viability of the production and export of cape gooseberry grown by indigenous people and therefore constitutes an alternative for substituting illicit crops.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "87e948f888dbae6487efa93bf7d5068a",
  "timestamp": "2025-05-15T03:05:03.584675"
}