{
  "id": 3115,
  "title": "ANTIHISTAMINES: RESEARCH AND ANALYSIS OF THE REGIONAL RETAIL MARKET",
  "abstract": "The aim. Focused on optimizing the assortment portfolio of pharmacy organizations and improving the process of drug supply to end-consumers, the aim of the study was to analyze the regional pharmaceutical market for antihistamines. Materials and methods. In the study, the following methods were used: a content analysis of regulatory documents; a documentary observation method of the volume of antihistamines sales; a sociological survey method. The objects of the study were accounting registers in 32 pharmacy organizations for 2020, as well as the sociological survey results of 174 respondents - consumers of antihistamines. Results. The classification analysis of 38 international non-proprietary trade names of antihistamines, represented by 187 names of drugs, revealed the prevalence of the first-generation drugs (63%). On the Russian pharmaceutical market, there were also 55% of foreign production drugs. At the regional level, there are 66 types of drugs in circulation, 50% of which are second-generation ones. The cost analysis showed rather a wide rage of the pricing proposal and the economic availability of antihistamines for patients. The sociological survey revealed the fact that 46% of the consumers were ready to pay for the necessary drugs in the price range over 100 and up to 500 rubles (over $ 1.38 and up to $ 6.88) for one conventional package. A medical-demographic profile of the antihistamines consumer at the regional level has been made up, and guidelines for pharmaceutical specialists on managing the assortment portfolio of pharmaceutical organizations have been developed. Conclusion. As a result of the study, the following facts have been established: the seasonal peaks in the antihistamines consumption; a gradual renewal of the pharmacies assortment portfolio due to the increased consumption of the second and third generation antihistamines. The medical and demographic profile of the consumer should be taken into consideration when planning a drug provision for the patients with allergic pathologies, and it is connected with the growth in pharmacies profits due to the sale of drugs in the range from 100 to 500 rubles (from $ 1.38 to $ 6.88). The methodical recommendations have been brought to the attention of the management of regional pharmacy organizations.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "87ee46ee737c42e7141d44d995462196",
  "timestamp": "2025-05-15T01:13:45.214566"
}