{
  "id": 689,
  "title": "Unlocking credit access: Using non-CDR mobile data to enhance credit scoring for financial inclusion",
  "abstract": "A significant portion of the global adult population, particularly in developing markets, lacks access to formal credit due to the absence of traditional credit histories. This presents a major challenge for financial institutions, FinTech companies, and policymakers aiming to promote financial inclusion. While conventional credit scoring models are built on established financial data, the growing penetration of mobile phones offers an alternative means to assess credit risk. Unlike prior research focused on Call Detail Records (CDRs)-data generated by telecommunication providers capturing users' call and message activities, such as duration, frequency, and timing-this study investigates the predictive power of a broader spectrum of mobile usage data, including non-CDR attributes like social media engagement and web browsing habits, in assessing credit risk. Using a broad range of machine learning algorithms on actual mobile usage data from over 1,500 demographically diverse individuals over a two-week period, we find that while these mobile usage attributes alone cannot fully replace FICO scores in regression models (R2=0.30), they significantly enhance the accuracy of classification models, especially when combined with CDR data (Accuracy=0.89). These findings have important implications for credit markets in emerging economies, pathways for financial institutions and FinTech companies to engage with unbanked populations and support the growth of alternative credit assessment tools.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8806d2abdf489dc009f287187ff26c16",
  "timestamp": "2025-05-15T01:53:59.364706"
}