{
  "id": 3116,
  "title": "Entrepreneurship, subjective risk intelligence and SMEs' financial stability: evidence from Italy",
  "abstract": "PurposeThis paper applies an original construct of subjective risk intelligence (SRI) to the small business context. By leveraging on its multidimensionality, it aims to shed light on the existing ambiguities in the analysis of the relationship between the entrepreneurial attitude towards risk evaluation and firms' financial stability.Design/methodology/approachThe empirical investigation refers to the Italian context, where an ad hoc survey has been administered to a sample of small businesses. Based on both a linear and a semiparametric regression, results show a significant relationship between SRI and firm's financial structure, and that such relationship is basically nonlinear.FindingsEvidence shows that entrepreneurs with a high level of risk intelligence run highly leveraged firms. Moreover, in the light of the non-linearity of such relationship, higher levels of risk intelligence are associated with a greater capacity of the entrepreneur to govern the financial balance of the enterprise only up to a certain threshold. Over this threshold, risk intelligence generates overconfidence leading the entrepreneur to a reckless behaviour in taking financial risks.Originality/valueFrom a theoretical point of view, the paper contributes to the literature by shedding lights on the complexity of the relationship between risk intelligence and small businesses. From a policy point of view, findings suggest that, to train new entrepreneurs, the educational system aims should focus on the development of two specific soft skills: the ability to manage emotions and the ability to glimpse opportunities even in uncertain situations.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8810539cd52e2e30b23e055715bcc8a8",
  "timestamp": "2025-05-15T02:22:56.651262"
}