{
  "id": 1497,
  "title": "DYNAMIC CREDIT EVALUATION MODEL OF FAMILY FARMS AND RANCHES INTEGRATED WITH MULTIPLE METHODS AND ITS APPLICATION",
  "abstract": "Underfinancing is the main problem hindering the sustainable development of family farms and ranches (FF & R). Their support by financial institutions can be improved by constructing and implementing a scientifically substantiated and experimentally validated credit evaluation system. Given the inconsistency of various credit risk evaluation methods, static evaluation in a single time is mainly used, biasing the results. This study attempts to mitigate the above limitations, combined with the credit characteristics of insufficient sample accumulation and time fluctuation of FF & Rs in Inner Mongolia, China, by introducing the time weight into respective analysis. Using the method of time from far to near and the weight from small to large, it carries out dynamic data conversion and builds a dynamic evaluation model of FF & R credit portfolio. The model is based on the credit ranking average method combined with entropy weight, logistic regression, and neural network evaluation techniques. One of the main contributions of this paper is that time is included in the credit evaluation system to measure the credit change trend of FF & Rs in different years, reflecting their dynamic credit change characteristics. The comprehensive evaluation results of FF & Rs are obtained through the time-weighted model, making the evaluation conclusion more objectively reflecting their actual credit status. Secondly, the paper integrates three classical methods, namely the entropy weight model of systematic evaluation, the logistic regression model of statistics and measurement, and the neural network model of artificial intelligence, improving the reliability and accuracy of FF & R credit evaluation results.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "881532e44deaa95e5ff0983a29d2b7dc",
  "timestamp": "2025-05-15T02:03:39.816170"
}