{
  "id": 4648,
  "title": "Forming a financial model of carbon regulation in the context of the decarbonization objectives for the Russian Federation",
  "abstract": "The article addresses financial issues of carbon regulation. The research purpose was to identify the features and problems of the financial model development of carbon regulation in the Russian Federation. The research objectives included substantiation of the model concept, systematization of models used in international practice, characterization and assessment of the current stage of the concerning model development in the Russian Federation. According to the research hypothesis, at the early stages of development, the financial model of carbon regulation in the Russian Federation is soft, providing rather a signal effect for business and not having a significant impact on the implementation of national objectives of decarbonization. In the study of international and Russian experience in the implementation of financial models of carbon regulation, methods of content analysis and statistical processing of relevant information were applied. The theoretical results of the research include the analyzed model concept, a refined classification of its main types and a model of its rigidity index. Systematization and evaluation of applied aspects of the problem allow us to conclude that the financial model of carbon regulation in the Russian Federation is super-soft, which has advantages for business, but actualizes such challenges as the effect of the green paradox, the risk of importing environmental problems from countries with stricter climate requirements and the green washing problem. It is argued that the development of the financial model of carbon regulation in the Russian Federation requires improving the system of incentive tools, tightening climate reporting standards, formalizing requirements for corporate climate strategies, as well as a differentiated approach adapted to regional business conditions. The research results will be in demand in further academic and expert work in this field. In particular, they can be used in climate strategizing, including in substantiating recommendations for the implementation of the Low-Carbon Development Strategy of the Russian Federation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88293e5eea18983cf98fe60099c13ec8",
  "timestamp": "2025-05-15T02:39:27.009313"
}