{
  "id": 4308,
  "title": "Artificial intelligence and firm growth - catch-up processes of SMEs through integrating AI into their knowledge bases",
  "abstract": "Artificial intelligence (AI) is seen as a key technology for future economic growth. It is labelled as a general-purpose technology, as well as an invention of a method for inventing. Thus, AI is perceived to generate technological opportunities and through these, innovations, and productivity growth. The leapfrogging hypothesis suggests that latecomer firms can use these opportunities to catch up. The aim of this paper is to provide insight into this catch-up process of latecomer firms through integrating AI into their knowledge portfolio and thereby creating new technological trajectories. The moderating effect of firm size is also analysed. Combining firm-level data with patent data, a regression at the firm level is conducted. Evidence is found that smaller firms experience productivity growth from AI when operating at the productivity frontier, indicating the opposite of the leapfrogging hypothesis. However, there is evidence for the positive im pact of AI on firm innovation, which is higher for latecomer firms that are larger in size. In general, we find a diverging pattern of the influence of AI on productivity and innovation growth, indicating the need for a finer grained analysis that takes indirect effects - that also could explain the observed productivity paradox - into account. Plain English Summary Small frontier firms experience a higher labour productivity growth through AI integration. In contrast, large latecomer firms experience a higher innovative productivity growth. These effects are dependent on the type of AI. Artificial intelligence (AI) is seen as a key technology for future economic growth. It is labelled as a general-purpose technology, as well as an invention of a method for inventing. Thus, AI is perceived to generate innovations and productivity growth. This paper investigates the influence of different types of AI on smaller and larger firms that are either frontier or latecomer firms. We find that smaller frontier firms experience a higher labour productivity growth while larger latecomer firms experience a higher innovative productivity growth. This diverging impact has implications for scholars, as it could partially explain the productivity paradox and shows the need for research on specific types of AI. This impact also has implications for policy makers and practitioners alike that aim to strengthen frontier firms or to develop latecomer firms.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "883e80c849eca58bafe6c8949597759a",
  "timestamp": "2025-05-15T01:25:50.508053"
}