{
  "id": 1802,
  "title": "Student perceptions of using the PebblePad e-portfolio system to support self- and peer-based formative assessment",
  "abstract": "The primary objective of the action research project discussed here was to monitor the implementation of an innovative course redesign in which the PebblePad e-portfolio system was used as the medium to support the introduction of self- and peer-based formative assessment strategies to approximately 170 students in the first year of a Bachelor of Education Honours Degree (BEd (Hons)) course. Successful completion of the four-year degree qualifies graduates to teach in primary (elementary) schools in Scotland. Action research was selected as a design due to its ability to support practitioner research whose express aim is to bring about change and improve practice through active learning and engagement. Students completed two questionnaires describing their experiences of assessment and feedback and of PebblePad usage on the course and detailing the impact of these on their ability to self-regulate learning. Findings were subjected to descriptive statistical analysis and indicate that self-and peer-based formative assessment was effective in fostering self-regulation in students and that this process was enhanced by adoption of the e-portfolio system. Further research may seek to explore the effectiveness of other ICT tools to support formative assessment and the extent to which self-regulation may foster positive attitudes to lifelong learning.",
  "year": 2012,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88585b6960afbf7712778f22b9853ec8",
  "timestamp": "2025-05-15T00:59:53.151518"
}