{
  "id": 7531,
  "title": "Characteristics of patients requesting an abortion beyond 14 weeks of gestation: Retrospective study in Brussels",
  "abstract": "Objectives: The debate over extending the legal time limit for abortion in Belgium has intensified in recent years. Health care providers must refer patients seeking abortion beyond the legal deadline to other countries, such as the Netherlands, where the time limits are more permissive. In light of this situation, we analyzed the demographic and social characteristics of patients requesting abortion after 14 weeks of gestation and compared them with those seeking the procedure within the legal limits. Study design: This retrospective study examines the sociodemographic characteristics of individuals requesting abortion at City Planning Brussels between January 1, 2022, and March 30, 2023. We employed logistic regression to identify predictive factors for late abortion. Results: We analyzed 627 abortion requests, with 593 occurring before 14 weeks and 34 after 14 weeks. Patients seeking abortion due to precarity or rape had a higher risk of presenting beyond the legal time limit (odds ratio [OR] 3.64, p = 0.001, and OR 3.96, p = 0.009, respectively). Factors that appeared to reduce this risk included requests for abortion based on personal reasons (lack of desire for a child) and being covered by mutual health insurance (OR 0.22, p < 0.001, and OR 0.25, p = 0.001). Conclusions: Management of late abortion in Belgium is difficult due to law's restriction. Our data indicate that the circumstances resulting in late abortion requests are often complex, frequently involving factors such as financial difficulties and precarity. A law modification is necessary to provide uniform and effective care for these patients.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8869365649de9bcf5d790c78e339d751",
  "timestamp": "2025-05-15T03:09:36.885101"
}