{
  "id": 83,
  "title": "Study on early warning of E-commerce enterprise financial risk based on deep learning algorithm",
  "abstract": "With the development trend of economic progress, the capital business of e-commerce enterprises has become complicated. The financial risk of listed companies is a problem that needs to be paid attention to. The financial risk of e-commerce companies is a complex and gradual process, and its unique reasons may be many. E-commerce companies are facing financial risks or difficulties, and bankruptcy and liquidation are also increasing. Financial risk has seriously affected e-commerce companies and society. As a result, the early warning methods of financial risks have been constantly improved. With the arrival of the new economic era in the era of knowledge economy, the early warning of financial risks in e-commerce companies has become a hot issue in the financial management of e-commerce companies. Based on the deep learning algorithm, this paper studies from the perspective of establishing the financial early warning model based on deep learning and constructing the financial risk early warning mechanism of e-commerce companies, and analyzes and forecasts the financial risks of listed companies. Through the construction of financial security early warning system, crisis signals can be diagnosed as soon as possible, and crisis signals can be prevented and solved timely and effectively.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8870570f43d73b08eaceb728b91f9101",
  "timestamp": "2025-05-15T01:33:49.017704"
}