{
  "id": 4011,
  "title": "How does relationship length influence donation amount over time for regular members of nonprofit organizations - the moderating role of donation frequency",
  "abstract": "Purpose The purpose of this study is to investigate whether a U-shaped relationship exists between the length of time a donor has been a regular member in a nonprofit organization and the amount donated over time. In addition, this research analyzes whether this relationship is moderated by donation frequency. Design/methodology/approach Using a database of 6,137 members from a collaborating nonprofit organization, a longitudinal study is conducted over an eight-year period (2013-2020). A set of ordinary least square (OLS) regression analyses are carried out to empirically test the proposed hypotheses. Findings This study finds a nonlinear, U-shaped relationship between donation amount and relationship length. This effect can be explained through the dynamic evolution of two dimensions of commitment: affective (decreasing over time) and normative (increasing over time). The results also reveal that these effects, however, become flatter for members who engage in more frequent donations. Originality/value The results provide novel insights revealing the nonlinear nature of the relationship between the length of time a donor has been a member of a nonprofit organization and the amount donated, and underscores the moderating role of donation frequency, which makes the U-shaped relationship flatter, thus increasing the amounts donated. Despite their relevance in the service ecosystem, nonprofits have been under-represented in prior work. This study offers important practical insights into the effective management of the regular donor portfolio.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88767758923745a81434f68133f7c275",
  "timestamp": "2025-05-15T01:23:07.330693"
}