{
  "id": 3362,
  "title": "Does CSR matter? Influence of corporate social responsibility on corporate performance in the creative industry",
  "abstract": "The contribution from the creative industry to the regional economic growth has made the creative industry a new driver in economic development. But as a relatively young economic sector, the creative industry has its unique way of profiting through generating intellectual property with human creativity, talents, and skills. This profiting mechanism draws attention from both academia and industry to explore the factors that influence the performance of creative industry. This study explores the relationship between corporate social responsibility and financial performance of the creative industry. Using the dynamic DEA approach, we evaluated the longitudinal efficiency performance of 53 creative firms during the period of 2010-2013. Regression analysis was employed to determine if corporate social responsibility influences financial performance. The empirical results indicated that content media related businesses, which include motion pictures, publishing, and broadcasting, are the performance growth leaders, and the regression result showed that corporate social responsibility has a significant positive influence on the financial performance of the creative industry. In addition, the results also revealed that risk taking and capital oriented characteristics exist within the creative industry.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88779907e83c541d131579fa2ff9f4ae",
  "timestamp": "2025-05-15T02:25:13.815043"
}