{
  "id": 5948,
  "title": "Measuring tail risk with GAS time varying copula, fat tailed GARCH model and hedging for crude oil futures",
  "abstract": "Considering the leptokurtic feature and clustering effect of returns distribution in portfolio as well as the nonlinear dependence structure among multiple variables of financial assets, the crude oil futures returns are assumed to follow Skew t distribution, with the asymmetric GJR-GARCH-Skew t model used to characterize the marginal distribution of crude oil futures returns. By utilizing the generalized autoregressive score (GAS) method to update copula function parameters over time, the GAS time varying copula model is employed to describe the nonlinear dependence among futures returns variables. Then the GJR-GARCH-Skew t-GAS copula model is constructed for the crude oil futures markets to investigate the fitting performances of marginal distributions combining with time-varying copula models. In addition, we modify the previous two-stage estimation method with modified quasi-maximum likelihood estimator for the GARCH model with heavy tailed innovation error. Furthermore, we utilize the newly constructed model to analyze the tail dependence and to measure the portfolio risk for crude oil futures markets, along with calculating the dynamic hedge ratio for crude oil spot. Empirical studies have found that the Brent and WTI crude oil futures exhibit higher peakness, thick tails and persistent volatility, which are suitable for the GJR-GARCH-Skew t marginal distribution. Connecting with constant and time-varying copulas functions, the tail dependence and portfolio risk of VaR and ES are investigated. It illustrates that the GAS Rotated Gumbel copula captures the tail behaviors best, with the corresponding dynamic tail dependence and risk measurements computed. Moreover, we compare the dynamic hedging efficiency of the crude oil futures employing different GAS copulas to enlighten investors.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8883b82406b34358db4adadd107644ed",
  "timestamp": "2025-05-15T02:53:03.135009"
}