{
  "id": 3521,
  "title": "An Analysis of Indonesian Farmer's Financial Literacy",
  "abstract": "The uncertainty of income earned by farmers, namely crop failure with a very high risk, will cause financial problems in their families. The target or respondents of this study are farmers who live in Lahat Regency, South Sumatera. Initial findings indicate that the level of financial inclusion of farmers in the Lahat Regency is still quite low. The purpose of this study is to analyze the level of farmers' financial literacy, identify the components of farmers' financial literacy, and analyze the factors that affect the level of farmers' financial literacy. The research method applied is descriptive analysis and multiple regression. The analysis showed that most of the literate farmers were in the moderately literate category of 47.2 percent and the least of the farmers in the less literate category was 24.5 percent. The financial attitude component gave the largest contribution to the farmers' financial literacy index, which was 0.73. Besides, the factor affecting the level of financial literacy of farmers is education. The policy implication resulting from this research is the existence of a structured promotion and training of financial literacy for farmers by local governments. In addition, campaigning for the importance of being educated and inviting educated people to start running agricultural business activities.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "888386a1adb3b292b52874aedcc9d024",
  "timestamp": "2025-05-15T02:27:19.078990"
}