{
  "id": 4455,
  "title": "Clinical mortality risk factors of variceal upper gastrointestinal bleeding in a Malagasy surgical intensive care unit",
  "abstract": "Background: Variceal upper gastrointestinal bleeding is a dreadful complication of portal hypertension with a significant morbidity and mortality. Different prognostic scores can be used. However, in the local context of Madagascar, the completion of paraclinical investigations can be delayed by the limited financial means of patients. Hence, determining clinical mortality risk factors of variceal upper gastrointestinal bleeding could be interesting. The aim of the study was to evaluate the clinical mortality risk factors of variceal gastrointestinal bleeding (VUGIB). Method: An observational, cohort retrospective study was conducted over an 8-year period (2010-2017), at the surgical intensive care unit of the J.R. Andrianavalona University Hospital, Antananarivo, in patients admitted for VUGIB confirmed by upper gastrointestinal endoscopy and whose clinical examination was performed at admission. The primary endpoint was intensive care unit (ICU) mortality. Univariate analysis and multivariate logistic regression analysis were performed to identify risk factors for ICU mortality, with OR defining odds ratio. A p value < 0.05 was considered significant. Results: 1920 patients were admitted for gastrointestinal bleeding of any digestive causes; the source of bleeding was variceal in 269 patients (14%). The predominantly male population (sex ratio = 2.5), aged 47.1 +/- 13.7 years was mostly American Society of Anesthesiologists (ASA) 1 classification (58.4%). In 56.5% of patients, the gastrointestinal bleeding had not occurred before. The mortality rate was 16.0%. Three major clinical factors of mortality were identified: previous endoscopic band variceal ligation (OR = 12.57 [2.18-72.58], p = 0.005), tachycardia > 120 bpm (OR = 2.91 [1.04-8.14], p = 0.041), and ascites (OR = 3.80 [1.85-7.81], p < 0.001). Conclusion: Upper gastrointestinal bleeding may be life-threatening. The mortality scores are certainly useful; however, the identification of clinical factors is interesting in countries like Madagascar, pending the results of paraclinical investigations.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "888fc5c43125ec1c27b90a8545094de2",
  "timestamp": "2025-05-15T02:37:16.968142"
}