{
  "id": 6216,
  "title": "Nonlinear impacts of board independence on debt financing: Contingent on the shareholdings of the largest shareholder",
  "abstract": "Shareholder interest is unprotected until and unless precise financial decision making is in place. Although literature supports the independent directors' monitoring function in a decision-making process, for a controversial debt financing issue, the influence of the largest shareholders may hinder such an action. This study aims to delineate the association between board independence and debt financing when the largest shareholders are likely to play a significant role between them. With a sample of Vietnamese listed companies from 2007 to 2016, our regression analyses show that a nonlinear U-shaped relationship between level of board independence and debt financing is stronger among the largest shareholders with a high level of shareholdings in their shareholding group than the full sample. This finding implies the determining influence of the largest shareholders with a high level of shareholdings in a company. However, this association is not found in companies with a low level of shareholdings by the largest shareholders. Results reveal that the largest shareholders have the incentive to influence the decision making of independent directors about debt financing when their shareholdings are high. Specifically, issuing more debt to raise capital for business reduces the risk of the largest shareholders losing their controlling rights. The results are further supported by several robustness checks and controlling for economic events such as the global financial crisis and ASEAN Economic Community.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88911676bc063256b443c50bfb93615f",
  "timestamp": "2025-05-15T02:56:10.563077"
}