{
  "id": 6057,
  "title": "Associations between COVID-19-related changes in the psychosocial work environment and mental health",
  "abstract": "Background: Individuals' lives have been substantially affected by the COVID-19 pandemic. We aimed to describe changes in psychosocial work environment and mental health and to investigate associations between job insecurity and mental ill-health in relation to changes in other psychosocial work factors, loneliness and financial worries. Methods: A sub-sample of individuals from the eighth Swedish Longitudinal Occupational Survey of Health answered a web-based survey in early 2021 about current and pandemic-related changes in health, health behaviours, work and private life. We investigated participants working before the pandemic (N=1231) in relation to standardised measures on depression, anxiety and loneliness, together with psychosocial work factors, in descriptive and logistic regression analyses. Results: While 9% reached the clinical threshold for depression and 6% for anxiety, more than a third felt more worried, lonelier or in a low mood since the start of the pandemic. Two per cent had been dismissed from their jobs, but 16% experienced workplace downsizings. Conditioning on socio-demographic factors and prior mental-health problems, the 8% experiencing reduced job security during the pandemic had a higher risk of anxiety, but not of depression, compared to employees with unaltered or increased job security. Loneliness and other psychosocial work factors explained more of the association than objective measures of job insecurity and financial worries. Conclusions: Reduced job security during the COVID-19 pandemic seems to have increased the risk of anxiety among individuals with a strong labour market attachment, primarily via loneliness and other psychosocial work factors. This illustrates the potentially far-reaching effects of the pandemic on mental health in the working population.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "889197f29abdcd5eedea13d062d26178",
  "timestamp": "2025-05-15T02:54:03.526047"
}