{
  "id": 786,
  "title": "Sample average approximation of CVaR-based hedging problem with a deep-learning solution",
  "abstract": "Conditional Value-at-Risk (CVaR) is an extremely popular risk measure in finance and is usually optimized to reduce the risk of large losses. This paper considers the CVaR optimization problem for hedging a portfolio of derivatives with bounded constraints. We focus on minimizing the CVaR of the loss of the hedging portfolio by a deep learning solution because of its promising application to classic portfolio optimization. As the cost objective function in the deep learning framework, the CVaR does not have a closed-form expression, but it can be estimated by using the i.i.d samples average approximation method. While many works have adopted minimizing the estimated CVaR to obtain the optimal solution, they lack theoretical performance guarantees for sample-based solutions. This paper attempts to bridge this gap. On the one hand, we introduce a typical deep neural network architecture for training the optimal hedging strategies, which helps us to analyze the properties of function set for this neural network. On the other hand, we offer a sufficient condition to guarantee that the optimal strategies obtained by using the estimated CVaR can be assured in practical applications. In particular, we prove that the uniform convergence in probability of the estimated CVaR to CVaR over a set of functions, which are generated by the proposed deep neural network. Numerical experiments verify the proposed sufficient condition and demonstrate the feasibility and superiority of this approach.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88a5b0924deccc660534e0aa35b2069e",
  "timestamp": "2025-05-15T00:47:50.451185"
}