{
  "id": 6658,
  "title": "The Moderating Effect of Gender on the Relationship Between Self-neglect and Suicidal Ideation in Older Adults of Korea",
  "abstract": "Objectives: Previous studies have reported that self-neglect, which may be a sign of elder abuse, can result in suicide among older adults. The signs of self-neglect and its impact on the risk of suicide may differ by gender. Thus, this study explored the association between self-neglect and suicide risk in older Korean adults and examined the potential moderating effect of gender on this relationship. Methods: Data were collected from 356 Korean adults aged 65 or older through an online survey. Multiple regression analysis was used to test the research hypothesis. First, the associations between 4 sub-dimensions of self-neglect (i.e., daily life management issues, personal hygiene issues, financial management issues, and relational issues) and suicidal ideation were examined. Then, the moderating effect of gender on these relationships was investigated by including interaction terms. Results: Self-neglect was significantly associated with suicidal ideation in older adults. Aspects of self-neglect related to daily life management and relational factors were key predictors of suicidal ideation. Gender significantly moderated the effect of the relational dimension of self-neglect on suicidal ideation. The relational dimension of self-neglect was more strongly associated with suicidal ideation in older women than in older men. Conclusions: The findings suggest the importance of screening older adults with signs of self-neglect for suicide risk. Special attention should be paid to older women who experience relational issues as a high-risk group for suicidal ideation. Public programs and support systems should be established to improve daily life management and promote social relationships among older adults.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88b52bde185edf3f642fd7fcbbaf4540",
  "timestamp": "2025-05-15T03:00:05.086482"
}