{
  "id": 7262,
  "title": "Health Inequities Among East and South Asian Gamblers During COVID-19: Key Risk Factors and Comorbidities",
  "abstract": "Online gambling during COVID-19 has been associated with a variety of risk factors and comorbidities, such as co-occurring substance use, mental health problems, and financial concerns and gambling motives. Far less is known about these impacts on ethno-cultural populations, including East and South Asian gamblers. The present study has attempted to explore the health inequities related to these comorbidities and risk factors among East and South Asian gamblers. A cross-sectional online survey of gamblers in Ontario, Canada, was carried out in August 2020-a time when most land-based gambling venues were not operating at full capacity. Descriptive statistical analyses, odds ratios, and negative binomial regression (NBR) were used to compare East and South Asian gamblers to other online gamblers in Ontario. The total survey sample of 2,012 gamblers included sub-samples of East Asian (n = 206) and South Asian gamblers (n = 107). Compared to other gamblers in Ontario, East and South Asians reported higher likelihood of severe gambling problems, risky financially focused gambling motives, gambling under the influence of alcohol, and elevated levels of mental health problems. An adjusted NBR analysis noted that East Asians were more highly involved in online gambling during the pandemic, compared to non-East Asian gamblers. This study has presented an array of factors representing potential health inequities among East and South Asian gamblers during the pandemic. These findings merit further investigation and replication in order to inform the development of appropriate support resources.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88b761affb04f322d446b381c5e79906",
  "timestamp": "2025-05-15T03:06:35.457151"
}