{
  "id": 5279,
  "title": "Valuing emerging markets companies: New approaches to determine the effective exposure to country risk",
  "abstract": "The aim of the paper is to propose new measures of the effective country risk exposure for companies operating in emerging markets. In particular, we propose seven new approaches and a revised CAPM for emerging markets. We classified the new approaches into Forward-looking and Historical measures, with the former measures based on growth estimates, and the latter based on the historical growth. We tested the Historical measures of company exposure to country risk on Latin America emerging-market companies, according to the classification of the MSCI Emerging Markets Latin America Index, and on US multinational companies listed in the Dow Jones Industrial Average. The results of the test confirm that the new approaches can be effectively applied by financial analysts both to emerging-market companies and to mature-market multinational companies that operate in emerging markets, providing with a more reliable estimate of both the premium effectively requested by investors in the past and the actual premium. Applying the new approaches, the cost of equity reflects the effective exposure of a company to country risk without being over-or underestimated, as is the case with other existing approaches. Our empirical research shows a diffuse undervaluation of country risk. (C) 2016 Elsevier B. V. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88d69c82dcaa52a0fa6a56c9bee700bd",
  "timestamp": "2025-05-15T02:46:16.188700"
}