{
  "id": 4065,
  "title": "Higher-order comparative reward processing is affected by noninvasive stimulation of the ventromedial prefrontal cortex",
  "abstract": "A crucial skill, especially in rapidly changing environments, is to be able to learn efficiently from prior rewards or losses and apply this acquired knowledge in upcoming situations. Often, we must weigh the risks of different options and decide whether an option is worth the risk or whether we should choose a safer option. The ventromedial prefrontal cortex (vmPFC) is suggested as a major hub for basic but also higher-order reward processing. Dysfunction in this region has been linked to cognitive risk factors for depression and behavioral addictions, including reduced optimism and feedback learning. Here, we test whether modulations of vmPFC excitability via noninvasive transcranial direct current stimulation (tDCS) can alter reward anticipation and reward processing. In a financial gambling task, participants chose between a higher and a lower monetary risk option and eventually received feedback whether they won or lost. Simultaneously feedback on the unchosen option was presented as well. Behavioral and magnetoencephalographic correlates of reward processing were evaluated in direct succession of either excitatory or inhibitory tDCS of the vmPFC. We were able to show modulated reward approach behavior (expectancy of greater reward magnitudes) as well as altered reevaluation of received feedback by vmPFC tDCS as indicated by modified choice behavior following the feedback. Thereby, tDCS not only influenced early, rather basic reward processing, but it also modulated higher-order comparative feedback evaluation of gains and losses relative to alternative outcomes. The neural results underline this idea, as stimulation-driven modulations of the basic reward-related effect occurred at rather early time intervals and were followed by stimulation effects related to comparative reward processing. Importantly, behavioral ratings were correlated with neural activity in left frontal areas. Our results imply a dual function of the vmPFC consisting of approaching reward (as indicated by more risky choices) and elaborately evaluating outcomes. In addition, our data suggest that vmPFC activity is associated with adaptive decision-making in the future via modulated behavioral adaptation or reinforcement learning.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88db7ce4c7eb685d1feeeae1f0fef171",
  "timestamp": "2025-05-15T02:33:03.359190"
}