{
  "id": 8504,
  "title": "Thirty-Day Hospital Revisit Rates and Factors Associated With Revisits in Patients Undergoing Septorhinoplasty",
  "abstract": "IMPORTANCE Estimates of the 30-day hospital revisit rate following septorhinoplasty and the risk factors associated with revisits are unknown in the current literature. Surgical 30-day readmission rates are important to establish, as they are increasingly used as a quality care metric and can incur future financial penalties from third-party payers and government agencies. OBJECTIVE To determine the rate of 30-day hospital revisits following septorhinoplasty and the risk factors associated with revisits. DESIGN, SETTING, AND PARTICIPANTS A retrospective cohort analysis was conducted of 175 842 patients undergoing septorhinoplasty between January 1, 2005, and December 31, 2009, using data from the Healthcare Cost and Utilization Project state inpatient database, state ambulatory surgery database, and state emergency department database from California, Florida, and New York. Information on revisits for these patients was collected from the 3 databases between January 1, 2005, and December 31, 2012. Data analysis was conducted from September 1, 2014, to May 1, 2015. MAIN OUTCOMES AND MEASURES Hospital revisits within 30 days after an index septorhinoplasty and the primary diagnosis at the time of the revisit were the main outcome measures. The revisit rate was calculated within subgroups of patients based on different demographic and clinical characteristics. A multivariable model was then used to determine independent risk factors for the occurrence of a hospital revisit within 30 days of the septorhinoplasty procedure. RESULTS In total, 11 456 of 175 842 patients (6.5%) who underwent septorhinoplasty procedures revisited the hospital within 30 days of the procedure. Most of these revisits (6353 [55.5%]) were to the emergency department. The most common primary diagnosis was bleeding or epistaxis, occurring in 2150 patients (1.2%). Multivariable logistic regression showed that patients aged 41 to 65 years (adjusted odds ratio [aOR], 1.09; 99% CI, 1.02-1.16) or older than 65 years (aOR, 1.23; 99% CI, 1.06-1.43) had an increased revisit rate, as did black patients (aOR, 1.39; 99% CI, 1.16-1.66); those with Medicare (aOR, 1.55; 99% CI, 1.32-1.81) and Medicaid (aOR, 1.63; 99% CI, 1.33-2.01); those with diagnoses of autoimmune disorders or immunodeficiency (aOR, 2.69; 99% CI, 1.20-6.03), coagulopathy (aOR, 2.06; 99% CI, 1.33-3.20), anxiety (aOR, 1.79; 99% CI, 1.55-2.07), and alcohol use (aOR, 1.70; 99% CI, 1.35-2.14); and those who had a conchal cartilage graft (aOR, 2.01; 99% CI, 1.29-3.14). CONCLUSIONS AND RELEVANCE The study results suggest that patients with more medical comorbidities and lower socioeconomic status most commonly returned to the emergency department for surgical complications, such as bleeding or epistaxis, in the 30-day period after the procedure. These data provide valuable preoperative counseling information for patients and physicians. In addition, this study provides data to third-party payers or government agencies in which postprocedure readmissions in the 30-day period are used as a quality care metric affecting reimbursements and financial penalties.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88f4554e7f3f206eb325773d0bdd8fda",
  "timestamp": "2025-05-15T03:19:21.370469"
}