{
  "id": 4146,
  "title": "Evaluating the effectiveness of green bonds and clean cryptocurrencies as hedging tools in volatile financial environments",
  "abstract": "PurposeCryptocurrencies have transformed the financial landscape and raised environmental concerns, particularly distinguishing between energy-intensive (dirty) cryptocurrencies and environmentally friendly (green) cryptocurrencies. This study investigates the role of energy-intensive and ecologically friendly cryptocurrencies in sustainable investments, exploring their potential as hedging tools amid market and geopolitical stresses.Design/methodology/approachEmploying a time-varying parameter vector auto-regression (TVP-VAR) connectedness approach, the research analyzes the interactions and spillover effects among clean and dirty cryptocurrencies, green bonds, and traditional financial assets. It also explores portfolio diversification strategies like minimum variance, correlation and connectedness portfolios, evaluating their risk minimization efficacy while incorporating green financial instruments. Empirical data on daily closing prices and financial indices are used to assess financial interconnectedness and evaluate portfolio diversification strategies.FindingsGreen bonds consistently provide strong hedging capabilities, while clean cryptocurrencies exhibit a more nuanced role influenced by market maturity and regulations. The results underscore the significance of promoting green finance to bolster investments in sustainable projects and enhance risk management strategies for investors. This research enriches the green finance literature by detailing the financial interconnectedness within the market and providing strategic insights for embedding sustainability in investment portfolios against a backdrop of global economic and geopolitical uncertainties.Research limitations/implicationsThe research highlights the importance of green finance in promoting sustainability and reducing environmental impact. It advocates for regulatory frameworks that support sustainable financial instruments, encouraging the development of financial products aligned with environmental goals and fostering a more sustainable economy.Practical implicationsThese research findings provide actionable guidance for investors and policymakers to develop diversified investment strategies incorporating green bonds and clean cryptocurrencies capable of balancing risks and returns. The study also urges policymakers to establish clear guidelines and incentives for green investments, improving transparency and effectiveness in green finance markets.Originality/valueThis study uses an innovative TVP-VAR connectedness approach to examine the interactions and spillover effects among clean and dirty cryptocurrencies, green bonds and traditional financial assets. It provides new insights into the roles of green bonds and clean cryptocurrencies as hedging tools in volatile markets, enhancing the understanding of financial interconnectedness and sustainable investment strategies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88f8ea76cb147e9567f12ed833501bb6",
  "timestamp": "2025-05-15T02:33:42.087188"
}