{
  "id": 8828,
  "title": "Trajectories of Intrinsic Capacity: Determinants and Associations with Disability",
  "abstract": "ObjectivesIntrinsic capacity (IC) declines progressively with age, thereby increasing the risk of disability. However, it is less known whether IC trajectories are associated with disability. This study aims to identify the different patterns of IC trajectories in older people, and examine their determinants and associations with Instrumental Activities of Daily Living (IADL).DesignCohort study.SettingCommunity centres in different regions in Hong Kong.Participants and MeasurementsLongitudinal data from community-dwelling older people aged 60 years or above (n = 1371) collected between 2016 and 2021 was analysed. Their mean age was 74.5 years, and 78.7% of them were female. Repeated measurements of a set of 14 self-reported items were used to generate IC scores at four time points using a bi-factor model. Latent class growth analysis was performed to identify classes with distinct IC trajectories. The association between class membership and IADL disability was then examined using logistic regression.ResultsThree distinct IC trajectories were identified. The 1(st) class included those with the highest level of baseline IC and the least declining trajectory, whereas the 3(rd) class was composed by those with the lowest level of baseline IC and the most declining trajectory. Older age, female gender, lower perceived financial adequacy, living in public or subsidized housing, and chronic diseases were associated with the 3(rd) class. After adjusting for demographic factors, socioeconomic status, and the number of chronic diseases, the 1(st) class was more likely to preserve IADL when compared against the 2(nd) class, with OR being 3.179 (95% CI: 2.152-4.793), whereas for the 3(rd) class, the OR was 0.253 (95% CI: 0.178-0.359).ConclusionMonitoring IC trajectories is of relevance to clinical practice, as it helps shift the focus from treating acute episodes of illness to preserving the functional ability of older people.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "88fcb1a5cd8cc372eab082e14536c25a",
  "timestamp": "2025-05-15T03:22:57.891375"
}