{
  "id": 7131,
  "title": "Treatments of progressive systemic sclerosis",
  "abstract": "Progressive Systemic Sclerosis (PSS) is still an incurable disease but there are treatments for it, and the list of proposed treatments is long. The methodology of trials concerning PSS is complex, due to the low prevalence of the disease and therefore its financial interest for pharmaceutical companies the lack of simple end points for efficacy, and the large number of clinical expressions with various prognoses. These causes explain why most open studies are fiercely positive, and why controlled studies are so rare. The progress made during the last 10 years concern 1) the diagnosis, which is now made earlier due to capillaroscopy and antibody assays, especially of anticentromere antibodies, 2) better knowledge of the prognosis, due to the classification of PSS into limited and the diffuse forms which have different prognoses, and 3) the recognition of a serious complication of the disease, ic. pulmonary hypertension, which can now be detected by noninvasive methods. All these improvements will also improve the methodology of future trials of drugs for treating PSS. In this ocean of uncertainties, some treatments have a valid background, and 3 visceral locations of PSS can be efficiently treated: renal involvement, with angiotensin-converting enzyme inhibitors, respiratory involvement, with D-penicillamine, and pulmonary hypertension, with prostacyclin derivatives. Corticosteroids are suspected to increase the risk of renal complications. Calcium blockers are considered a useful symptomatic treatment of the associated Raynaud's phenomenon and of the risk of digital necrosis, and may also constitute a treatment of PSS it self. A recent trial conducted by the French Microcirculation Society and its acrosyndrome Study Group considered the effects of an oral derivative of prostacyclin. Beneficial effects were: a reduction of the risk of digital necroses, improved overall wellbeing, less necessity for hospitalizations. fewer giant capillaries, and a dramatic fall in the level of von-Willebrand factor.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8900025bccc272c71f18d77b302343a2",
  "timestamp": "2025-05-15T03:05:32.029567"
}