{
  "id": 4262,
  "title": "Bitcoin Price Forecasting and Trading: Data Analytics Approaches",
  "abstract": "Currently, the most popular cryptocurrency is bitcoin. Predicting the future value of bitcoin can help investors to make more educated decisions and to provide authorities with a point of reference for evaluating cryptocurrency. The novelty of the proposed prediction models lies in the use of artificial intelligence to identify movement cryptocurrency prices, particularly bitcoin prices. A forecasting model that can accurately and reliably predict the market's volatility and price variations is necessary for portfolio management and optimization in this continually expanding financial market. In this paper, we investigate a time series analysis that makes use of deep learning to investigate volatility and provide an explanation for this behavior. Our findings have managerial ramifications, such as the potential for developing a product for investors. This can help to expand upon our model by adjusting various hyperparameters to produce a more accurate model for predicting the price of cryptocurrencies. Another possible managerial implication of our findings is the potential for developing a product for investors, as it can predict the price of cryptocurrencies more accurately. The proposed models were evaluated by collecting historical bitcoin prices from 1 January 2021 to 16 June 2022. The results analysis of the GRU and MLP models revealed that the MLP model achieved highly efficient regression, at R = 99.15% during the training phase and R = 98.90% during the testing phase. These findings have the potential to significantly influence the appropriateness of asset pricing, considering the uncertainties caused by digital currencies. In addition, these findings provide instruments that contribute to establishing stability in cryptocurrency markets. By assisting asset assessments of cryptocurrencies, such as bitcoin, our models deliver high and steady success outcomes over a future prediction horizon. In general, the models described in this article offer approximately accurate estimations of the real value of the bitcoin market. Because the models enable users to assess the timing of bitcoin sales and purchases more accurately, they have the potential to influence the economy significantly when put to use by investors and traders.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "890bbb2dc6bb95d31f50cdd7901e52d6",
  "timestamp": "2025-05-15T01:25:23.277039"
}