{
  "id": 4179,
  "title": "Doing well by doing good: Evaluating the influence of patient safety performance on hospital financial outcomes",
  "abstract": "Background: As financial pressures on hospitals increase because of changing reimbursement structures and heightened focus on quality and value, the association between patient safety performance and financial outcomes remains unclear. Purpose: The purpose of this study is to investigate if hospitals with higher patient safety performance are associated with higher levels of profitability than those with lower safety performance. Methodology/Approach: Using multinomial logistic regression, we analyzed data from the spring 2014 Leapfrog Hospital Safety Score and the 2014 American Hospital Association to determine the association between Leapfrog Hospital Safety Score performance and three dimensions of organizational profitability: operating margin, net patient revenue, and operating income. Results: Our findings suggest that improved hospital safety scores are associated with a relative risk of being in the top versus bottom quartile of financial performance: 5.41 times greater (p < .001) for operating margin, 10.98 times greater (p < .001) for net patient revenue, and 4.03 times greater (p < .001) for operating income. Practice Implications: Our findings suggest that improved patient safety performance, as evaluated within the Leapfrog Hospital Safety Score, is associated with improved financial performance at the hospital level. Targeted focus on patient safety may allow hospitals to improve financial performance, maximize scarce resources, and generate additional capital to continue to positively evolve care.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8920c9d98e4f2b768cdf6ba9181e395a",
  "timestamp": "2025-05-15T02:34:13.397318"
}