{
  "id": 9255,
  "title": "How does membership in local savings groups influence the determinants of national health insurance demand? A cross-sectional study in Kisumu, Kenya",
  "abstract": "Background: Rotating savings and credit associations (ROSCAs) are highly active in many sub-Saharan African countries, serving as an important gateway for coping with financial risk. In light of the Kenya's National Hospital Insurance Fund's (NHIF's) strategy of targeting ROSCAs for membership enrolment, this study sought to estimate how ROSCA membership influences the determinants of voluntary health insurance enrolment. Methods: A cross-sectional survey of 444 households was carried out in Kisumu City between July and August 2016. A structured questionnaire was administered on health insurance membership, household attributes, headship characteristics and health-seeking behaviour. We assessed the influence of ROSCA membership on the associations between NHIF enrolment and the explanatory variables using univariate logistic regression. Results: The study found that education was associated with NHIF demand regardless of ROSCA membership. Both ROSCA and non-ROSCA households with high socioeconomic status showed stronger health insurance demand compared with poorer households; there was, however, no evidence that the strength of this association was influenced by ROSCA status (p-value = 0.47). Participants who were self-employed were significantly less likely to enrol into the NHIF if they did not belong to a ROSCA (interaction test p-value = 0.03). NHIF enrolment was found to be lower among female-headed households. There was a borderline effect of ROSCA membership on this association, with a lower odds ratio amongst non-ROSCA members (p-value = 0.09): the low treatment numbers amongst the insured infers that ROSCA membership may play a role on the association between gender and NHIF demand. Conclusions:Our findings suggest that ROSCA membership may play a role in increasing health insurance demand amongst some traditionally under-represented groups such as women and the self-employed. However, the strategy of targeting ROSCAs to increase national health insurance enrolment may yield exiguous results, given that ROSCA membership is itself influenced by several non-observable factors - such as time-availability and self-selection. It is therefore important to anchor outreach to ROSCAs within a broader, multi-pronged approach that targets households within their social, economic and political realities.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "89453df0470afe9226855bb0359baf03",
  "timestamp": "2025-05-15T03:26:54.612118"
}