{
  "id": 6412,
  "title": "Modeling the volatility of DJIM equity indices: a fundamental analysis using quantile regression",
  "abstract": "Purpose This paper aims to investigate the behavior of volatility of Islamic equity indices toward fundamental risk factors. It focuses on the degree and structure of sensitivity to commodity price changes, global risk perception and term premium and whether crises and fragility periods have shaped the degree and structure of this sensitivity. Design/methodology/approach Quantile regression incorporating structural changes and GARCH-class model are used to establish how sensitivities are varying across volatility distribution depending on global events. The data are daily series of return indices, over the period spanning from January 1, 2001 until January 22, 2018. Findings The results show significant sensitivity to fundamental factors. The sensitivity is identified for different regional indices and intensified across quantiles. Speculation has shaped the structure of sensitivity at normal time, but correction holds at time of crisis. The results reveal that even if they share common features, commodities cannot be considered as homogeneous asset class. Indeed, the exact relationship cannot be observed at normal time in presence of speculation and information delay. However, at time of financial fragility and periods of crisis, the sensitivity is assigned with the plausible sign. Practical implications The obtained results present several policy implications as well for academics, portfolio managers and policy-makers. It opens new research paths for academic research, it helps in investment decisions, provides lessons for portfolio diversification, both for price discovery and hedging. The results serve as well to implement effective macroeconomic stabilization policies and even fiscal policies to counteract any inflationary impact of fundamental price changes on investors and Islamic banks. Originality/value This paper contributes to empirical literature by dealing with the sensitivity of Islamic equity indices to commodity prices and term premium along with the effect of investor sentiment. It pays attention to the financial stability of Islamic stock markets by investigating the sensitivity at normal time, during fragility periods and periods of crisis. It considers the financialization process of commodity markets and includes the term premium to control for rational expectations on term structure of interest rates and the VIX (Volatility index) as global risk perception to control for safety and risk aversion.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8945a85c34aa9644f96da09def8375c7",
  "timestamp": "2025-05-15T02:57:38.872257"
}