{
  "id": 6304,
  "title": "Influences on emergency department length of stay for older people",
  "abstract": "ObjectiveThe aim of this study was to examine the influences on emergency department (ED) length of stay (LOS) for older people and develop a predictive model for an ED LOS more than 4h.MethodsThis retrospective cohort study used organizational data linkage at the patient level from a major Australian health service. The study population was aged 65 years or older, attending an ED during the 2013/2014 financial year. We developed and internally validated a clinical prediction rule. Discriminatory performance of the model was evaluated by receiver operating characteristic (ROC) curve analysis. An integer-based risk score was developed using multivariate logistic regression. The risk score was evaluated using ROC analysis.ResultsThere were 33926 ED attendances: 57.5% (n=19517) had an ED LOS more than 4h. The area under ROC for age, usual accommodation, triage category, arrival by ambulance, arrival overnight, imaging, laboratory investigations, overcrowding, time to be seen by doctor, ED visits with admission and access block relating to ED LOS more than 4h was 0.796, indicating good performance. In the validation set, area under ROC was 0.80, PHosmer-Lemeshow-value was 0.36 and prediction mean square error was 0.18, indicating good calibration. The risk score value attributed to each risk factor ranged from 2 to 68 points. The clinical prediction rule stratified patients into five levels of risk on the basis of the total risk score.ConclusionObjective identification of older people at intermediate and high risk of an ED LOS more than 4h early in ED care enables targeted approaches to streamline the patient journey, decrease ED LOS and optimize emergency care for older people.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "894d99931a189e929850900531c9153f",
  "timestamp": "2025-05-15T02:56:37.516668"
}