{
  "id": 2928,
  "title": "Optimization of China's provincial renewable energy installation plan for the 13th five-year plan based on renewable portfolio standards",
  "abstract": "Renewable energy (RE) in China has developed rapidly in recent years. Due to an overly aggressive RE installation plan, the country now faces the issue of RE power curtailment. Based on the newly proposed provincial renewable portfolio standards for 2020, an integrated planning model composed of a multi-regression model and linear planning model was established to optimize the RE power installation plan for each province in 2020. The results show that after optimization using the integrated model, nearly 400 TWh of excess RE power (including about 300 TWh of non-hydropower) will be saved. Guangdong, Shanghai, and Jiangsu are the main hydropower transfer provinces, whereas Beijing, Tianjin, Henan, Zhejiang, and Jiangsu are the principal non-hydropower transfer provinces. The research results also show that the newly installed capacity of RE resource-rich areas such as Sichuan, Yunnan, Inner Mongolia, and Xinjiang will account for less than 20% of the existing installed capacity according to China's current plan. In the future, these provinces must make full use of the power generation capacities of existing installed RE sources. The optimization of RE resource allocation is promoted in this study through the inter-provincial allocation of RE power and the combination of the renewable portfolio standards and the green certificate trading system.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "894ef4a8a07f17324812e5e2b289b2d9",
  "timestamp": "2025-05-15T01:11:48.475937"
}