{
  "id": 2219,
  "title": "CHALLANGES IN ACQUISITION ACCOUNTING: IDENTIFYING CONTROL AND CONTROLLERS IS TRICKY",
  "abstract": "This paper studies the complications embedded into identifying the existence of Control and the identity of the Controller on companies for accounting purposes. The issue appears of importance in view of the fact that, while the various theoretical definitions allow to understand the meaning of the concepts and to distinguish between Control, Influence and Portfolio Investment, still in practice recognizing whether Control exist and who the Controller is can be extremely tricky. The conundrum is relevant to more than just academic satisfaction. Indeed, those rules governing the recognition of the interest in a controlled subsidiary are different from the accounting treatment of the interest in Associates (Company over which another company has influence) and of portfolio investment (when the investor is not involved in managing the company). Hence, a proper classification of investments into categories (acquisition of Control, Influence or portfolio investment) is crucial for the preparation of proper financial statements. Investors and the general public can be easily misled otherwise. The IFRS 10, issued in 2011, provides guidance regarding the recognition of Control. Nonetheless, in reality the application of these rules can be tricky because recognizing Control(lers) is not always straightforward. We discuss the point theoretically and then we present two case-studies.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "895e80410a1f009ab44cb92e9095296a",
  "timestamp": "2025-05-15T01:04:27.454148"
}