{
  "id": 4960,
  "title": "Caregiver characteristics associated with caregiver neglect in persons living with dementia",
  "abstract": "Objectives: Caregiver neglect and abuse are typically studied together as elder mistreatment but have distinct features. We examined the relationship between neglect reported by caregivers of persons living with dementia and caregiver stressors that have been identified as risk factors for mistreatment. Method: Caregivers of persons living with dementia (N = 81) completed a cross-sectional survey about caregiving and mistreatment. Bivariate chi-square tests and t-tests and a multivariable logistic regression controlling for caregiver demographics were used to compare characteristics of caregivers who did and did not self-report neglect. Results: 46% were caring for a parent and 51% were Hispanic/Latino. Fifteen (19%) caregivers reported neglect in the last year. Caregivers who reported having high expectations of the care recipient (OR = 3.78, p = 0.045), and financial dependence on the care recipient (OR = 4.20, p = 0.035) had higher likelihood of neglect. Caregiver burden, depression symptoms, and anxiety symptoms were significantly associated with neglect in bivariate tests but not in the multivariable model. Conclusion: Previous studies have identified financial dependency as a risk factor for elder mistreatment; caregivers' expectations are a more novel finding with important implications for intervention design. Our findings contribute to growing evidence that elder mistreatment subtypes should be studied individually.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8964f994429caa6a668963db77857519",
  "timestamp": "2025-05-15T02:42:36.319072"
}