{
  "id": 3313,
  "title": "Financial literacy and planning: assessing risk impacts on premarital young couples",
  "abstract": "PurposeThis study aims to investigate the risk and the impact of financial literacy on the financial planning of young couples in Palembang, Indonesia, a significant emerging market in Southeast Asia. Drawing on institutional theory, the research highlights the role of formal and informal institutions in addressing institutional voids in markets where formal financial education mechanisms may be weak or absent.Design/methodology/approachUsing a sample of 403 young couples who participated in premarital courses of the Catholic Church, the study examines both basic and advanced levels of financial literacy and their effects on financial planning. Data were collected via questionnaires and analysed using descriptive statistics, validity and reliability tests and multiple regression models.FindingsThe results indicate that the financial literacy of young couples in Palembang is moderate, with their financial planning skills also being relatively strong. Specifically, the study found that higher levels of financial literacy significantly improve financial planning outcomes, with advanced financial literacy contributing to better financial decision-making and investment diversification.Originality/valueThe study identifies a gap in the literature regarding the application of financial literacy in emerging markets like Indonesia, particularly in understanding how age and advanced financial literacy influence financial behaviours. The study concludes that enhancing financial education among young couples is crucial for fostering effective financial planning and supporting broader economic stability in emerging markets.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8977a477245a45eb11acdd9653b9d905",
  "timestamp": "2025-05-15T02:25:13.607949"
}