{
  "id": 1436,
  "title": "Optimization of large portfolio allocation for new-energy stocks: Evidence from China",
  "abstract": "Investment in the fast-growing new-energy of China has gradually attracted great attention. At present, more than 100 new-energy stocks are listed on China's stock markets. How to effectively manage the investment risk of these stocks and achieve better returns is of great interest to investors and policymakers. In finance, mean- variance portfolio (MVP) is often applied to solve portfolio allocation problems. However, when investing in numerous stocks, the classical MVP is no longer applicable. For large portfolio allocation, this study constructs a comprehensive MVP model, called an unconstrained regression model with latent factors (URELAF). It applies a factor structure with latent factors to modify the covariance matrix estimation in the classical MVP, using an unconstrained penalized regression to estimate the allocation. In addition, to more realistically simulate the investment of stock markets, transaction costs are considered. The empirical results show that URELAF model can control the risk with Sharpe ratio reaching 6 times as many as MVP model, and even improve about 26% compared with the sub-optimal portfolio model. URELAF also outperforms other portfolios with transaction costs. Finally, hypothesis tests further verify that URELAF can significantly improve portfolio performance compared with other portfolio methods for China's new-energy market.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8983c702ee0cc20eb4f2827b329f0cd9",
  "timestamp": "2025-05-15T00:55:28.591807"
}