{
  "id": 7672,
  "title": "Impact of international labor migration on crop production in eastern Amhara, Ethiopia. A multinomial endogenous switching regression model analysis",
  "abstract": "In Ethiopia, approximately 40 % of the rural labor force engages in subsistence farming, encountering seasonal variations and market access issues. In response to economic insecurity, political disturbances, and climate change effects, many individuals migrate to other areas. This study analyzes the impact of international labor migration on crop production in Eastern Amhara, using data from 384 households. The data were collected by the combination of primary and secondary data collection methods. It used both descriptive and econometric analyses, specifically multinomial logistic regression and multinomial endogenous switching regression model. Using a multinomial logistic regression model, the study found that education significantly impacts migration, with higher levels reducing rates of legal and illegal migration. Access to credit negatively affects illegal migration, suggesting that better financial resources can decrease reliance on illegal migration. Environmental factors, especially drought, were significant drivers of migration, while participation in irrigation practices discourages it, indicating that stable livelihoods can reduce the need for migration. Previous migration experience reinforces future decisions, creating a potential cycle. This study analyzes the impact of international labor migration on crop production outcomes using the multinomial endogenous treatment effects model. The findings reveal significant income disparities between migrants and non-migrants, with legal migrants experiencing an average treatment effect of 191,684.5 Ethiopian birr (a 19 % increase) and illegal migrants earning 168,477.6 birr (a 33.64 % increase) compared to nonmigrants. Despite the challenges faced by illegal migrants, their experiences often lead to improved agricultural practices, showing migration's dual nature as both a risk and an opportunity. Additionally, the study reveals behavioral heterogeneity among migrants, indicating that legal migrants may face productivity declines under certain conditions, while illegal migrants enjoy substantial productivity benefits despite their risky situations. This research concludes that international labor migration positively impacts crop production, despite the challenges faced by illegal migrants. Therefore, the researchers recommend that the government and stakeholders focus on promoting rural entrepreneurship and establishing legal migration pathways to mitigate the negative effects of illegal migration, enhance community resilience, and foster sustainable economic growth in the agricultural sector.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8997c6e233f07532b873efa4dd68ff78",
  "timestamp": "2025-05-15T03:11:04.503468"
}