{
  "id": 2491,
  "title": "Does risk management committee gender diversity matter? A financial distress perspective",
  "abstract": "Purpose Using 2010 corporate governance principles and recommendations (CGPR) as a natural setting, the purpose of this paper is to investigate the relationship between risk management committee (RMC) gender diversity and a firm's likelihood of financial distress. Empirical evidence regarding whether CGPR (2010) enhances RMC gender diversity (RMCGD) is also provided. Design/methodology/approach Data were collected from the annual reports of the top 300 Australian Stock Exchange (ASX) listed companies from 2007 to 2014. To control for potential endogeneity, the association between (RMCGD) and a firm's likelihood of financial distress was investigated using an instrumental variable approach (panel 2SLS regression). The relationship between CGPR (2010) and RMCGD was explored using panel regression analysis with firm fixed effects. Findings RMCGD was found to be associated with a lower probability of financial distress, suggesting that women are better at monitoring and reducing firms' excessive risk-taking behaviours, which, in turn, decreases firms' risk of financial distress. The results also indicate that CGPR (2010) is quite effective in enhancing committee gender diversity. In the additional analysis, the results show that RMCGD moderates the negative relationship between risk and likelihood of financial distress. Importantly, the proportion of women with financial experience on RMCs is more effective in reducing the likelihood of financial distress compared to the proportion of men with financial experience on RMCs. These results highlight the benefits of having a gender diverse RMC. Research limitations/implications - The results were based on the top 300 ASX-listed companies; thus, restricting generalisability. In addition, this study only focussed on listed firms, non-listed firms may add additional insights to the literature. Practical implications - The results provide new and useful empirical evidence about RMCGD for Australian policymakers. This paper suggests that, in the short-term at least, RMCGD should be encouraged by regulators. Regulators could also recommend that the firms with a non-diverse RMC include women with financial experience on their RMC. Originality/value Given that prior studies have indicated that gender diversity is closely related to risk, this study contributes to the previous literature by investigating RMCGD and its effect on the likelihood of financial distress. It is expected that the role of RMC member would be to protect the firm from ultimate failure (likelihood of financial distress), especially during a financial crisis.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "89b47c97d4c97de28ed986db74a2c60c",
  "timestamp": "2025-05-15T02:15:59.863915"
}