{
  "id": 4668,
  "title": "Deep learning-based NT-proBNP prediction from the ECG for risk assessment in the community",
  "abstract": "Objectives: The biomarker N-terminal pro B-type natriuretic peptide (NT-proBNP) has predictive value for identifying individuals at risk for cardiovascular disease (CVD). However, it is not widely used for screening in the general population, potentially due to financial and operational reasons. This study aims to develop a deep-learning model as an efficient means to reliably identify individuals at risk for CVD by predicting serum levels of NT-proBNP from the ECG.Methods: A deep convolutional neural network was developed using the population-based cohort study Hamburg City Health Study (HCHS, n=8,253, 50.9 % women). External validation was performed in two independent population-based cohorts (SHIP-START, n=3,002, 52.1 % women, and SHIP-TREND, n=3,819, 51.2 % women). Assessment of model performance was conducted using Pearson correlation (R) and area under the receiver operating characteristics curve (AUROC).Results: NT-proBNP was predictable from the ECG (R, 0.566 [HCHS], 0.642 [SHIP-START-0], 0.655 [SHIP-TREND-0]). Across cohorts, predicted NT-proBNP (pNT-proBNP) showed good discriminatory ability for prevalent and incident heart failure (HF) (baseline: AUROC 0.795 [HCHS], 0.816 [SHIP-START-0], 0.783 [SHIP-TREND-0]; first follow-up: 0.669 [SHIP-START-1, 5 years], 0.689 [SHIP-TREND-1, 7.3 years]), comparable to the discriminatory value of measured NT-proBNP. pNT-proBNP also demonstrated comparable results for other incident CVD, including atrial fibrillation, stroke, myocardial infarction, and cardiovascular death.Conclusions: Deep learning ECG algorithms can predict NT-proBNP concentrations with high diagnostic and predictive value for HF and other major CVD and may be used in the community to identify individuals at risk. Long-standing experience with NT-proBNP can increase acceptance of such deep learning models in clinical practice.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "89bfc805131c3ccc84d12a8b27d9cf18",
  "timestamp": "2025-05-15T02:39:57.418139"
}