{
  "id": 8738,
  "title": "Unraveling the Complexity of Cardiac Distress: A Study of Prevalence and Severity",
  "abstract": "IntroductionWhile much research attention has been paid to anxiety and depression in people who have had a recent cardiac event, relatively little has focused on the broader concept of cardiac distress. Cardiac distress is a multidimensional construct that incorporates but extends beyond common mood disorders such as anxiety and depression. In the present study we assessed the prevalence, severity and predictors of a broad range of physical, affective, cognitive, behavioral and social symptoms of cardiac distress. This is the first study to investigate cardiac distress in this comprehensive way. MethodA sample of 194 patients was recruited from two hospitals in Australia. Eligible participants were those who had recently been hospitalized for an acute cardiac event. Data were collected at patients' outpatient clinic appointment ~8 weeks after their hospital discharge. Using a questionnaire developed through a protocol-driven 3-step process, participants reported on whether they had experienced each of 74 issues and concerns in the past 4 weeks, and the associated level of distress. They also provided sociodemographic and medical information. Regression analyses were used to identify risk factors for elevated distress. ResultsAcross the 74 issues and concerns, prevalence ratings ranged from a high of 66% to a low of 6%. The most commonly endorsed items were within the domains of dealing with symptoms, fear of the future, negative affect, and social isolation. Common experiences were being physically restricted (66%), lacking energy (60%), being short of breath (60%), thinking I will never be the same again (57%), and not sleeping well (51%). While less prevalent, not having access to the health care I need, being concerned about my capacity for sexual activity, and being unsupported by family and friends were reported as highly distressing (74, 64, and 62%) for those experiencing these issues. Having a mental health history and current financial strain were key risk factors for elevated distress. Conclusion and ImplicationsSpecific experiences of distress appear to be highly prevalent in people who have had a recent cardiac event. Understanding these specific fears, worries and stressors has important implications for the identification and management of post-event mental health and, in turn, for supporting patients in their post-event cardiac recovery.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "89d0710be17f4957eb43ee0dcee7cbf8",
  "timestamp": "2025-05-15T03:21:56.621517"
}