{
  "id": 3157,
  "title": "Impacts of climate change risks on financial performance of listed firms in agriculture industries in Vietnam",
  "abstract": "PurposeClimate change increases systematic risk for firms, especially those in the agricultural industry. Therefore, the need to examine the consequences of climate-related risks on agribusiness companies' financial performance across the globe and emerging markets has risen. In this context, the paper aims to investigate the effects of climate change risks on the financial performance of agriculture listed firms in Vietnam.Design/methodology/approachThe study sample includes 77 Vietnamese listed firms in the agricultural industry in the period of 2015-2019. The authors chose temperature, wind, rainfall and humidity proxies to measure climate change. The OLS regression, random regression and sub-sample analysis have been used to examine the impacts of climate risks on firms' financial performance.FindingsEmpirical results show that rain and temperature have positive impacts on financial performance of Vietnamese agriculture listed firms, while wind and humidity have insignificant impacts on financial performance.Research limitations/implicationsThe research helps researchers, businesses, practitioners and policymakers interested in the agricultural industry, especially those in developing and emerging countries, to develop a deep understanding of the impact of climate change risks on firm performance and therefrom prepare necessary measures to reduce the negative impacts.Originality/valueThis study adds to the literature stream on the impacts of climate change on financial performance. It is the first study to investigate this impact in Vietnam, a country which depends mainly on agriculture.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "89d283d6f403c544a8241ea2ee4eecdb",
  "timestamp": "2025-05-15T02:22:56.850176"
}