{
  "id": 9041,
  "title": "Digital age imperatives and firm internal control quality: evidence from CEOs personal trait and type of state-owned enterprises",
  "abstract": "PurposeIn the context of an evolving digital-based global economy, this study aims to investige the impact of digital transformation (DT) on a firm's internal control (IC) quality. It also explores how the personal traits of (CEOs) - such as age, gender and educational background - intersect with DT to shape the IC quality in various types of state-owned enterprises (SOEs).Design/methodology/approachThe study uses the data from China A-shares non-financial enterprises, listed on Shanghai and Shenzhen stock exchanges between 2007 and 2020. Using the fixed effect regression method alongside various statistical techniques, such as propensity score matching, alternative analysis and instrumental variables analysis, yields robust findings. These methods effectively address issues related to functional form misspecification and potential biases from omitted explanatory variables.FindingsThe findings reveal a positive impact of DT on firm IC quality, and this impact is more pronounced in firms when the CEO is female, young and possesses a higher level of education. Notably, the study also distinguishes between central and local state-owned enterprises (SOEs), highlighting that DT has a greater influence on IC quality in central SOEs, where CEOs often have higher political ranks and closer to government monitoring. Overall, the findings are robust and consist to alternative variable and other statistical methods.Research limitations/implicationsFollowing are the significant implications for both academia and business. First, firms that effectively adopt DT to enhance IC not only gain a strategic advantage over competitors but also establish efficient risk management practices and a robust IC system. Second, better IC resulting from DT can enhance investor and stakeholder confidence. This is particularly important for publicly traded companies, where investors and analysts closely scrutinize the robustness of IC systems. Third, DT could result in cost savings over time, as automation and streamlined processes may reduce the need for manual efforts and resource-intensive tasks associated with IC.Originality/valueThe findings are contributed to the literature in multiple ways. It enhances our comprehension of the intricate DT-IC quality relationship, and provides valuable insights into the transformative impact of DT on organizational operations and risk management. It also introduces a novel perspective by investigating how CEOs personal traits intersect with DT to shape IC quality, contributing to upper echelons theory. Furthermore, it expands the discussions on firm ownership by considering the types of SOEs (central vs. local), in the DT-IC quality context.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "89d65cd75832aca597f77a8e5e90a94c",
  "timestamp": "2025-05-15T03:24:54.924604"
}