{
  "id": 448,
  "title": "A reduced-order model based on cubic B-spline basis function and SSP Runge-Kutta procedure to investigate option pricing under jump-diffusion models",
  "abstract": "The purpose of this research is to develop a numerical method that can be used to deal with option pricing in jump-diffusion models. The proposed model is made up of a backward partial integro-differential equation with diffusion and advection factors. For the first and second order derivatives, the pseudo-spectral technique is used in conjunction with cubic B-spline functions. As a consequence, the first-and second-order derivative matrices are constructed, and an ODE system is created. Second-order Strong Stability Preserved Runge-Kutta (SSP) procedure is used to solve the ODE problem. According to what has been stated, the main model falls under the advection-diffusion classification. As a result, in order to reach the ultimate time, we need to increase both the number of collocations and the number of time steps in order to improve our results. That is why the final algebraic system of equations has been condensed using a technique known as proper orthogonal decomposition (POD). The POD-cubic B-Spline (POD-CB-S) function collocation approach can be used to describe this numerical procedure. Finally, a number of test cases are conducted to demonstrate the proposed method's efficiency and accuracy.",
  "year": 2023,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "89dbd83e7d247bea2f9cf552433db39e",
  "timestamp": "2025-05-15T01:32:30.118611"
}