{
  "id": 7196,
  "title": "Cost-effectiveness analysis in long-term treatment of risk factors",
  "abstract": "Health care decision makers are increasingly forced to identify and implement the options for potential spendings and savings. Historically, preventive measures for cardiovascular diseases have been scrutinised a great deal. The main reason for this was that substantial financial investments would have to be undertaken long before the clinical benefits were apparent. In the past, most economic evaluations of lipid lowering therapy have been based on models combining logistic regression risk functions from epidemiological cohort studies, such as the Framingham study, with the extent of cholesterol reduction. Recently, however, data from the large controlled outcome studies (4S, CARE, LIPID, WOSCOPS) have been reported which allow a direct estimate of the economic benefits of cholesterol reduction in primary) and secondary prevention. The economic evaluation of such therapies can be performed in several ways, from relatively easy cost-consequence analyses to more complex cost-effectiveness analysis. Initial economic analyses of the trials are already available. There are, however, still considerable practical and methodological issues which have to be taken into account in assessing lipid lowering drugs. Available pharmaco-economic data on lipid lowering therapies suggest chat statins are a cost-effective option in primary and secondary coronary prevention.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "89e2df64250a602b809ae3d66f2df2f0",
  "timestamp": "2025-05-15T03:06:01.272196"
}