{
  "id": 4836,
  "title": "Are Shariah-compliant firms less prone to stock price crash risk? Evidence from Malaysia",
  "abstract": "Purpose The term Shariah compliance states that a firm conducts business activities within the boundaries stipulated by Islamic law. The purpose of this study is to empirically examine whether a firm's Shariah compliance helps in reducing firm-specific stock price crash risk (SPCR). Design/methodology/approach Using the data of 10,391 firm-year observations of non-financial public listed firms in Malaysia from 2001-2017, this study uses the panel data estimation technique for regression analysis. Moreover, a series of alternative estimations has been applied to check the consistency of results. Findings The findings reveal a significant negative impact of firms' Shariah compliance on SPCR. The results indicate that Shariah-compliant (SC) firms are less likely to hoard bad news, ultimately reducing SPCR. The results also unveil a possible mechanism through which SC firms reduce SPCR. The findings reveal that SC firms are less likely to be involved in earnings management, which reduces the risk of a stock price crash in SC firms. It highlights the behavioral differences in financial reporting between SC firms and Shariah non-compliant (SNC) firms. Practical implications This research adds to the existing literature of Islamic capital markets from the perceptive of SPCR. The SPCR exhibits a tail risk of the stocks and is very important for risk management and investment decisions. The findings of this study will help risk-averse investors to include SC firms in their investment portfolios for risk minimization. The results also guide policymakers and regulatory bodies to rethink the monitoring mechanisms of publicly listed firms. Originality/value This study is unique, as it highlights that firms' Shariah compliance reduces SPCR.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "89ee51ce91ee16dd9394634d8187013b",
  "timestamp": "2025-05-15T02:41:32.742865"
}