{
  "id": 8151,
  "title": "People, places, systems and society:A qualitative exploration of socio-cultural factors in head and neck cancer survivorship",
  "abstract": "Purpose: People living with head and neck cancer (HNC) often endure permanent and life changing adverse effects of treatment and reduced health-related quality of life. Study of post-traumatic growth (PTG), is gaining traction to understand why some people living with cancer have better psychosocial outcomes than others. Current theoretical models on PTG point to the importance of 'socio-cultural influences' but do not provide insight into how such socio-cultural factors influence survivorship outcomes. This research aimed to illuminate pathways to PTG following HNC by exploring socio-cultural factors in experiences of living with, and moving on from, HNC. Method: Semi-structured interviews with people living with HNC (up to 5 years post-treatment) on experiences of diagnosis, treatment and recovery. Qualitative framework analysis using the environmental factors codes from the International Classification of Functioning, Disability and Health (ICF) HNC core set. Results: 20 people living with HNC were interviewed (11 male, 9 female; aged 46-83 years). Four inter-related themes described socio-cultural factors that influence (positively and/or negatively) the experience of living with HNC: (1) people and places; (2) healthcare systems and support services; (3) societal attitudes to cancer; (4) work and finances. Conclusion: Support from family, friends and healthcare professionals, as well as societal attitudes, financial and work security and personal experiences all appear to contribute to an individuals' ability to navigate the HNC experience. These findings could inform development of interventions targeting the socio-cultural factors in the lives of people living with HNC, particularly for those at risk for poorer psycho-social outcomes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "89ef65052ce1417c240a1d56bfca8063",
  "timestamp": "2025-05-15T03:15:38.458350"
}