{
  "id": 3887,
  "title": "Two decades of contagion effect on stock markets: Which events are more contagious?",
  "abstract": "This study aims to investigate the impact of a wide range of economic and non-economic events on stock market spillover effects in a group of 16 major developed and emerging countries over the 2000-2020 period. We analyse the size and structure of contagion to verify how different events spread contagion across borders and sectors. We applied the methodology proposed by Diebold and Yilmaz (2009, 2012, 2014) to a wide range of stock market indices using a quantile regression framework. Our findings show that the sectoral and countryspecific indices usually range below the overall market contagion levels, while their density functions differ structurally from those of overall market contagion. Among non-economic events, viruses - notably, the COVID19 pandemic - are the most widespread sources of contagion, while terrorism events affect the widest range of sectors with the greatest magnitude. Among economic events, the strongest negative impact is found for prudential ones. Quantitative easing (QE) and liquidity support reduce overall market contagion, while QE unwinding has a more substantial role than its introduction or expansion, exemplifying its asymmetric impact. We also investigate how investors may benefit from using contagion information in developing trading strategies, highlighting the positive impact of spillover-based weightings on portfolio returns.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a023d889943842e3d1ca9c9f056fbfa",
  "timestamp": "2025-05-15T01:21:41.433028"
}