{
  "id": 7585,
  "title": "Spillover Impact of the US Unconventional Monetary Policy and Uncertainties on Stock-Bond Correlations",
  "abstract": "This paper investigates the spillover impact of US unconventional monetary policy and uncertainty factors on the time-varying co-movements be-tween the US stock market and 14 advanced countries' bond markets, as based on monthly data from January 2002, to October 2015, and utilising the condi-tional nonlinear quantile regression approach. The empirical results reveal that US unconventional monetary policy has an asymmetric positive effect on stock -bond market co-movements, with a nonlinear effect in France and Denmark and a strong effect in the UK and Finland. Further, US bond market uncertainty has heterogeneous effects on stock-bond market co-movements, with a nonlinear effect in France and Denmark and a strong effect in Finland and Sweden. In addition, default risk spread positively influences stock-bond market co -move-ments across most countries for all quantiles. In contrast, stock-bond market co -movements negatively and symmetrically respond to the US stock market un-certainty in most countries. Finally, stock-bond co-movements exhibit mixed re-sponses to US economic policy uncertainty across countries. Our results have valuable implications for international investors who allocate capital across de-veloped countries' stock and bond markets. Our findings provide important infor-mation for financial communities with regard to diversification and hedging.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a19e67f5208a0d5ca2ed2b610a224f6",
  "timestamp": "2025-05-15T03:10:05.552059"
}