{
  "id": 3298,
  "title": "Do firms facing competitors from emerging markets behave differently? Evidence from Austrian manufacturing firms",
  "abstract": "Purpose The purpose of this study is to explore the strategic positioning and product portfolio diversification of Austrian manufacturing firms that face competition from emerging markets as opposed to firms that do not. Design/methodology/approach The research was conducted in two successive steps. Firstly, a literature review of dynamic capabilities was put into an international and import competition context, from which the domains studied empirically were derived. Secondly, a survey among the largest Austrian manufacturing firms was conducted to explore differences between firms that face competitors from emerging markets, and firms that do not. The questionnaire development was based on the strategic management literature. Even though the data are cross-sectional, backward- and forward-looking questions introduce a dynamic perspective. Both descriptive statistics and a regression analysis were used in the analysis. Findings The findings show that facing competitors from emerging markets is not always a force majeure, but the result of firms' international activity. An analysis of the competitiveness profile reveals that existing strengths and weaknesses are more pronounced when firms face competitors from emerging markets. In addition, emerging market competition is associated with a broader product portfolio and triggers portfolio adjustments. Yet, a larger share of the companies facing emerging market competitors neither adjusts the product portfolio nor plans to develop new competences. Research limitations/implications One limitation of this study is that it is confined to a survey among Austrian manufacturing firms. The findings may differ in other contexts, and thus, future research should be expanded to include firms from countries that are not from a small, open economy like Austria or from the service sector. The study uses cross-sectional data, and longitudinal/panel data would add causality. Practical implications Emerging markets play an increasing role in international business and there is a fierce debate about the strategic reactions of firms that face such competitors, especially from China. The findings provide guidance to managers who adjust their business strategies in a dynamically evolving competitive environment. The results also provide evidence relevant for strategic industrial policies aiming to reduce pressures from low-cost emerging market competitors while maintaining a free trade regime. Social implications Import competition from China (and other emerging economies) has been argued to contribute to the decline of the manufacturing industry, especially from the USA. The findings provide a building block of the efforts that aim to alleviate competitive pressures. Originality/value Even though researchers increasingly debate the effects of competition from emerging markets, research about incumbents' responses focuses on broadly defined product diversification or patent analyses. This study aims to fill this gap by providing comprehensive evidence about the strategic positioning of firms, thereby adding to theory. This paper also adds methodologically by offering a comprehensive picture that allows researchers to paint a nuanced picture of firms' competitiveness.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a4bc22e9417ba8a0deebc3ed48ebeeb",
  "timestamp": "2025-05-15T01:15:54.702410"
}