{
  "id": 359,
  "title": "Automated portfolio-based strategic asset management based on deep neural image classification",
  "abstract": "Despite the popularity of image-based classification techniques in identifying building materials and elements in building and construction sites, the real feasibility of it accommodating the needs of operation and maintenance (O&M) inspection-repair processes in the real project scale is still awaiting testing due to the vast number of project assets, hundreds of asset categories, and requirements of portfolio-based strategic asset management (SAM) tasks. The building's O&M phase does not yet have a large-scale inspection-repair dataset created on images based on the actual workflow of building and infrastructure projects. This paper described a MobileNet1.0-based image classification method for optimising and automating a series of portfolio-based SAM service processes, including condition surveying, data validation, standardisation and integration. By examining the performance of image classification in the building O&M phase's SAM tasks, the paper examines whether the constructed MobileNet1.0 model can achieve satisfactory built assets category classification performance based on commercial surveying data with the enhancement of the online image training dataset. The constructed MobileNet1.0 model achieved satisfactory built assets category classification results for both building asset type category classification (with 85.6% level-1 test accuracy) and different building data attributes (e.g., built assets' condition, activity cycle, failure type, etc.). The experiment results proved the online enhanced image training dataset can further boost the on-site image classification performance. The results of this paper demonstrate a broader application of image-based technologies in portfolio-based SAM and other building and infrastructure projects' O&M phase applications. Future research can be conducted to exploit the performance of image clas-sification methods over more building asset categories and building and building asset data attribute types.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a4f85a94c4ec9ecf4bb2f66fdff08ee",
  "timestamp": "2025-05-15T00:42:32.489090"
}