{
  "id": 504,
  "title": "Price spread prediction in high-frequency pairs trading using deep learning architectures",
  "abstract": "High-Frequency Trading (HFT) leverages advanced algorithms and high-speed data transmission to execute a large volume of trades within extremely short timeframes and generate profit. However, predicting stock prices in this context is challenging due to the frequent fluctuations in bid and ask conditions within financial markets. Institutional investors often employ pairs trading strategies to mitigate the systemic risk associated with single products, simultaneously buying and selling highly correlated financial instruments to profit from fluctuations in abnormal price spreads. In this study, we utilized intraday continuous trading data from the Taiwan Stock Exchange, integrating commonly used stock market features relevant to HFT. By employing XGBoost for feature selection and combining it with deep learning models, we aimed to predict the relationship between price spreads and boundaries in pairs trading, thereby generating entry and exit signals. Although accurately predicting the relationship between price spreads and boundaries presents significant challenges, the model effectively learned the pattern of price spread changes. Applying the model's entry and exit signals in pairs trading demonstrated that this strategy can enhance win rates and achieve stable profits in the volatile intraday market environment. This research provides practical implications for those interested in high-frequency trading and deep learning models in the financial market, equipping them with valuable knowledge and insights.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a68a2f03cfaa25a7b1f276024ded71e",
  "timestamp": "2025-05-15T01:38:59.310337"
}