{
  "id": 1285,
  "title": "Stock portfolio optimization based on factor analysis and second-order memetic differential evolution algorithm",
  "abstract": "Portfolio optimization will apply the concept of diversification across asset classes, which means investing in a wide variety of asset types and classes for a risk-mitigation strategy. Portfolio optimization is a way to maximize net gains in a portfolio while minimizing risk. A portfolio means investing in a wide variety of asset types and classes for a risk-mitigation strategy by the investor. In this paper, factor analysis and cluster algorithm are used to screen stocks and an improved differential evolution algorithm for solving portfolio optimization model is proposed. By comprehensively analyzing the stock data with factor analysis and k-means clustering algorithm, it has found that important factors have important effect on stock price movement, and finally 10 stocks are selected with investment value. Besides, a Mean-Conditional Value at Risk (CVaR) model is constructed, which takes into account both the cost function and the diversification constraint. Finally, a second-order memetic differential evolution (SOMDE) algorithm is presented for solving the proposed model. The experiments show that the proposed SOMDE algorithm is valid for solving the Mean-CVaR model and that factor analysis for stock selection can benefit portfolio with higher return and less risk greatly.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a75dc7cc9c30fe499c0cd72b6fd0f01",
  "timestamp": "2025-05-15T00:53:42.208091"
}