{
  "id": 2364,
  "title": "Do China's Non-Financial Firms Affect Systemic Risk?",
  "abstract": "This article investigates the contribution of non-financial firms to systemic risk in the entire financial system and the corresponding firm-specific determinants. Thus, we develop a new measure of systemic risk with a test of our hypothesis that separates systemic risk from systematic risk. We also consider the firm-level determinants of contributions to systemic risk using a fixed-effects model and a logit model. Using data on companies in the CSI 300 index from 2008 to 2016, we find that our extreme value theory (EVT)-copula method is a good fit for testing the joint probability distribution of extreme returns as well as diverse dependence patterns with asymmetry and non-linearity characteristics. The empirical results provide evidence against the marginal expected shortfall (MES) method without a mechanism to test the statistical significance of determination. Several non-financial firms, though not all financial institutions, can generate significant spillover effects on the financial system. Our regression results suggest that, among firms with a significantly positive contribution to systemic risk, smaller firms have greater spillover effects on the financial system in China. Moreover, economy-wide systemic risk information and dynamic identification on systemically important firms deserve more attention in terms of macro-prudential regulation.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a76aa45a1cf69cfbbf90f710565be85",
  "timestamp": "2025-05-15T02:14:50.253384"
}