{
  "id": 8706,
  "title": "Factors associated with non-utilisation of postnatal care services in Indonesia",
  "abstract": "Background: Postnatal care helps prevent neonatal deaths. This study aims to examine factors associated with non-utilisation of postnatal care in Indonesia. Methods: A cross-sectional analytic study was conducted using data from the 2002-3 Indonesia Demographic and Health Survey (IDHS), which used multistage cluster random sampling. Contingency table and logistic regression analyses were used to determine the factors associated with non-utilisation of postnatal care services. The population attribution risk percentage (PAR%) for non-utilisation of postnatal care services was also calculated. Results: Data were available for 15 553 singleton live-born infants. The prevalence of non-attendance at postnatal care services was consistently higher in rural areas than in urban areas. Maternal factors associated with lack of postnatal care included low household wealth index, low education levels, lack of knowledge of pregnancy-related complications or where distance from health services was a problem. Infants of high birth rank and those reported to be smaller than average were less likely to receive postnatal care. Other indicators of access to healthcare services which were associated with non-utilisation of postnatal care services included few antenatal care checks, use of untrained birth attendants and births outside healthcare facilities. Conclusion: Public health interventions to increase the utilisation of postnatal care services should target women who are poor, less educated, from rural areas and who use untrained birth attendants. Strategies to improve the availability and accessibility of antenatal care services and skilled birth attendance including focused financial support and health promotion programmes, particularly in the rural areas, should increase utilisation of postnatal care services in Indonesia.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a820d362b6404e7e1af0236ae267d92",
  "timestamp": "2025-05-15T03:21:24.735644"
}