{
  "id": 56,
  "title": "Numerical solving of generalized Black-Scholes differential equation using deep learning based on blocked residual connection",
  "abstract": "Option pricing in the financial derivatives market is worth studying. When the volatility and the rate of return are not fixed in Blacks-Scholes (BS) equation, the analytical form of the solution is difficult to be obtained. In this paper, we propose deep learning based on blocked residual connection method (DLBR) for the numerical solving of BS equations. The validity period and inventory price are the inputs of the network, while the option price is the solution. Neurons on the multiple hidden layers are processed in blocks and each block is connected to the residuals. The boundary conditions are constructed as a part of the numerical solution and the loss function is minimized to obtain the optimal network parameters. The DLBR method has strong applicability and overcomes the shortcomings of extreme learning machines. Three experiment calculated the numerical solution of the BS equation about European options and promoted the option pricing model. Compared with the existing algorithms such as finite element method and physics-informed neural networks (PINN) method, the obtained numerical solution has higher precision and smaller error, which shows the feasibility and superiority of the proposed method. (C) 2022 Elsevier Inc. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a85745ccc7b8adb86b3076106eb8665",
  "timestamp": "2025-05-15T01:26:54.953475"
}