{
  "id": 128,
  "title": "Unlocking financial literacy with machine learning: A critical step to advance personal finance research and practice",
  "abstract": "Financial literacy is crucial, and measuring it doesn't have to be expensive. In today's world of interactive artificial intelligence, the reduced costs of coding have made machine learning and text mining viable, costeffective alternatives to traditional assessment methods. This groundbreaking study is the first globally to integrate diverse fields-such as personal finance, socialization, parenting, and family well-being-to train supervised machine learning models for predicting low financial literacy. We labeled a sample of youth in Hong Kong using two definitions of low financial literacy. Our training results revealed that among the four machine learning models trained-decision tree, random forest, light gradient boosting machine, and support vector machine-the light gradient boosting machine was the most effective for predicting low financial literacy based on the first definition (low objective financial knowledge). Conversely, the random forest model performed best according to the second definition, which considers the gap between subjective and objective financial knowledge or a deficiency in both. This research provides educators with a powerful tool to identify and offer targeted financial education to at-risk youth. Additionally, the identification of key features through ablation analyses informs the development of innovative conceptual models for future research. Ultimately, this pioneering study encourages scholars across social science disciplines to collaborate, share data, and advance the research paradigm in their fields.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a855b430e1720ac1c3fe399ef32beb8",
  "timestamp": "2025-05-15T01:47:14.031027"
}