{
  "id": 5130,
  "title": "An analysis of extreme risk spillover effects and their determinants between AI-related assets and Islamic banking indices",
  "abstract": "PurposeThis study uses the time-varying parameter vector autoregressive (TVP-VAR) frequency connectedness approach to examine the interconnectedness between artificial intelligence (AI)-related financial assets and Islamic banking indices in financial markets. It reveals linkages across different market segments and their influence on spillovers between segments at different investment horizons.Design/methodology/approachThe research methodology involves using the TVP-VAR model. This model allows the authors to analyze return spillovers across different time frames by capturing the dynamic nature of the relationships between variables. The authors also consider various global factors in the regression analysis for rigor (Chatziantoniou et al., 2023).FindingsThis research shows that short-term changes impact extreme risk interconnectedness more than medium- or long-term changes. Well-established market indices like AI-related stocks (MSFT, GOOG and NVDA) and Islamic banks (Saudi Arabia, UAE) consistently contribute to or transmit returns. In contrast, most AI-related tokens and Asian Islamic banks tend to receive shocks. Two indices related to gold and the uncertainty of the US dollar demonstrate potential for hedging and predictability in interconnectedness.Practical implicationsThe results emphasize the vital role of short-term changes in diversifying a portfolio and managing risks, providing valuable insights for financial analysts and professionals in AI-related finance, Islamic banking and portfolio management.Originality/valueThe rising importance of AI-related stocks and tokens in investing has raised concerns about their compatibility with traditional financial instruments, especially in Islamic finance (Rabbani et al., 2023; Darehshiri et al., 2022; Yousaf et al., 2022). This paper examines the connections among AI-related stocks, AI-related tokens and Islamic banking indices to shed light on their correlations and potential impacts on the financial landscape.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8a882702fca75b498dd7368f89bf2147",
  "timestamp": "2025-05-15T02:44:43.841745"
}