{
  "id": 9146,
  "title": "Medically unexplained symptoms in patients referred to a specialist rheumatology service: prevalence and associations",
  "abstract": "Objectives. To determine the prevalence of medically unexplained rheumatic symptoms amongst patients newly referred to a rheumatology out-patient service and to examine their relationship with pain, disability, socioeconomic factors and the presence of emotional disorders (anxiety, depression and panic). Methods. A sample of newly referred consecutive patients to a hospital-based, regional rheumatology service was administered a questionnaire for assessment of emotional disorders, pain, health status and socioeconomic factors. Rheumatologists rated the degree to which patients' symptoms were explained by organic disease (organicity rating). Results. Two hundred and fifty-six patients were eligible and 203 (79%) participated. The sample included 69% females and mean age was 50 yr. Ninety-three (46%) had symptoms that were completely explained, 52 (26%) largely explained, 41 (20%) somewhat explained and 17 (8%) not at all explained by organic disease. Patients whose symptoms were of 'low organicity' (somewhat or not at all explained) were more likely to be female [relative risk (RR) 1.8, 95% confidence interval (CI) 1.0-3.1], younger (mean age 44 vs 52 yr, P<0.001) and to report more somatic symptoms (median 2 vs 1, P=0.021). On univariate analysis they were more likely to be experiencing financial hardship (RR 1.7, 95% CI 1.1-2.6) and work dissatisfaction (RR 1.6, 95% CI 1.0-2.4) and to live in rented housing (RR 1.8, 95% CI 1.2-2.8) or with dependent relatives (RR 1.6, 95% CI 1.0-2.5). Logistic regression showed that female gender and living in rented housing were the significant independent predictors of low organicity. Organicity ratings were not associated with pain severity, disability, physical and mental health status or the presence of emotional disorders. Conclusions. Twenty-nine per cent of patients newly referred to rheumatology clinics had symptoms that were poorly explained by identifiable rheumatic disease. Having unexplained symptoms was associated with socioeconomic factors but not levels of pain, disability or emotional disorders.",
  "year": 2003,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8aa5ea48d3840cd21b5398ff47474652",
  "timestamp": "2025-05-15T03:25:54.651986"
}