{
  "id": 3544,
  "title": "Novel forecasting of white maize futures volatility: a hybrid GARCH-based bi-directional LSTM model",
  "abstract": "Price volatility in grain markets, especially for maize, has substantial socio-economic impacts, particularly in low-income regions where food security remains a critical concern. Accurate forecasting of grain price volatility is therefore crucial in safeguarding the financial interests of commodity traders, as well as shielding consumers from detrimental effects of inflationary food prices. This study proposes a hybrid Bi-directional Long Short-Term Memory (BLSTM) model, integrated with generalised autoregressive conditional heteroscedasticity (GARCH)-type methods, to forecast white maize futures volatility in South Africa. By comparing the forecasting accuracy of the hybrid BLSTM model against several benchmarks, including standard LSTM and BLSTM models, our results demonstrate notable improvements in prediction accuracy, as shown through heteroscedasticity-adjusted performance metrics. The key contribution of this research is its enhancement of volatility forecasting by combining advanced machine learning with traditional econometric approaches, bridging a gap in predictive accuracy for commodity price dynamics. Additionally, this study supports the United Nations Sustainable Development Goals (SDGs), particularly Zero Hunger and Responsible Consumption and Production, by improving food price stability and risk management in agriculture. This approach exemplifies the evolving role of data science in financial analysis, offering market participants an effective tool to manage price risk and improve food security.Impact StatementThis study introduces a novel hybrid forecasting model that integrates GARCH-type econometric techniques with Bi-directional Long Short-Term Memory (BLSTM) neural networks to predict the realised volatility of white maize futures. As white maize is a staple food, accurate volatility forecasting directly contributes to improved food security and price stability. The model significantly outperforms traditional approaches and standard deep learning models across multiple forecast horizons, offering a powerful risk management tool for farmers, traders, and policymakers. By enhancing the accuracy of agricultural price forecasts, this research supports the United Nations Sustainable Development Goals (SDGs), particularly Zero Hunger (SDG 2) and Responsible Consumption and Production (SDG 12), while also demonstrating the value of advanced data science methods in addressing real-world socio-economic challenges.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ab2a91b0e43eec6fd18acb605d3b1f2",
  "timestamp": "2025-05-15T02:27:19.111518"
}