{
  "id": 2832,
  "title": "Long-term care needs and the risk of household poverty across Europe: a comparative secondary data study",
  "abstract": "PurposePopulation ageing and rising poverty are two of the most pressing issues today, even in Western European nations, growing as a result of the recent global economic crisis and the COVID-19 containment measures. This study explores the relationship between long-term care (LTC) needs and risk of poverty at household level in eight European countries, representing the different European care regimes.MethodsThe main international databases were scoured for study variables, categorized according to the following conceptual areas: home care, residential care, health expenditure, service coverage, cash benefits, private services, population, family, education, employment, poverty, disability and care recipients, and life expectancy. We initially identified 104 variables regarding 8 different countries (Austria, Finland, Germany, the Netherlands, Italy, Spain, Poland, Romania). Statistical analyses were conducted as described hereafter: analysis of the Pearson's Bivariate Correlation between the dependent variable and all other variables; a Multivariable Linear Regression Model between the Poverty Index (dependent variable) and the covariates identified in the preceding step; a check for geographical clustering effects and a reduced Multivariable Linear Regression Model for each identified European cluster.ResultsThe variables that addressed the risk of poverty pertained to the area of policy intervention and service provision. Rising private out-of-pocket health expenditures and proportion of poor couples with at least one child are two factors that contributed significantly to poverty increasing. Moreover, rising private out-of-pocket health expenditures for covering LTC needs (even in presence of public financial contribution to the family) is the main contributor to household poverty increasing in presence of ADL disability.ConclusionThe results reveal the existence of a clear correlation between the need for LTC and the risk of poverty in households across Europe. These results highlight the central relevance of LTC policies, which are often still treated as marginal and sectoral, for the future sustainability of integrated care strategies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ab6a3ed4eabcb517ea1037fb0738ab2",
  "timestamp": "2025-05-15T02:19:46.637344"
}