{
  "id": 2919,
  "title": "The Value of Consistency: Portfolio Labeling Strategies and Impact on Winery Brand Equity",
  "abstract": "The reported research examines the impact of product portfolio labeling strategies on brand reputation and equity. A netnographic approach allowed to observe winery portfolio labeling approaches and create a typology of winery labeling strategies. Expert evaluation served to assess the dependent variable brand equity by deploying a regression analysis. For the observed wine industry, being part of the food industry, creating consistent and recognizable brands has a direct relevance for reducing (sustainability-related) food information overload and thereby building sustainable brand equity. The results uncover the relative importance of each of the six identified labeling strategies as well as their impact on reputation and brand equity creation. The results point to the need to establish a consistent, strategically founded product communication. Such an approach, with a positive effect on reputation building can serve to build sustainable brand equity. Stuck in the middle-type strategies apparently diminish winery brand equity exploitation. The findings contribute to the knowledge on food labels in product communication strategies and their impact on organizational brand equity, thereby having high relevance for the implementation of environmental certification initiatives in an organizational context. The article deploys a novel research approach in an under-researched area to provide new insights for further research as well as implications for practice.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8abf3c736278c03bb38db2fe44afc884",
  "timestamp": "2025-05-15T01:11:48.420008"
}