{
  "id": 6808,
  "title": "Sources of social support and sexual behaviour advice for young adults in rural South Africa",
  "abstract": "Introduction While young people in sub-Saharan Africa (SSA) are at greatest risk of HIV acquisition, uptake of HIV prevention interventions among them has been limited. Interventions delivered through social connections have changed behaviour in many settings, but not to date in SSA. There is little systematic evidence on whom young SSA adults turn to for advice. We therefore conducted an exploratory cross-sectional study from whom young rural South Africans received support and sexual behaviour-specific advice. Methods We asked 119 18-34 year olds in rural KwaZulu-Natal about the important people in their lives who provided emotional, informational, financial, physical, social or other support. We also asked whether they had discussed sex or HIV prevention with each contact named. We used descriptive statistics and logistic regression to analyse support and advice provision patterns. Results Respondents named 394 important contacts, each providing a mean of 1.7 types of support. Most contacts were relatives, same-gender friends or romantic partners. Relatives provided most informational, financial and physical support; friends and partners more social support and sexual advice. Respondents reported discussing sexual matters with 60% of contacts. Sources of support changed with age, from friends and parents, towards siblings and partners. Discussion Sexual health interventions for young adults in rural South Africa may be able to harness friend and same-generation kin social ties through which sex is already discussed, and parental ties through which other forms of support are transmitted. The gender-segregated nature of social connections may require separate interventions for men and women.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ad7392069711719fe1ee902b0fc1edf",
  "timestamp": "2025-05-15T03:01:31.485254"
}