{
  "id": 5905,
  "title": "Significant wins and their impacts: Predictors of problem gambling in French and Polish national samples",
  "abstract": "Aim: We examined the role of significant win experiences alongside psychosocial factors in the risk of problem gambling. Participants: The study involved adult pure-chance gamblers from representative Polish (n = 3143) and French samples (n = 5692). Measurements: The questionnaire encompassed socio-demographic details, gambling behaviours, significant win experiences, gambling motivation, and problem gambling. Design & setting: Logistic regression analyses unveiled universal and country-specific factors significantly linked to problem-gambling risk. Findings: Universal factors comprised gender (lower risk among females), age (higher risk for ages 35+), household income (negative association), current and past debt (positive association), type of gambling game (higher risk for games other than lotteries), and gambling frequency (positive association). Risk factors also encompassed heightened coping and social motivations to gamble, while the financial motivation inversely correlated with risk. Inter-country differences featured significant wins in the player's environment, associated with problem-gambling risk only among the French. Then, only the highest amounts spent on gambling in the French group correlated with problem gambling, while lower amounts in the Polish group also did. Notably, a higher problem-gambling risk was observed in the Polish group compared to the French. Conclusions: A crucial finding was that significant wins were associated with problem gambling, even when controlling for other essential factors. Our study highlights the role of significant wins, construed as subjective gambler experiences, in fostering problem gambling. This insight suggests the need for a paradigm shift in understanding the role of winning in gambling, representing a risky experience regardless of the objective amount gambled.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ae4e823af5700b721ca4de96dc2d43e",
  "timestamp": "2025-05-15T02:52:31.504446"
}