{
  "id": 2731,
  "title": "MANUFACTURING EVOLUTION THROUGH SERVITIZATION: EMPIRICAL EVIDENCE ON RELATIONSHIP BETWEEN MANUFACTURING CAPABILITY AND ECONOMIC ADVANTAGES",
  "abstract": "Recent trends towards service orientation make manufacturing, especially in developed economies, to move into a more service oriented strategy. One solution is to fulfill customer requirements by a product and its after-sales services. However, the actual impact of this transformation on manufacturers has never been explored. This study aims to understand how evolution of service in terms of service-width and length takes place over time, and how it impacts on the manufacturer and is impacted from it. We carry out a longitudinal case-based study on a particular service family (iTune) in consumer electronics using Pearson correlation and linear regression using SPSS software package. Considering consistent intention to improve existing ones and introduce new services, following results are gained: (1)Manufacturing with higher research and development capabilities are expected to have great potential to have strong after-sales portfolio both in terms of service-width and length. A strong portfolio in this type of manufacturing is expected to bring economic advantage. (2)Manufacturing with higher liabilities is expected to have more economic advantage in increasing service-width. (3)Manufacturing with robust infrastructure are expected to have more economic advantage in increasing service-length.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ae5b86516fdfb48dd5efeaf4699d849",
  "timestamp": "2025-05-15T01:09:43.403172"
}