{
  "id": 294,
  "title": "Are Derivative Warrants Overpriced?",
  "abstract": "This study investigates the pricing efficiency of Hang Seng Index (HSI) derivative warrants in Hong Kong. Different from similar research, the study examines the pricing efficiency of index warrants by comparing their implied volatilities (IV) with realized volatility (RV). Although prior studies find that warrants are more expensive than the corresponding options, they are not necessarily overpriced in the conventional sensethat is, relative to the RV. This approach allows the study to test the pricing efficiency of warrants via a test of their information content. Moreover, unlike studies that focus on data at market close, the study uses a large sample of highly synchronous intraday, firm, bidask quote data to avoid possible distortions arising from intraday variations in liquidity and pricing in the instruments. The data also helps eliminate the potential nonsynchronous price problem that may affect the test results. Consistent with the results from previous studies, we find that warrants are often more expensive than options. This result is attributed to the inability of non-issuers to sell short, and the high participation rate of unsophisticated investors in the warrants market. However, regression analysis shows that IVs from ATM and OTM warrants provide unbiased volatility forecasts, and that IVs from ATM options do not subsume the information content of ATM warrants. ATM warrant prices are in line with the RV and are efficiently priced. Simulation results show that writing warrants is more profitable than writing options, and that the overpricing is directly related to the volatility premium.",
  "year": 2012,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ae9926eb08b77528760f40172b9629e",
  "timestamp": "2025-05-15T01:30:19.184535"
}