{
  "id": 4476,
  "title": "Shaping a greener future: The role of geopolitical risk, renewable energy and financial development on environmental sustainability using the LCC hypothesis",
  "abstract": "The recent progress report of Sustainable Development Goals (SDG) 2023 highlighted the extreme reactions of environmental degradation. This report also shows that the current efforts for achieving environmental sustainability (SDG 13) are inadequate and a comprehensive policy agenda is needed. However, the present literature has highlighted several determinants of environmental degradation but the influence of geopolitical risk on environmental quality (EQ) is relatively ignored. To fill this research gap and propose a inclusive policy structure for achieving the sustainable development goals. This study is the earliest attempt that delve into the effects o of geopolitical risk (GPR), financial development (FD), and renewable energy consumption (REC) on load capacity factor (LCF) under the framework of load capacity curve (LCC) hypothesis for selected Asian countries during 1990 - 2020. In this regard, we use several preliminary sensitivity tests to check the features and reliability of the dataset. Similarly, we use panel quantile regression for investigating long -run relationships. The factual results affirm the existence of the LCC hypothesis in selected Asian countries. Our findings also show that geopolitical risk reduces environmental quality whereas financial development and REC increase environmental quality. Drawing from the empirical findings, this study suggests a holistic policy approach for achieving the targets of SDG 13 (climate change).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8af39a159e8a0cef335979c285cc7490",
  "timestamp": "2025-05-15T02:37:47.496928"
}