{
  "id": 7106,
  "title": "Associations between healthcare utilization and access and diabetic retinopathy complications using All of Us nationwide survey data",
  "abstract": "Purpose Inadequacies in healthcare access and utilization substantially impact outcomes for diabetic patients. The All of Us database offers extensive survey data pertaining to social determinants that is not routinely available in electronic health records. This study assesses whether social determinants were associated with an increased risk of developing proliferative diabetic retinopathy or related complications (e.g. related diagnoses or procedures). Methods We identified 729 adult participants in the National Institutes of Health All of Us Research Program data repository with diabetic retinopathy (DR) who answered survey questions pertaining to healthcare access and utilization. Electronic health record data regarding co-morbidities, laboratory values, and procedures were extracted. Multivariable logistic regression with bi-directional stepwise variable selection was performed from a wide range of predictors. Statistical significance was defined as p<0.05. Results The mean (standard deviation) age of our cohort was 64.9 (11.4) years. 15.2% identified as Hispanic or Latino, 20.4% identified as Black, 60.6% identified as White, 2.74% identified as Asian, and 16.6% identified as Other. 10-20% of patients endorsed several reasons for avoiding or delaying care, including financial concerns and lack of access to transportation. Additional significant social determinants included race and religion discordance between healthcare provider and patient (odds ratio [OR] 1.20, 95% confidence interval [CI] 1.02-1 .41, p = 0.03) and caregiver responsibilities toward others (OR 3.14, 95% CI 1.01-9.50, p = 0.04). Conclusions Nationwide data demonstrate substantial barriers to healthcare access among DR patients. In addition to financial and social determinants, race and religion discordance between providers and patients may increase the likelihood of PDR and related complications.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8aff9ec1b39790013a5515485cccbb3c",
  "timestamp": "2025-05-15T03:05:03.568622"
}