{
  "id": 8724,
  "title": "Prevalence of malaria and hepatitis B among pregnant women in Northern Ghana: Comparing RDTs with PCR",
  "abstract": "Background High prevalence of malaria and hepatitis B has been reported among pregnant women in Ghana. In endemic areas, the diagnoses of malaria and hepatitis B among pregnant women on antenatal visits are done using histidine-rich protein 2 (HRP2) and hepatitis B surface antigen (HBsAg) rapid diagnostic tests (RDTs), respectively, which are, however, reported to give some false positive results. Also, socio-economic determinants have been drawn from these RDTs results which may have questionable implications. Thus, this study was aimed at evaluating the prevalence of malaria and hepatitis B by comparing RDTs with polymerase chain reaction (PCR) outcomes, and relating the PCR prevalence with socio-economic status among pregnant women in Northern Ghana. Methods We screened 2071 pregnant women on their first antenatal visit for Plasmodium falciparum and hepatitis B virus (HBV) using HRP2 and HBsAg RDTs, and confirming the infections with PCR. Socio-economic and obstetric information were collected using a pre-tested questionnaire, and associations with the infections were determined using Pearson's chisquare and multinomial logistic regression analyses at a significance level of p<0.05. Results The prevalence of the infections by RDTs/PCR was: 14.1%/13.4% for P. falciparum mono-infection, 7.9%/7.5% for HBV mono-infection, and 1.9%/1.7% for P. falciparum/HBV co-infection. No statistical difference in prevalence rates were observed between the RDTs and PCRs (chi(2) = 0.119, p = 0.73 for malaria and chi(2) = 0.139, p = 0.709 for hepatitis B). Compared with PCRs, the sensitivity/specificity of the RDTs was 97.5%/99.1% and 97.9%/99.4% for HRP2 and HBsAg respectively. Socio-economic status was observed not to influence HBV mono-infection among the pregnant women (educational status: AOR = 0.78, 95% CI = 0.52-1.16, p = 0.222; economic status: AOR = 1.07, 95% CI = 0.72-1.56, p = 0.739; financial status: AOR = 0.66, 95% CI = 0.44-1.00, p = 0.052). However, pregnant women with formal education were at a lower risk for P. falciparum mono-infection (AOR = 0.48, 95% CI = 0.32-0.71, p<0.001) and P. falciparum/HBV co-infection (AOR = 0.27, 95% CI = 0.11-0.67, p = 0.005). Also those with good financial status were also at a lower risk for P. falciparum mono-infection (AOR = 0.52, 95% CI = 0.36-0.74, p<0.001). Conclusion Our data has shown that, the RDTs are comparable to PCR and can give a representative picture of the prevalence of malaria and hepatitis B in endemic countries. Also, our results support the facts that improving socio-economic status is paramount in eliminating malaria in endemic settings. However, socio-economic status did not influence the prevalence of HBV mono-infection among pregnant women in Northern Ghana.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b07ca3aadbd5ed9f320ec94fdf30e7f",
  "timestamp": "2025-05-15T03:21:56.596619"
}