{
  "id": 1272,
  "title": "Identifying clusters of anomalous payments in the salvadorian payment system",
  "abstract": "We develop an unsupervised methodology to group payments and identify possible anomalies. With our methodology, we identify clusters based on a set of network features, using transactional (unlabeled) information from a systemically important payment system of El Salvador. We first preprocess network features, such as degree and strength, through a principal components analysis we reduce the dimensionality of the newly defined data, then we place the main variables into clustering algorithms ( k-means and DBSCAN) ) to analyze anomalous payments. We then analyze, these clusters using random forest to obtain the main network feature. Our results suggest that the proposed methodology works very well to detect anomalous payments, and it is very important to study the case of El Salvador, because of the recent restructuring of the Massive Payment System in El Salvador (promoted by the Transfer365 project), because the authorities want to increase financial inclusion. This change will make the SPM available to the public, to diversify services and incorporate more participants because, historically, it has operated with only three active participants. We expected that Transfer365 will interconnect the LBTR participants' systems with their banking core, the systems of the Ministry of Finance, and other authorized participants to channel large payment flows. Then, identifying possible anomalies through methodology will enhance risk monitoring and management by payment systems overseers.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b0d632b4a2f57a8c867ab8cee905a69",
  "timestamp": "2025-05-15T02:01:11.801542"
}