{
  "id": 553,
  "title": "Optimizing stock market volatility predictions based on the SMVF-ANP approach",
  "abstract": "The stock market is considered one of the most complicated financial systems, comprising several components or inventories, whose prices vary substantially over time. Bursaries include revealing market tendencies over time. All investors in the stock market aim to maximize profits and reduce the associated risks. Stock currency forecasts are a significant financial concern that is being handled even more closely. In recent years, various neural network and hybrid models have surpassed classic linear and non-linear techniques to produce reliable prediction outcomes. This study investigates the efficacy of dynamic and effective stock market forecasting using neural network models. This study examines market transmission mechanisms and assesses the predicted links between multiple financial and economic factors. A stock market volatility and artificial network prediction (SMVF-ANP) approach is presented. The models analyzed included a multilayer perceptron (MLP), dynamic artificial neural network, and generalized autoregressive conditional heteroscedasticity to extract additional input variables. The results reveal that the trade strategies led by the classification models yield superior risk-adjusted returns compared to the buy-and-hold approach and those led by the neural network and linear regression model-level estimate predictions. The numerical results show that the proposed SMVF-ANP method achieved a high performance ratio of 94.1%, an enhanced prediction ratio of 98.4%, a high stock market volatility rate of 96.7%, a reduced mean square percentage error ratio of 16.3%, a probability rate of 32.7%, an increased efficiency rate of 96.9%, and an accuracy ratio of 97.2% compared to other methods.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b146fc422929c9ea81bed894ce57592",
  "timestamp": "2025-05-15T01:52:12.301477"
}