{
  "id": 7721,
  "title": "Longitudinal impact of psychosocial status on children's mental health in the context of COVID-19 pandemic restrictions",
  "abstract": "Emerging research suggests that the prevalence of child and adolescent mental health problems has increased considerably during the COVID-19 crisis. However, there have been few longitudinal studies on children's mental health issues according to their social determinants in this context, especially in Europe. Our aim was to investigate the association between family socioeconomic status (SES) and children' mental health during the period of school closure due to COVID-19. Longitudinal data came from 4575 children aged 8-9 years old in 2020 and participating in the ELFE population-based birth cohort that focuses on children's health, development and socialization. Parents completed the Strengths and Difficulties Questionnaire (SDQ) when children were (a) 5 years of age and (b) 9 years of age, which corresponded to the period of school closure due to the COVID-19 pandemic in France. We retrieved data from the ELFE cohort collected on children from birth to age 5 years (birth, 1 year, 2 years, 3,5 years and 5 years). Socioeconomic status (SES) was measured based on information obtained when the child was 5 years old. Data were analyzed using multinomial logistic regression models. Children's elevated levels of symptoms of Attention-deficit/Hyperactivity disorder (ADHD) during the period of school closure were significantly associated with prior low family SES (aOR 1.26, 95% CI 1.08-1.48). Children's elevated symptoms of hyperactivity/inattention and of emotional symptoms were associated with decline in income during the COVID crisis (respectively, aOR 1.38, 95% CI 1.16-1.63 and aOR 1.23, 95% CI 1.01-1.51). Moreover, when testing interactions, a low prior SES was significantly associated with a higher risk of emotional symptoms aOR 1.54 (1.07-2.21), only for children whose families experienced a decline in income, while gender, parental separation and prior mental health difficulties were not associated. This study underlines the impact of the financial crisis related to the COVID-19 epidemic on children's mental health. Both pre-existing family SES before lockdown and more proximal financial difficulties during the COVID crisis were negatively associated with children's psychological difficulties during the period of school closure. The pandemic appears to exacerbate mental health problems in deprived children whose families suffer from financial difficulties.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b1556143ae2a6cae2fe0c0fd19d7753",
  "timestamp": "2025-05-15T03:11:38.437147"
}