{
  "id": 2756,
  "title": "A multiple criteria credit rating approach utilizing social media data",
  "abstract": "Credit rating is a process for building a classification system for credit lenders to characterize current or potential credit borrowers. By such a process, financial institutions classify borrowers for lending decision by evaluating their financial and/or nonfinancial performances. Recently, use of social media data has emerged an important source of information. Accordingly, social media data can be very useful in evaluating companies' credibility when financial or non-financial assessments are missing or unreliable as well as when credit analyzers' subjective perceptions manipulate the decision. In this study, a multiple criteria credit rating approach is proposed to determine companies' credibility level utilizing social media data as well as financial measures. Additionally, to strengthen the lender's interpretation and inference competency, ratings are represented with a risk distribution based on cumulative belief degrees. Sentiment analysis, a web mining and text classification method, is used to collect social media data on Twitter. Importance of criteria is revealed through pairwise comparisons. Companies' performance scores and ratings are obtained by a cumulative belief degree approach. The proposed approach is applied to 64 companies. Results indicate that social media provides valuable information to determine companies' creditability. However credit ratings tend to decrease when social media data is considered.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b224ce152e61ed75b20dc5263d3aade",
  "timestamp": "2025-05-15T02:18:37.219456"
}