{
  "id": 4920,
  "title": "INTEGRATING REMOTE SENSING FOR EARTHQUAKE RISK ASSESSMENT IN ISTANBUL'S KARTAL DISTRICT",
  "abstract": "Developing strategies to mitigate damage from high- risk buildings in earthquake-prone areas is essential. This study focuses on prioritizing buildings based on their risk levels, considering the impracticality of addressing all high- risk structures simultaneously. Traditional methods emphasize individual buildings, overlooking the collective impact. This study extends beyond earthquake effects, considering financial losses due to displacements particularly in energy-dependent contexts. Advancements in remote sensing, particularly SAR technology's phase and amplitude signal characteristics, are crucial. These technologies facilitate shell deformation analysis, classification studies, and post-disaster damage mapping, offering broad spatial coverage and all-weather, day-and-night operation. Our study employs Sentinel 1 SBAS method, Tandem-X Change detection maps, building construction dates, and VS30 data to analyze Istanbul's Kartal District. Utilizing Microsoft's deep learning-based building footprints, seismic VS30 data, TanDEM-X Change Maps, and building age and height information, this research comprehensively assesses earthquake risks. The SBAS technique with Sentinel 1 data is applied for surface displacement analysis, enhancing the understanding of earthquake losses and updating ground deformation data for Istanbul.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b2631849c2091983ae3aa533f541f7b",
  "timestamp": "2025-05-15T02:42:36.120819"
}