{
  "id": 3678,
  "title": "Thematic Analysis of Organizational Characteristics in NCI Community Oncology Research Program Cancer Care Delivery Research",
  "abstract": "Organizational characteristics, including organizational structures and processes, are important to understanding care delivery and health outcomes. However, organizational-level constructs present measurement challenges in care delivery research. This analysis aims to understand if, when, and how organizational characteristics are examined in a National Cancer Institute (NCI) research network conducting cancer care delivery research (CCDR). The NCI Community Oncology Research Program encourages consideration of organizational variables in CCDR studies. We conducted a cross-sectional thematic analysis to identify organizational characteristics examined in this portfolio of research. Organizational characteristics targeted, related measures, and analytic approach were abstracted by 2 study investigators using a coding framework adapted from 2 existing frameworks. A total of 78.9% of eligible study protocols included organizational characteristics. Structural characteristics were the most common, collected in all 15 included protocols, 14 examined at least 1 organizational process, and 12 examined organizational-level outcomes. Most studies proposed descriptive practice-level analyses or multilevel analyses using random effects to account for clustering of patients and staff within practices. Few (n = 5) specified that organizational variables would be modeled as effects of interest (vs covaried out) or proposed analytic approaches that could more robustly examine effects of targeted organizational characteristics on primary outcomes. Inclusion of organizational variables is common in CCDR conducted through the NCI Community Oncology Research Program, NCI's national network charged with bringing cancer clinical trials to people in their communities. Nonetheless, opportunities remain to improve the use of theory to guide organizational construct selection, operationalization, measurement, and incorporation into study hypotheses and analyses.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b36ae3b33c59b2a72eddbe574158109",
  "timestamp": "2025-05-15T01:19:26.258073"
}