{
  "id": 29,
  "title": "A Synergetic Approach to Ethereum Option Valuation Using XGBoost and Soft Reordering 1D Convolutional Neural Networks",
  "abstract": "In an ever-evolving realm of cryptocurrencies, Ethereum has emerged as a prominent player, captivating both investors and enthusiasts alike. Within the diverse financial landscape of cryptocurrencies, options stand out as a versatile tool, offering flexibility and hedging opportunities. This paper introduces a cutting-edge approach to pricing Ethereum options, harnessing the formidable power of XGBoost and the visionary capabilities of Convolutional Neural Networks (CNN). This research proposes a novel method that utilizes XGBoost for implied volatility estimation by integrating historical volatility, and generalized auto-regressive conditional heteroscedasticity (GARCH) model-predicted volatility. Subsequently, a soft reordering 1-dimensional CNN (1D-CNN) model is employed to enhance the pricing accuracy of Ethereum options. The soft reordering mechanism is used to dynamically rearrange the initial tabular dataset, optimizing it for enhanced learning within the CNN framework. The outcome indicates the ability of the proposed model in estimating implied volatility and pricing options with remarkable accuracy, outperforming traditional option pricing models and data-driven models documented in literature. The proposed model also exhibits the lowest pricing error across all maturities and various moneyness criteria, with the exception of long term put and deep out of the money (DOTM) options.",
  "year": 2025,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b49a0e7773cc508acfa4c2bab28eb15",
  "timestamp": "2025-05-15T01:26:26.432961"
}