{
  "id": 9345,
  "title": "ASSESMENT OF ACCIDENT-PRONE DEFORMATION ZONES OF BUILDINGS CLOSE TO DEEP FOUNDATION PITS",
  "abstract": "During the construction of buildings with a developed underground par and underground structures in the current cramped conditions of megacities there often remain undervalued financial costs associated with the need to reconstruct and strengthen surrounding buildings, caught in the zone of influence of new construction. Only the project decisions of the object of new construction are worked out and evaluated without additional design solutions for the reconstruction and strengthening of surrounding buildings and as resulted possible additional costs that may arise. The article deals with the construction of buildings with a subterranean part in the cramped conditions of megacities, namely the risk of accidental deformation of existing buildings near the deep pits. To assess the possibility of accidental deformation of the existing buildings the author has done numerical calculations using finite element method in three-dimensional formulation. On the basis of calculations for deep pits 56 buildings under construction entering the zone of influence together with 198 existing buildings plots of strain based on the dependence on the distance to these buildings from the edges of the pit. With consideration of many years of observation experience the buildings near the deep pits and existing normative literature calculations were performed for buildings located at a distance 0Hk (directly on the edge of the pit) to 5Hk. For a more detailed analysis the charts were divided into intervals containing not more than ten points. For each interval average values of deformations were determined and dispersion equation and the standard deviation of the standard were recorded. Conducted studies have allowed us to develop a classification of accident-prone zones around the deep pits on the degree of exposure of the surrounding buildings to excess deformation. The author offers to use 5 main areas within a range from 0Hk to 5Hk: from 0.0Hk to 0.5Hk - a potentially dangerous area; from 0.5Hk to 1.0Hk - dangerous zone; from 1.0Hk do1.5Hk medium dangerous zone, from 5.0 to 1.5Hk Hk - low degree of danger zone; more than 5Hk - safe zone. Depending on the technical condition of buildings, structures located in these zones a conclusion about the probable need to strengthen the construction of these buildings or for reconstruction can be made. The proposed method, based on the zoning of surrounding buildings, allow a preliminary assessment of the possible excessive deformation of surrounding buildings in the zone of influence of deep pits and on the early stages of design lay in the costs associated with the construction the necessary finance on the reconstruction and strengthening of structures.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b5a1a06666b215304ce42478155217b",
  "timestamp": "2025-05-15T03:27:53.384498"
}