{
  "id": 470,
  "title": "Individual-level determinants of waterpipe smoking demand in four Eastern-Mediterranean countries",
  "abstract": "The prevalence of waterpipe tobacco smoking in the Eastern Mediterranean Region is at alarmingly high levels, especially among young people. The objective of this research was to evaluate the preferences of young adult waterpipe smokers with respect to potential individual-level determinants of waterpipe smoking using discrete choice experiment methodology. Participants were young adult university students (18-29 years) who were ever waterpipe smokers, recruited from universities across four Eastern Mediterranean countries: Jordan, Oman, Palestine and the United Arab Emirates. The Internet-based discrete choice experiment, with 6 x 3 x 2 block design, evaluated preferences for choices of waterpipe smoking sessions, presented on hypothetical waterpipe cafe menus. Participants evaluated nine choice sets, each with five fruit-flavored options, a tobacco flavored option (non-flavored), and an opt-out option. Choices also varied based on nicotine content (0.0% vs. 0.05% vs. 0.5%) and price (low vs. high). Participants were randomized to receive menus with either a pictorial thorn text health-warning message or no message (between-subjects attribute). Multinomial logit regression models evaluated the influence of these attributes on waterpipe smoking choices. Across all four samples (n = 1859), participants preferred fruit-flavored varieties to tobacco flavor, lower nicotine content and lower prices. Exposure to the health warning did not significantly predict likelihood to opt-out. Flavor accounted for 81.4% of waterpipe smoking decisions. Limiting the use of fruit flavors in waterpipe tobacco, in addition to accurate nicotine content labeling and higher pricing may be effective at curbing the demand for waterpipe smoking among young adults.",
  "year": 2019,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b8021607a6c48e99463d1c76c847df4",
  "timestamp": "2025-05-15T01:32:30.166957"
}