{
  "id": 2903,
  "title": "Liquidity risk in FinTech lending: Early impact of the COVID-19 pandemic on the P2P lending market",
  "abstract": "This study empirically investigates the impact of the COVID-19 pandemic on the liquidity risk incurred by the peer-to-peer (P2P) lending market. As the pandemic adversely affects financial markets globally, a better understanding of the dynamics of successful P2P lending is necessary under the conditions of financial distress. By using the cross-country database of secondary market listing outcomes at Bondora (Estonia) and employing probit, ordered probit and tobit regression methods, we provide evidence of the pandemic-induced exposure to liquidity risk in the P2P lending market. Despite increased volatility in the financial markets, results show that COVID-19 risk increases the probability of successful listing during the pandemic. However, this outcome comes at significant liquidation costs for investors in the form of higher premiums. Further analysis based on listing outcomes and loan characteristics shows a negative association between COVID-19 risk and share of overdue loans and average overdue days in secondary market listings. Simultaneously, more experienced investors dominate the market as COVID-19 risk increases, a trend that is reflected in shorter listing times. The findings of this study imply certain early tendencies in financial markets during pandemic-induced turmoil and open new avenues for further research.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b929dbb7c2550616ed62096678636e3",
  "timestamp": "2025-05-15T02:20:16.970075"
}