{
  "id": 4325,
  "title": "Information Asymmetries as Antecedents of Opportunism in Buyer-Supplier Relationships: Testing Principal-Agent Theory",
  "abstract": "Purpose: A severe problem in supplier selection refers to moral hazard: suppliers not behaving in the expected way once contracted. Principal-agent theory could provide insights on how to reduce this problem. Because buyer-supplier relationships can be interpreted as principal-agent situations, the application of agency theory should facilitate improved supplier selection. Although theoretically compelling, empirical tests verifying this assumption are not prevalent. Regarding the advancement of theory, this paper tests whether both ex ante and ex post information asymmetries influence moral hazard. In particular, in the context of a globalizing economy with a subsequent increase in information asymmetries as a problem in supplier selection, this conceptual approach may be contributive. Design/methodology/approach: The authors use a set of 87 buyer-supplier relationships to conduct a test, applying a partial least squares model with latent variables. A particularity of the data set is that it contains information on ongoing as well as on discontinued relationships. Findings: The analysis indicated that both ex ante information asymmetries (operationalized by a reputation variable) and ex post asymmetries (operationalized by a monitoring variable) have shown to be significant and strong antecedents explaining the occurrence of moral hazard. Interestingly, and opposed to the common assumption, the length of a relationship and the amount of direct meetings have not revealed any explanatory significance. Buyer dependency hardly showed influence on supplier opportunism. Research limitations/implications: Data were collected from a multitude of buyer-supplier relationships from a single firm in the chemical-pharmaceutical industry. Generalizations to other industries still need to be tested. Socially desirable answering behavior cannot fully be excluded because relationship discontinuation is not a desirable situation. In terms of theory implications, this research adds to the notion that both hidden action and hidden intention can lead to moral hazard. Practical implications: An agency-based analysis can be operationalized with the help of an agency-based supplier classification portfolio. It might be of particular value to firms to discuss those suppliers that scored high in risk of opportunism but did not (yet) reveal any signs of moral hazard. Finally, the strong explanatory power of reputation alerts buyers to pay more attention to behavioral information on the (potential) supplier available in the market. Originality/value: Analyzing the occurrence of moral hazard and including terminated relationships adds to the emerging stream of literature on relationship discontinuation in B2B markets. Further, the strong empirical results may encourage researchers to elaborate on principal-agent theory-based assumptions, adding another layer of explanation to buyer-supplier relationships. Findings show that reputation is unduly neglected as supplier selection criterion in current theory and practice.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8b942ab6d39f0ebb4a10f1c7ddee4a0a",
  "timestamp": "2025-05-15T01:25:50.593287"
}