{
  "id": 8936,
  "title": "THE IMPACT OF HEALTH-INSURANCE STATUS ON ADOLESCENTS UTILIZATION OF SCHOOL-BASED CLINIC SERVICES - IMPLICATIONS FOR HEALTH-CARE REFORM",
  "abstract": "Purpose: 1) To examine Variations among students with different health insurance coverage in their use of school-based clinics (SBCs), reasons for not receiving health care when needed, and reasons for using or not using SBCs, and 2) to determine if insurance status is a significant factor in predicting SEC use, after controlling for demographic variables and health status. Methods: Confidential questionnaires were administered to 2,860 adolescents attending 3 urban high schools with on-site SBCs. Chi-square and multiple logistic regression analyses were used to assess differences among insurance groups in patterns of SEC use and reasons for clinic use/nonuse. Results: Students with private insurance or HMO coverage had the highest rates of SEC utilization (67% and 66%) and students without health insurance and with Medicaid had the lowest (57% and 59%) (p < 0.01). While there was no difference among adolescents according to insurance group membership in their use of SEC medical services, a significantly higher proportion of students with Medicaid coverage used SEC mental health services. Students without health insurance were less likely to receive health care from any source when it was needed. After controlling for demographic variables and health status, no insurance factors remained significant. Conclusions: SEC users represent a variety of insurance groups. Health care reform efforts need to take into account the special needs of adolescents and the challenges they face in accessing care that go beyond financial barriers to care. SEC have been shown to provide a convenient and acceptable source of care, as well as offering the opportunity to provide preventive and primary care services to at-risk youth. As the country moves to a managed care environment potential partnerships with SBCs represent a unique opportunity to improve the delivery of care to adolescents, assuring increased access to a package of health services that they need.",
  "year": 1995,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ba3a4209c8f04975f87f29f5326234d",
  "timestamp": "2025-05-15T03:23:56.078475"
}