{
  "id": 8315,
  "title": "Vigilance for HIV/AIDS: a cross-sectional study of 2 million adults in the United States",
  "abstract": "Introduction: This work aimed at studying human immunodeficiency virus (HIV) as well as the chara-cteristics of individuals who have been tested for HIV in the United States during 2009-2018, with the ultimate goal to be found statistically significant predictors for HIV testing. Material and methods: Statistical methods used to extract the results of this work were chi(2) and one-way analysis of variance (ANOVA) test. A multiple logistic regression analysis was applied with odds ratio (OR) to find statistically significant prognostic factors for HIV testing. Results: As specified by multiple logistic regression analyses, individuals aged 18-44 were eight times more likely to be tested for HIV (OR = 8.18), while Black or African Americans were three times more likely to be tested for the virus (OR = 2.78). In addition, those who employ full-time (OR = 2.17), and living with a partner (OR = 1.80) were twice as likely to be tested for HIV. Finally, females (OR = 1.24), who live in a large metropolitan statistical area (OR = 1.61), with some college education status (OR = 1.05), and living in a poor financial situation (OR = 1.34) were more likely to be tested for the virus. Conclusions: The results of this work highlight the prognostic characteristics of individuals, who are more likely to be tested for HIV, which reflects the vigilance for this incurable virus. Moreover, individuals with a higher degree of vigilance for HIV are more likely to be females in the age group of 18-44, financially independent, with a high level of education. On the contrary, individuals with a lower degree of vigilance for HIV, and therefore in high-risk groups, are more likely to be males, with less than a high school diploma education status, not poor, divorced or separated, with a private health insurance coverage, who do not employ and has never worked, living in the Midwest.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8bb16523fd08c4451b3c7a02294720f2",
  "timestamp": "2025-05-15T03:17:49.062167"
}