{
  "id": 4285,
  "title": "Differential attainment at national selection for higher surgical training: a retrospective cohort study",
  "abstract": "Objectives National selection for higher surgical specialty training (HST) in the UK is a high-stakes gatekeeping assessment. If barriers, such as differential attainment, exist at HST selection for some groups and not others, then this will have a significant and lasting impact on trainees' career progression and the diversity of the workforce, which should reflect the population it provides care for. The objective of this study was to characterise the relationship between candidate sociodemographic factors and performance at National Selection for HST in the UK. Design A retrospective cohort study. Setting National Selection for HST in the UK. Participants All UK graduates in the UKMED database (https://www.ukmed.ac.uk) who underwent selection for HST from 2012 to 2019. Outcomes and measures Performance at HST Selection for each surgical specialty is measured by assessment of the candidate's academic portfolio and multiple objective structured clinical examination style stations testing knowledge and skills. Univariate analysis identified differences in success rates at first application. Logistic regression models identified sociodemographic predictors of success after adjusting for prior academic attainment (Membership of the Royal College of Surgeons (MRCS) performance). Results Of all applications to HST (n=2875), 66.5% were successful at the first attempt. Females were 32% more likely than males to be successful at selection for HST (OR 1.32 (95% CI 1.05 to 1.67)). MRCS performance was found to be a strong independent predictor of future success at HST selection. Females were more likely to be successful at general surgery selection (OR 2.69 (95% CI 1.63 to 4.45)), older candidates (graduates) were less likely to be successful at ENT selection (OR 0.21 (95% CI 0.05 to 0.95)), and candidates that were the first in their family to attend University were less likely to be successful at urology selection (OR 0.41 (95% CI 0.21 to 0.78)). Conclusions Our findings highlight few statistically significant associations and no consistent patterns between sociodemographic factors and performance at HST selection once we adjusted for prior academic attainment. This suggests that differences in performance on selection into HST may be more likely due to individual rather than group-level differences.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8bbcaaa516d076ca1772fc93a8f6dffc",
  "timestamp": "2025-05-15T01:25:23.385844"
}