{
  "id": 2437,
  "title": "Smart Rehabilitation-Planning Framework for Sustainable Infrastructure: Roofing Application",
  "abstract": "Aging infrastructure assets, including buildings, require efficient rehabilitation to sustain services. However, current rehabilitation planning is a complex process that is challenged by strict budgets and the difficulty of identifying and delivering the assets that are most worthy of rehabilitation. Existing methods struggle not only with collecting inspection data but also with how to use these data to allocate the limited rehabilitation funds efficiently across the asset portfolio. This paper introduces a smart infrastructure rehabilitation framework that integrates inspection, fund allocation, and scheduling phases. Focusing on roofing elements, the proposed framework uses four novel components: (1) asset image analysis to quantify the size of sustained damage; (2) data-mining to further analyze the asset condition; (3) clustering and optimization to shortlist the assets that are most worthy of rehabilitation under a strict budget; and (4) repetitive scheduling to generate timely delivery plans for the budgeted rehabilitation works. The model was applied to the Toronto District School Board asset portfolio (300+ schools), and the model identified the buildings in most need of rehabilitation given a strict budget ($2.3 million) and offer a schedule for the efficient delivery of the required rehabilitation work within a 45-day period of the school's summer break. Although this paper focuses on built-up building roofs, the framework is scalable to other types of assets.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8bc491ea33c97306b0d1198771aa5c10",
  "timestamp": "2025-05-15T01:06:38.179926"
}