{
  "id": 7092,
  "title": "Adaptive Boom Barrier Management at ETC Toll Plazas Using Predictive Analytics",
  "abstract": "The management of barrier systems in Electronic Toll Collection (ETC) lanes is crucial for optimizing toll plaza operations by balancing traffic flow, congestion, revenue, and environmental impacts. Open-barrier systems, while reducing vehicle queues and carbon emissions by enabling continuous flow, may increase the risk of revenue loss due to unauthorized crossings. Closed-barrier systems (CBB), on the other hand, improve payment compliance and safety but can lead to longer queues and higher emissions due to idling vehicles. This study proposes an innovative adaptive barrier management framework that integrates predictive modeling to optimize toll booth operations, particularly during peak traffic periods. The framework utilizes real-time traffic data to predict both service time and Average Queue Length (AQL). A key component of the system involves the prediction of service times under open-barrier conditions (OBB) using machine learning models and the use of Gated Recurrent Unit (GRU) networks combined with the Optuna framework for predicting AQL under both CBB and OBB. This work explores the novel application of these techniques to the specific problem of toll plaza operations, thereby contributing new insights into optimizing barrier systems for ETC toll lanes. The study evaluates the trade-offs between operational efficiency, carbon reduction, and revenue loss in open-barrier and closed-barrier systems. Our results show that allowing a certain percentage of unauthorized crossings can significantly improve operational efficiency, reducing AQL by 36.62%/day on weekdays and 31.88%/day on weekends in ETC lanes, as well as decreasing carbon emissions by 617.43 kgCO(2) equivalent/day on weekdays and 383.08 kgCO(2) equivalent/day on weekends by reducing idle times. However, exceeding established thresholds for unauthorized crossings leads to an increase in revenue loss, which can negatively affect toll plaza performance. The feasibility analysis further quantifies these environmental and financial trade-offs, proposing a strategy for dynamically adjusting barrier management to minimize revenue loss while maintaining high operational efficiency. This research contributes to the advancement of intelligent toll systems by offering a framework for dynamic barrier management that balances operational efficiency, carbon reduction, and economic sustainability, supporting the development of low-carbon, efficient toll infrastructure and paving the way for future innovations in adaptive traffic management.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8bcaacc4b69ac1611f80c1c5a5f7a944",
  "timestamp": "2025-05-15T03:05:03.505916"
}