{
  "id": 9342,
  "title": "Trends of autoimmune liver disease inpatient hospitalization and mortality from 2011 to 2017: A United States nationwide analysis",
  "abstract": "BACKGROUND Autoimmune liver diseases (AiLD) encompass a variety of disorders that target either the liver cells (autoimmune hepatitis, AIH) or the bile ducts [(primary biliary cholangitis (PBC), and primary sclerosing cholangitis (PSC)]. These conditions can progress to chronic liver disease (CLD), which is characterized by fibrosis, cirrhosis, and hepatocellular carcinoma. Recent studies have indicated a rise in hospitalizations and associated costs for CLD in the US, but information regarding inpatient admissions specifically for AiLD remains limited. AIM To examine the trends and mortality of inpatient hospitalization of AiLD from 2011 to 2017. METHODS This study is a retrospective analysis utilizing the National Inpatient Sample (NIS) databases. All subjects admitted between 2011 and 2017 with a diagnosis of AiLD (AIH, PBC, PSC) were identified using the International Classification of Diseases (ICD-9) and ICD-10 codes. primary AiLD admission was defined if the first admission code was one of the AiLD codes. secondary AiLD admission was defined as having the AiLD diagnosis anywhere in the admission diagnosis (25 diagnoses). Subjects aged 21 years and older were included. The national estimates of hospitalization were derived using sample weights provided by NIS. chi(2) tests for categorical data were used. The primary trend characteristics were in-hospital mortality, hospital charges, and length of stay. RESULTS From 2011 to 2017, hospitalization rates witnessed a significant decline, dropping from 83263 admissions to 74850 admissions (P < 0.05). The patients hospitalized were predominantly elderly (median 53% for age > 65), mostly female (median 59%) (P < 0.05), and primarily Caucasians (median 68%) (P < 0.05). Medicare was the major insurance (median 56%), followed by private payer (median 27%) (P < 0.05). The South was the top geographical distribution for these admissions (median 33%) (P < 0.05), with most admissions taking place in big teaching institutions (median 63%) (P < 0.05). Total charges for admissions rose from 66031 in 2011 to 78987 in 2017 (P < 0.05), while the inpatient mortality rate had a median of 4.9% (P < 0.05), rising from 4.67% in 2011 to 5.43% in 2017. The median length of stay remained relatively stable, changing from 6.94 days (SD = 0.07) in 2011 to 6.51 days (SD = 0.06) in 2017 (P < 0.05). Acute renal failure emerged as the most common risk factor associated with an increased death rate, affecting nearly 68% of patients (P < 0.05). CONCLUSION AiLD-inpatient hospitalization showed a decrease in overall trends over the studied years, however there is a significant increase in financial burden on healthcare with increasing in-hospital costs along with increase in mortality of hospitalized patient with AiLD.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8bd0fee2b4919edd99bb939df5c77f20",
  "timestamp": "2025-05-15T03:27:53.372991"
}