{
  "id": 3780,
  "title": "Don't know what you've got 'til it's gone? Skills-led qualifications, secondary school attainment and policy choices",
  "abstract": "In the name of curriculum breadth and raising standards, recent government policy in England has removed a large number of non-academic qualifications from the list of those that secondary schools can count in league tables, discouraging their use. Most of these were vocational qualifications, but they also include skills-led qualifications. This paper reports mixed methods research investigating the relationship between mainstream secondary school qualifications in England and a specific, widely used skills-led qualification: the Certificate of Personal Effectiveness (CoPE). Neither academic nor vocational, CoPE requires learners to assemble a portfolio of evidence in response to 'challenges' negotiated with the teacher. It is designed to promote a reflective learning orientation and to develop (and assess) skills that underpin learning and future employability. We use a combination of regression analysis, pseudo-experiment and qualitative case study. Our research shows that CoPE is associated with improved outcomes in the 'mainstream' academic qualifications often regarded as the benchmark for the quality of schools and much of what goes on in them. Thus, we argue that certain reforms designed to raise standards are likely to depress attainment in the very qualifications deemed as core indicators of educational standards.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8bd3c68aef19f43864cc12bc7092ee01",
  "timestamp": "2025-05-15T01:20:36.120501"
}