{
  "id": 6634,
  "title": "Screening for ectopic pregnancy in symptom-free women at increased risk",
  "abstract": "Objective: To determine the ectopic pregnancy rate among symptom-free women at increased risk undergoing a screening program involving transvaginal sonography and serum hCG testing. Methods: Consecutive symptom-free women at increased risk for ectopic pregnancy were studied prospectively by transvaginal sonography and serum hCG measurement to detect ectopic pregnancy before the onset of symptoms. Results: Between September 1993 and May 1996, 143 symptom-free pregnant women with pregnancies of a gestational age of less than 7 weeks were screened. Eight had ectopic pregnancies, 129 had intrauterine pregnancies, and six had trophoblast in regression. Among the eight women with ectopic pregnancies, one was initially diagnosed as having an intrauterine pregnancy. This woman returned 1 week later with abdominal pain, and an ectopic pregnancy with intra-abdominal bleeding was found. Ectopic pregnancies were present in 5.6% (95% confidence interval 2.5%, 10.7%) of the women screened. This was significantly lower than reported in a previous study. Conclusion: The ectopic pregnancy rate in the population that was offered screening was low. Thus, it is questionable whether the possible benefits (prevention of complications and reassurance of the woman) outweigh possible detriments (false-positive diagnosis, financial costs, and emotional stress that could be induced by screening). (C) 1997 by The American College of Obstetricians and Gynecologists.",
  "year": 1997,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8bf57ca59455066abebc30b702beac47",
  "timestamp": "2025-05-15T03:00:05.001005"
}