{
  "id": 8538,
  "title": "Prehospital and Posthospital Fall Injuries in Older US Adults",
  "abstract": "Question What are older adults' risks of fall injuries in the periods surrounding hospitalization? Findings This retrospective cohort study using national survey and linked Medicare data observed spikes in older adult fall injury risk in the periods just before and after hospitalization. Risk increases were particularly pronounced for those who experienced an inpatient fall injury. Meaning These findings suggest that efforts to improve coordination of fall injury risk during care transitions into and out of the hospital are needed. Importance To date, measurement and treatment of older adult fall injury has been siloed within specific care settings, such as a hospital or within a nursing home or community. Little is known about changes in fall risk across care settings. Understanding the occurrence of falls across settings has implications for measuring and incentivizing high-value care across care settings. Objective To estimate the risk of older adult fall injury within and across discrete periods during a 12-month care episode anchored by an acute hospitalization. Design, Setting, and Participants This cohort study is a longitudinal analysis of 12-month periods that include an anchor hospital stay using national data from 2006 to 2014. Participants included older (aged >= 65 years) Medicare fee-for-service beneficiaries from the Health and Retirement Study. Weekly fall injury rates were computed for 4 periods compared with the anchor hospitalization: at baseline (1-6 months before hospitalization), just before (<1 month before hospitalization), just after (<1 month after hospitalization), and at follow-up (1-6 months after hospitalization). Piecewise logistic regression models estimated weekly marginal risk of fall injury within each period, adjusting for sociodemographic and health characteristics. Fall injury risks for high-risk beneficiaries with a fall injury during the anchor hospitalization were also estimated. Data analysis was performed from November 2019 to April 2020. Main Outcomes and Measures Fall injuries. Results In total, 10.106 anchor hospitalizations for 4101 beneficiaries (mean [SD] age, 77.1 [7.6] years; 5912 hospitalizations among women [58.5%]) were identified. The overall fall injury risk was 0.77%. In adjusted models, marginal increases in weekly fall injury risk just before hospitalization (0.27 percentage points [95% CI, 0.22 to 0.33 percentage points], or 30.0%; P < .001) were 4 times greater than decreases just after hospitalization (-0.18 percentage points [95% CI, -0.23 to -0.13 percentage points], or -9.2%; P < .001)]. A greater risk differential before and after hospitalization was observed for patients with an inpatient fall injury (1.89 percentage points [95% CI, 1.37 to 2.40], or 309.8%; P < .001; vs -0.39 percentage points [95% CI, -0.73 to -0.04], or -11.6%; P = .03). Conclusions and Relevance An episode-based assessment of fall injury illustrates substantial variability in period-specific risks over an extended period including an anchor hospitalization. Risk transitions between periods include sizable increases just before hospitalization that do not fully subside after hospital discharge. Financial incentives to coordinate hospital and posthospital care for patients at risk for fall injury are needed. These could include bundled payments for fall injury episodes that incentivize coordination across settings. This cohort study estimates the risk of older adult fall injury within and across discrete periods during a 12-month care episode anchored by an acute hospitalization.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c148d9955fe52105f24cb79aa507659",
  "timestamp": "2025-05-15T03:19:52.126032"
}