{
  "id": 8243,
  "title": "An Analysis of the Impact of ESG Incidents on Tax Avoidance in Korean Distribution Companies",
  "abstract": "Purpose: The purpose of this study is to analyze the impact of ESG incidents on tax avoidance trends in domestic listed distribution companies. Research Design, Data, and Methodology: We collected five years of financial data (2019-2023) for companies included in the KOSPI 200 index to test the hypothesis that ESG incidents lead to reduced tax avoidance. Using ESG incidents data provided by Whosgood, we employed the effective tax rate as a response variable to identify the relationship between tax avoidance and ESG incidents in the distribution industry. This relationship was examined through a multiple regression analysis model, yielding empirical results aligned with the study's objectives. Results: The empirical analysis indicated that korea's distribution industry, with its high propensity for tax avoidance due to frequent undocumented transactions, showed a reduced tendency for tax avoidance in companies with high ESG incidents scores. This trend was not observed in the non-distribution industry. Specifically, within the same social score, only distribution companies with significant social issues demonstrated a lower propensity for tax avoidance. Conclusions: This study offers several academic contributions. Firstly, it confirms that in companies where ESG risks are realized and actual ESG performance is low, the tendency to avoid taxation decreases as a risk management strategy. Additionally, the study highlights the distinct characteristics of ESG performance in the distribution and non-distribution industries, showing that ESG issues differentially affect corporate policies in the non-distribution industry.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c1b350025a1659c1b1f1fef38ec8a7f",
  "timestamp": "2025-05-15T03:16:48.990622"
}