{
  "id": 105,
  "title": "Neural network model of interaction between real economy sector entrepreneurship and financial field under risk",
  "abstract": "The paper presents a developed neural network model of interaction between entrepreneurship enterprises and financial system. A hypothesis that a neural network makes it possible to simulate the interaction between complex systems and develop a profit forecast for enterprises in the real sector of the economy under risk has been put forward and proved. Among the main research methods, monographic method, design-constructive procedure and artificial intelligence are to be emphasized. The results include the fact that the theoretical foundations of the interaction between enterprises in the real economy sector and the financial and budgetary systems have been investigated. The factors determining the profitability of the enterprises in the real sector of the economy have been considered. Main interaction dependencies between the economic and financial systems under conditions of market uncertainty have been revealed. The systems of artificial intelligence in business and other spheres have been investigated. The theoretical foundations of the financial risk analysis under conditions of uncertainty have been considered. A neural network model that makes it possible to obtain a profit forecast for enterprises in the real sector of the economy under risk has been developed. Main conclusions that reflect the results of the study have been formulated. They consist in the fact that in modern conditions it is important to study the issues associated with the further development of entrepreneurship and the real sector of the economy as a whole in conditions of market uncertainty and risk. The studies have shown that it seems appropriate to identify patterns of interaction between entrepreneurship in the real economy and the financial and budgetary systems using artificial intelligence systems. The research has resulted in a neural network model that makes it possible to obtain a profit forecast for enterprises in the real sector of the economy under risk.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c1d012cf9e103c3e7e1b83c3168fc2d",
  "timestamp": "2025-05-15T01:46:39.614991"
}