{
  "id": 4985,
  "title": "Farmers' adaptation to climate change in Pakistan: Can their climate risk management strategies lead to sustainable agriculture?",
  "abstract": "Farming communities in many developing nations are facing the impacts of climate change, characterized by greater variability and frequency of extreme weather events, which threaten their livelihoods and the agricultural sector as a whole. Agricultural sustainability is at risk when farmers engage in off-farm activities to protect their economic future and combat climate change. This study aimed to identify the determinants of off-farm management activities adoption and highlight the issues faced by farmers after their adoption in agriculture. The data were collected data through a questionnaire survey from 360 farm households in Pakistan. The study utilized a stepwise probit regression to analyse the adoption of land use and migration-based diversification as risk management strategies. The results indicated that marital status, household size, risk perception of rains, floods, drought, and extreme weather were the factors determining the adoption of land use and migration-based diversification as risk management strategies. However, livestock showed a negative association with the adoption of these strategies. Moreover, the study identified crop failure as the primary reason to adopt off-farm strategies, followed by rising production costs. The results showed that farmers were managing climate change risks at the cost of farmland, labour loss, and increased production costs. The study is unique in its focus on the unanticipated negative effects of this adaptation. The findings emphasize the need for investment in climatesmart agriculture and financial assistance for farmers. Building a sustainable agricultural system needs more than just adaptation: long-term practices and financial protections to stabilize farmers' incomes and help rural areas develop.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c2358fe32454c50104c1138e2e14688",
  "timestamp": "2025-05-15T02:43:06.769491"
}