{
  "id": 5169,
  "title": "Funding liquidity risk and asset risk of Indonesian Islamic rural banks",
  "abstract": "This study explores the influence of funding liquidity risk and several control variables on Islamic rural banks' asset risk in Indonesia. Our study analyzes Islamic rural banks comprising 142 Islamic banks with quarterly data from 2013: Q1 to 2018: Q4. Panel regression is then employed. We divide Islamic banks related to their size and location for further analysis. Our results confirm the funding liquidity risk increase Islamic banks' asset risk. Small Islamic banks encounter less asset risk than large Islamic banks, but large banks face a lower probability of bad financing than small Islamic banks. The influence of funding liquidity risk on asset risk is higher for Islamic banks in developed areas than in less developed areas. More interestingly, the results using an interaction term between funding liquidity risk and financial contracts show that Islamic banks providing profit-loss sharing contracts (PLS) and non-PLS face lower asset risk than those Islamic banks providing only non-PLS contracts. Results also highlight the importance of market power, size, financing, and efficiency in lowering asset risk. Our findings have two implications. First, policymakers can implement investment account product to reduce mismatch between liquidity risk and asset risk. Second, Islamic banks should provide both PLS and non-PLS contracts by optimizing both contracts to reduce Islamic banks' risk assets.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c28fa7901aea4332489ae0d04b3cbf7",
  "timestamp": "2025-05-15T02:45:17.006488"
}