{
  "id": 7161,
  "title": "Negative life events and major depressive disorder among HIV-positive individuals in Guangdong, China A cross-sectional study",
  "abstract": "HIV-positive individuals encounter a number of negative life events (NLEs). This cross-sectional study aimed to evaluate the association between NLEs and major depressive disorder (MDD) among HIV-positive individuals in Guangdong, China, about which little is known. HIV-positive individuals were recruited from the Centers for Disease Prevention and Control of Guangzhou, Zhongshan, and Yangjiang from September 2007 to September 2008. Data on NLEs were collected using a questionnaire. The Structured Clinical Interview for DSM-IV-TR Axis I Disorders-Patient Edition (SCID-I/P) based on the DSM-IV criteria was used to diagnose MDD. Multiple logistic regression analyses were conducted to evaluate the association between NLEs and MDD. Among the 339 participants, 306 (90.27%) reported that one or more NLEs had ever occurred. Participants who reported NLEs that included HIV infection, financial problems, AIDS diagnosis, HIV/AIDS discrimination, conflict with spouse or lover, conflict with other family members, problems in childbearing, and conflict with nonfamily were at a higher risk of MDD. Participants who reported more NLEs in the last year had a higher risk of MDD (OR=2.86, 95% CI: 1.76-4.65) than individuals who reported fewer NLEs. Individuals with higher chronic stress scores had a higher risk of MDD (OR=4.36, 95% CI: 2.44-7.78) than individuals with lower chronic stress scores. However, acute stress was not associated with MDD. NLEs were common among HIV-positive individuals. MDD was associated with a greater number of NLEs and the increased chronic stress caused by the NLEs. Interventions should be tailored to those who reported NLEs to help reduce the risk of MDD and increase the quality of life among HIV-positive individuals.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c2add02c531f048808b593867d6a398",
  "timestamp": "2025-05-15T03:05:32.132165"
}