{
  "id": 1886,
  "title": "The interplay between experiential and traditional learning for competency development",
  "abstract": "Extensive research demonstrated that firms may pursue several advantages in hiring individuals with the set of emotional, social, and cognitive (ESC) competencies that are most critical for business success. Therefore, the role of education for competency development is becoming paramount. Prior studies have questioned the traditional methods, grounded in the lecture format, as a way to effectively develop ESC competencies. Alternatively, they propose experiential learning techniques that involve participants in dedicated courses or activities. Despite the insights provided by these studies, they do not take into account a comprehensive set of learning methods and their combined effect on the individual's competency portfolio within educational programs that aim to transfer primarily professional skills. Our study aims to fill these gaps by investigating the impact of the interplay between different learning methods on ESC competencies through a sample of students enrolled in the first year of a master's degree program. After providing a classification of three learning methods [traditional learning (TL), individual experiential learning (IEL), and social experiential learning (SEL)], the study delves into their combined influence on ESC competencies, adopting the Artificial Neural Network. Contrary to prior studies, our results provide counterintuitive evidence, suggesting that TL needs to be implemented together, on the one hand, with IEL to achieve a significant effect on emotional competencies and, on the other hand, with SEL to have an impact on social competencies. Moreover, IEL plays a prominent role in stimulating cognitive competencies. Our research contributes to educational literature by providing new insights on the effective combination of learning methods that can be adopted into programs that transfer technical knowledge and skills to promote behavioral competencies.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c460fe64564ef52bd9d245c8b1f4ca2",
  "timestamp": "2025-05-15T01:00:27.438814"
}