{
  "id": 146,
  "title": "A firefly algorithm modified support vector machine for the credit risk assessment of supply chain finance",
  "abstract": "Purpose: Nowadays, Supply Chain Finance (SCF) has been developing rapidly since the emergence of credit risk. Therefore, this paper used SVM optimized by the firefly algorithm, which is called firefly algorithm support vector machine (FA-SVM), and applied it to SCF evaluation with a different indicator selection. Design/methodology/approach: In this paper, we used FA-SVM to assess the credit risk of supply chain finance with extracted index through correlation and appraisal analysis, and finally determined 3 first-level indicators and 15 third-level indicators. Through the application analysis, 39 SMEs (117 sample data) were selected from the Computer and Electronic Communications Manufacturing Industry as the characteristics for the input variables, to verify the improvement effect of the method relative to the LIBSVM and the classification pretest effect in the credit risk assessment of the SCF. Findings: The results showed that FA-SVM could improve the accuracy of classification prediction compared with LIBSVM, and decrease the error rate of falseness recognize credible enterprise to untrusted enterprise. Originality/value: This paper appliedthe firefly support vector machine in the supply chain financial evaluation for the first time. The output variable was described in a more detailed manner during the index define, and the random selection set in the process of FA-SVM data training.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c4fd8d70fbf26f890a65e6bf2c34c53",
  "timestamp": "2025-05-15T01:47:14.127196"
}