{
  "id": 1548,
  "title": "Federated Reinforcement Learning in Stock Trading Execution: The FPPO Algorithm for Information Security",
  "abstract": "Stock trading execution is a critical component in the complex financial market landscape, and the development of a robust trade execution framework is essential for financial institutions pursuing profitability. This paper presents the Federated Proximal Policy Optimization (FPPO) algorithm, an adaptive trade execution framework that leverages joint reinforcement learning. The FPPO algorithm demonstrates significant improvements in model performance across various stocks, with average returns enhanced by 3% to 15%. It also exhibits superior performance in key metrics such as the reward function value, showcasing its effectiveness in different financial contexts. The paper further explores the model's performance under the FPPO algorithm with varying numbers of client nodes and different risk preferences, underscoring the importance of these factors in model construction. The results substantiate the FPPO algorithm's capability to safeguard privacy, ensure high performance, and enable the creation of personalized trading models in the optimal trade execution problem. This positions investors to gain a competitive edge in the dynamic and complex financial markets. Although the FPPO algorithm demonstrates significant potential in trade execution optimization, it may need to integrate a broader range of real-world variables and develop advanced privacy-preserving mechanisms to enhance its applicability in diverse financial contexts.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c5745cfd41ce4b82d23d088e842ad67",
  "timestamp": "2025-05-15T02:04:20.120755"
}