{
  "id": 6609,
  "title": "Assessing the interrelations of traffic collisions' risk factors",
  "abstract": "The enormous human and financial costs of traffic collisions mean that improving road safety by reducing the number of accidents is a major priority for transportation authorities around the world. One major prerequisite for reducing accidents is investigation of the risk factors for traffic collisions. Conventional multiple regression, pattern recognition and multi-criteria decision-making models in some ways have a high ability to predict traffic collisions. However, they provide no information about the indirect effect of the examined factors in the occurrence of traffic collisions; therefore, they are not appropriate for the descriptive analysis of these factors. In the present study, structural equation modelling was applied to evaluate the cause-effect interrelationship of traffic collisions' risk factors, and their cause-effect relationships with the accidents. According to experimental results on the main roadway network of Hamedan province, human, traffic and road factors had a significant direct effect on the occurrence of collisions. Moreover, the human factors indirectly led to an increase in the probability of the collisions' occurrence through the mediator variable of the road. Among the human factors, education and age had prominent impacts rather than the locality. The work highlights these peculiar aspects and suggests methods to reduce their effects.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c61e42598ec70b6081b5b77629ebb27",
  "timestamp": "2025-05-15T02:59:37.100267"
}