{
  "id": 7601,
  "title": "Perceived Threats through COVID-19 and the Role of Organizational Capacity: Findings from Non-Profit Sports Clubs",
  "abstract": "(1) Background: The COVID-19 pandemic has forced non-profit sports clubs to shut their doors. As a consequence, neither sports activities nor social gatherings could take place for an indefinite period. This situation poses potential risks to sports clubs as clubs could lose members, volunteers, and revenue. The purpose of this study is to investigate how strong clubs have been affected so far by COVID-19 and which capacities help or hinder clubs in dealing with the crisis. (2) Methods: The study is based on large-scale primary data (n = 4295) collected among German sports clubs in autumn 2020. Three fractional regression models are applied to examine which organizational capacities are related to potential threats caused by COVID-19. (3) Results: Clubs perceive the risk of losing members as most threatening, followed by the challenge of retaining volunteers. Potential financial threats are perceived as smaller by clubs without their own sports facilities and paid employees. (4) Conclusions: Overall, sports clubs with a strong solidarity culture seem to be affected less by potential threats through COVID-19. To become more resilient to unexpected external influences, capacity building in specific areas of sports clubs should be considered. Support from public institutions and sports associations is needed.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c66136667a5c9525a0a82819d7869e0",
  "timestamp": "2025-05-15T03:10:05.655350"
}