{
  "id": 9451,
  "title": "Linkages Between The US And South Korean Markets: Evidence From Dually Listed Stocks",
  "abstract": "Globalisation and reduction of restrictions on cross-border market listings have led to significant growth in cross-border capital flows between the US and all other countries. In making financial decisions with regard to investment and risk management, it is important for corporate management to understand the behaviour of information linkages and correlations between markets. Most studies focused on the dynamics of price transmission between American depository receipts (ADRs) and their underlying foreign securities in the developed markets and examined only the unidirectional effects of three pricing factors namely, the underlying shares, exchange rate, and the foreign markets, on the overseas listed shares such as ADRs based on a value-weighted portfolio. This paper examines the behaviour of information linkages between dually listed stocks traded in the US and emerging South Korean market using a VAR model in a cointegration framework. The primary focus is to examine the dynamic of price transmissions between the South Korean shares and its ADRs for ten individual firms and a value-weighted portfolio of all firms. This study tests for possible long-run cointegrating relationship between five pricing factors, namely the prices of Korean ADRs and their underlying shares, the US and the Korean market indices, and the exchange rate. In addition, the short-run dynamics between the five pricing factors with feedback from the long-run relationship, and the effect and persistence of a shock in one pricing factor to itself as well as to the other factors in the system are also analysed. Daily closing prices of the dually-listed Korean shares, exchange rate of US dollar per Korean won, and the Korean and the US total market return indices are obtained from Datastream International. With only four companies listed before 2000, this study covers the period from 3rd January 2000 to 30th June 2005 with a total of 1434 observations. The daily returns for each company are computed as logarithmic differences of daily share prices over the entire sample period. The Johansen maximum likelihood method is used to test for the presence of cointegrating long-run relationship among the five pricing factors. Both the trace and maximal eigenvalue test statistics indicate that the individual firms and the portfolio have at least one long-run cointegrating relationship among the prices of five pricing factors at the 5% level of significance. The generalized forecast error variance decompositions indicate that the price of Korean underlying shares is highly sensitive to price movement in the Korean markets, followed by the changes in the Korean ADRs and the US markets. Consistent with the dominant market theory, this study found that the US market is not affected by the Korean market, but rather by its own market conditions. The Korean market has the most significant influence on the Korean ADRs, with the Korean underlying shares and the US market also playing an important part on its prices. The exchange rate does not seem to have a significant influence on both prices in the short run. The generalised impulse response functions of the VAR model show that the price of Korean underlying shares is more responsive to its own shock and shock in the price of Korean ADRs. Similarly, for the Korean ADRs, the responses are mainly coming from their own shocks and that of the underlying shares. Overall, the short-run regression results of the Korean underlying portfolio are quite in line with the VAR findings. However, the order of influence of individual factors has differed, with the lagged returns of Korean underlying portfolio, the Korean and the US markets overtook the Korean ADR return as the more dominant factors. These results represent the process of short-run adjustments with feedback from the long-run equilibrium of the VAR model. In the case of the Korean ADR return, it is more sensitive to its own lagged return, and returns of its underlying portfolio and the US market in the short run.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c6a5037b5ca1e35c10acdc8ccec3261",
  "timestamp": "2025-05-15T03:28:46.369569"
}