{
  "id": 4228,
  "title": "Variability in Namibian landraces of watermelon (Citrullus lanatus)",
  "abstract": "An on-station experiment was carried out in northern Namibia to compare local landraces of watermelon to modern varieties. Three groups of local watermelon are distinguished by farmers in Namibia: watermelons for fresh consumption, cooking melons used for porridge, and seed melons for oil pressing. The present study was carried out to estimate agronomic potential of the local landraces and verify whether agronomic characteristics would justify the local groupings. Important agronomic and fruit-quality traits ( yield, earliness, fruit weight, fruit number, rind thickness, soluble solids, seed weight, and tolerance to biotic and abiotic stress) were measured in seven landraces ( three watermelons, three cooking melons and one seed melon) and compared to three modern cultivars frequently grown in Namibia. The study revealed that well-adapted, productive Citrullus lanatus landraces are available, and cultivated by local farmers throughout the northern regions of Namibia. Based on a combination of agronomic characteristics these local varieties could be grouped into three distinct types: watermelons, cooking melons, and seed melons, in agreement with farmers classification. Landrace water melons were characterized by smaller, less sweet fruits with larger seed and a thicker rind compared to modern varieties. Yield level was comparable but development was later and fruit number in some cases higher. Cooking water melons were less sweet than local water melon with large fruits comparable in size to modern cultivars. The only included seed watermelon had small fruits with large seeds and low soluble sugars. Yield varied from 118 t/ha for a giant cooking melon, out yielding all other accessions, to only 10t/ha for the seed melon type, but with considerable variation within groups. The earliness of commercial varieties may be of interest in developing a mixed portfolio of short- and long-cycle landraces, whereas plant vigour, resistance and seed characters in some of the Namibian landraces may be important traits for breeding for both local purposes and for commercial varieties.",
  "year": 2003,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c6dd45f1616164dbb2d7e6988fa3034",
  "timestamp": "2025-05-15T01:24:51.512273"
}