{
  "id": 2430,
  "title": "The benefits for European companies and investors of promoting happiness through high-performing work policies",
  "abstract": "PurposeIn this paper, the authors tested if promoting the workforce's happiness (through high performance work policies or HPWP) and well-being in European Public companies relates to their profitability (return on equity, ROE), market risk (beta) and stock price return. Also, the authors tested if investors have a performance benefit if they buy a portfolio screened with companies with HPWP.Design/methodology/approachThe authors proxied the quality of the HPWP efforts in the first method with the Refinitiv workforce score. They used this data in an unbalanced panel of eastern, western, northern and southern Europe companies from 2011 to 2022. The panel data also included the ROE, the market risk (beta) and the stock price return of these companies. The authors estimated the corresponding regressions with the panel data and tested the relationship between the workforce score and these three variables. In a second method, they simulated the weekly performance of a portfolio that invested only in European companies with high standards in their HPWP and compared its performance against a conventional market portfolio (with no HPWP screening).FindingsIn the first method, the authors found no significant relationship between the workforce score and the ROE, beta, or stock price return in the panel regression, controlling for random effects. In the second one, they found no over or underperformance in the HPWP portfolio against the European market one in the second method.Practical implicationsThe results suggest that there is no risk or cost for European Public companies and investors alike if they promote, with better HPWP, the happiness and well-being of their workforce. The findings suggest that if European companies promote HPWP, there will be no adverse impact on their profits, market risk, or stock price performance. Also, investors will not lose performance (against a conventional market portfolio) if they screen their portfolios with this type of workforce-friendly companies.Originality/valueIncrease the scarce literature on the test of the workforce score with company profitability (ROE), stock market price variation and stock market risk level.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c88888a20fa39e7c3b2ed4366f7b9e8",
  "timestamp": "2025-05-15T01:06:38.145331"
}