{
  "id": 4154,
  "title": "Learning Curve Analyses for Achieving Satisfactory Procedural Completion Rates in Paediatric Oesophagogastroduodenoscopy",
  "abstract": "Background: The learning curve in paediatric oesophagogastroduodenoscopy (OGD) is unknown. Using >= 95% D2 (second part of the duodenum) intubation rates as a marker of technical competency, we conducted learning curve analyses to identify when trainees achieve competency in paediatric OGD. Factors associated with competency were also evaluated. Methods: This nationwide study analysed data from paediatric OGD procedures prospectively entered into the UK endoscopy training e-portfolio between 2014 and 2018. Moving average and learning curve cumulative summation analyses were performed to determine procedural numbers required to achieve >= 95% D2 intubation rates. Factors associated with D2 intubation were assessed using a multivariable binary logistic regression approach. Results: A total of 8929 procedures performed by 61 trainees were identified. These 61 trainees had recorded a mean of 124.6 procedures (range 22-571, interquartile range 165). By moving average analysis, 95% D2 intubation was achieved after 79 procedures. By learning curve cumulative summation analysis, 81.6% of trainees were competent after 100 procedures. Multivariable factors associated with unassisted procedural completion included: lifetime procedure count (P < 0.001), higher trainee seniority (P < 0.001), patient age (P = 0.002), outpatient status (P < 0.001), and attendance at a national Basic Skills OGD course (P = 0.011). Conclusions: This study demonstrates that, on average, 79 procedures in paediatric OGD are required to attain the competency outcome of >= 95% D2 intubation rates. By 100 procedures, 81.6% of our sample had achieved >= 95% D2 intubation. The minimum procedural count of 100 set by the UK and international training programmes can be used alongside existing objective assessment measures to safeguard competency within a training cohort.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c8ae3e2009b1b3a01571e636b962f3f",
  "timestamp": "2025-05-15T01:24:25.336136"
}