{
  "id": 7145,
  "title": "Risk and reward: unraveling the link between credit risk, governance and financial performance in banking industry",
  "abstract": "PurposeThis study aims to investigate the moderating role of corporate governance (CG) on the relationship between credit risk (CRs) and financial performance (FP) of banks listed in the Palestine Securities' Exchange (PEX) and Amman Securities' Exchange (ASE).Design/methodology/approachThis study used a hypothesis-testing research design to collect data from the annual reports of 21 banks listed on (PEX) and (ASE). Secondary data, annual reports and disclosures were used between from 2009 to 2019. Descriptive and inferential statistics were used, along with correlation analysis to evaluate linear relationships between variables. Data was collected based on panel data, the VIF was used to test multicollinearity and binary logistic regression was used to develop the research model.FindingsThe regression results showed the association between CR and firm performance depends on the measurement of each factor applied. The results showed mixed results between loans to total assets (LTA) and nonperforming loans to total loans (NPLs) with FP. LTA has a significant and positive effect on TOBINSQ and return on equity (ROE), but an insignificant and positive effect on return on assets (ROA). On the other hand, NPLs have a significant and negative effect on ROA, whereas NPLs have a weak and positive effect on TOBINSQ. However, there is an insignificant and positive effect of NPLs on ROE. Moreover, the results demonstrated that CG moderated the relationship between CRs and FP of banks. The practical contribution of this paper, for bank policymakers and authorities, the study's implications are noteworthy. Understanding the varied impacts of different CR measures on FP can help regulators and policymakers design more tailored and effective risk management frameworks for banks.Research limitations/implicationsThis study had limitations that future research might be able to address. First, the small size of the sample used in the study included 21 banks listed on the PEX and ASE. Likewise, the ASE and PEX are considered developing stock exchanges, so the results of this study may differ from those of other stock exchanges. Second, only CRs were considered in this study when examining the association between the profitability of Palestinian banks and ASE. Other studies can be undertaken on other nonfinancial risks, such as operational risk, to measure the differences between them and examine their effects on the profitability of Palestinian and Jordanian banks. Other studies might be performed to compare CRs and its impact on profitability in Palestinian and Jordanian banks with those in other Western and Eastern banks. Furthermore, in addition to TOBINSQ, ROA and ROE, researchers can use other financial indicators to measure profitability. This will contribute to substantiating the present study's findings.Originality/valueAlthough several studies have examined the relationship between CRs and FP in developed and developing countries, the results have been mixed. However, this study is one of the few studies that examined the moderating role of CG in association with CRs and FP, especially on Palestinian and Jordanian contexts. Finally, the findings offer policymakers and practitioners of Palestinian and Jordanian contexts.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c902dbdd35238142ed08889e8221287",
  "timestamp": "2025-05-15T03:05:32.077842"
}