{
  "id": 6153,
  "title": "Gender Diversity and Corporate Performance in South African Listed Companies",
  "abstract": "Gender diversity in the workplace is of importance and the body of literature on gender diversity and corporate performance has consequently grown substantially in line with the increased interest in the topic. There are such contradictory findings on the matter that it is difficult to draw concrete conclusions from the various studies conducted. This research was conducted better to understand the effect, if any, of gender diversity in boards of directors on corporate financial performance. Board gender composition and financial performance of the top hundred companies on the Johannesburg Stock Exchange from 2010 to 2014 were analysed using multiple regression analysis and Structural Equation Modelling. Both Tobin's Q and Return on Assets were used as financial performance measures. No statistically significant positive or negative relationship could be observed between board gender diversity and company financial performance. While this is contrary to some literature, that found either a positive or a negative relationship between these variables, a large number of studies similarly found no relationship at all. A possible explanation is that the average number of female directors on boards of the companies studied was below three for each of the five years analysed. This implies a higher risk of tokenism, when there are three or less women on the board, and where women are seen only as symbols because there are so few of them. Another possible explanation is endogeneity, where the number of women on the board is argued to be a factor of company attributes. Or, perhaps, financial performance is possibly more complex than demographics of board members? While not providing any definitive answers, the research raises important questions about female board representation and highlights areas for further investigation. It is also noted that investigating whether female representation can improve financial performance is already indicative of a problem or form of discrimination. The representation on the board must be given according to the merits, skills, and qualifications of individuals regardless of gender. There have been 13 significant studies on this topic worldwide, but not in SA, with disparate results. Gender representivity is a major issue facing all boards, but the question remains - does it make any difference? This research considers the problem, finding no evidence of impact on performance, but highlights some possible issues. The case is made that the focus should be shifted to eliminating the obstacles of equal representation rather than the number of females represented on boards.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8c96de9ee07183a3cfd475d678445cdc",
  "timestamp": "2025-05-15T02:55:12.977288"
}