{
  "id": 5346,
  "title": "Household stock market participation in South Africa: the role of financial literacy and social interactions",
  "abstract": "Purpose One of the most important phenomena that have been confronted in the field of household finance is the stock market participation puzzle. The puzzle describes the anomaly that the majority of households do not have ownership of stock market products, though empirically stocks give higher expected returns than risk-free assets. The stock market participation rate plays an important role as it has a direct bearing on the equity premium. In this study, the authors aim to investigate how financial literacy and various proxies of social interaction are associated with stock market participation in South Africa. Design/methodology/approach The study uses probit regression and ordinary least squares using the South African National Income Dynamics survey Wave 5 of 2017 to investigate whether financial literacy and social interaction are significantly associated with stock market participation. The financial literacy index is computed using factor analysis on the responses to the financial literacy questions used in the survey. The authors use three proxies for social interaction, namely membership in a Stokvel, membership in a men's association and membership in a women's association. Findings The results reveal that an increase in financial literacy increases the odds of respondents participating in the stock market. Among the control variables, age, race and level of education are significantly associated with stock market participation. When it comes to social interaction, it is belonging to a men's association that is significantly associated with stock market participation. The other proxies for social interaction are insignificantly associated with stock market participation. Originality/value The study contributes to the extant literature by using a set of proxies for social interaction that have the potential to influence stock market participation which have not been used in a South African context.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8cabf459687fb88fd41a0d4ed2c3f6c6",
  "timestamp": "2025-05-15T02:46:44.941863"
}