{
  "id": 1299,
  "title": "Artificial Intelligence in Financial Risk Early Warning Systems: A Bibliometric and Thematic Analysis of Emerging Trends and Insights",
  "abstract": "With the continuous development of financial markets worldwide, there has been increasing recognition of the importance of financial risk management. To mitigate financial risk, financial risk early warning serves as a risk uncovering mechanism enabling companies to anticipate and counter potential disruptions. The present review paper aims to identify the bibliometric analysis for exploring the growth and academic evolution of financial risk, financial risk management, and financial risk early warning concepts. Academic literature is surveyed from the Scopus database during the period 2010-2024. The network analysis, conceptual structure, and bibliographic analysis of the selected articles are employed using VOSviewer and Bibliometric R Package. The biblioshiny technique based on the bibliometric R package was used to draw journal papers' performance and scientific contributions by displaying distinctive features from the bibliometric method used in prior studies. The data was extracted from Scopus databases. In addition, this study comprehensively analyzes the evolution of financial risk early warning systems, highlighting significant trends and future directions. Thematic evaluation across 2010-2015, 2016-2021, and 2022-2024 reveals a shift from traditional statistical methods to advanced machine learning and AI techniques, with neural networks, random forests, and XGBoost being pivotal. Innovations like attention mechanisms and LSTM models improve prediction accuracy. The integration of sustainability factors, such as carbon neutrality and renewable energy, reflects a trend towards incorporating environmental considerations into risk management. The study underscores the need for interdisciplinary collaborations and advanced data analytics for comprehensive financial systems. Policy implications include promoting AI adoption, integrating environmental factors, fostering collaborations, and developing advanced data analytics frameworks.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8cad6017cd3af3c077b4e499cd7024d8",
  "timestamp": "2025-05-15T02:01:11.886425"
}