{
  "id": 7470,
  "title": "Income Inequalities and Risk of Early Rehospitalization for Diabetes, Hypertension and Congestive Heart Failure in the Canadian WorkingAge Population",
  "abstract": "Objectives: In the Canadian context of universal health-care coverage, income inequalities are understudied as potentially predictive of the timings and patterns of repeat hospitalizations for diabetes, despite this condition requiring self-care practices entailing appreciable out-of-pocket expenses in daily life. In this study, we examined the relationships between income disparities and risk of earlier readmission for diabetes and commonly comorbid chronic conditions in the working-age population. Methods: The cohort study exploited 2006 population census data linked longitudinally to 3 years of hospital records from the Discharge Abstract Database among adults 25 to 64 years of age. Multiple regression survival models were used to test the associations of income group with cause-specific times to rehospitalization for diabetes (types 1 and 2) and 5 additional conditions, controlling for other individual sociodemographics. Results: The mean time to rehospitalization for diabetes was 223 days (N 1/44,540). Compared with those in the lowest income quintile, the adjusted risk of earlier readmission was significantly lower among inpatients in the highest income quintile for diabetes (hazard ratio [HR]1/40.89; 95% confidence interval [CI], 0.80 to 0.99) and for the diabetes-concordant conditions of congestive heart failure (HR 1/40.81; 95% CI, 0.66 to 0.99) and hypertension (HR 1/40.85; 95% CI, 0.76 to 0.95). No significant associations between income and readmission intervals were observed for the discordant conditions of angina, asthma and chronic obstructive pulmonary disease. Conclusions: Delays in rehospitalization for diabetes and concordant conditions among the most affluent suggest the persistence of income-mediated differences in individuals' ability to manage these conditions. Further research is needed to understand the specific financial burdens of disease management on patients and their households that may accelerate the risk of repeat hospitalization.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8cb0fcef245c98a6504752d3018d5971",
  "timestamp": "2025-05-15T03:09:07.232797"
}