{
  "id": 7999,
  "title": "Financial protection effects of modification of China's New Cooperative Medical Scheme on rural households with chronic diseases",
  "abstract": "Background: Several years have passed since the rural New Cooperative Medical Scheme (NCMS) in China was established and policies kept continuous improvement. Its policies on chronic diseases vary by county but have certain shared characteristics. Following this modification of medical insurance policy, this study reassesses the provision of insurance against expenditure on chronic diseases in rural areas, and analyzes its effect on impoverishment. Methods: We conducted an empirical study using multi-stage stratified random sampling. We surveyed 1,661 rural households in three provinces and analyzed the responses from 1,525 households that participated in NCMS, using descriptive and logistic regression analysis. Results: The NCMS has reduced the prevalence of poverty and catastrophic health expenditure (CHE), as measured by out-of-pocket (OOP) payments exceeding 40% of total household expenditure, by decreasing medical expenditure. It provides obvious protection to households which include someone with chronic diseases. However, these households continue to face a higher financial risk than those without anyone suffering from chronic diseases. Variables about health service utilization and OOP payment differed significantly between households with or without people suffering from chronic disease. And CHE risk is commonly associated with household income, the number of family members with chronic diseases, OOP payment of outpatient and inpatient service in all three provinces. Conclusion: To reduce CHE risk for these households, it is critical to decrease OOP payments for health services by enhancing the effective reimbursement level of NCMS and strictly regulating the providers' behaviors. We recommend that a combinatory changes should be made to the rural health insurance scheme in China to improve its effect. These include improving the NCMS benefit package by broadening the catalogue of drugs and treatments covered, decreasing or abolishing deductible and increasing the reimbursement ratio of outpatient services for people with chronic diseases, together with expansion of insurance fund, and modifying health providers' behaviors by payment reform.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8cb3ef1e27ad7af776d730e6aa31d241",
  "timestamp": "2025-05-15T03:14:07.293436"
}