{
  "id": 7491,
  "title": "Risk premium or irrational expectations? An investigation into the causes of forward discount bias across 27 developed and developing economies forward rates",
  "abstract": "This study investigates the causes of forward discount bias in 27 forward rates for the period 2007-2016. First, it analyzes the forward discount bias across two horizons: 3-month and 12-month; across two sub-periods: financial crisis and non-crisis; and across two country groups: developed and developing. The regression results show that forward discount bias is present and significant, but has become smaller compared to many earlier studies. In general, 12-month forward discount is less biased compared to the 3-month. The study confirms that during the noncrisis period, developing country forward discount is less biased compared to the developed country across both the horizons. The crisis period has impacted the magnitude of the bias. For the developed country, the bias is higher during the crisis period compared to the non-crisis period at the 3-month horizon but lower at the 12-month horizon. Developing country forward discount is less biased during the crisis period compared to the non-crisis period at the 3-month horizon, but slightly more biased at the 12-month horizon. Second, the study decomposes the bias into two components: irrational expectations and risk premium. The results show that both irrationality and time varying risk premium are present in the bias. However, the irrationality component plays a minor role in the 3-month forward discount bias, but plays a major role in the 12-month forward discount bias. Irrationality is high during the crisis period for both the country groups. The risk premium component of the bias is highly significant across both the periods, country groups and horizons, and thus, plays a major role in the overall bias. Further, the non-parametric tests of comparison of statistical significance of the beta coefficient values between country groups, periods and horizons indicate that many differences are statistically significant supporting our conclusions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8cbad8f0f3ca3d097a042b7cbf761e42",
  "timestamp": "2025-05-15T03:09:07.307523"
}