{
  "id": 8488,
  "title": "Costs of Healthcare- and Community-Associated Infections With Antimicrobial-Resistant Versus Antimicrobial-Susceptible Organisms",
  "abstract": "Objective. We compared differences in the hospital charges, length of hospital stay, and mortality between patients with healthcare- and community-associated bloodstream infections, urinary tract infections, and pneumonia due to antimicrobial-resistant versus -susceptible bacterial strains. Methods. A retrospective analysis of an electronic database compiled from laboratory, pharmacy, surgery, financial, and patient location and device utilization sources was undertaken on 5699 inpatients who developed healthcare- or community-associated infections between 2006 and 2008 from 4 hospitals (1 community, 1 pediatric, 2 tertiary/quaternary care) in Manhattan. The main outcome measures were hospital charges, length of stay, and mortality among patients with antimicrobial-resistant and -susceptible infections caused by Staphylococcus aureus, Enterococcus faecium, Enterococcus faecalis, Klebsiella pneumoniae, Pseudomonas aeruginosa, and Acinetobacter baumannii. Results. Controlling for multiple confounders using linear regression and nearest neighbor matching based on propensity score estimates, resistant healthcare- and community-associated infections, when compared with susceptible strains of the same organism, were associated with significantly higher charges ($15 626; confidence interval [CI], $4339-$26 913 and $25 573; CI, $9331-$41 816, respectively) and longer hospital stays for community-associated infections (3.3; CI, 1.5-5.4). Patients with resistant healthcare-associated infections also had a significantly higher death rate (0.04; CI, 0.01-0.08). Conclusions. With careful matching of patients infected with the same organism, antimicrobial resistance was associated with higher charges, length of stay, and death rates. The difference in estimates after accounting for censoring for death highlight divergent social and hospital incentives in reducing patient risk for antimicrobial resistant infections.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8cc75558156e1e1ddfb07fd0ad240292",
  "timestamp": "2025-05-15T03:19:21.333461"
}