{
  "id": 6596,
  "title": "Risk factors for readmission with preeclampsia: a call for more preventative surveillance and counseling",
  "abstract": "BackgroundPostpartum readmission for preeclampsia is a difficult predicament for patients which creates financial, psychosocial, and physical stress. It is often a challenge to predict postpartum preeclampsia and therefore identify patients that may be at risk prior to discharge. This study aims to identify risk factors in patients that are at high risk for readmission due to preeclampsia. The identification of these risk factors may also lead to enhanced education and counseling prior to discharge.MethodsResearchers conducted a case-control study using a data set collected from 2015 to 2022 looking at obstetric readmissions within 6 weeks of delivery and then stratified these patients for preeclampsia diagnosis. A control set was created within the healthcare system's electronic medical record's search tools for patients diagnosed with preeclampsia who were not readmitted to the hospital. This study evaluates 78 patients who were readmitted with a diagnosis of preeclampsia and compared to 77 patients who were diagnosed with preeclampsia who were not readmitted. Again, the aim of this study was to investigate risk factors for readmission among patients with preeclampsia.ResultsA multivariable logistic regression model was used to assess predictors which revealed that older age (OR 1.13, CI 1.03-1.24), no history of preeclampsia with or without severe features within pregnancy before delivery (OR 15.29, CI 5.56-41.98 and 13.58, CI 4.46-12.85), no aspirin use in pregnancy (OR 4.38, CI 2.02-9.48), and number of triage visits related to hypertension during prenatal care were all significant predictors for readmission due to preeclampsia.ConclusionWith these risk factors in mind, better counseling and preventative surveillance can be provided to patients. Future studies are needed to evaluate the effectiveness of predictive models developed using these found risk factors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ccf302e1de495307d6548377bfac767",
  "timestamp": "2025-05-15T02:59:37.080274"
}