{
  "id": 5060,
  "title": "Coping strategies related to food insecurity at the household level in Bangladesh",
  "abstract": "Introduction In connection to food insecurity, adaptation of new techniques or alteration of regular behavior is executed that translates to coping strategies. This paper has used data from food security and nutrition surveillance project (FSNSP), which collects information from a nationally representative sample in Bangladesh on coping behaviors associated with household food insecurity. To complement the current understanding of different coping strategies implemented by the Bangladeshi households, the objective of this paper has been set to examine the demographic and socio-economic characteristics of the food insecure households which define their propensity towards adaptation of different types of coping strategies. Methodology FSNSP follows a repeated cross-sectional survey design. Information of 23,374 food insecure households available from February 2011 to November 2013 was selected for the analyses. Coping strategies were categorized as financial, food compromised and both. Multinomial logistic regression was employed to draw inference. Results Majority of the households were significantly more inclined to adopt both multiple financial and food compromisation coping strategies. Post-aman season, educational status of the household head and household women, occupation of the household's main earner, household income, food insecurity status, asset, size and possession of agricultural land were found to be independently and significantly associated with adaptation of both financial and food compromisation coping strategies relative to only financial coping strategies. The relative risk ratio of adopting food compromisation coping relative to financial coping strategies when compared to mildly food insecure households, was 4.54 times higher for households with moderate food insecurity but 0.3 times lower when the households were severely food insecure. Whereas, households were 8.04 times and 4.98 times more likely to adopt both food compromisation and financial relative to only financial coping strategies if moderately and severely food insecure respectively when compared to being mildly food insecure. Conclusion Households suffering from moderate and severe food insecurity, are more likely to adopt both financial and food compromisation coping strategies.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8cef8b71eb1155e6cc3539168a7bbbc6",
  "timestamp": "2025-05-15T02:43:40.294846"
}