{
  "id": 8183,
  "title": "Life course pathways from parental education to age-related decrements in kidney function among Black and white American adults",
  "abstract": "Objective: Using cross-sectional data on Black and white adults, this analysis examined whether age-related decrements in kidney function across adulthood were associated with parental education, and whether the association was differentially influenced by race. Further, this study assessed racial differences in life course pathways from parental education to age-related decrements in kidney function, through current SES and healthrelated risk factors. Method: Data from the main survey and the Biomarker Project of the Midlife in the United States (MIDUS) Wave 2 and Refresher samples were combined, resulting in 1861 adults (54.5% female; age 25-84, Mage = 53.37) who self-identified as non-Hispanic Black (n = 326) and non-Hispanic white (n = 1535). Estimated glomerular filtration rate (eGFR) was based on serum creatinine, calculated using the CKD-EPI formula. Adults SES was based on education, income, and financial strains. Health-related risk factors included obesity, elevated blood pressure (BP), and insulin resistance. Hypotheses were tested by utilizing multiple linear regression and regression-based moderated mediation analysis. Results: Lower parental education was associated with steeper age-related decrements in eGFR (B = 0.38, SE = 0.15, p = .013, 95%CI = 0.08, 0.68), due to higher eGFR among younger participants and lower eGFR among older participants. In addition, age-related decrements in kidney function were steeper among Black relative to white adults (B = 0.41, SE = 0.13, p < .01, 95%CI = 0.16, 0.66), driven by higher proportion of younger Black adults that met criterion for renal hyperfiltration. Furthermore, parental education and race were associated with age-related decrements in kidney function in an additive rather than interactive way. There were some racial differences in the life course pathways from parental education to age-related differences in eGFR, glucoregulation, and hypertension. Among Black adults, lower parental education was associated with elevated eGFR among younger participants through insulin resistance. Among white adults, lower parental education was linked to higher eGFR among younger adults and lower eGFR among older adults, and the association was mediated by current SES, elevated BP, and insulin resistance. Discussion: Early life SES can have a long-lasting influence on the preclinical renal senescence that is associated with the normal biology of aging for both Black and white adults.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8cfa9686e51937fdd2872a19c4d6ba2a",
  "timestamp": "2025-05-15T03:16:17.386782"
}