{
  "id": 7347,
  "title": "The Impact of Hybrid Coronary Revascularization on Hospital Costs and Reimbursements",
  "abstract": "Background. Hybrid coronary revascularization (HCR) combines a minimally invasive, left internal mammary artery-left anterior descending coronary artery (LAD) bypass with percutaneous intervention of non-LAD vessels for patients with multivessel coronary disease. The financial implications of HCR have not been compared with off-pump coronary artery bypass (OPCAB) through sternotomy. Methods. The contribution margin is a fiduciary calculation (best hospital payment estimate - total variable costs) used by hospitals to determine fiscal viability of services. From 2010 to 2011, 26 Medicare patients underwent HCR at a single United States institution and were compared with 28 randomly selected, contemporaneous Medicare patients undergoing multivessel OPCAB. All HCR patients underwent a robotic-assisted, sternal-sparing, off-pump, left internal mammary artery-LAD anastomosis plus percutaneous intervention to non-LAD vessels. A linear regression model was used to compare fiscal and utilization outcomes of HCR to OPCAB adjusted for hospital length of stay and The Society of Thoracic Surgeons Predicted Risk of Mortality score. Results. On regression analysis controlling for overall length of stay and Predicted Risk of Mortality score, the contribution margin (+$8,771, p < 0.0001) was greater for HCR than for OPCAB. Despite higher total cost for HCR compared with OPCAB (+$7,026, p = 0.001), the total variable cost (+$2,281, p = 0.07) was not significantly different. Best payment estimates (+11,031, p < 0.0001) and Medicare reimbursements (+$8,992, p = 0.002) were higher for HCR than for OPCAB, and there was a reduction in blood transfusion (-1.5 units, p < 0.0001), ventilator time (-10 hours, p = 0.001), and postoperative length of stay (-1.2 days, p = 0.002) for the HCR group. Conclusions. Compared with OPCAB, HCR results in a greater contribution margin for hospitals. This may result from higher reimbursement as well as improved resource utilization postoperatively, which may offset more expensive procedural costs associated with HCR. (C) 2014 by The Society of Thoracic Surgeons",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d0e14df8261239b4ed2396b7859b291",
  "timestamp": "2025-05-15T03:07:31.932927"
}