{
  "id": 4203,
  "title": "Household livelihood diversification and its determinant factors in Robe town and its surrounding hinterlands, Bale zone, southeast Ethiopia",
  "abstract": "Livelihood diversification is a set of activities that households engage in to generate revenue, and sustain life, or maximize financial benefit. This study examined the impact of rural-urban connectivity on household income diversification into farm and non-farm businesses, as well as the underlying driving factors in Robe Town's hinterland, Bale Zone, Southeastern Ethiopia. Structured survey questions, key informant interviews, focus group discussions, and field observations were used to collect quantitative and qualitative data. A total of 260 samples were taken, representing 5% of households in hinterland villages within a 20-kilometre radius. Both multiple linear regression and descriptive statistics were utilized to analyze the data. According to the descriptive statistics, 40% of the 260 households generated income from non-farm sources. The data also showed that most households (84.3%) earned their income from agricultural activities. It was further revealed that income generated from non-farm businesses accounted for 16.3% of the total household income share. The average Simpson Diversity Index (SDI) for household livelihood income source diversification was 0.5087, indicating a modest level of livelihood diversity. In the hinterland, 21.9% of households have less diverse income sources, while 58.5% and 19.6% have moderately and highly diverse income sources, respectively. Landholding size, education level, irrigation use, harvesting of forest products, non-farm activities, Tropical Livestock Unit (TLU), farm commercialization, and rural-urban linkages are statistically significant drivers of farm households' livelihood diversification (P < 0.05). The findings have policy implications; therefore, they call for expanding rural services, rural non-farm businesses, and improved linkages between rural and urban areas to facilitate the development of a portfolio of livelihood activities that sustain life, foster wealth creation, initiate vibrant inclusive socioeconomic development in the region, and ultimately reduce poverty.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d30d55da72fa6bd24ea0e50008166f4",
  "timestamp": "2025-05-15T01:24:51.429808"
}