{
  "id": 312,
  "title": "RETRACTED: Credit Risk Evaluation in Enterprise Financial Management by Using Convolutional Neural Network under the Construction of Smart City (Retracted Article)",
  "abstract": "Smart cities are the forward goals of future cities, and the development of small- and medium-sized enterprises (SMEs) plays a key role in it. To solve the financing difficulties of SMEs, it is necessary to scientifically, objectively, and accurately assess the credit risk of SMEs. Based on the current research and analysis of scholars in related fields, taking corporate financial data as the object, the SMEs' credit risk is assessed through an adaptive and self-learning convolutional neural network (CNN) method. The GoogleNet method is further improved to reconstruct the credit risk evaluation model of SMEs. Finally, the influence of the convolution kernel depth on the accuracy is discussed through the optimization of the structure and the selection of the initial value of the learning rate. The results are verified by using the data in the 2016-2021 SME sector in Shanghai and Shenzhen in the wind database. It can be found that when the learning rate is finally set to 0.4 and the convolution kernel depth is set to 8 and 32 in turn, the evaluation accuracy of the test dataset is the highest, with a total accuracy of 96.8%. Therefore, it is believed that the newly constructed model has higher accuracy and more practical value than the other three typical risk assessment models.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d34603ba76112f1de2dcb59bd4fc6af",
  "timestamp": "2025-05-15T01:49:04.726747"
}