{
  "id": 7097,
  "title": "Factors associated with perceived caregivers' willingness to provide care among older adults with disabilities in China",
  "abstract": "ObjectiveThe aim of this study was to analyze the status quo and associated factors of care recipients' perceptions of caregivers' willingness to provide care among disabled older adults in China. Thus, this study contributes to our understanding of vulnerable older populations who are at a high risk of receiving support from informal caregivers who are unable or unwilling to take the caregiver role. MethodsWe analyzed the cross-sectional data of 3,539 disabled older adults who received informal care at home from the seventh wave of the 2018 Chinese Longitudinal Healthy Longevity Survey (CLHLS). Multiple logistic regression models were used to examine the variables associated with the respondents' perceived caregivers' willingness to care from five aspects: respondents' sociodemographic attributes, health-related data, family endowment, access to health care services and community-based long-term care services (CBLTCS). ResultsThis study found that the majority of disabled older adults (90.9%) had a positive attitude toward their caregivers' willingness to care and the care they received; however, 7.0% of the adults were concerned about their caregivers' ability to handle the care. Moreover, there was a small number of disabled older people (2.1%) who felt that their caregivers were reluctant to care or lacked patience. The results from the multiple logistic regression showed that disabled older adults with socioeconomic disadvantages (living in rural areas, being poor and with no children who frequently visited) or high demand (with severe disabilities or cognitive impairment) were more likely to consider that their caregivers needed respite care. Those adults with anxiety symptoms, a lower amount of care time, poor self-rated financial status and poor accessibility to health care services were more likely to report that their caregivers were reluctant to administer care. ConclusionThis study found that living in rural areas, being poor, with no children who frequently visited, severe disabilities or CI were positively associated the care recipients' perception that caregivers needed respite care. While anxiety symptoms, a lower amount of care time, poor self-rated financial status and poor accessibility to health care services were significantly associated with care recipients' perception of caregivers' reluctance to care. Our findings highlight the awareness of monitoring informal carers' willingness to care or capability to enact caring tasks.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d3f7fa982c2fa21991069514c4858e2",
  "timestamp": "2025-05-15T03:05:03.528547"
}