{
  "id": 2740,
  "title": "Cryptocurrencies: hedging or financialization? behavioral time series analyses",
  "abstract": "This article investigates the time-series properties of cryptocurrency returns and compares them with currency and commodity returns. We perform and analyze the mean reversion, normality, unit root, high and low returns, correlation, Autoregressive Moving Average (ARMA) [2,2], Autoregressive (AR) [5], and long-run components in the Generalized Autoregressive Conditional Heteroskedasticity (GARCH) [1,1] estimates. We also perform regression analyses to evaluate two possible behavioral biases: familiarity and disposition effect. Our time series analysis documents that cryptocurrencies are neither currencies nor commodities. We also show that adding cryptocurrency to a portfolio increases market efficiency and uncertainty. We also document that cryptocurrency investors exhibit the same familiarity and disposition effect biases as commodity and currency investors. Overall, we conclude that investors in cryptocurrencies tend to underestimate risk and misestimate future prices, as they do in commodity and currency markets. This study makes at least three contributions to the literature. First, we evaluate whether cryptocurrencies tend to hedge or financialization. Second, our analysis includes both univariate and portfolio dimensions. Third, this is a pioneering study on using behavioral bias analysis to determine whether a cryptocurrency is a commodity or a currency.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d40c329b37bfcb302c02c285e58fb29",
  "timestamp": "2025-05-15T01:10:16.394018"
}