{
  "id": 6092,
  "title": "Investigating the double-edged sword effect of environmental, social and governance practices on corporate risk-taking in the high-tech industry",
  "abstract": "Research background: Corporate risk-taking (CRT) is crucial to a business's survival and performance and is a driving force for sustainable development. Environmental, social and governance (ESG) practices are critical to firm profits when considering sustainable economic growth; however, they can also be the cause of financial burdens. It is, therefore, crucial to assess the relationship between a company's ESG performance and its risk-taking.Purpose of the article: Considering the controversial results of empirical studies on the rela-tionship between ESG and CRT, this study aims to theoretically and empirically investigate the curvilinear nexus between ESG practices and CRT within Taiwan's high-tech industry.Methods: Ordinary least square regression and quantile regression analysis was applied to investigate the curvilinear ESG-CRT relationship. The empirical studies were conducted in 38 high-tech companies on the Taiwan Stock Exchange that disclosed ESG information between 2005 and 2020, with a total of 437 firm-year observations.Findings & value added: Quantile regression estimation results reveal the ESG-CRT nexus is U-shaped (convex). Both the environmental and social pillar's relationship with CRT is non-linear and U-shaped, whereas the governance pillar has no significant relationship with CRT. Overall, a comprehensive view is provided that shows ESG practices can have a double-edged sword effect on CRT. It is suggested that high-tech companies in Taiwan should avoid ESG practices becoming a tool for managements' self-interest. More information of ESG practices should be disclosed to stakeholders to ensure they are given full credit for the positive impact they have on capital allocation. Regulators guide firms to surpass the threshold of the U-shaped effect and take into consideration the whole benefits of stakeholders when they allo-cate existing resources toward environmental and social endeavors.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d5088a1abef3af26b37c59e06fa240e",
  "timestamp": "2025-05-15T02:54:38.852050"
}