{
  "id": 2376,
  "title": "Can firms with the best training program withstand the storm of economic policy uncertainty?",
  "abstract": "This study examines if firms whose training programs ranked as the best ones in the United States can withstand the changes in economic policy uncertainty. The regression analysis of monthly changes in economic policy uncertainty index, monthly returns on the CRSP value-weighted index, and monthly returns on an equal-weighted portfolio of public firms in the United States ranked consecutively from 2006 to 2011 in the top 50 of the Training Top 125 shows that the increased changes in economic policy uncertainty negatively affect the portfolio returns; however, this effect is not statistically significant at the 1% level. The result from regressing monthly returns on CRSP value-weighted index on the monthly changes of economic policy index yields a statistically significant negative coefficient at the 1% level, and this coefficient is more negative than the coefficient obtained from regressing the monthly portfolio returns on the monthly changes in economic policy uncertainty. This study provides empirical evidence of the ability of firms in the US with the best training program to withstand the storm of economic policy uncertainty better than the whole market. In other words, the findings suggest that firms with the best training program are more prepared than the whole market in responding to the changes in economic policy uncertainty.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d512e6a994562ce710a4eb3b2da9b96",
  "timestamp": "2025-05-15T01:06:10.784998"
}