{
  "id": 4581,
  "title": "Decoding a construction organisation's tendency to litigate: an understanding through financial statements",
  "abstract": "PurposeDespite the availability of amicable means to resolve construction disputes, litigation remains a mainstream dispute resolution process in some countries. This tendency to litigate (TTL) calls for research to develop appropriate precautions to encourage stakeholders to resolve most commercial disputes through alternate dispute resolution (ADR) techniques. While a claimant's TTL arise from the individual, project and organisation preferences, this study, which can benefit both potential claimants and employers by saving time and money on litigation, identifies a bidder's financial parameters that may increase its litigation propensities, as a first step towards aiding employers to incorporate precautions to discourage such tendencies.Design/methodology/approachAfter the literature review, the theoretical construct proposed by Rachlinski's framing theory of litigation (based on Kahneman and Tversky's Prospects Theory) is used to explain organisation-level litigation decision-making. The study sources data from the financial statements of Indian construction/real estate firms, followed by panel regression analysis to test the theoretical construct's validity.FindingsThe results show that the TTL (risk-seeking behaviour) generally increases with a lower value of sales, higher assets and profitability. Interestingly, organisation-level cash flow shows an insignificant influence on litigation tendencies.Practical implicationsKnowing which financial parameters may increase litigation tendencies could help employers evaluate a bidder's propensity to litigate project disputes.Originality/valueResearchers use financial statements to explore correlations among financial variables. However, in the construction context, there are no empirical studies with data from construction firms to understand potential litigation expenses compared to specific financial ratios.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d54b8f75f2d1313c62a7e97d383e384",
  "timestamp": "2025-05-15T02:38:56.309840"
}