{
  "id": 6567,
  "title": "Prevalence and Risk Factors for Medical Debt and Subsequent Changes in Social Determinants of Health in the US",
  "abstract": "IMPORTANCE Cost barriers discourage many US residents from seeking medical care and many who obtain it experience financial hardship. However, little is known about the association between medical debt and social determinants of health (SDOH). OBJECTIVE To determine the prevalence of and risk factors associated with medical debt and the association of medical debt with subsequent changes in the key SDOH of food and housing security. DESIGN, SETTING, AND PARTICIPANTS Cross-sectional analyses using multivariable logistic regression models controlled for demographic, financial, insurance, and health-related factors, and prospective cohort analyses assessing changes over time using the 2018, 2019, and 2020 Surveys of Income and Program Participation. Participants were nationally representative samples of US adults surveyed for 1 to 3 years. EXPOSURES Insurance-related and health-related characteristics as risk factors for medical debt; Newly incurred medical debt as a risk factor for deterioration in SDOHs. MAIN OUTCOMES AND MEASURES Prevalence and amounts of medical debt; 4 SDOHs: inability to pay rent or mortgage or utilities; eviction or foreclosure; and food insecurity. RESULTS Among 51872 adults surveyed regarding 2017, 40 784 regarding 2018 and 43 220 regarding 2019, 51.6% were female, 16.8% Hispanic, 6.0% were non-Hispanic Asian, 11.9% non-Hispanic Black, 62.6% non-Hispanic White, and 2.18% other non-Hispanic. A total of 10.8% (95% CI, 10.6-11.0) of individuals and approximately 18.1% of households carried medical debt. Persons with low and middle incomes had similar rates: 15.3%; (95% CI,14.4-16.2) of uninsured persons had debt, as did 10.5% (95% CI, 10.2-18.8) of the privately-insured. In 2018 the mean medical debt was $21687/debtor (median $2000 [IQR, $597-$5000]). In cross-sectional analyses, hospitalization, disability, and having private high-deductible, Medicare Advantage, or no coverage were risk factors associated with medical indebtedness; residing in a Medicaid-expansion state was protective (2019 odds ratio [OR]. 0.76; 95% CI, 0.70-0.83). Prospective findings were similar, eg, losing insurance coverage between 2017 and 2019 was associated with acquiring medical debt by 2019 (OR, 1.63: 95% CI. 1.23-2.14). as was becoming newly disabled (OR, 2.42; 95% CI, 1.95-3.00) or newly hospitalized (OR. 2.95; 95% CI, 2.40-3.62). Acquiring medical debt between 2017 and 2019 was a risk factor associated with worsening SDOHs, with ORs of 2.20 (95% CI,1.58-3.05) for becoming food insecure; 2.29 (95% CI, 1.73-3.03) for losing ability to pay rent or mortgage; 2.37 (95% CI, 1.75-3.23) for losing ability to pay utilities; and 2.95 (95% CI, 1.38-6.31) for eviction or foreclosure in 2019. CONCLUSIONS AND RELEVANCE In this cross-sectional and cohort study, medical indebtedness was common, even among insured individuals. Acquiring such debt may worsen SDOHs. Expanded and improved health coverage could ameliorate financial distress, and improve housing and food security.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d5f4c0475aa18125e5b23fa134e19bd",
  "timestamp": "2025-05-15T02:59:36.870646"
}