{
  "id": 7878,
  "title": "Late and Persistent Symptoms Suggestive of Surgical Site Infections After Cesarean Section: Results from a Prospective Cohort Study in Rural Rwanda",
  "abstract": "Background: Women in low-resource settings will likely develop late surgical site infections (SSIs), diagnosed after post-operative day (POD) 10. We measured SSI prevalence and predictors of late and persistent SSIs-suggestive symptoms among women who delivered via cesarean section (c-section).Patients and Methods: Women who underwent c-sections at Kirehe District Hospital (KDH) between September 2019 and February 2020 were prospectively enrolled. Data were collected on POD1, POD11, and POD30. Logistic regression identified factors associated with persistent and late SSI symptoms.Results: In total, 808 women were study enrolled. Of these, 646 women physically attended the POD11 clinic visit follow-up, while 671 received the POD30 telephone-based follow-up review. Thirty-three (5.0%) women were diagnosed with an SSI on POD11, and 39 (5.3%) had an SSI diagnosis during POD11 to POD30, giving a cumulative prevalence of 10.3% late SSI rate. Of 671, 400 (59.9%) reported at least one SSI-associated symptom between POD11 and POD30. The reported symptoms included pain (56.6%), fever (19.4%), or incision drainage (16.6%). Of these, 200 women reported still having at least one of these symptoms on POD30. Of the 400 women with late SSI symptoms, 232 (58.0%) did not seek care, and of these, 80 (48.5%), 59 (35.8%), and 15 (8.9%) could not afford transport fare, did not believe symptoms were severe for a medical visit, and were not able to travel, respectively. Lower odds of late SSI-suggestive symptoms were reported among women with health insurance (adjusted odds ratio [aOR], 0.06; p = 0.013), whereas higher late SSI-suggestive symptoms odds were among women with wealthier socioeconomic status (aOR, 2.88; p = 0.004).Conclusions: Women in rural Rwanda are at risk of late and persistent SSI-suggestive symptoms. Financial barriers and the perception that their symptoms were not serious enough for the medical visit need education on early care seeking and interventions to mitigate financial barriers for optimizing perinatal care.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d69cb23ddf161846d67b133a2ba8ab7",
  "timestamp": "2025-05-15T03:13:04.901155"
}