{
  "id": 7282,
  "title": "Pell Grants as Performance-Based Scholarships? An Examination of Satisfactory Academic Progress Requirements in the Nation's Largest Need-Based Aid Program",
  "abstract": "The Federal Pell Grant Program is the nation's largest need-based grant program. While students' initial eligibility for the Pell is based on financial need, renewal is contingent on meeting minimum academic standards similar to those in models of performance-based scholarships, including a grade point average (GPA) requirement and ratio of credits completed compared to those attempted. In this study, we describe federal satisfactory academic progress (SAP) requirements and illustrate the policy's implementation in a statewide community college system. Using state administrative data, we demonstrate that a substantial portion of Pell recipients are at risk for Pell ineligibility due to their failure to meet SAP GPA or credit completion requirements. We then leverage the GPA component of the policy to explore the impacts of failure to meet standards on early college persistence and achievement, earning a credential, and transferring to a 4-year college using two methodological approaches: regression discontinuity (RD) and difference-in-differences (DD). Our results across the two approaches are mixed, with the RD providing null estimates and the DD indicating statistically significant impacts, including a negative effect on early college persistence. We conclude by discussing the implications for future research.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d755cb31ce648193f52d7997ace101d",
  "timestamp": "2025-05-15T03:07:02.608637"
}