{
  "id": 1150,
  "title": "Use of the Naive Bayes algorithm for predicting asset price movement in capital markets",
  "abstract": "The study presented in this paper aimed to analyze the performance of the use of the Naive Bayes machine learning algorithm to predict the movement of the stock prices that make up the Ibovespa Index of the Brazilian capital market (B3 -Brazil, Bolsa, Balcao). To achieve the proposed objective, daily stock price data were collected, with a share of more than 1% in the theoretical portfolio of the Ibovespa Index, and technical indicators were calculated in the period from January 2012 to December 2021. The results showed that the models developed using the Naive Bayes algorithm performed statistically above the market average. Thus, the use of this machine learning algorithm surpasses the average expected return based on past data, questioning the efficiency of these markets in the weak form of the efficient markets hypothesis (HME). The research carried out contributes to the literature of finance and the practice in the capital market about the use of machine learning algorithms (especially, the Naive Bayes) to forecast the movement of the prices of assets listed in the Brazilian market from different perspectives: (i) the study about the prediction of the daily movements of the main assets of Ibovespa; (ii) the evidence that the performances of the different groups of technical indicators used did not present significant differences; and (iii) the questioning of the efficiency of the markets studied in their weak form in a context of ample automation by machine learning algorithms.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d83880b16feb40f7ff8ad581e925c28",
  "timestamp": "2025-05-15T00:52:33.821623"
}