{
  "id": 1573,
  "title": "Banking systemic risk estimating of China's banking industry during the COVID-19 pandemic-based on complex network theory",
  "abstract": "The spread of COVID-19 worldwide has led to significant fluctuations in the global financial market, and the banking industry has also been exposed to the dual impact of the real economy and the financial market. In this paper, Chinese bank networks in different COVID-19 periods were constructed using CoVaR model and least absolute shrinkage and selection operator (LASSO) regression, and the characteristics and risk changes of the proposed bank networks were analyzed based on complex network theory. Additionally, the index of complex network theory was combined with the non-performing loan ratio of banks to build a new index for evaluating and measuring the systemic risk of banks in different periods. It was found that the network density, clustering coefficient and average network strength of banking networks increased during the COVID-19 pandemic, while the level of inter-bank correlation, and the systemic risk of banking networks increased. It was suggested after using the new indicators that joint-stock commercial banks and rural commercial banks were the main risk spillovers in different periods, and the systemic risk of these banks had increased during COVID-19. Therefore, the supervision of joint-stock commercial and rural commercial banks should be strengthened to prevent the risks from spreading to these banks during the COVID-19 pandemic.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d887e8df867304374f410e1ea942a50",
  "timestamp": "2025-05-15T02:05:08.106122"
}