{
  "id": 2216,
  "title": "Asymmetric risk contagion effect of the interaction between the real economy and the financial sector-an analysis based on the domestic commodity price index",
  "abstract": "As the uncertainty of the global economy intensifies, domestic real economy risks and financial risks may interact and worsen under international risk shocks. Commodity prices are an important channel for transmitting international economic and financial risks. Taking January 2007 to July 2021 as the sample period and using data from nine commodity price indices and banking, diversified finance, and insurance industry indices, this article uses rolling regression method to construct different commodity price risk and financial sector risk indicators. Combined with a vector autoregressive model, the risk contagion effect is calculated. The analysis indicates that there exist significant asymmetric risk contagion effects between various commodities (with energy and steel having the largest risk spillover effects) and there are significant net risk spillover effects on financial sectors (with insurance having the largest risk spillover effect). There are asymmetric risk contagion effects among different financial sectors, with varying degrees of risk spillover effects on commodity prices (with the banking sector having the greatest risk spillover effects on commodity prices and other financial sectors, and diversified finance having the greatest risk spillover effect on commodities). During major global financial events, the risk spillover effects of commodities and input effects increase significantly due to the intensification of the risk spillover effects of energy, steel, and nonferrous metals. The risk spillover effect between commodities and the overall risk spillover effect have significantly increased. The financial sector's overall net risk input effect has increased, while the net risk input effect of the insurance sector has also increased. These findings are significant for improving systemic financial risk monitoring indicators and adopting accurate prevention and control measures.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d8f2fbf67c88fb4cbb3faedcb56f12d",
  "timestamp": "2025-05-15T02:12:50.944055"
}