{
  "id": 4724,
  "title": "Islamic religiosity and portfolio allocation: the Malaysian context",
  "abstract": "Purpose - This study aims to investigate the association between Muslim individuals' portfolio allocation choice and Islamic religiosity (levels and dimensions), controlling for risk tolerance and sociodemographic factors. Design/methodology/approach - The study uses primary data collected via survey questionnaires from a sample of 751 Muslim working individuals in Kuala Lumpur, Malaysia. Owing to the ordinal nature of the dependent variable, which reflects the levels of proportions of risky assets in portfolios, the data were analyzed using an ordered probit regression model. Findings - The findings reveal that Islamic religiosity levels in general were insignificantly related to portfolio allocation, but that two dimensions of religiosity (virtue and obligation) significantly impact the allocations of risky assets in the portfolio. The higher the level of virtue, the lower the propensity to allocate risky assets into the portfolio. On the contrary, the higher the level of obligation, the higher the propensity to allocate risky assets in the portfolio. Meanwhile, individuals with higher risk tolerance, income and education levels show greater propensity to allocate risky assets in the portfolio. Research limitations/implications - The sample is restricted to Muslims in Kuala Lumpur; hence, the findings are not easily generalized to Muslim investors in general. Findings may differ between Muslims across the world, so future research needs to expand from a country specific to an international analysis. In addition, future studies could include other determinants of portfolio allocation, such as financial literacy. Practical implications - The findings of this study may assist financial planners and policymakers to better understand the drivers of portfolio allocation among their Muslim clients. Originality/value - While other studies have tended to focus on the impact of religiosity on the holdings of specific financial assets, such as Islamic bank accounts or Takaful, the present study explores the effect of Islamic religiosity dimensions on the allocations of risky assets in the portfolio. The study also develops an ordinal measure of portfolio allocation and makes a methodological contribution by using an ordered probit regression analysis.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d98c8d7911ae7daf7a3ad32edae833e",
  "timestamp": "2025-05-15T02:40:27.903592"
}