{
  "id": 7733,
  "title": "Relaxation of the One Child Policy and Trends in Cesarean Section Rates and Birth Outcomes in China Between 2012 and 2016: Observational Study of Nearly Seven Million Health Facility Births",
  "abstract": "Health care communities around the world have expressed concerns about the health effects of increased cesarean delivery rates. In China, complex factors such as financial incentives and medicolegal concerns have influenced the high cesarean rates. The Chinese government has established several top-down policies such as hands-on training for practitioners, the removal of financial incentives, and patient education to address this rise; however, it is unknown how this has affected overall rates. This observational study examined how the relaxation of the one-child policy in 2013 and policies to reduce cesarean delivery rates might have affected trends over time in cesarean rates as well as perinatal-and pregnancy-related mortality in China. Study authors used a modified version of the Robson classification (8 categories) to sort women into risk groups for cesarean delivery. Using China's National Maternal Near Miss Surveillance System, researchers looked at 6,838,582 births in 438 hospitals between 2012 and 2016. The weighted cesarean delivery rate was 43.5%. Rates were higher in urban areas and in hospitals with 6 or more obstetricians. Rates were lowest among women with few antenatal visits, those with no education, and unmarried women. Rates increased noticeably with maternal age. The relaxation of the one-child policy was associated with an increase in the proportion of multiparous births and births in women with a uterine scar nearly doubled. In addition, cesarean rates declined steadily during the study period, with an 18% change. The decrease was most pronounced in hospitals with the highest rates in 2012, consistent with the government's policy of targeting such hospitals. Of note, perinatal mortality declined from 10.1 to 7.2 per 1000 births. Pregnancy-related mortality did not change. China's success in reversing the rise in cesarean delivery rates is remarkable given that the relaxation of the one-child policy is assumed to have led to an increase in the need for cesarean delivery rates. The authors hypothesize that the knowledge that more women can have a subsequent pregnancy may well leadmore clinicians and women to opt for an initial vaginal delivery. They also note that a variety of policies, including those encouraging the use of financial incentives/ penalties around cesarean delivery targets and using rates of cesarean without medical indication as an indicator, may have had an impact. That said, it is not possible to attribute this change to a single factor or policy. Ultimately, these results suggest that improvement is possible with comprehensive change that addresses systemic factors.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8d9d8171acfde26a44c34d2c422e2115",
  "timestamp": "2025-05-15T03:11:38.508243"
}