{
  "id": 8382,
  "title": "Influence of CEOs' religious affiliations on firms' advertising spending and shareholder value",
  "abstract": "Purpose This study aims to answer two unique related questions on the overarching relationship between a CEO's personal religious affiliation, the firm's advertising spending decision and its shareholder value. First, does the CEO's religious affiliation, a proxy for risk taking, influence the firm's advertising spending decision? Second, does the advertising spending decision mediate the relationship between the CEO's religious affiliation and the firm's shareholder value? Design/methodology/approach This study uses data on the religious affiliations of CEOs of publicly listed US firms, 1992-2014, from Marquis Who's Who; advertising spending and shareholder value from Compustat, and panel data-based regression models including CEO characteristics from ExecuComp, and firm-, industry- and time-based controls. Findings We find higher advertising spending levels for Protestant over Catholic-led firms, and advertising spending mediates the relationship between a CEO's religious affiliation and the firm's shareholder value. Research limitations/implications Marketing theory needs to incorporate the missing but fundamental effect of the CEO's religious affiliation-based values on decisions and outcomes. Practical implications Boards of Directors may need to align the CEO's and their firm's spending goals. Originality/value While previous studies focused on the influence of religious affiliation on consumers' attitudes and behavior, and executives' financial and R&D spending decisions, this study, to the best of the authors' knowledge, is the first to investigate the effect of a CEO's religious affiliation on the firm's advertising spending decision and its shareholder value.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8da323f6c36d1763fa7996b03acd08a4",
  "timestamp": "2025-05-15T03:18:19.565508"
}