{
  "id": 751,
  "title": "The Co-Movement between International and Emerging Stock Markets Using ANN and Stepwise Models: Evidence from Selected Indices",
  "abstract": "In the past two decades, especially after the financial crisis of 2007-09, the literature for examining the availability of integration between the stock exchanges in developed and developing markets has grown. The importance of this topic stems from the significant implications of the linkage between exchange markets on various decisions taken by interested parties, such as policymakers and investors, in the decisions for portfolio diversification. This study examines the relationship between a developing stock exchange index, Amman Stock Exchange Index (ASEI), and the number of international indices, including S&P 500, NASDAQ, Nikkei, DAX, CAC, and HSI for 2008-2019. To validate the availability of the linkage between the indices, the author includes various tests of a correlation coefficient, stepwise regression analysis, and artificial neural network (ANN). Despite the results indicating that the ANN is more efficient than linear regression in investigating the availability of the relationship between ASEI and international indices, stepwise regression and neural network support this relationship. Furthermore, ANN results revealed that the S&P 500 index and year have the most substantial relationship with ASEI. Our research is theoretically and practically important; policymakers and investors can benefit from our findings. Future studies may explore the effect of different international stock market indices on ASEI or other developing markets. Further studies can use macroeconomic factors to build prediction models for stock market indices.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8da4aaf67fd5f8553f3be27c0dc4c092",
  "timestamp": "2025-05-15T00:47:50.288830"
}