{
  "id": 93,
  "title": "Howard's algorithm for high-order approximations of American options under jump-diffusion models",
  "abstract": "Data-driven approaches to price computations of financial options are gaining in importance relative to methods based on numerical solutions of the pricing equations. Comparisons between artificial neural networks and the Black-Scholes pricing model have shown that the machine learning technique compares well in terms of performance with the parametric model. A Bayesian neural network model has recently been employed for predicting the price of options under jump-diffusion models since jump processes have a better capability of fitting market options data. The potential applicability of data-driven models for generating price approximations under jump processes is high, but due to the need of ensuring that computed prices are arbitrage-free, validation by the often employed partial differential equations approach is important. This work proposes a new algorithm that can be used for comparing prices obtained by a learning algorithm for diffusion models with jumps. Two directions are chosen in order to develop a competitive algorithm. The first is employing a higher-order discretisation of the pricing partial integro-differential equation and second using a more efficient numerical procedure for the solution of the resulting linear complementarity problem. Howard's algorithm or policy iteration is one such procedure for the second phase, but application of this method requires that the coefficient matrix is monotone. The combination of high-order approximations for the derivative and integral terms with policy iteration yields an accurate and efficient computational technique, and these properties are illustrated using an extensive set of numerical examples.",
  "year": 2020,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8dafd6a448641e8ab69b29aeb6729f5d",
  "timestamp": "2025-05-15T01:28:03.981917"
}