{
  "id": 3980,
  "title": "How do auditors price financial secrecy culture? An international study",
  "abstract": "PurposeThis research examines the influence of financial secrecy culture on audit fees. Additionally, we investigate the potential moderating effect of adopting International Financial Reporting Standards (IFRS) on the relationship between financial secrecy culture and audit fees.Design/methodology/approachWe use an international dataset comprising 249,217 firm-year observations from 30 countries/regions listed between 1996 and 2022. Our analysis includes regression analysis, the Heckman self-selection bias test, change analysis and various robustness tests.FindingsOur results reveal a significant positive association between audit fees and firms listed in secretive jurisdictions, suggesting that auditors charge higher fees to accommodate additional audit effort or risk premiums. Furthermore, our empirical findings indicate that implementing IFRS in countries/regions with higher levels of secrecy introduces complexities or ambiguities in audit procedures, leading to increased audit fees. These results hold up under rigorous endogeneity tests and remain consistent across alternative measures and tests.Research limitations/implicationsOur findings establish a direct link between financial secrecy and audit fees, demonstrating higher costs for firms with greater secrecy. Additionally, they show that implementing IFRS in secretive jurisdictions intensifies audit complexities, resulting in higher fees. These findings emphasize the critical importance of transparency, regulatory compliance and risk management in financial reporting, with implications for investor confidence and regulatory strategies.Originality/valueThis study contributes to the literature by exploring the previously unexamined relationship between financial secrecy culture and audit fees while also assessing the moderating effect of IFRS adoption. By utilizing a comprehensive international dataset spanning multiple jurisdictions and years, our research provides valuable insights into cross-border variations in audit practices and their broader implications.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8db6cd052fee344d7ebe51c1920224d6",
  "timestamp": "2025-05-15T02:31:58.625775"
}