{
  "id": 401,
  "title": "On the Resiliency of Power and Gas Integration Resources Against Cyber Attacks",
  "abstract": "Integration of power and gas systems has been recently proposed as a portfolio solution to deal with the sporadic availability of renewables and enhance the flexibility of power systems. In an integrated system, where critical operating information and control signals of both systems need to be communicated, the risk of cyber attack is intensified. In this article, we present a new model for the integration of power and gas systems using power-to-gas (PtG) and gas-fired generation (GfG) facilities. We demonstrate how the operation of the integrated system can be adversely impacted during cyber attacks that may not be detected using traditional methods. We propose two new detection schemes for false data injection attacks against the input and output signals of the PtG/GfG facility scheduler. In the first scheme, a supervised machine-learning technique, based on the convolutional neural network and wavelet transforms, is adopted to detect attacks on the information received by the facility scheduler. In the second scheme, a hybrid neural network is developed, based on an unsupervised learning technique, that requires no labeled training information to detect attacks on the output control signals issued by the scheduler. In both schemes, information acquired from local sensors and deterministic estimation methods is utilized for signal evaluation. The proposed schemes are incorporated into the facilities' scheduler to create a cyber-attack resilient scheduling model in an integrated power and gas grid. The efficacy and feasibility of the proposed model are evaluated via numerical studies using the IEEE30-bus power system integrated with the Belgian gas grid as the test bed using historical operating parameters.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8dc42898b9029455fb80ebedcb186619",
  "timestamp": "2025-05-15T00:43:10.495920"
}