{
  "id": 5386,
  "title": "Social Determinants of Health Influence Early Outcomes Following Lumbar Spine Surgery",
  "abstract": "Background: Disparities among social determinants of health (SDoH) can impact overall well-being and surgical outcomes. The purpose of this study was to identify SDoH for patients who underwent lumbar spine surgery and evaluate their relationship to the postoperative outcomes of length of stay (LOS), discharge disposition, and readmissions. Methods: We conducted a retrospective observational study of patients who underwent lumbar spine surgery from July 2017 to January 2021. We used a self-reported SDoHsurvey in conjunction with the electronicmedical record to gather patient information. Multivariate analysis was used to evaluate the relationships between patient demographics, SDoH, and postoperative outcomes. Results: A total of 951 patients underwent lumbar spine surgery: 484 (50.9%) had decompressive laminectomy alone without fusion, and 467 (49.1%) had decompressive laminectomywith instrumented posterolateral fusion. When controlling for age, American Society of Anesthesiologists physical status classification, and surgery type, the SDoH of being currently married or having a life partner was associated with shorter LOS and decreased likelihood of discharge to a skilled nursing facility. Financial strain was associated with longer LOS, while attending church was associated with a decreased likelihood of 30-day emergency department (ED) return. Conclusion: This study identified various SDoH thatmay influence postoperative lumbar spine surgery outcomes of LOS, discharge disposition, 30- day ED return, and 30-day readmission. Patients at risk for suboptimal outcomes appear to be those with lower financial resources, less in-home support, and lower social connectivity. Routine screening of SDoH may enable care teams to effectively allocate resources for at-risk patients.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e135c25e31c294e67bfa27f2a8b669f",
  "timestamp": "2025-05-15T02:47:13.971509"
}