{
  "id": 6954,
  "title": "Mapping the quality of prenatal and postnatal care and demographic differences on child mortality in 26 low to middle-income countries",
  "abstract": "BackgroundClosing the gap between child mortality in low- and middle-income countries (LMICs) and high-income countries is a priority set by the WHO in sustainable development goals (SDGs). We aimed to examine poor nutrition and prenatal and postnatal care that could increase the risk of child mortality in LMICs.MethodsThe Demographic and Health Survey (DHS) was used to examine data from 26 countries to compare prenatal, postnatal, nutritional, and demographic factors across LMICs. Outcome of child death was classified into death before one month of age, between 1 to 11 months, between one to two years, between three to five years, and overall death before five years. Chi-square analyses identified differences in prenatal care, postnatal care, nutrition, and demographic factors between children who died and those who survived. Logistic regression identified factors that increased child mortality risk.ResultsThe majority of deaths occurred before the ages of one month and one year. Considerably poorer quality of prenatal care, postnatal care, and nutrition were found in low-income and low-middle-income countries in the contemporary 2020s. High child mortality and poor quality of prenatal and postnatal care coincide with low income. Children in LMICs were exposed to less vitamin A-rich foods than children in higher-middle-income countries. The use of intestinal parasite drugs and the absence of postpartum maternal vitamin A supplementation significantly increased child mortality risk. Significant socio-demographic risk factors were associated with an increased mortality rate in children, including lack of education, maternal marital status, family wealth index, living rurally, and financial problems hindering access to healthcare.ConclusionsPoor nutrition remains a vital factor across all LMICs, with numerous children being exposed to foods low in iron and vitamin A. Significantly, most deaths occur in neonates and infants, indicating an urgent need to address risk factors associated with early child death.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e1478662278a0baa381815c54ffed91",
  "timestamp": "2025-05-15T03:03:13.528677"
}