{
  "id": 3257,
  "title": "Are there inextricable connections among automobile stocks, crude oil, steel, and the US dollar?",
  "abstract": "According to the International Organization of Motor Vehicle Manufacturers (OICA), Automobile manufacturers use 40% of steel to make the body structure, 23% to make engines and gears, and 12% for suspensions. We untangled the perceived inextricable connections between crude oil, steel, the US dollar, and stocks of Toyota, Daimler, and Volkswagen as the automobile firms with the largest capitalization by using the time series daily data from 1998 to 2023. We used an augmented version of the Diebold and Yilmaz (2012) connectedness approach, which is based on the Time-Varying Parameter Vector Auto-regression (TVP-VAR) approach as introduced by Antonakakis et al. (2020). Findings suggested that Volkswagen, Daimler, and Toyota are more affected by shocks in steel prices than by USD and oil price shocks, with a spillover of 9%, 11.72%, and 8.72% respectively from steel. The next transmitter is USD, which contributes 4.94%, 6.37% and 3.96% of shocks to Volkswagen, Daimler, and Toyota stocks, and the third variable is the oil price shocks, which contributes 4.25%, 5.41% and 3.50% of spillover effects to Volkswagen, Daimler, and Toyota stocks, respectively. This shows the heterogeneous responses of automobile stocks with the highest capitalization and sales to the error variances transmitted from steel, USD as well as oil. Most notably, overall steel is a net transmitter and USD as net receiver in TYP-VAR system for Toyota and Daimler and can therefore be used as a diversifier. Our findings are impactful for the shareholders as well as portfolio managers for risk reduction and efficient portfolio management.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e164b02318402b96a823aa86ea96c37",
  "timestamp": "2025-05-15T01:15:26.085527"
}