{
  "id": 1882,
  "title": "Budgetary Impact of Including the Urinary Genomic Marker Cxbladder Detect in the Evaluation of Microhematuria Patients",
  "abstract": "Introduction:Current AUA guidelines mandate a risk-stratified approach for the evaluation of microhematuria. Urine genomic tests with high negative predictive value could further reduce unnecessary diagnostic testing and morbidity, but the economic impact is unknown. This study modeled the financial impact of Cxbladder Detect on microhematuria evaluations.Methods:A decision tree analysis was constructed by Coreva Scientific comparing 1-year costs of the standard microhematuria evaluation using the AUA guidelines vs an algorithm incorporating Cxbladder Detect. Cxbladder Detect-positive patients had cystoscopy and imaging, whereas patients with negative tests were reevaluated in 6 months. Patients with positive diagnostic testing underwent cystoscopy, and positive cystoscopies led to transurethral resection of bladder tumor. Test performance was based on published literature, and costs were based on Medicare allowable fees.Results:Using the decision tree model, the average savings of using Cxbladder Detect was $559 compared with the standard of care, with an average reduction of 0.38 procedures per patient. Probabilistic analysis showed statistical significance with a median reduction in the total cost of $498 per patient (95% CrI [-1356, -2]) and a significant median reduction in diagnostic procedures per patient of 0.36 (95% CrI [-0.52, -0.16]) without impact on the number of cancers diagnosed.Conclusions:This model-based study demonstrates the potential economic value of using a Cxbladder-driven protocol for microhematuria evaluations.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e2eeac3da5a28d950b0c6f30cc0a398",
  "timestamp": "2025-05-15T02:08:39.026973"
}