{
  "id": 6879,
  "title": "Do investors value GCC firms' social performance?",
  "abstract": "The study examines the influence of Gulf Cooperation Council (GCC) firms' social profile on their stock performance using firms' Beta and stock return. Firms are increasingly finding themselves under pressure to showcase their commitment to issues that concern an increasingly broader spectrum of stakeholders. Despite the rapid economic growth in GCC countries in the last decade, several key differences remain between GCC countries with growing financial markets and Western developed countries with mature governance environments and wider guidance on sustainability reporting. We used CSR strategy scores and ESG disclosure scores as proxies for firms' social performance. Multiple panel regression models are employed to examine the impact of GCC firms' social performance on their market performance. Additionally, we employed the two-staged least squares regression model and the lagged values of CSR strategy score and ESG disclosure score to ensure the robustness of our results. We also interact variables to examine the moderating effect of firm profitability on how ESG disclosures affect firm risk. We find that CSR strategy score has favorable influence on both firms' Beta and stock return in all examined models. However, our results show that ESG disclosure score reduces firm Beta only when the firm achieves relatively high profitability levels. This suggests that market participants perceive ESG spending as a worthwhile project only if the firm is outperforming the market. The unique value of this paper is to shed some light on the role that social performance plays in evaluating and assessing firm risk in GCC given their setting in emerging economies and the challenges they are facing. The paper provides evidence on how the market processes the signaling of ESG disclosures for low and high profitability firms. This discerns how markets navigate asymmetric information around the GCC-listed firms by strategically conveying information relevant to firm's Beta.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e39b8fc0db8334da77b599639b0eb3c",
  "timestamp": "2025-05-15T03:02:41.223515"
}