{
  "id": 7188,
  "title": "Graft Failure Due to Nonadherence among 150 Prospectively-Followed Kidney Transplant Recipients at 18 Years Post-transplant: Our Results and Review of the Literature",
  "abstract": "Background: We previously reported that graft failure due to nonadherence (GFNA) was a major cause of graft loss in kidney transplantation. Here, among 150 prospectively-followed kidney transplant recipients at 18 years post-transplant, we provide: updated (longer-term) estimates of cause-specific graft loss probabilities, risk factors for developing GFNA, and detailed characterizations of patients' overt nonadherent (NA) behavior, including timing, extent, and clinical consequences. Methods: Determination of the patient becoming NA in taking his/her immunosuppressive medications, and the underlying cause of graft loss, were determined prospectively by the attending physicians. For never-functioning-graft, GFNA, GF due to causes other than NA (Other GF), and death with a functioning graft (DWFG), cumulative incidence functions were used to estimate the cumulative probabilities of cause-specific graft loss. Cox stepwise regression was used to determine significant multivariable predictors for the hazard rate of developing GFNA. Results: GFNA was a major cause of graft loss (22/150 patients), particularly among African-American and Hispanic recipients <50 years of age-at-transplant (20/56 experienced GFNA), with estimated percentages of such patients ever developing GFNA ranging between 36.9 and 41.5%. These patients were also at a higher risk of developing Other GF. For the remaining patients (2/94 experienced GFNA), estimated percentages of ever-developing GFNA were much lower (range: 0.0-6.7%). The major cause of graft loss among recipients >= 50 years of age was DWFG; GFNA rarely occurred among older recipients. In 21/22 GFNA patients, NA behavior lasted continuously from the time of developing NA until GFNA. In total, 28/150 patients became NA, and 67.9% (19/28) occurred beyond 36 months post-transplant. A total of 25 of 28 NA patients (89.3%) developed biopsy-proven acute rejection and/or chronic rejection that was directly attributed to the NA behavior. Lastly, 25/28 admitted to NA behavior, with financial and psychological components documented in 71.4% (20/28) and 96.4% (27/28) of NA cases, respectively. Conclusions: These results highlight the importance of performing serial monitoring of patients for overt NA behavior throughout their post-transplant follow-up. Financial and psychological components to NA behavior need to be simultaneously addressed with the goal of achieving complete avoidance/elimination of NA behavior among higher risk patients.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e3966f6e13c33503807b39d82dc76ad",
  "timestamp": "2025-05-15T03:06:01.230654"
}