{
  "id": 7894,
  "title": "Optimal combinations of factors influencing the sustainability of Taiwanese firms",
  "abstract": "Purpose The authors aim to obtain the optimal combinations of factors from institutional environment adaptation mechanisms and internal resources or capabilities that influence the sustainability of a firm. Design/methodology/approach The authors develop a new index, called the sustainability index, based on the stakeholder perspective by employing a corporate credit risk index, an evaluation of a firm's corporate governance, corporate financial performance and firm age. The authors then apply both Ordinary Least Squares (OLS) Regression Analysis and Fuzzy set Qualitative Comparative Analysis (FsQCA) to obtain the optimal models for firms' sustainability. Findings The OLS analysis shows that the variables including financial leverage, slack, innovation capability, manufacturing capability and human capital that have significant influences on the sustainability of firms. Our FsQCA analysis obtains configurations of several solutions for firm sustainability and concludes that the fit of combinations of institutional factors and/or internal resources and capabilities of a firm is related to its sustainability. Research limitations/implications The limitations in our new index include these: first, one may add more key metrics to measure the index; second, the findings do not provide any necessary nor a sufficient condition to get sustainability for sure. The limitations of using multiple regression analysis are that it is not able to reveal the combinations of causal conditions that can lead to the outcome in the real world as well as to the sustainability of a firm in our study. To overcome the limitations, the authors apply fsQCA analysis to identify combinations of causal conditions to a firm's sustainability in our study. Practical implications Introducing the sustainability index enables us to find out all factors influencing the sustainability of a firm. The authors' analysis can be used to identify combinations of causal conditions to lead to outcomes in the real world. Their analysis enables managers to know how to predict the sustainability of the firm. For example, the authors' fsQCA analysis shows that low marketing capability will lead to the high sustainability of the firm. This information helps managers to make the decision or plan to achieve good results toward their businesses and get better allocate their resources and get a better investment. Social implications The authors' analysis can be used to identify combinations of causal conditions to lead to outcomes in the real world and enable managers to know how to predict the sustainability of the firm. A correct prediction can assist companies in developing their future operations, which would enhance their competitiveness vis-a-vis rivals during this time of global economic volatility, which, in turn, enables firms to perform better and employ more employees that could help the entire society. Originality/value The sustainability index the authors developed in our paper is new in the literature and the findings obtained by both OLS Regression Analysis and FsQCA are new in predicting a firm's sustainability. The authors' findings are useful for academics, managers and policymakers in predicting and maintaining a firm's sustainability.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e3c33e3427b3dbc0f1568b072c9842a",
  "timestamp": "2025-05-15T03:13:04.947086"
}