{
  "id": 586,
  "title": "The four principles of enduring success",
  "abstract": "When your company is doing well, and money is pouring in, how do you know if it could be doing better? How can you tell which management practices are making the difference -and which are merely not doing obvious harm? To find out, Professor Stadler and a team at Innsbruck University's business school conducted a massive benchmarking study comparing nine pairs of European companies over 50 years. Each pair was from the same industry (and, preferably, the same country) and included one exceptional performer and one less impressive, but solid performer. The project yielded four main findings, which Stadler calls the four principles of enduring success: Exploit before you explore. Great companies don't innovate their way to growth-they grow by efficiently exploiting the fullest potential of existing innovations. Diversify your business portfolio. Good companies, conscious of the dangers of irrational conglomeration, tend to stick to their knitting. But the great companies know when to diversify, and they remain resilient by maintaining a wide range of suppliers and a broad base of customers. Remember your mistakes. Good companies tell stories of success, but great companies also tell stories of past failures to avoid repeating them. Be conservative about change. Great companies very seldom make radical changes-and take great care in their planning and implementation. How much difference do these principles make? An investment of $1 in 1953 in the group of companies in the study that consistently applied them-insurers Allianz, Legal & General, and Munich Re; financial services firm HSBC; building materials maker Lafarge; high-tech firms Nokia and Siemens; oil giant Shell; and pharmaceutical firm GlaxoSmithKline-would be worth $4,077 today. A $1 investment in the comparison companies-Aachener und Munchener, Prudential Limited, and Cologne Re; Standard Chartered; Ciments Frangais; Ericsson and AEG; BP; and Wellcome-would have yielded $713.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e3c1643fcb4a2f5c6a3a6706bb905d1",
  "timestamp": "2025-05-15T00:37:38.199839"
}