{
  "id": 7648,
  "title": "Geopolitical Tensions, Policy Uncertainties, and Human Misery in Developing Countries: Exploring Sustainable Development Paths in 17 Emerging Economies",
  "abstract": "Geopolitical tensions and policy uncertainties tend to accentuate human misery. However, empirical accounts of their underlying nexus are scant in the literature, limiting the policy options for sustainable development. To circumvent this drawback, we verified the influence of geopolitical risks (GPR) and economic policy uncertainties (EPU) on poverty and income distributions in 17 emerging economies from 2010 to 2021. The estimates of the novel smoothed instrumental-variable quantile regression unveiled the following empirical insights. GPR and EPU are strong determinants of human miseries in these emerging economies. While GPR had more profound effects on the income disparities, EPU influenced poverty more profoundly. Thus, policymakers should focus more on GPR to reduce the income inequalities, while EPU should be the focal point for poverty reductions. The prevailing quality of institutions and financial inclusiveness in these countries failed to engender substantial reductions in human miseries. Remarkably, human capacity building and the availability of ICT infrastructures reduced human miseries substantially. Therefore, we emphasize articulating country-specific countercyclical policy guidelines capable of insulating the macroeconomic spaces from global risk factors like GPR and EPU. Besides, the roles of strong institutions, human capacity building, inclusive finance, and ICT infrastructure cannot be overemphasized. By implementing these policy guidelines, human miseries would be eliminated for overall welfare optimization.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e3dcb461231bf10472845ba7b79db09",
  "timestamp": "2025-05-15T03:10:33.087918"
}