{
  "id": 2510,
  "title": "Optimizing Cryptocurrency Returns: A Quantitative Study on Factor-Based Investing",
  "abstract": "This study explores cryptocurrency investment strategies by adapting the robust framework of factor investing, traditionally applied in equity markets, to the distinctive landscape of cryptocurrency assets. It conducts an in-depth examination of 31 prominent cryptocurrencies from December 2017 to December 2023, employing the Fama-MacBeth regression method and portfolio regressions to assess the predictive capabilities of market, size, value, and momentum factors, adjusted for the unique characteristics of the cryptocurrency market. These characteristics include high volatility and continuous trading, which differ markedly from those of traditional financial markets. To address the challenges posed by the perpetual operation of cryptocurrency trading, this study introduces an innovative rebalancing strategy that involves weekly adjustments to accommodate the market's constant fluctuations. Additionally, to mitigate issues like autocorrelation and heteroskedasticity in financial time series data, this research applies the Newey-West standard error approach, enhancing the robustness of regression analyses. The empirical results highlight the significant predictive power of momentum and value factors in forecasting cryptocurrency returns, underscoring the importance of tailoring conventional investment frameworks to the cryptocurrency context. This study not only investigates the applicability of factor investing in the rapidly evolving cryptocurrency market, but also enriches the financial literature by demonstrating the effectiveness of combining Fama-MacBeth cross-sectional analysis with portfolio regressions, supported by Newey-West standard errors, in mastering the complexities of digital asset investments.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e501260b55397eb4001fcac1389085f",
  "timestamp": "2025-05-15T01:07:35.712800"
}