{
  "id": 372,
  "title": "RETRACTED: Quantitative analysis of portfolio based on optimized BP neural network (Retracted article. See vol. 56, pg. 264, 2019)",
  "abstract": "The securities market is a high risk and high return investment market. Investors are pursuing the goal of getting higher returns and reducing risks. This involves two basic issues: one is to choose which securities (to predict the stock price); and the two is how to allocate the portfolio to reduce the risk (prediction accuracy). On the basis of the traditional and innovation theory, the advanced technical methods have been fully realized on the basis of the traditional and innovation theory, based on the two problems mentioned above. Cluster. Traditional statistical techniques have great limitations in dealing with nonlinear data, and stock market data are nonlinear. Artificial neural network has proved its ability to analyze nonlinear time series data. Stock price forecasting is an important field in today's research. Different types of models have been implemented in this field. The two technologies include the ARMA model and the neural network. In this work, the ARMA model, together with two types of neural networks (back propagation) and multilayer perceptron (MLP), has been used. In addition, the two neural networks are combined with the ARMA model (alone) to produce the best prediction price. The two indicators used for forecasting are Dow Jones Jones Industrial Average Index (DJI) and Saudi stock exchange TATA-WUL (TASI). The 800 values are used to predict the next 200 values. It is found that for such a large number of forecasts, MLP produces the best results, and the results are significantly improved when combined with ARMA prediction. (C) 2018 Elsevier B.V. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e5f719915c4098834b2695adac7728d",
  "timestamp": "2025-05-15T00:42:32.557047"
}