{
  "id": 4096,
  "title": "Socioeconomic status, loneliness, and depression among older adults: a cross-sectional study in Spain",
  "abstract": "Background The association between socioeconomic status and depression is weaker in older adults than in younger populations. Loneliness may play a significant role in this relationship, explaining (at least partially) the attenuation of the social gradient in depression. The current study examined the relationship between socioeconomic status and depression and whether the association was affected by loneliness. Methods A cross-sectional design involving dwelling and nursing homes residents was used. A total of 887 Spanish residents aged over 64 years took part in the study. Measures of Depression (GDS-5 Scale), Loneliness (De Jong-Gierveld Loneliness Scale), Socioeconomic Status (Education and Economic Hardship), and sociodemographic parameters were used. The study employed bivariate association tests (chi-square and Pearson's r) and logistic regression analyses. Results The percentage of participants at risk of suffering depression was significantly higher among those who had not completed primary education (45.5%) and significantly lower among those with university qualifications (16.4%) (X2 = 40.25;p <.001), and respondents who could not make ends meet in financial terms faced a higher risk of depression (X2 = 23.62;p <.001). In terms of the respondents who experienced loneliness, 57.5% were at risk of depression, compared to 19% of those who did not report loneliness (X2 = 120.04;p <.001). The logistic regression analyses showed that having university qualifications meant a 47% reduction in the risk of depression. This risk was 86% higher among respondents experiencing financial difficulties. However, when scores for the loneliness measure were incorporated, the coefficients relating to education and economic hardships ceased to be significant or were significantly reduced. Conclusion Loneliness can contribute to explaining the role played by socioeconomic inequalities in depression among older adults.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e75eca0aab78ce010a9ac8c69079425",
  "timestamp": "2025-05-15T02:33:03.483681"
}