{
  "id": 3674,
  "title": "Dynamics between currency and equity in Chinese markets",
  "abstract": "Purpose - This study aims to examine the dynamics between exchange rate and equities contextualizing the current liberal currency regime in China. This investigation also extends the analysis to explore the potential important factors influencing the interactions between these two markets. After exchange rate reforms, currency issue has emerged as a new dimension in portfolio decisions and diversification strategies in Chinese equity markets. Design/methodology/approach - This research uses the dynamic conditional correlation generalized autoregressive conditional heteroskedasticity model proposed by Engle (2002) to explore the dynamic interactions between the currency and stock markets. Further, the paper uses regression analysis to explore the explanatory channels of the correlation. The sample comprises 1,265 listed companies over the period 2005-2012 with daily, weekly and monthly observations. To make analysis robust, the study also considers different exchange rates and equities belonging to different industries. Findings - The findings suggest that exchange rate and stock price are related negatively. This conduit increases during the financial crisis period. This association is more prominent at monthly frequency than that of daily and weekly frequencies, which may refer to the noise factor in the high-frequency data. For a portfolio diversification point of view, currency may be considered an alternative diversifier against equity in China. The results also suggest a weak influence of market forces on the association between the currency and stock markets. Originality/value - Much of the related past research is based on co-integration approaches and limited to the relationship between currency and equity markets without exploring the determining channels of this important connection. This study uses a more suitable approach to examine the topic and also investigates the determinants. Besides, previous studies take index data which may be poor to depict the overall market outlook. This paper proceeds with firm-level data which are more appropriate to expose the overall market outlook and investor behavior. This research also draws valuable implications.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e767059c8956775ffe120415457944e",
  "timestamp": "2025-05-15T01:19:26.240978"
}