{
  "id": 5383,
  "title": "The role of refundable accommodation deposits in financing aged care capital expenditure: Views from the sector",
  "abstract": "Residential aged care providers rely on refundable accommodation deposits (RADs) to finance capital expenditure, but changing consumer accommodation payment preferences may reduce their access. Our study evaluated the potential impact of a significant reduction in provider RAD balances. We surveyed 300 providers across Australia in 2020 and conducted focus groups and interviews with stakeholder executives, to develop key themes using an inductive constant comparative method couched within grounded theory. We found preferences for RADs vary across providers, with those seeking to undertake capital expenditure mostly preferring RADs. Stakeholder views suggested RADs facilitate low cost capital investment for some providers and allow banks to offer more debt to more providers. However, stakeholders suggested RADs may also create a more volatile financial structure and impose barriers to entry for equity. Stakeholders suggested a significant and sustained reduction in RADs would negatively impact capital expenditure and increase provider financial risk. Our study proposes that government intervention to stop a significant reduction in provider RAD balances should only occur if access to care is threatened. Intervention options could include enforcing liquidity and capital adequacy requirements, increasing investor returns to attract more equity and facilitate more commercial debt and establishing a government backed accommodation capital facility.JEL Classification: D14, G41, G51, G53, I18",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e8ac2ff542ee45073d69309714a5cc3",
  "timestamp": "2025-05-15T02:47:13.952423"
}