{
  "id": 8049,
  "title": "Escalation of mortality and resource utilization in emergency general surgery transfer patients",
  "abstract": "BACKGROUND Emergency general surgery (EGS) patients require greater resources and have increased rates of morbidity and mortality. Previous work has shown mortality differences in colectomy patients between direct admissions and transfers patients based on source, including emergency department, inpatient, and nursing home transfers. We hypothesize that patient transfer status negatively effects morbidity, mortality, and resource utilization in a mixed population of EGS patients. METHODS Data were obtained for patients undergoing EGS using public files from the American College of Surgeons National Surgery Quality Improvement Program for the years 2014 through 2016. We analyzed risk factors and 30-day outcomes by transfer status on frequently performed procedures using chi(2) analysis and multivariable logistic regression. Significance was set at p < 0.001 for the bivariate analyses and p < 0.05 for the multivariable analyses. RESULTS A total of 167,636 procedures were identified. Transferred patients had increased clinical risk, operative complexity, and poorer outcomes. Fewer transfers were initiated for less technically sophisticated cases such as laparoscopic appendectomy and cholecystectomy, whereas more complex acute open cases were more often transferred. Transfer patients required longer operations and more transfusions and experienced more complications likely to require an intensive care unit stay. Transfer patients returned to the operating room more often, had higher rates of readmission, and greater 30-day mortality. These effects remained after adjusting for procedure group, secondary procedures, age, sex, and American Society of Anesthesiologists class. CONCLUSION Our study demonstrates significant increases in mortality, morbidity, and resource utilization in EGS transfer patients who were not attributable to case mix, demographics, and comorbid status alone. These data point to potential financial and quality assessment challenges for tertiary referral centers. Copyright (c) 2019 Wolters Kluwer Health, Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e8a63b575ac989d74a5593a464f8982",
  "timestamp": "2025-05-15T03:14:37.395894"
}