{
  "id": 4343,
  "title": "Palivizumab for immunoprophylaxis of respiratory syncytial virus (RSV) bronchiolitis in high-risk infants and young children: a systematic review and additional economic modelling of subgroup analyses",
  "abstract": "Background: Respiratory syncytial virus (RSV) is a seasonal infectious disease, with epidemics occurring annually from October to March in the UK. It is a very common infection in infants and young children and can lead to hospitalisation, particularly in those who are premature or who have chronic lung disease (CLD) or congenital heart disease (CHD). Palivizumab (Synagis (R), MedImmune) is a monoclonal antibody designed to provide passive immunity against RSV and thereby prevent or reduce the severity of RSV infection. It is licensed for the prevention of serious lower respiratory tract infection caused by RSV in children at high risk. While it is recognised that a policy of using palivizumab for all children who meet the licensed indication does not meet conventicnal UK standards of cost-effectiveness, most clinicians feel that its use is justified in some children. Objectives: To use systematic review evidence to estimate the cost-effectiveness of immunoprophylaxis of RSV using palivizumab in different subgroups of children with or without CLD or CHD who are at high risk of serious morbidity from RSV infection. Data sources: A systematic review of the literature and an economic evalutaion was carried out. The bibliographic databases included the Cochrane Library [Cochrane Central Register of Controlled Trials (CENTRAL), Cochrane Database of Systematic Reviews (CDSR), Database of Abstracts of Reviews of Effects (DARE) and Health Technology Assessment (HTA)] and five other databases, from inception to 2009. Research registries of ongoing trials including Current Controlled Trials metaRegister, Clinical Trials.gov and the National Institute for Health Research Clinical Research Network Portfolio were also searched. Review methods: Searches were conducted for prognostic and hospitalisation studies covering 1950-2009 (the original report searches conducted in 2007 covering the period 1950-2007 were rerun in August 2009 to cover the period 2007-9) and the database of all references from the original report was sifted to find any relevant studies that may have been missed. The risk factors identified from the systematic review of included studies were analysed and synthesised using STATA. The base-case decision tree model developed in the original HTA journal publication [Health Technol Assess 2008;12(36)] was used to derive the cost-effectiveness of immunoprophylaxis of RSV using palivizumab in different subgroups of pre-term infants and young children who are at high risk of serious morbidity from RSV infection. Cost-effective spectra of prophylaxis with palivizumab compared with no prophylaxis for children without CLD/CHD, children with CLD, children with acyanotic CHD and children with cyanotic CHD were derived. Results: Thirteen studies were included in this analysis. Analysis of 16,128 subgroups showed that prophylaxis with palivizumab may be cost-effective [at a willingness-to-pay threshold of 30,000/quality-adjusted life-year (QALY)] for some subgroups. For example, for children without CLD or CHD, the cost-effective subgroups included children under 6 weeks old at the start of the RSV season who had at least two other risk factors that were considered in this report and were born at 24 weeks gestational age (GA) or less, but did not include children who were > 9 months old at the start of the RSV season or had a GA of > 32 weeks. For children with CLD, the cost-effective subgroups included children < 6 months old at the start of the RSV season who were born at 28 weeks GA or less, but did not include children who were > 21 months old at the start of the RSV season. For. children with acyanotic CHD, the cost-effective subgroups included children < 6 months old at the start of the RSV season who were born at 24 weeks GA or less, but did not include children who were > 21 months old at the start of the RSV season. For children with cyanotic CHD, the cost-effective subgroups included children < 6 weeks old at the start of the RSV season who were born at 24 weeks GA or less, but did not include children who were > 12 months old at the start of the RSV season. Limitations: The poor quality of the studies feeding numerical results into this analysis means that the true cost-effectiveness may vary considerably from that estimated here. There is a risk that the relatively high mathematical precision of the point estimates of cost-effectiveness may be quite inaccurate because of poor-quality inputs. Conclusions: Prophylaxis with palivizumab does not represent good value for money based on the current UK incremental cost-effectiveness ratio threshold of 30,000 pound/QALY when used unselectively in children without CLD/CHD or children with OLD or CHD. This subgroup analysis showed that prophylaxis with palivizumab may be cost-effective (at a willingness-to-pay threshold of 30,000/QALY) for some subgroups. In summary, the cost-effective subgroups for children who had no OLD or CHD must contain at least two other risk factors apart from GA and birth age. The cost-effective subgroups for children who had OLD or CHD do not necessarily need to have any other risk factors. Future research should be directed towards conducting much larger, better powered and better reported studies to derive better estimates of the risk factor effect sizes.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e8f510b314d36ede02afc166d03e3c0",
  "timestamp": "2025-05-15T01:26:26.180142"
}