{
  "id": 835,
  "title": "Investigating barriers & facilitators for the successful implementation of the BP@home initiative in London: Primary care perspectives",
  "abstract": "Background The COVID-19 pandemic led to the implementation of a national policy of shielding to safeguard clinically vulnerable patients. To ensure consistent care for high-risk patients with hypertension, NHS England introduced the BP@home initiative to enable patients to self-monitor their blood pressure by providing them with blood pressure monitors. This study aimed to identify barriers and facilitators to the implementation of the initiative based on the experience and perspectives of programme managers and healthcare professionals (HCPs) involved in its implementation in London.Methods and findings We conducted five semi-structured focus groups and one individual interview with a total of 20 healthcare professionals involved at different levels and stages in the BP@home initiative across four of the five London Integrated Care Systems (ICSs). All focus groups and interviews were audio-recorded, transcribed and analysed thematically following the Framework Method. Respondents reported being challenged by the lack of adequate IT, human and financial resources to support the substantial additional workload associated with the programme. These issues resulted in and reinforced the differential engagement capacities of PCNs, practices and patients, thus raising equity concerns among respondents. However respondents also identified several facilitators, including the integration of the eligibility criteria into the electronic health record (EHR), especially when combined with the adoption of practice-specific, pragmatic and opportunistic approaches to the onboarding of patients. Respondents also recommended the provision of blood pressure monitors (BPMs) on prescription, additional funding and training based on needs assessment, the incorporation of BP@home into daily practice and simplification of IT tools, and finally the adoption of a person-centred care approach. Contextualised using the second iteration of the Consolidated Framework for Implementation Research (CFIR), these findings support key evidence-based recommendations to help streamline the implementation of the BP@home initiative in London's primary care setting.Conclusions Programs such as BP@Home are likely to become more common in primary care. To successfully support HCPs' aim to care for their hypertensive patients, their implementation must be accompanied by additional financial, human and training resources, as well as supported task-shifting for capacity building. Future studies should explore the perspectives of HCPs based in other parts of the UK as well as patients' experiences with remote monitoring of blood pressure.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8e956de5c7e9706132153913c15057fc",
  "timestamp": "2025-05-15T01:43:20.590541"
}