{
  "id": 7557,
  "title": "Predictors of psychological distress and sleep deprivation in caregivers of stroke survivors",
  "abstract": "Background: Caregivers for stroke survivors (CSS) suffer from long hours of care, limited support, and financial difficulties, which often affect their mental health. Objectives: This study sought to determine the factors affecting psychological distress and sleep duration among CSS. Methods: We analyzed cross-sectional data from the 2013 Comprehensive Survey of the Living Conditions for Stroke Survivors and CSS. Linked data from 841 pairs of stroke survivors and CSS were extracted. Kessler's Psychological Distress scale (K6) was used to evaluate psychological distress. CSS who slept less than 5 hours per day were classified as having short sleep duration. Factors predictive of psychological distress and short sleep duration were evaluated using multivariable logistic regression analysis with the forward selection method. Results: The mean (SD) age of the CSS was 65.4 (12.5) years. A total of 5.6% of these caregivers presented with serious psychological distress, and 12.0% were sleep deprived. Serious psychological distress was associated with not having someone to consult with, having subjective symptoms within a few days, and having short sleep duration, while having their own houses reduced the risk of serious psychological distress. Furthermore, short sleep duration was associated with stroke survivors in long-term care levels 4 or 5, not having someone to consult with, participation in sponge baths as part of nursing care activities, and having serious psychological distress. Conclusions: This nationwide survey identified several risk factors for psychological stress and sleep deprivation among CSS and suggests the need for multidimensional approaches to reduce their distress. (c) 2022 Elsevier Inc. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ea82fd2488cdd9fc72e37ad020b36e4",
  "timestamp": "2025-05-15T03:09:36.979765"
}