{
  "id": 8588,
  "title": "Initial Management of Acute Primary Angle Closure A Randomized Trial Comparing Phacoemulsification with Laser Peripheral Iridotomy",
  "abstract": "Purpose: To compare the 2-year efficacy of phacoemulsification and intraocular lens implant (phaco/IOL) with laser peripheral iridotomy (LPI) in the early management of acute primary angle closure (APAC) and coexisting cataract. Design: Randomized, controlled trial. Participants: We included 37 subjects presenting with APAC who had responded to medical treatment such that intraocular pressure (IOP) was <= 30 mmHg within 24 hours, and had cataract with visual acuity of <= 6/15. Main Outcome Measures: The primary outcome measure was failure of IOP control defined as IOP between 22 to 24 mmHg on 2 occasions (readings taken within 1 month of each other) or IOP >= 25 mmHg on 1 occasion, either occurring after week 3. Secondary outcome measures were complications, degree of angle opening, amount of peripheral anterior synechiae, visual acuity, and corneal endothelial cell count (CECC). Methods: Subjects were randomized to receive either LPI or phaco/IOL in the affected eye within 1 week of presentation and were examined at fixed intervals over 24 months. Patients underwent a standardized examination that included Goldmann applanation tonometry, gonioscopy, and CECC measurements. Logistic regression was used to estimate the effect of treatment on failure of IOP control. Time to failure was evaluated using the Kaplan-Meier technique and Cox regression was used to estimate the relative risk of failure. Results: There were 18 patients randomized to LPI and 19 to phaco/IOL. The average age of subjects was 66.0 +/- 9.0 years and mean IOP after medical treatment was 14.5 +/- 6.9 mmHg. The 2-year cumulative survival was 61.1% and 89.5% for the LPI and phaco/IOL groups, respectively (P = 0.034). There was no change in CECC for either group from baseline to month 6. There was 1 postoperative complication in the phaco/IOL group compared with 4 in the LPI group (P = 0.180). Conclusions: Performed within 1 week in patients with APAC and coexisting cataract, phaco/IOL resulted in lower rate of IOP failure at 2 years compared with LPI. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2012;119:2274-2281 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8eaf1d15a40f2f59e09f76f001c82bec",
  "timestamp": "2025-05-15T03:20:22.245534"
}