{
  "id": 8440,
  "title": "Relations Between Proximal and Distal Predictors of Suicide Risk Among College Students",
  "abstract": "Objective: The rates of suicide and prevalence of mental health and behavioral problems have been increasing among adolescents and young adults in the United States over the past two decades. This study examines underlying distal and mediating proximal factors leading to suicide attempts during the sensitive transition period of emerging adulthood. Method: We conducted bivariate, multivariate, and mediation regression analyses of 5 years of data from a large national student survey to first identify and then decompose relationships between past-year suicide attempt into distal and proximal associations, controlling for a range of personal and sociodemographic respondent characteristics. Results: Of 372,000 college students surveyed, 4,292 (1.2%) reported having attempted suicide during the past year. Mediation by proximal, precipitating factors accounted for percentages of the total distal factors as follows: history of diagnosed mental health disorder (20.1%), history of diagnosed alcohol use disorder (25.7%), history of physical abuse (73.9%), financial distress experienced during childhood (40.2%) and having a disability (23.4%). Recent depression severity and recent sexual assault victimization accounted for >= 40% of the total indirect association of each distal factor. Mediation of diagnosed mental health disorder and diagnosed alcohol use disorder were attributed primarily to conceptually related proximal factors. Conclusions: Information regarding dynamic relationships between distal and proximal risk factors may inform integrated clinical and comprehensive campus suicide prevention strategies to mitigate the life-threatening consequences of mental health disorders, alcohol and drug misuse, and stressful life experiences during emerging adulthood.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8eb4a28870066704aea9c0f2622f360b",
  "timestamp": "2025-05-15T03:18:51.626913"
}