{
  "id": 2401,
  "title": "Combination of Multifactor APT Model and CAPM: An Empirical Analysis of the Prague Stock Exchange",
  "abstract": "The goal of the paper is to investigate possibilities of utilizing multi factor APT models in constructing portfolios of securities under circumstances of Czech capital market. Authors are focusing on using several econometrical models like multifactor regression, regression including lags of explaining variables, Cochran Orcutts procedure with and without lags of explanatory variables, ARDL models and sequential F-tests for identifying factors that are crucial for explaining development of Czech market represented by index of Prague Stock Exchange. These factors are tested, evaluated and consequently applied to explain the variability of selected shares listed on the PSE. These models are created in three versions depending on different market indices. For these analysis have been chosen indices DAX, DJSTXE and WIX. Using sensitivities of companies' shares on the selected factors, their betas are investigated. Multifactor model is transformed into one factor CAPM model. Weights of shares in optimal portfolio are calculated using cut-off method. However Czech market is not old enough to perfectly perform such analysis, many helpful findings can be found in this paper, which may lead to better understanding of behavior of prices in PSE. Validity of models is confirmed by rather accurate predictions of portfolio value development.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ec7cbe2cd6de0d7b4f48114a8e458e7",
  "timestamp": "2025-05-15T01:06:38.041420"
}