{
  "id": 4202,
  "title": "Detecting relevant changes in time series models",
  "abstract": "Most of the literature on change point analysis by means of hypothesis testing considers hypotheses of the formH0 :theta(1=)theta(2) versus H-1 :theta(1)not equal theta(2) where theta(1) and theta(2) denote parameters of the process before and after a change point. The paper takes a different perspective and investigates the null hypotheses of no relevant changes, i. e. H-0 : parallel to theta(1) - theta(2)parallel to <=Delta, where parallel to parallel to is an appropriate norm. This formulation of the testing problem is motivated by the fact that in many applications a modification of the statistical analysis might not be necessary, if the difference between the parameters before and after the change point is small. A general approach to problems of this type is developed which is based on the cumulative sum principle. For the asymptotic analysis weak convergence of the sequential empirical process must be established under the alternative of non- stationarity, and it is shown that the resulting test statistic is asymptotically normally distributed. The results can also be used to establish similarity of the parameters, i. e. H-1 : parallel to theta(1) - theta(2)parallel to <= Delta at a controlled type 1 error and to estimate the magnitude parallel to theta(1) - theta(2) parallel to of the change with a corresponding confidence interval. Several applications of the methodology are given including tests for relevant changes in the mean, variance, parameter in a linear regression model and distribution function among others. The finite sample properties of the new tests are investigated by means of a simulation study and illustrated by analysing a data example from portfolio management.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ec866ae9b5e4f5dc7c83ef39f21d3cb",
  "timestamp": "2025-05-15T01:24:51.427350"
}