{
  "id": 2293,
  "title": "RETRACTED: Fuzzy Decision-Making Analysis of Quantitative Stock Selection in VR Industry Based on Random Forest Model (Retracted Article)",
  "abstract": "Since Professor L.A. Zadeh published Fuzzy Set Theory in the 1960s, the theory of fuzzy mathematics has been formally established and developed and has been gradually introduced into work in all walks of life. At the same time, fuzzy mathematics theory has also been widely used in VR industry selection. In the stock strategy, the advantages of improving unit classification accuracy, screening high-quality stocks, and constructing near-perfect investment portfolios continue to emerge. On the other hand, with the increasing maturity and continuous development of China's computer and Internet technologies, the VR industry has gained a new round of development space, and its own investment value and the investable space between related industries have been gradually tapped. Different from the analysis of quantitative stock selection by constructing a logistics multifactor stock selection model in the existing research, the research mainly adopts the random forest algorithm based on fuzzy mathematics to construct the initial investment strategy portfolio. Secondly, different from the single effective frontier algorithm, the research is based on the random forest algorithm, calculates the average AUC of the index, and continuously checks and tests the results to obtain the optimal investment portfolio. Finally, select appropriate risk indicators and performance indicators to evaluate the performance of the strategy portfolio. The study concludes that the portfolios selected by the random forest model are highly investable and have good stability.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ecb087b96d9cc86b0e8a9107742cd3f",
  "timestamp": "2025-05-15T01:05:39.583435"
}