{
  "id": 3559,
  "title": "Third- and fourth-degree perineal tears among primiparous women in England between 2000 and 2012: time trends and risk factors",
  "abstract": "ObjectiveTo describe the trends of severe perineal tears in England and to investigate to what extent the changes in related risk factors could explain the observed trends. DesignA retrospective cohort study of singleton deliveries from a national administrative database. SettingThe English National Health Service between 1 April 2000 and 31 March 2012. PopulationA cohort of 1 035 253 primiparous women who had a singleton, term, cephalic, vaginal birth. MethodsMultivariable logistic regression was used to estimate the impact of financial year of birth (labelled by starting year), adjusting for major risk factors. Main outcome measureThe rate of third-degree (anal sphincter is torn) or fourth-degree (anal sphincter as well as rectal mucosa are torn) perineal tears. ResultsThe rate of reported third- or fourth-degree perineal tears tripled from 1.8 to 5.9% during the study period. The rate of episiotomy varied between 30 and 36%. An increasing proportion of ventouse deliveries (from 67.8 to 78.6%) and non-instrumental deliveries (from 15.1 to 19.1%) were assisted by an episiotomy. A higher risk of third- or fourth-degree perineal tears was associated with a maternal age above 25years, instrumental delivery (forceps and ventouse), especially without episiotomy, Asian ethnicity, a more affluent socio-economic status, higher birthweight, and shoulder dystocia. ConclusionsChanges in major risk factors are unlikely explanations for the observed increase in the rate of third- or fourth-degree tears. The improved recognition of tears following the implementation of a standardised classification of perineal tears is the most likely explanation.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8edf2fa36b04eb6626b0af310a8a0f7f",
  "timestamp": "2025-05-15T02:27:19.141302"
}