{
  "id": 5074,
  "title": "Reducing agate dust exposure in Khambhat, India: Protective practices, barriers, and opportunities",
  "abstract": "Aims Agate workers in Khambhat, India and their community members are exposed to high levels of silica dust and related diseases. Use of effective prevention practices remains low, prompting the need for effective interventions which increase the uptake of and investment in prevention practices. We sought: (a) to describe knowledge, self-efficacy, and practices among a population of workers, their family members, and neighbors involved in or located close to agate processing; and (b) to explore which factors are related to use of prevention practices and willingness to invest in new dust control technologies. Methods A community survey was conducted to measure demographics, occupation and financial factors, knowledge, prevention practices, barriers, risk perceptions, and efficacy beliefs. Descriptive statistics were used and, among agate workers, hierarchical logistic regression explored predictors of prevention practice use and willingness to invest. Results Among 1120 respondents, approximately 44%, 35%, and 8% of workers, family members, and neighbors used prevention practices, respectively. Knowledge and risk perceptions were generally high, where efficacy beliefs were low. Workers who had high levels of education, worked at home, and had high efficacy beliefs were more likely to report using prevention practices and being willing to invest. Barriers to prevention practice use included financial barriers, and beliefs that prevention is ineffective and health is not at risk. Conclusions Interventions and future research should be designed to engage the community to improve preventive behavior, and implement affordable and effective dust control interventions in the agate industry.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ee795da7fd29c3897b0b8b16fa36b65",
  "timestamp": "2025-05-15T02:44:10.986765"
}