{
  "id": 467,
  "title": "Foreign exchange forecasting and portfolio optimization strategy based on hybrid-molecular differential evolution algorithms",
  "abstract": "At present, the COVID-19 epidemic is still spreading at home and abroad, and the foreign exchange market is highly volatile. From financial institutions to individual investors, foreign exchange asset allocation has become important contents worthy of attention. However, most intelligent optimization algorithms (hereinafter IOAS) adopt the existing data and ignore the forecasted one in the foreign exchange portfolio allocation, which will result in a huge difference between portfolio allocation and actual demand; at the same time, many IOAS are less adaptable and have lower optimization ability in portfolio problems. To solve the aforementioned problems, this paper first proposed a DETS based on hybrid tabu search and differential evolution algorithms (DEAs), which has excellent optimization ability. Subsequently, the DETS algorithm was applied to support vector machine (SVM) model. Experiments show that, compared with other algorithms, the MAE and RMSE obtained by using DETS optimization parameters are reduced by at least 3.79 and 1.47%, while the CTR is improved by at least 2.19%. Then combined with the DETS algorithm and Pareto sorting theory, an algorithm suitable for multi-objective optimization was further proposed, named NSDE-TS. Finally, by applying NSDE-TS algorithm, the optimal foreign exchange portfolio is acquired. The empirical analysis shows that the Pareto front obtained by this algorithm is better than that of NSGA-II. Since the lower the uniformity index and convergence index, the stronger the optimization performance of the corresponding algorithm, compared with NSGA-II, its uniformity and convergence index decreased by 15.7 and 39.6%.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f14e12febb60468db36fb760a364b60",
  "timestamp": "2025-05-15T00:43:47.364697"
}