{
  "id": 6817,
  "title": "Diversity as value driver in Euro Stoxx 50 companies",
  "abstract": "PurposeCorporate diversity encompasses the different talents, knowledge, cultures, experiences and values of its employees. This diversity is reflected in multiple characteristics, such as race, age, gender, social class, religion, sexual orientation, ethnicity, culture and disability. The objective of this study is to identify if diversity is a value driver.Design/methodology/approachWe take the diversity score from the Diversity Leaders Index 2023 published by Financial Times (FT) and Statista; this will be our independent variable in linear regression models whose objective variables are relevant fundamental indicators of the Euro Stoxx 50 companies. It is, therefore, a cross-sectional sample with financial data taken as of the current date. We have 37 Euro Stoxx 50 components included in the diversity ranking.FindingsThe results indicate that diversity is not a value driver for trading volume, for its revenue, or for systematic risk measured by the beta parameter. However, it is observed, in a confidence interval of 90%, that the most diverse companies are larger (according to their market capitalization). In addition, the most diverse companies are more profitable [return on assets (ROA)] and valued by the market [price to earnings ratio (PER)] in a confidence interval of 95%.Originality/valueThese results indicate that companies should promote corporate diversity as a management strategy, as it is observed that more diverse companies are more profitable and valued by the market. This study provides a quantitative vision in the context of homogeneous companies such as the Euro Stoxx 50 Index on the aspects in which diversity is a value driver.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f15112da51f1da229269a4bd09df8b9",
  "timestamp": "2025-05-15T03:02:07.420952"
}