{
  "id": 4160,
  "title": "Stakeholders' opinions and expectations of the Global Fund and their potential economic implications",
  "abstract": "Objectives: To analyse stakeholder opinions and expectations of the Global Fund to Fight AIDS, Tuberculosis, and Malaria, and to discuss their potential economic and financial implications. Design: The Global Fund commissioned an independent study, the '360 degrees Stakeholder Survey', to canvas feedback on the organization's reputation and performance with an on-line survey of 909 respondents representing major stakeholders worldwide. We created a proxy for expectations based on categorical responses for specific Global Fund attributes' importance to the stakeholders and Current perceived performance. Methods: Using multivariate regression, we analysed 23 unfulfilled expectations related to: resource mobilization; impact measurement; harmonization and inclusion,effectiveness of the Global Fund partner environment, and portfolio characteristics. The independent variables are personal and regional-level characteristics that affect expectations. Results: The largest unfulfilled expectations relate to: mobilization of private sector resources; efficiency in disbursing funds; and assurance that people affected by the three diseases are reached. Stakeholders involved with the fund through the country coordinating mechanisms, those working in multilateral organizations and persons living with HIV are more likely to have unfulfilled expectations. In contrast, higher levels of involvement with the fund correlate with fulfilled expectations. Stakeholders living in sub-Saharan Africa were less likely to have their expectations met. Conclusions: Stakeholders' unfulfilled expectations result largely from factors external to them, but also from factors over which they have influence. in particular, attributes related to partnership score poorly even though stakeholders have influence in that area. joint efforts to address perceived performance gaps may improve future performance and positively influence investment levels and economic viability. (C) 2008 Wolters Kluwer Health. Lippincott Williams & Wilkins.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f186618be66f27f095472a997574054",
  "timestamp": "2025-05-15T01:24:25.357894"
}