{
  "id": 3042,
  "title": "The Phenomenon of Repeat Payday Loan Borrowing in the United States: Assessing Risk and Protective Factors among the Financially Vulnerable",
  "abstract": "Payday lenders provide high-cost short-term loans to those who have limited access to traditional financial institutions. Although an overwhelming majority of payday loan customers are repeat borrowers, studies examining the phenomenon of repeat borrowing is scant. Our study aimed to assess risk and protective factors among repeat payday loan borrowers. Using Bankruptcy filers' data obtained through the Public Access to Court Electronic Records database of the United States Bankruptcy Court of a Southern district, we conducted a multinomial logistic regression analysis to compare one-time and repeat borrowers with non-borrowers (N = 453). Findings revealed that medical debt and the number of children are associated with an increased risk of repeat borrowing. Homeownership is associated with a decreased risk of both one-time and repeat borrowing. In contrast, student loans are associated with an increased risk of one-time borrowing. Implications for social work practice, policy, research, and education to engage with financially vulnerable households, build assets and financial capability, and address risk and protective factors of alternative financial services such as repeat payday loan borrowing toward achieving socio-economic justice goals are discussed.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f1e5b0d065c9d8031a556fe36461127",
  "timestamp": "2025-05-15T02:21:52.246748"
}