{
  "id": 6726,
  "title": "Depression Among Older Adults with Diabetes in Israel: Pattern of Symptoms and Risk Factors",
  "abstract": "Background: Diabetes is a complex metabolic disease that is growing in prevalence worldwide. Depressive disorder is one of the most serious health co-morbidities associated with this disease, with a range of factors known to increase risk. Objectives: To explore the pattern of depression symptoms characterizing Israeli patients with diabetes who are 50 years of age and older and to identify sociodemographic factors and behavioral risks that may influence this risk of diabetes patients who suffer from depression symptoms. Methods: Symptoms of depression were examined using a sample of 2332 Israeli respondents (age 50 years) who participated in the third Israeli wave of the Survey of Health, Ageing, and Retirement in Europe study. Among them, 561 reported that they were diagnosed with diabetes. Multiple logistic regressions were conducted to examine the influence of sociodemographic and behavioral factors on the risk for developing depression in this population. Results: Results showed different patterns of depressive symptoms, which were significantly higher among older adults with self-reported diabetes compared to those without self reported diabetes. In multiple regression models, it was found that women were twice as likely to suffer from depression. In addition, financial distress and activity limitation due to health were found to be major risks for developing depression among this population. Conclusions: The study findings emphasize the importance of using focused clinical strategies aimed at reducing specific symptoms of depression while addressing sociodemographic factors and health risks among older adults with diabetes.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f2717c730c6028d19d927cec9b8b277",
  "timestamp": "2025-05-15T03:01:03.546296"
}