{
  "id": 4447,
  "title": "The Relationship Between Financial Stressors, Chronic Pain, and High-Impact Chronic Pain: Findings From the 2019 National Health Interview Survey",
  "abstract": "Objectives: Public health interventions to prevent financial stressors and reduce chronic pain and high-impact chronic pain (HICP) are important to potentially improve the health of the US population. The objectives of our study were to provide an update on the prevalence of chronic pain and HICP and to examine relationships between financial stressors and pain. Methods: We used data from a cross-sectional sample of adults aged >= 18 years (n = 31 997) collected by the 2019 National Health Interview Survey. We constructed bivariate and multivariate models to examine chronic pain and HICP in relation to financial worries, employment with wages, income, sociodemographic characteristics, number of chronic health conditions, and body mass index. Results: In fully adjusted multivariate regression models, having no employment with wages was strongly associated with increased risk for chronic pain (adjusted odds ratio [aOR] = 1.3; 95% CI, 1.2-1.5) and HICP (aOR = 1.6; 95% CI, 1.4-1.9). Worries about paying medical bills was associated with chronic pain (aOR = 1.1; 95% CI, 1.0-1.2) and HICP (aOR = 1.1; 95% CI, 1.0-1.3). Being unable to pay medical bills was associated with chronic pain (aOR = 2.1; 95% CI, 1.9-2.3) and HICP (aOR = 2.3; 95% CI, 2.0-2.6). Compared with having more income, having less income relative to the federal poverty level was associated with increased risk for chronic pain and HICP. Conclusions: We found a strong relationship between financial worries, employment for wages, income, and self-reported chronic pain and HICP independent of poor physical health and body mass index. Interventions to reduce chronic pain and HICP should address economic instability and financial stressors.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f35eb4a5d739a9b1b85691c271445d9",
  "timestamp": "2025-05-15T02:37:16.925057"
}