{
  "id": 3534,
  "title": "THE IMPACT OF COVID-19 ON THE PERFORMANCE OF ISLAMIC BANKS IN THE MENA REGION",
  "abstract": "Purpose - This research explores the impact of COVID-19 on the financial return of Islamic banks (IBs) in nine countries located in the Middle East and North Africa (MENA) region. It also examines the determinants of IBs' profitability during stable and uncertain periods, namely before and during the development of coronavirus. Design/Methodology/Approach - The financial data of this paper were collected from annual reports of IBs and the Orbis Bank Focus database over four years: 2018, 2019, 2020 and 2021. Descriptive statistics were used to examine the progress of IBs' performance from 2018 to 2021. The t-test was employed in this research paper to compare the financial proxies of IBs, and the multiple regression model was used to assess the determinants of IBs' performance before and during the development of coronavirus in MENA countries. Findings - The empirical findings show that IBs in MENA countries were dramatically influenced by the development of COVID-19. All financial proxies of IBs like financial return and liquidity experienced a sharp drop during the lockdown period. The empirical findings also indicate that the financial situation of IBs in 2021 became close to the pre-pandemic situation but was nonetheless below the banks' performance prior to the pandemic period (2018-2019). Finally, the results show that the determinants of IBs' return were not the same during stable and uncertain periods. During the COVID-19 period, credit risk, managerial efficiency and oil price were the significant determinants of IBs' profitability. Before the development of COVID-19, besides the elements of credit risk, managerial efficiency and oil price, liquidity risk and bank size were also found to have an influence on IBs' profitability. Originality/Value - The research offers new insights to top managers in IBs to increase the institutions' financial return and mitigate the negative shock of crises by managing several factors such as credit risk and managerial efficiency.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f3b4df016ef9b6e01e14120251ea66c",
  "timestamp": "2025-05-15T02:27:19.101989"
}