{
  "id": 4072,
  "title": "Macroeconomic Factors of Consumer Loan Credit Risk in Central and Eastern European Countries",
  "abstract": "In the scientific literature, there is a lack of a systematic approach to credit risk factors. In addition, insufficient attention is still paid to analysing the macroeconomic factors of consumer loan credit risk. Thus, this research aims to evaluate the macroeconomic factors of consumer loan credit risk in Central and Eastern European countries' banking systems. The findings of the study can be formulated as follows. After analysing scientific literature on credit risk factors, an improved and detailed (at five different levels) classification of factors influencing banking credit risk is proposed. This classification can be beneficial for more enhanced analysis of the factors influencing banking credit risk for the whole loan portfolio as well as for different types of loans, e.g., consumer loans. For quantitative evaluation of the impact of macroeconomic factors on consumer loan credit risk, the methods of panel data analysis and bivariate and multiple regressions are employed. Eleven CEE countries in the period from 2008 to 2020 are analysed. The results revealed that the aggregate of general macroeconomic condition factors is negatively related to consumer loan NPLs. Moreover, the economic growth, stock market, foreign exchange market, and institutional environment factors proved to be risk-decreasing, while credit market and bond market factors had a risk-increasing impact. The results of this research might help financial institutions manage credit risk more efficiently and also might be relevant to governments and central banks when selecting and applying fiscal and monetary policy measures. This study also makes policy recommendations.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f424e181748a868b975b5bb95ee793a",
  "timestamp": "2025-05-15T02:33:03.368523"
}