{
  "id": 3230,
  "title": "Spatially explicit modeling of disease surveillance in mixed oak-hardwood forests based on machine-learning algorithms",
  "abstract": "Incidences of disease, dieback, decline or mortality, some of which induced or enhanced by climate change, threaten the sustainability of forest stands in many ecosystems. Spatially explicit prediction of disease onset remains challenging, however, due to the involvement of several causative agents. In this paper, we developed a generic framework based on machine-learning algorithms and spatial analyses for landscape-level prediction of oak disease outbreaks caused by the charcoal fungus Biscogniauxia mediterranea in a mixed-oak forest of Medi-terranean climate. For prediction, we used a set of fifteen causative factors as a cross-function of soil, site and stand-related predictors. A total of 80 sample plots, including 1134 affected trees, were surveyed and used for the modeling process at the 5600-ha landscape level of the southern Zagros, Iran, where the disease occurs in roughly 25% of forest lands. Ten machine learning algorithms were explored and the performance of each al-gorithm to predict oak disease outbreak was evaluated. The modeling framework used maximum entropy to remove the least influential variables and build the status-quo management scenario to which the results of the prediction models were compared. Results showed that the random forests algorithm (AUC = 0.96: Precision = 0.71: Accuracy = 0.90: F-Measure = 0.70) achieved significantly better results than the status-quo management (Precision = 0.13: Accuracy = 0.67: F-Measure = 0.12) and any other algorithm. Soil chemical properties (NPK, organic carbon and EC) and landform predictors (slope, distance to roads, and TWI) were major forecasters of oak disease outbreak identified by the random forest algorithm. Geostatistical analysis enabled the creation of a map that identified sites at higher risk of infestation, allowing epidemiologists and forest managers to find sites likely to be infested. Consequently, financial resources can be allocated and management practices such as sanitation felling treatments applied across large forest landscapes to minimize the risk of spread and severity to uninfested high-value trees on nearby or adjacent land zones that are in the early stage of epidemics.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f4a4f87b7a8de06a52bb138d0cea0b9",
  "timestamp": "2025-05-15T02:24:05.091946"
}