{
  "id": 80,
  "title": "Chemistry of the Behaviors, Assessing the Effect of Testosterone, Cortisol, Progesterone and Estradiol on Financial Risk Taking using Machine Learning Regression Methods",
  "abstract": "Human behavior is the consequence of the interactions between physiological and biological factors. On the other hand, biochemical hormones are crucial indicators that widely impress the human life. Financial behaviors are the same as risk attitude which affect the economic and social quality of human life, and are also driven by the hormones which are biochemicals that circulate with the blood and govern the targeted parts of the body, mostly the brain. Cortisol, Testosterone, Progesterone, and Estradiol are some of the hormones that shape the human life with the extensive impact they have on emotional conditions and obviously change the individual tendency to financial risk taking. The present study is an experimental work which assesses the effect of the four mentioned hormones levels on the financial risk taking score. The levels of these hormones are measured in the blood samples provided by 38 participants. The participants further filled a standard and reliable questionnaire which indicates the level of financial risk taking. Several regression methods of machine learning are applied to the produced database and it is concluded that the value of financial risk taking could be modeled by Testosterone, Cortisol, Progesterone, and Estradiol hormone concentrations. The statistical analysis is also performed and it is demonstrated that testosterone has a positive effect on the financial risk taking whilst the other three hormone levels are negatively associated with the financial risk taking.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f75d1ed69052156f7863b12edd192d8",
  "timestamp": "2025-05-15T01:46:39.561825"
}