{
  "id": 2496,
  "title": "The impact of pre- and post-trauma financial problems on posttraumatic stress symptoms, anxiety and depression symptoms, and emotional support: A prospective population-based comparative study",
  "abstract": "Potentially traumatic events (PTEs) are associated with a higher risk of mental health problems and a lack of emotional support. The extent to which pre-and/or post-trauma financial problems further increase this risk, while controlling for pre-trauma mental health problems and lack of support and compared to nonvictims, is largely unknown. To better understand this risk, data was extracted from four surveys of VICTIMS study using the Dutch population-based longitudinal LISS-panel. Multivariate logistic regression analyses (MLRA) showed that nonvictims (nnonvictims total=5003) with persistent financial problems (present at T1 and present at T2 one year later) more often suffered from severe anxiety and depression symptoms (ADS; Adjusted OR (aOR)= 1.72) and lack of emotional support (aOR=1.96) than nonvictims without these problems, and that victims of PTEs (nvictims total=872) with persistent financial problems more often suffered moderate ADS (aOR=2.10) than nonvictims with persistent financial problems. MLRA showed that victims with pre-and/or post-trauma financial problems were more at risk of probable PTSD than victims without financial problems (aORs >= 2.02). Victim services and (mental) health care professionals should screen for pre-and post-trauma financial problems and, when found, refer the victims to relevant professionals since these problems can significantly hinder recovery.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f752d9049269ea4ff311d1e31823c0d",
  "timestamp": "2025-05-15T02:15:59.883437"
}