{
  "id": 7066,
  "title": "The association and contribution of gender-related characteristics to prevalent chronic kidney disease in women and men in a multi-ethnic population - The HELIUS study",
  "abstract": "In chronic kidney disease (CKD), prevalence differences between sexes have been reported. While biological factors have been investigated, research on sociocultural factors is scarce. We explore the extent gender-related characteristics associate with, and contribute to, CKD prevalence in women and men in a multi-ethnic population. Cross-sectional analyses were performed on data of 12,221 women and 8,930 men aged 18-70 years across six ethnic groups from the HELIUS Study. Using age-, education-, and ethnicity adjusted Poisson regression, we determined associations between time spent on housework; primary earner status; employment status; and occupational segregation, and CKD. Population attributable fractions estimated the contribution to CKD and the extent traditional CKD risk factors explained these contributions. In women, associations with CKD were found for doing little housework, part-time work, and unemployment. In men, primary-earnership and unemployment were associated. Associations aligned across ethnic groups. Estimated contributions ranged from 1.8% for women doing little housework to 26.5% for part-time employment and 12.1% for unemployment to 37.5% for primary-earnership in men, and were hardly explained by traditional risk factors. In our study, gender-related characteristics are associated with CKD in women and men across ethnic groups. Contributions to population prevalence may hardly be explained by CKD risk factors. The prevalence of chronic kidney disease (CKD) differs between women and men. We explored to what extent the risk may be associated with sociocultural expectations for women and men. We analysed data of 12,221 women and 8,930 men from six different ethnic groups. CKD was more common in all women who did little housework, worked part-time or were unemployed, and in men whose financial contribution was equal to their partners or who were unemployed. The higher risk of CKD was not explained by a higher occurrence of known risk factors. In future, specific policies or targeted interventions may be developed to reduce the risk of CKD overall and in certain population subgroups.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f8101487d7e88e3068f9119eb1f2d12",
  "timestamp": "2025-05-15T03:05:03.365457"
}