{
  "id": 18,
  "title": "Trend Forecast of Shanghai Crude Oil Futures",
  "abstract": "The dominant position in crude oil pricing affects a country's energy and economic security. We construct different time-series forecasting models to analyze the long-term trends of Shanghai crude oil futures and guide current price trading. First, we built a classic ARIMA model as the benchmark. It is a good choice for short-term investors but does not apply to long-term trend prediction. We propose an improved HW-Prophet model that can maximize its advantages in selecting and reconstructing mutation points and reduce the forecast error by approximately 22%. The Prophet model is then introduced into the prediction of futures price series, and the Haar wavelet and KS (HWKS) algorithm and sliding window are used to optimize the change-point selection of the Prophet model. Finally, we created different combinations of long short-term memory (LSTM) and HW-Prophet models based on residual correction and optimal weighting. The results showed that the combined residual correction method was unsuitable for the two single models in this study. Because the residual sequence predicted by the HW-Prophet model is similar to white noise, it is difficult for LSTM to learn the effective dynamic laws from it. By minimizing the error sum of squares to solve the optimal weight coefficients and combining the two models linearly, the prediction advantages of a single model in different intervals can be effectively transmitted, and the prediction accuracy is greatly improved. The HW-Prophet-LSTM combination model constructed in this study based on the optimal weight is currently one of the best models for predicting the long-term trends of Shanghai crude oil futures.",
  "year": 2022,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f8bd0167829799b235cbaeb2b8f2ce3",
  "timestamp": "2025-05-15T01:26:26.369340"
}