{
  "id": 9228,
  "title": "Long-term impact of COVID-19 pandemic on fear of COVID-19 and psychological distress among the general population in Japan: a longitudinal study",
  "abstract": "Objectives The long-term impact of the COVID-19 pandemic on the mental health issues of the general population in Japan is unclear. Thus, we examined the long-term effects of the COVID-19 pandemic on fear of COVID-19 and psychological distress and determined their causal relationships among the general population in Japan. Design and setting A longitudinal online survey was conducted by a Japanese online survey company to investigate the items regarding personal demographics, fear of COVID-19 (Japanese version of the fear of COVID-19 scale) and psychological distress (Japanese version of the Kessler 6 scale). Participants The participants were 274 individuals (women=44.2%) with a mean age of 51.6 years (SD=13.6) who responded to the online surveys in September 2020 (Time 1: T1) and January 2023 (Time 2: T2). Results The paired t-test showed that fear of COVID-19 decreased significantly from T1 to T2 (t=2.79, df=273, p<0.01, d=0.16). The chi(2) test showed that the proportion of those at high risk for psychological distress remained the same (chi(2)=1.33, df=1, n.s.). Furthermore, in a two-panel cross-lagged analysis to determine the causal relationship between fear of COVID-19 and psychological distress, fear of COVID-19 at T1 significantly predicted psychological distress at T2 (beta=0.26, p<0.001). Additional multiple regression analyses adjusted for covariates (age, sex, marital status, COVID-19 status, etc) showed that worsening household finances (beta=0.11, p<0.05) and avoiding contact with others (beta=0.20, p<0.01) were associated with fear of COVID-19 at T2. Conclusions During the long-lasting COVID-19 pandemic, fear of COVID-19 decreased, but psychological distress did not change. In addition, fear of COVID-19 predicted psychological distress and was associated with poorer household finances and avoiding contact with others. Mental health professionals and policymakers should continue to support mental health issues following the long-lasting COVID-19 pandemic through interventions focused on promoting financial support and social interactions to reduce fear of COVID-19.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f9dba6aa6ac6f103254d6d94d7270a3",
  "timestamp": "2025-05-15T03:26:54.525259"
}