{
  "id": 6141,
  "title": "Power Equipment Fault Prediction and Diagnosis Algorithm Driven by Power Big Data",
  "abstract": "The fault of power equipment must be dealt with in time, otherwise the damage degree may continue to increase, which will not only greatly increase the complexity and cost of maintenance, but also have a chain reaction to the surrounding equipment, thus leading to the expansion of the fault range. In this paper, Transformer model is introduced to deeply mine and analyze the historical operation data of power equipment. In the concrete implementation of the algorithm, the multi-dimensional operation data of power equipment are collected comprehensively and continuously through the sensor network; then, these original data are strictly cleaned and preprocessed, such as noise removal, missing value filling and standardization. Then, the carefully selected feature sets are input into the Transformer model and trained with rich historical fault data. Finally, the trained Transformer model is deployed to the power system to realize real-time monitoring and fault early warning of power equipment. When the potential failure risk is detected, the model immediately triggers the early warning mechanism and informs the operation and maintenance personnel to take corresponding preventive measures or maintenance plans. The experimental data show that the average prediction accuracy rate of the Transformer model proposed in this paper is 97.19%, and the prediction accuracy rate of fault types is above 90.2%, which all show better prediction performance than SVM. This paper not only shows the outstanding advantages of Transformer model in the field of financial forecasting, but also provides new ideas for future research.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f9d0b459789253bf08ba0b0a7dacb61",
  "timestamp": "2025-05-15T02:55:12.915280"
}