{
  "id": 2080,
  "title": "Higher-order moment risk connectedness and optimal investment strategies between international oil and commodity futures markets: Insights from the COVID-19 pandemic and Russia-Ukraine conflict",
  "abstract": "This paper investigates the higher-order moment risk connectedness between West Texas Intermediate (WTI) oil futures, Brent oil futures, Chinese oil futures and commodity futures (agricultural, industrial metals, and precious metals) before and during the COVID-19 pandemic and following the outbreak of the Russia-Ukraine conflict, by combining ex-post moment measures and the novel time-varying parameter (TVP)-vector auto-regression (VAR)based connectedness approach. Further, this paper depicts the dynamic overall and pairwise correlations between oil and commodity futures and constructs the hedging and optimal-weighted portfolio strategies using the DCC-GARCH t-Copula model. This paper also constructs the multivariate oil-commodity portfolio based on the newly proposed minimum connectedness portfolio approach and takes into account the higher-order moment risk connectedness. The empirical results demonstrate that the dynamic linkages between international oil and commodity futures are positive, time-varying, and have been greatly intensified by the outbreak of the 2018 China-US trade war, the 2020 COVID-19 pandemic, and the 2022 Russia-Ukraine conflict. The risk connectedness results are moment-dependent. The averaged total skewness and kurtosis spillovers are lower than the return and volatility connectedness. Brent (WTI) oil is the largest net transmitter of the return and volatility (skewness and kurtosis) risk spillovers. The dynamic total, net, and net-pairwise spillovers are all time-varying and highly reactive to major crises, especially the COVID-19 pandemic and the Russia-Ukraine conflict. Furthermore, the optimal-weighted portfolio shows a higher risk reduction than the hedging strategy. Finally, the minimum skewness connectedness portfolio shows relatively higher hedging effectiveness, while the minimum kurtosis connectedness portfolio offers the highest cumulative returns.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8f9e5961e36a3265e0f3eadc7d252ac4",
  "timestamp": "2025-05-15T01:02:32.934819"
}