{
  "id": 8573,
  "title": "WOMAC score and arthritis diagnosis predict decreased agricultural productivity",
  "abstract": "BackgroundArthritis and joint pain are highly prevalent in agricultural (ag) workers. Many ag operations are sustained by a small number of workers, and the disability of even one worker thus contributes to economic hardship. This study investigated associations between joint health in Montana ag workers and economic well-being and work capacity.MethodsThis observational mixed-methods study utilized quantitative survey data and qualitative focus group data. 299 ranchers and farmers in 9 Montana counties completed either an online or paper survey that included participant demographics, joint symptoms, history of arthritis and arthritis type, financial status, work capacity, and the need to rely on others to complete one's work. The Western Ontario and McMaster Universities arthritis index (WOMAC) survey was completed by those with hip or knee pain. Data were entered into REDCap v8.9.2 for analysis with SAS 9.4, using logistic and linear regression models to detect associations between covariables and to calculate odds ratios and confidence intervals. Focus groups were held with ranchers in two Montana counties, discussing similar topics, and the themes expressed were identified.Results87.6% of survey respondents reported joint pain, 47.8% a diagnosis of arthritis, and 22.4% osteoarthritis (OA). A 10-point increase in WOMAC was significantly associated with lower work capacity (OR 2.00; 95% CI [1.58, 2.55], p<0.01), worse financial condition (OR 1.23; 95% CI [1.01,1.48], p=0.04), and increased reliance on others (OR 1.82; 95% CI [1.32, 2.55], p<0.01). An arthritis diagnosis was associated with worsening work capacity (OR 4.66; 95% CI [2.71, 8.01], p<0.01) and increased odds of relying on others (OR 3.23; 95% CI [1.56, 6.66], p<0.01). A diagnosis of OA was significantly associated with decreased work capacity (OR 3.47; 95% CI [1.97, 6.11], p<0.01). Unadjusted for age and BMI, we found a significant association between years spent working in agriculture and joint health, which became non-significant after adjusting for age and BMI. Focus group themes included decreased productivity with increased joint symptoms and a tendency for ranchers to avoid interaction with the health care system.ConclusionPoor joint health is associated with economic risk on Montana ranches and farms.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8fa930681af79196b1f024dab5d8a5ab",
  "timestamp": "2025-05-15T03:20:22.171127"
}