{
  "id": 6956,
  "title": "Cascade analysis of awareness, willingness, uptake and adherence with regard to PrEP among young men who have sex with men (YMSM) in China: A comparison between students and non-students",
  "abstract": "Introduction: In China, young men who have sex with men (YMSM) are one of the groups most at risk of HIV/AIDS. The uptake of pre-exposure prophylaxis (PrEP) among YMSM has not been well documented. A cascade analysis of awareness, willingness, use and adherence with regard to PrEP was conducted separately among YMSM students and non-students. Methods: From 20 October to 30 December 2021, all adolescents aged 16-24 years were selected for the study from among MSM recruited from 31 provincial administrative regions in mainland China. Participants were included in a cross-sectional study of awareness, willingness, use and adherence with regard to PrEP among YMSM. Logistic regression modelling was used to identify factors associated with the four outcomes. Results: Among 1014 student and 866 non-student YMSMs, respectively, 88.07% and 81.64% had heard of PrEP; 58.16% and 50.35% were willing to use PrEP; 7.59% and 7.62% had used PrEP; and 3.16% and 3.58% had adhered to PrEP. Among students, those living in high-risk areas and pilot cities and those who had engaged in commercial sex and group sex had a positive effect on PrEP use, and the same trends were found among non-students living in high-risk areas and pilot cities and those who had engaged in group sex. 'Daily oral' and 'flexible' PrEP use positively influenced adherence among both groups. Conclusions: A differentiation strategy of PrEP promotion should be implemented among YMSM. Material support for students, such as financial resources, should increase, while non-students should increase their level of perception of HIV risk.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8fafa877ae7c3c4bbffb1bca2eb0d133",
  "timestamp": "2025-05-15T03:03:13.536678"
}