{
  "id": 3,
  "title": "A Deep Residual Shrinkage Neural Network-based Deep Reinforcement Learning Strategy in Financial Portfolio Management",
  "abstract": "Reinforcement Learning algorithms are widely applied in many fields, such as price index prediction, image recognition, and natural language processing. This paper introduces a novel algorithm based on the classical Deep Reinforcement Learning algorithm and Deep Residual Shrinkage Neural Network for portfolio management. In this algorithm, the Ensemble of Identical Independent Evaluators framework put forward by Jiang et al. is adopted in the policy function. Following this, we adopt the Deep Residual Shrinkage Neural Network to function as the identical independent evaluator to optimize the algorithm. We use the cryptocurrency market in this research to assess the efficacy of our strategy with eight traditional portfolio management strategies as well as Jiang et al.'s reinforcement learning strategy. In our experiments, the Accumulated Yield is used to reflect the profit of the algorithm. Despite having a high commission rate of 0.25% in back-tests, results show that our algorithm can achieve 44.5% 105.4% and 148.8% returns in three different 50-days back-tests, which is five times more than the profit of other non-reinforcement learning strategies and Jiang et al.'s strategy. Furthermore, the Sharpe ratio demonstrates that the extra reward per unit risk of the our strategy is still better than other traditional portfolio management strategies and Jiang et al.'s strategy by at least 50% in different time horizons.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8fb68930be948f057adff3ad0ae6b2b7",
  "timestamp": "2025-05-15T00:38:16.197902"
}