{
  "id": 4138,
  "title": "Psychological symptoms, mental fatigue and behavioural adherence after 72 continuous days of strict lockdown during the COVID-19 pandemic in Argentina",
  "abstract": "BackgroundAn early and prolonged lockdown was adopted in Argentina during the first wave of COVID-19. Early reports evidenced elevated psychological symptoms. AimsTo explore if the prolonged lockdown was associated with elevated anxiety and depressive symptoms; if mental fatigue was associated with lockdown adherence (a phenomenon called 'behavioural fatigue'); and if financial concerns were associated with lockdown adherence and emotional symptoms. MethodThe survey included standardised questionnaires to assess depressive (PHQ-9) and anxious (GAD-7) symptoms, mental fatigue, risk perception, lockdown adherence, financial concerns, daily stress, loneliness, intolerance to uncertainty, negative repetitive thinking and cognitive problems. LASSO regression analyses were carried out to predict depression, anxiety and lockdown adherence ResultsThe survey reached 3617 adults (85.2% female) from all provinces of Argentina after 72 days of lockdown. Data were collected between 21 May 2020 and 4 June 2020. In that period, Argentina had an Oxford stringency index of 85/100. Of those surveyed, 45.6% and 27% met the cut-offs for depression and anxiety, respectively. Mental fatigue, cognitive failures and financial concerns were correlated with psychological symptoms, but not with adherence to lockdown. In regression models, mental fatigue, cognitive failures and loneliness were the most important variables to predict depression, intolerance to uncertainty and lockdown difficulty were the most important for anxiety, and perceived threat was the most important for predicting lockdown adherence. ConclusionsDuring the extended lockdown, psychological symptoms increased, being enhanced by mental fatigue, cognitive difficulties and financial concerns. We found no evidence of behavioural fatigue. Thus, feeling mentally fatigued is not the same as being behaviourally fatigued.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8fba424619f362c5589c5a8e5b6ab134",
  "timestamp": "2025-05-15T02:33:42.053296"
}