{
  "id": 9443,
  "title": "Heterogeneous choice in the demand for agriculture credit in China: results from an in-the-field choice experiment",
  "abstract": "Purpose In this study, the authors examined demand-side credit in rural China with the aims of understanding attribute preferences and the willingness of farmers to pay for credit. Design/methodology/approach The authors implemented an in-the-field discrete choice experiment (DCE) using a D-optimal block (6 x 9 x 3) design applied to 420 farm households across five Chinese provinces (Shandong, Sichuan, Shaanxi, Jiangsu and Henan) in the summer and fall of 2018. The DCE included six attributes including the interest rate, term of loan, type of loan, type of repayment, type of institution and mobile banking services. Findings Conditional and mixed logit results indicated a downward sloping credit demand curve with variable elasticity across regions. Provincial willingness-to-pay (WTP) indicators suggested that farmers were willing to pay a premium for long-term ( 0.03-0.687%) and low collateral credit loans ( 0.79-2.93%). Also, four of five provinces indicated a preference for loan amortization rather than lump-sum payment. Interestingly, in comparison to the Agricultural Bank of China (ABC), only farmers in Shandong, Sichuan and Shaanxi indicated a preference for rural credit cooperatives (RCCs)/banks and the Postal Savings Bank of China (PSBC). Another quite surprising result was bank services, in our case, access to mobile banking did not appear to induce WTP for agricultural credit. While conditional and mixed logit regression coefficients were similar (and therefore robust), the authors found that there was substantial heterogeneity across attribute preferences on term of loan, type of loan and amortization. Preferences for type of lender and mobile banking were generally homogenous. This result alone suggested that lenders should consider offering a suite of credit products with different attributes in order to maximize the potential pool of borrowers. While there were some differences across provinces, farmers appeared to be indifferent to lenders, and it did not appear that offering banking services such as mobile banking had any bearing on credit decisions. Research limitations/implications This paper presents a first step in using in-the-field choice experiments to better understand rural finance in China. Although the sample size satisfies conventional levels of significance and rank conditions, the authors caution against attributing results to China as a whole. Different provinces have different institutional structures and agricultural growing conditions and economies and these effects may differentially affect WTP for credit. Although by all indications farmers were aware of credit, not all farmers, in fact a minority, actually borrowed from a financial institution. This is not unusual in China, but for these farmers, the DCE was posed as hypothetical. Likewise, the study's design was based on a generic credit product typical of rural China, and the authors caution against making inferences about other products with different attributes and risk structures. Social implications This study is motivated by the rapidly changing dynamic in China's agricultural economy. With specific reference to new laws and regulations about the transfer of land use rights (LURs), China's agricultural economy is undergoing significant and rapid change which will require better understanding by policy makers, lenders and practitioners of the changing credit needs of farmers, including the new and emerging class of commercial farmers. Originality/value To the best of the authors' knowledge, the authors believe that the result provided in this paper present the first use of in-the-field DCE and are the first to be reported in either the English or Chinese literature on rural credit product design.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8fd5bdd77a38301f73d21a79957742b7",
  "timestamp": "2025-05-15T03:28:46.334804"
}