{
  "id": 6554,
  "title": "Psychosocial Work Conditions and Burnout Among Brazilian Bank Employees: A Cross-Sectional Study",
  "abstract": "Changes in the modern economy have affected the financial sector. Time pressures, excessive work demands, and job stress are frequent concerns among bank employees, which might predispose them to burnout symptoms. The objective of the present study was to investigate the association between burnout symptoms and exposure to psychosocial work conditions in bank employees. A cross-sectional study of 1046 bank employees was carried out in Para and Amapa, northern Brazil. We applied a self-administered questionnaire evaluating socio-demographic characteristics, burnout (Maslach Burnout Inventory), and two job stress models (Demand-Control-Support and Effort-Reward Imbalance). Two levels of burnout symptoms were analysed: moderate level of burnout (MLB) and high level of burnout (HLB). Logistic regression models were used to estimate associations between the two levels of burnout and the two stress models, controlling for relevant covariates. The overall prevalence of burnout was 71.8% (31.1% for HLB; 40.7% for MLB), regardless of gender. Exposure to adverse psychosocial conditions in the workplace, such as high strain, low social support at work, high effort/low reward, and over commitment showed strong association with HLB and MLB, and these associations were independent of age, gender, and other occupational characteristics. We found that psychosocial conditions in the financial sector involving high strain, low social support at work, high effort/low reward, and over commitment represent possible risk factors for moderate and HLB symptoms in bank employees.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ff0a99de3fc94d0e9c4422ef6c4a24f",
  "timestamp": "2025-05-15T02:59:07.596999"
}