{
  "id": 9229,
  "title": "Geographic Distribution of Social Service Resources for Stroke Survivors in Ohio Varies by Rurality",
  "abstract": "BACKGROUND:Both social service resources and stroke prevalence vary by geography, and health care resources are scarcer in rural areas. We assessed whether distributions of resources relevant to stroke survivors were clustered around areas of the highest stroke prevalence in Ohio and whether this is varied by rurality using an ecological study design.METHODS:Census tract (CT)-level self-reported stroke prevalence estimates (Centers for Disease Control and Prevention PLACES-2019 Behavioral Risk Factor Surveillance System) were linked with sociodemographic and rurality data (2019 American Community Survey) and geographic density of resources in Ohio (2020 findhelp data). Resources were grouped into categories: housing, in-home, financial, transportation, education, and therapy. Negative binomial regression models estimated the mean number of resources within 25 miles and 30 minutes of a CT centroid and quartiles of stroke prevalence for each resource group by rurality status (rural, urban, and suburban). Models were sequentially adjusted for total population and CT demographics.RESULTS:In Ohio, stroke prevalence was 3.9% (0.4%-14.2%). The highest stroke prevalence quartile (versus lowest) was associated with fewer resources within 25 miles overall (resource ratio [RR], 0.57-0.98). The most pronounced disparities were in rural CT; rural CTs with the highest quartile stroke prevalence had fewer housing (RR, 0.49 [95% CI, 0.32-0.75]), in-home (RR, 0.31 [95% CI, 0.20-0.49]), and therapy (RR, 0.23 [95% CI, 0.13-0.43]) resources compared with those with the lowest quartile stroke prevalence (reference: mean, 1.2 housing, 5.1 in-home, and 4.9 therapy resources, respectively). Rural disparities no longer persisted after adjustment for federal poverty limit (rural: housing [RR, 0.69 (95% CI, 0.40-1.20)], in-home [RR, 0.65 (95% CI, 0.34-1.23)], and therapy [RR, 0.66 (95% CI, 0.33-1.32)]).CONCLUSIONS:Stroke social service resources are inversely distributed relative to stroke prevalence in Ohio, particularly in rural areas. This inverse link in rural Ohio is likely explained by geographic differences in poverty. Stroke-specific resource-related interventions may be needed and should consider the roles of rurality and poverty.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "8ff497a2f633fa07a4616e5b8a97823e",
  "timestamp": "2025-05-15T03:26:54.530327"
}