{
  "id": 1599,
  "title": "Design and Application of Intelligent Financial Accounting Model Based on Knowledge Graph",
  "abstract": "With the continuous progress of science and technology, economic globalization has become an important direction for the development of enterprises. In the process of enterprise development, artificial intelligence and machine learning techniques have greatly improved the efficiency of enterprise accounting and financial management and have gradually shifted traditional financial accounting to modern financial management and accounting. Owing to the existing problems of inefficiency, large consumption of time and resources, and low degree of intelligence in the existing computerized financial data prediction systems, this study proposes an intelligent financial accounting and a financial risk monitoring and early warning model based on knowledge graph and deep learning techniques. To validate its performance, the model is trained using financial data of 120 listed companies, and the model is applied to establish the prediction of whether the listed companies are facing a financial crisis, using another 60 companies as the test sample. Results show that the use of deep learning and knowledge graph techniques can significantly improve the regulatory model, enhance regulatory penetration, and alleviate regulatory time lag, thus improving the ability of regulation to detect enterprise problems and prevent risks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "90031e680d6b2b2e2a29ff481e092dea",
  "timestamp": "2025-05-15T02:05:08.226200"
}