{
  "id": 7155,
  "title": "Incidence of Pseudarthrosis and Subsequent Surgery After Cervical Fusion Surgery: A Retrospective Review of a National Health Care Claims Database",
  "abstract": "BACKGROUND: Cervical pseudarthrosis is a post-operative adverse event that occurs when a surgically induced fusion fails to establish bone growth connecting the 2 regions. It has both clinical and financial implications and may result in significant patient morbidity; it continues to be one of the leading causes of pain after surgery.METHODS: A retrospective longitudinal cohort study was performed. Patients in the IBM MarketScan Commer-cial Claims and Encounters (CCAE) database, 18-64 years old, who underwent elective cervical fusions during 2015- 2019 were included. Patients with trauma, infection, or neoplasm were excluded. Patients were followed for 2 years from surgical fusion for occurrence of pseudarth-rosis. After pseudarthrosis, subsequent surgery was documented, and cumulative incidence curves, adjusted for patient/procedure characteristics, with 95% confidence intervals (CIs) were generated. Risk factors were evaluated with multivariable Cox regression analysis.RESULTS: The cohort included 45,584 patients. The 1-year and 2-year incidence of pseudarthrosis was 2.0% (95% CI, 1.9%-2.2%) and 3.3% (95% CI, 3.1%-3.5%), respectively. Factors significantly associated with increased risk of pseudarthrosis were female gender, current/previous substance abuse, previous spinal pain in the cervical/thoracic/lumbar spine, and Elixhauser score double dagger 5. Factors significantly associated with decreased risk of pseudarthrosis were anterior cervical approach, use of an interbody cage, and 2-level or 3-level anterior instrumen-tation. The 1-year and 2-year incidence of subsequent surgery in patients with pseudarthrosis was 11.7% (95% CI, 9.6%-13.7%) and 13.8% (95% CI, 11.5%-16.2%), respectively.CONCLUSIONS: Cervical pseudarthrosis and subsequent surgery still occur at a low rate. Surgical factors such as anterior approach, interbody cage use, and anterior instrumentation may reduce pseudarthrosis risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "901362625085dde7d140d40833d9d06f",
  "timestamp": "2025-05-15T03:05:32.107181"
}