{
  "id": 5986,
  "title": "Energy vs. Precious Metals Funds Performance During Commodity Markets Volatility-Evidence from Poland",
  "abstract": "Events of recent years, such as the COVID-19 pandemic and the war in Ukraine, have caused significant fluctuations in financial markets, including energy and precious metals markets. Many investors see commodity investments as a way to diversify portfolio risk. The article's main aim was to evaluate the performance of Polish commodity funds and analyze how external factors influenced their investment results from 2020 to 2023. Using popular investment fund performance metrics, it was determined that precious metals funds could not be considered effective during the 2020-2023 period, whereas the opposite conclusion applied to energy commodity funds. Additionally, mixed linear regression models showed that the average performance of precious metals funds was significantly positively influenced by the price of gold. Meanwhile, the performance of the average energy commodity fund was significantly positively impacted by the CRB Commodity Index value. The conducted analysis demonstrates that mixed linear regression models can be successfully applied in evaluating the external factors influencing the efficiency of commodity funds, taking into account their capital allocation policies. The obtained results can be utilized by current and potential participants of commodity funds, investors seeking portfolio diversification opportunities, and commodity fund managers to maximize investment performance.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9027ca4930d1889857debf3ae1fad7ab",
  "timestamp": "2025-05-15T02:53:33.425940"
}