{
  "id": 3438,
  "title": "Drivers of Individual Credit Risk of Retail Customers-A Case Study on the Example of the Polish Cooperative Banking Sector",
  "abstract": "The main aim of the research was to determine the key factors determining the level of credit risk of individual clients (clients in the form of natural persons, excluding companies) on the example of Polish cooperative banks according to the following features: transaction characteristics, socio-demographic characteristics of the customer, the customer's financial situation, the customer's history of cooperation with the cooperative bank where they applied for a loan, and the customer's history of cooperation with other financial institutions. For the research gathered data from 1000 credit applications submitted by individual customers when applying for a credit in five different cooperative banks were used for the analyses. To assess the credit risk of retail clients we use logit regression models, and additionally, score cards were calculated. The results of the research indicate that among the factors with high predictive power there were the features characterizing the client's history of cooperation with the cooperative bank, where they applied for a loan. It may mean that when assessing credit risk related to financing individual customers, cooperative banks due to their local character, have an advantage over other financial institutions.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "902d40e89ead35e4987f642ba98c6be9",
  "timestamp": "2025-05-15T02:26:09.169614"
}