{
  "id": 2124,
  "title": "Modeling of extended osprey optimization algorithm with Bayesian neural network: An application on Fintech to predict financial crisis",
  "abstract": "Accurately predicting and anticipating financial crises becomes of paramount importance in the rapidly evolving landscape of financial technology (Fintech). There is an increasing reliance on predictive modeling and advanced analytics techniques to predict possible crises and alleviate the effects of Fintech innovations reshaping traditional financial paradigms. Financial experts and academics are focusing more on financial risk prevention and control tools based on state-of-the-art technology such as machine learning (ML), big data, and neural networks (NN). Researchers aim to prioritize and identify the most informative variables for accurate prediction models by leveraging the abilities of deep learning and feature selection (FS) techniques. This combination of techniques allows the extraction of relationships and nuanced patterns from complex financial datasets, empowering predictive models to discern subtle signals indicative of potential crises. This study developed an extended osprey optimization algorithm with a Bayesian NN to predict financial crisis (EOOABNNPFC) technique. The EOOABNN-PFC technique uses metaheuristics and the Bayesian model to predict the presence of a financial crisis. In preprocessing, the EOOABNN-PFC technique uses a minmax scalar to scale the input data into a valid format. Besides, the EOOABNN-PFC technique applies the EOOA-based feature subset selection approach to elect the optimal feature subset, and the prediction of the financial crisis is performed using the BNN classifier. Lastly, the optimal parameter selection of the BNN model is carried out using a multi -verse optimizer (MVO). The simulation process identified that the EOOABNN-PFC technique reaches superior accuracy outcomes of 95.00% and 95.87% compared with other existing approaches under the German Credit and Australian Credit datasets.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9033f2ea18c400e74369d373a25eba55",
  "timestamp": "2025-05-15T02:11:40.524292"
}