{
  "id": 4145,
  "title": "Analysis of risk management performance with innovative approach: a case study of China's shipping companies",
  "abstract": "In implementing the Belt and Road Initiative (BRI) and mixed ownership reform, China has merged its state-owned shipping companies, reorganized, and rapidly integrated them into the state shipping projects of the BRI. The economies of scale, industrial integration have led to reducing orders and declining profits of more small and medium-sized shipping companies (SMSCs), enabling large enterprises to gain 'pricing power' in the shipping market, transforming the shipping industry into a 'perfect monopoly market'. This has caused the liquidation of fixed assets and large-scale unemployment. This study aims to find innovative strategies by identifying and countering risk factors to maintain a certain market share of SMSCs. Using correlation analysis, this study ranks market, operational, financial and hazard risks by sub-factors. It rejects the hypothesis that market strategies will mediate the relationship between risk and performance. It accepts the hypothesis of operational, financial and hazard strategies mediating the relationship between risk and performance through three-step regression analysis. This study suggests that SMSCs can reduce integrated risks by strengthening flexibility and single organizational structure, and circumventing the state cultural risks of BRI. It also helps SMSCs identify potential risks and management needs to pursue sustainability.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "90342213907c4edd39fc33d8e4812f84",
  "timestamp": "2025-05-15T02:33:42.083195"
}