{
  "id": 3524,
  "title": "Financial inclusion and improved water usage among households in Ghana",
  "abstract": "Background In Ghana, about 76% of households are at risk of drinking water polluted with faecal matter, hence, poor sanitation and unsafe water are responsible for 80% of all diseases in the country. Given this, some studies have been carried out concerning the factors that determine access and use of improved water among households in Ghana. However, although financial inclusion can make it easy for households to afford and hence, use improved water, it has received very little attention. This study, thus, examines the effect of financial inclusion on the use of improved water among households in Ghana.Methods The Ghana Living Standards Survey round 7 (GLSS7) is used as the data source while the binary logit regression is employed as the main empirical estimation technique.Results The results show that households with financial inclusion (employing an indicator which has not been disaggregated into formal and informal financial inclusion) have a higher likelihood of using improved water sources relative to those without financial inclusion. The results are robust using formal financial inclusion as well as a combined index of financial inclusion.Conclusion Enhancing financial inclusion, especially formal financial inclusion can be utilised as a major policy instrument towards increasing access and use of improved water sources among households in Ghana.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "904d2259f8763da9f5018365c26cbe94",
  "timestamp": "2025-05-15T02:27:19.082990"
}