{
  "id": 9391,
  "title": "Refining risk adjustment for bundled payment models in cervical fusions-an analysis of Medicare beneficiaries",
  "abstract": "BACKGROUND CONTEXT: The current Bundled Payment for Care Improvement model relies on the use of Diagnosis Related Groups (DRGs) to risk-adjust reimbursements associated with a 90-day episode of care. Three distinct DRG groups exist for defining payments associated with cervical fusions: (1) DRG-471 (cervical fusions with major comorbidity/complications), (2) DRG-472 (with comorbidity/complications), and (3) DRG-473 (without major comorbidity/complications). However, this DRG system may not be entirely suitable in controlling the large amounts of cost variation seen among cervical fusions. For instance, these DRGs do not account for area/location of surgery (upper cervical vs. lower cervical), type of surgery (primary vs. revision), surgical approach (anterior vs. posterior), extent of fusion (1-3 level vs. >3 level), and cause/indication of surgery (fracture vs. degenerative pathology). PURPOSE: To understand factors responsible for cost variation in a 90-day episode of care following cervical fusions. STUDY DESIGN: Retrospective study of a 5% national sample of Medicare claims from 2008 to 2014 5% Standard Analytical Files (SAF5). OUTCOME MEASURES: To calculate the independent marginal cost impact of various patient-level, geographic-level, and procedure-level characteristics on 90-day reimbursements for patients undergoing cervical fusions under DRG-471, DRG-472, and DRG-473. METHODS: The 2008 to 2014 Medicare SAF5 was queried using DRG codes 471, 472, and 473 to identify patients receiving a cervical fusion. Patients undergoing noncervical fusions (thoracolumbar), surgery for deformity/malignancy, and/or combined anterior-posterior fusions were excluded. Patients with missing data and/or those who died within 90 days of the postoperative follow-up period were excluded. Multivariate linear regression modeling was performed to assess the independent marginal cost impact of DRG, gender, age, state, procedure-level factors (including cause/indication of surgery), and comorbidities on total 90-day reimbursement. RESULTS: Following application of inclusion/exclusion criteria, a total of 12,419 cervical fusions were included. The average 90-day reimbursement for each DRG group was as follows: (1) DRG-471=$ 54,314 +/-$32,643, (2) DRG-472=$28,535 +/-$17,271, and (3) DRG-473=$18,492 +/-$10,706. The risk-adjusted 90-day reimbursement of a nongeriatric (age < 65) female, with no major comorbidities, undergoing a primary 1- to 3-level anterior cervical fusion for degenerative cervical spine disease was $14,924 +/-$753. Male gender (+$922) and age 70 to 84 (+$1,007 to +$2,431) was associated with significant marginal increases in 90-day reimbursements. Undergoing upper cervical surgery (-$1,678) had a negative marginal cost impact. Among other procedure-level factors, posterior approach (+$3,164), >3 level fusion (+$2,561), interbody (+$667), use of intra-operative neuromonitoring (+$1,018), concurrent decompression/laminectomy (+$1,657), and undergoing fusion for cervical fracture (+$3,530) were associated higher 90-day reimbursements. Severe individual comorbidities were associated with higher 90-day reimbursements, with malnutrition (+$15,536), CVA/stroke (+$6,982), drug abuse/dependence (+$5,059), hypercoagulopathy (+$5,436), and chronic kidney disease (+$4,925) having the highest marginal cost impacts. Significant state-level variation was noted, with Maryland (+$8,790), Alaska (+$6,410), Massachusetts (+$6,389), California (+$5,603), and New Mexico (+$5,530) having the highest reimbursements and Puerto Rico (-$7,492) and Iowa (-$3,393) having the lowest reimbursements, as compared with Michigan. CONCLUSIONS: The current cervical fusion bundled payment model fails to employ a robust risk adjustment of prices resulting in the large amount of cost variation seen within 90-day reimbursements. Under the proposed DRG-based risk adjustment model, providers would be reimbursed the same amount for cervical fusions regardless of the surgical approach (posterior vs. anterior), the extent of fusion, use of adjunct procedures (decompressions), and cause/indication of surgery (fracture vs. degenerative pathology), despite each of these factors having different resource utilization and associated reimbursements. Our findings suggest that defining payments based on DRG codes only is an imperfect way of employing bundled payments for spinal fusions and will only end up creating major financial disincentives and barriers to access of care in the healthcare system. (C) 2019 Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9052609ece07438e18daeb7d7a696b21",
  "timestamp": "2025-05-16T17:50:25.566879"
}