{
  "id": 3123,
  "title": "Recent innovations in long-term care coverage and financing: a rapid scoping review",
  "abstract": "Objectives To identify, chart and analyse the literature on recent initiatives to improve long-term care (LTC) coverage, financial protection and financial sustainability for persons aged 60 and older.Design Rapid scoping review.Data sources Four databases and four sources of grey literature were searched for reports published between 2017 and 2022. After using a supervised machine learning tool to rank titles and abstracts, two reviewers independently screened sources against inclusion criteria.Eligibility criteria Studies published from 2017-2022 in any language that captured recent LTC initiatives for people aged 60 and older, involved evaluation and directly addressed financing were included.Data extraction and analysis Data were extracted using a form designed to answer the review questions and analysed using descriptive qualitative content analysis, with data categorised according to a prespecified framework to capture the outcomes of interest.Results Of 24 reports, 22 were published in peer-reviewed journals, and two were grey literature sources. Study designs included quasi-experimental study, policy analysis or comparison, qualitative description, comparative case study, cross-sectional study, systematic literature review, economic evaluation and survey. Studies addressed coverage based on the level of disability, income, rural/urban residence, employment and citizenship. Studies also addressed financial protection, including out-of-pocket (OOP) expenditures, copayments and risk of poverty related to costs of care. The reports addressed challenges to financial sustainability such as lack of service coordination and system integration, insufficient economic development and inadequate funding models.Conclusions Initiatives where LTC insurance is mandatory and accompanied by commensurate funding are situated to facilitate ageing in place. Efforts to expand population coverage are common across the initiatives, with the potential for wider economic benefits. Initiatives that enable older people to access the services needed while avoiding OOP-induced poverty contribute to improved health and well-being. Preserving health in older people longer may alleviate downstream costs and contribute to financial sustainability.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "905660931e55997805c750c1a618a500",
  "timestamp": "2025-05-15T02:22:56.677842"
}