{
  "id": 4738,
  "title": "Does gender diversity on boards reduce the likelihood of financial distress? Evidence from Malaysia",
  "abstract": "Purpose The purpose of this paper is to examine the impact of board gender diversity on firm financial distress for a sample of 367 non-financial firms listed on Bursa Malaysia over the period from 2011 to 2019. Design/methodology/approach The study employs both panel logistic regression and dynamic generalized method of moments estimator to determine the impact of board gender diversity on the likelihood of financial distress. Altman Z-score model is used as a proxy for financial distress indicator. The bigger the Z-score, the smaller the risk of financial distress. Findings The results show that board gender diversity could help to improve board effectiveness by preventing corporations from being too exposed to financial distress and bankruptcy. In particular, whether they are independent or inside members, women directors are likely to reduce the likelihood of financial distress. The results also show that the effect of female directors on the likelihood of financial distress is strengthened through more board independence. The results are consistent with those in prior research that documents the benefits of board gender diversity. Practical implications This paper provides insights for corporate decision makers in emerging economies, helping them to determine the board's design in terms of roles and composition that promote governance practices and prevent financial troubles. Furthermore, the findings of this study may be useful regulators as they shed light on the importance to undertake measures and reforms to promote board effectiveness by the introduction of gender diversity. Finally, this study also offers implications for society in general, considering that the practice of enhancing board gender diversity can significantly safeguard the interest of a wide range of stakeholders by reducing the chances of corporate bankruptcy. Originality/value While prior research has examined the effect of board gender diversity on firm performance, this study is the first to investigate the effect of board gender diversity on the likelihood of financial distress in Malaysia.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9058fb404a19bae0d7b65e34116b4a96",
  "timestamp": "2025-05-15T02:40:27.955723"
}