{
  "id": 5661,
  "title": "Catastrophic health expenditure associated with non-inpatient costs among middle-aged and older individuals in China",
  "abstract": "Background Since their establishment, the two predominant social health insurance schemes in China, Urban Employee Medical Insurance (UEMIS) and Urban and Rural Residents' Medical Insurance (URRMS), have primarily focused on covering non-inpatient expenditure, while costs associated with outpatient care and pharmaceutical purchases have been largely excluded from the insurance benefit package. This study intends to analyze the distribution of non-hospitalization expenditure and assess resulting financial risks, with an objective to reform the health insurance benefit package by including coverage for non-hospitalization costs.Methods The primary data were obtained from the 2018 wave of CHARLS, encompassing a total of 12942 individuals for analysis. Assess the financial risk associated with non-hospitalization expenses through catastrophic health expenditures (CHE) and examine the determinants of CHE using logistic regression analysis.Results Over 60% of the participants availed non-inpatient services in the month preceding the investigation. A smaller proportion (14.26 and 14.28% for UEMIS and URRMS enrollee, respectively) utilized outpatient services provided by medical institutions, while a larger proportion (54.20 and 56.91% for UEMIS and URRMS enrollee, respectively) purchased medication from pharmacies. The study reveals a distinct subgroup of participants (8.91 and 6.82% for UEMIS and URRMS enrollee, respectively) who incurs substantial out-of-pocket non-inpatient expenditure, surpassing 1,000 RMB per month. However, reimbursement for non-inpatient expenditures is significantly limited under the two predominant health insurance schemes, and there is minimal disparity in the distribution of non-inpatient expenses before and after insurance reimbursement. The prevalence of CHE resulting from non-inpatient costs was substantial, particularly among participants enrolled in URRMS (25.06%) compared to those enrolled in UEMIS (14.26%). The presence of chronic diseases, advanced age, and limited financial resources are all determinants contributing to the occurrence of CHE.Conclusion The incorporation of non-inpatient expenses into China's fundamental health insurance plan remains a contentious issue, given the limited available evidence. This study presents empirical evidence underscoring the significance of non-inpatient expenditures as a determinant of financial risk, thereby emphasizing the imperative to adjust China's fundamental health insurance benefit package in order to address risks associated with non-inpatient costs, particularly among individuals with chronic illnesses and limited income.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9058bd5768ac95ff309e93ec5e3fe5e9",
  "timestamp": "2025-05-15T02:49:50.402949"
}