{
  "id": 7737,
  "title": "Violent behaviour and post-traumatic stress disorder in US Iraq and Afghanistan veterans",
  "abstract": "Background Violence towards others in the community has been identified as a significant problem for a subset of Iraq and Afghanistan veterans. Aims To investigate the extent to which post-traumatic stress disorder (PTSD) and other risk factors predict future violent behaviour in military veterans. Method A national, multiwave survey enrolling a random sample of all US veterans who served in the military after 11 September 2001 was conducted. A total of 1090 veterans from 50 US states and all military branches completed two survey waves mailed 1 year apart (retention rate=79%). Results Overall, 9% endorsed engaging in severe violence and 26% in other physical aggression in the previous year, as measured at Wave 2. Younger age, financial instability, history of violence before military service, higher combat exposure, PTSD, and alcohol misuse at Wave 1 were significantly associated with higher severe violence and other physical aggression in the past year at Wave 2. When combinations of these risk factors were present, predicted probability of violence in veterans rose sharply. Veterans with both PTSD and alcohol misuse had a substantially higher rate of subsequent severe violence (35.9%) compared with veterans with alcohol misuse without PTSD (10.6%), PTSD without alcohol misuse (10.0%) or neither PTSD nor alcohol misuse (5.3%). Using multiple regression, we found that veterans with PTSD and without alcohol misuse were not at significantly higher risk of severe violence than veterans with neither PTSD nor alcohol misuse. There was a trend for other physical aggression to be higher in veterans with PTSD without alcohol misuse. Conclusions Co-occurring PTSD and alcohol misuse was associated with a marked increase in violence and aggression in veterans. Compared with veterans with neither PTSD nor alcohol misuse, veterans with PTSD and no alcohol misuse were not significantly more likely to be severely violent and were only marginally more likely to engage in other physical aggression. Attention to cumulative effects of multiple risk factors beyond diagnosis - including demographics, violence history, combat exposure, and veterans' having money to cover basic needs like food, shelter, transportation, and medical care - is crucial for optimising violence risk management.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "905d64e65c39e0b7cbaca59908532134",
  "timestamp": "2025-05-15T03:11:38.536834"
}