{
  "id": 8285,
  "title": "Income related inequality and influencing factors: a study for the incidence of catastrophic health expenditure in rural China",
  "abstract": "Background: Catastrophic health expenditure (CHE) puts a heavy disease burden on patients' families, aggravating income-related inequality. In an attempt to reduce the financial risks of rural families incurring CHE, China began the New Rural Cooperative Medical System (NCMS) on a trial basis in 2003 and has raised the reimbursement rates continuously since then. Based on statistical data about rural families in sample area of Jiangsu province, this study measures the incidence of CHE, analyzes socioeconomic inequality related to CHE, and explores the influences of the NCMS on the incidence of CHE. Methods: Statistical data were acquired from two surveys about rural health care, one conducted in 2009 and one conducted in 2010. In 2009, 1424 rural families were analyzed; in 2010, 1796 rural families were analyzed. An index of CHE is created to enable the evaluation of the associated financial risks. The concentration index and concentration curve are used to measure the income-related inequality involved in CHE. Multiple logistic regression is utilized to explore the factors that influence the incidence of CHE. Results: The incidence of CHE decreased from 13.62% in 2009 to 7.74% in 2010. The concentration index of CHE was changed from -0.298 (2009) to -0.323 (2010). Compared with rural families in which all members were covered by the NCMS, rural families in which some members were not covered by the NCMS had a lower incidence of CHE: The odds ratio is 0.65 with a 95% confidence interval of 0.43 to 1.00. For rural families in which all members were covered by the NCMS, the increase in reimbursement rates is correlated to the decline in the incidence of CHE if other influencing factors were controlled: The odds ratio is 0.48 with a 95% confidence interval of 0.36 to 0.64. Conclusions: Between 2009 and 2010, the incidence rate of CHE in the sampled area decreased sharply, CHE was more concentrated among least wealthy and inequality increased during study period. As of 2010, the poorest rural families still had high risk of experiencing CHE. For rural families in which all members are covered by the NCMS, the rise in reimbursement rates reduces the probability of experiencing CHE.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "907cba52c360bdcb6019d1bac7666ffc",
  "timestamp": "2025-05-15T03:17:21.535328"
}