{
  "id": 7785,
  "title": "Drivers of moral hazard in banks",
  "abstract": "The objective of this research is to identify factors that determine the moral hazard in banks by using discrete choice models (probit and logit regression). A specially constructed indicator was used to quantitatively assess moral hazard as the average difference between the better rating of a client in a bank and the most conservative rating of the same client in the banking sector. This is an example where moral hazard manifests itself as the tendency of management in banks to underestimate credit risk. The results showed that state-owned banks and foreign privately-owned banks with evident problems at the level of their headquarters had higher values of this quantitative indicator of moral hazard. Also, banks whose financial result and capital are highly sensitive to a small increase in non-performing loans, as well as banks that at any time in the observed period had a problem with meeting regulatory capital requirements, showed a greater propensity to moral hazard, as measured by this indicator. In the above cases, in the absence of quality corporate governance, management in banks tends to show performance better than it actually is. The obtained results for Serbia in comparison with the previous research give the possibility to quantitatively confirm additional specific factors important for explaining moral hazard (composite variable of the type of ownership and capital restrictions, variables that perform only the transmission of certain forms of management behaviour, size, capital and profit sensitivity, credit risk level, etc.), in addition to the common factors of moral hazard, such as the type of ownership in the bank, capital restrictions, etc.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "908afb6b20175d5575e9af92a49c112a",
  "timestamp": "2025-05-15T03:12:11.599565"
}