{
  "id": 6951,
  "title": "Corneal Neovascularization as a Risk Factor for Graft Failure and Rejection after Keratoplasty An Evidence-Based Meta-analysis",
  "abstract": "Topic: Preoperative corneal neovascularization (CNV) is thought to be associated with an increased rate of corneal graft failure and potentially also graft rejection. Clinical Relevance: New therapeutic options that offer differential influence on the ingrowths or regression of either corneal blood or lymphatic vessels force us to re-evaluate the known data about the role of CNV in keratoplasty. Methods: Electronic databases and corneal registries were searched (up through September 2008). Results were reported both descriptively for each study and using random effects meta-analysis. Potential moderating factors for the association between vascularization and graft failure and rejection were examined using metaregression analysis. Results: Nineteen studies reporting on a total of 24 944 grafts undergoing keratoplasty were included. An increase in the risk of graft failure and rejection in the presence of pathologic CNV was seen in studies with a pooled risk ratio of 1.32 (95% confidence interval [CI], 1.15-1.49) for graft failure and 2.07 (95% CI, 0.98-3.15) for graft rejection. There was evidence of incremental increase of risk for graft failure and rejection as more corneal quadrants were affected by neovascularization. The 2 factors predictive of increased risk of neovascularization and graft failure were increased recipient age (P = 0.003) and male gender (P = 0.046). Conclusions: Graft failure and rejection risk increase with an increasing number of corneal quadrants affected by neovascularization before keratoplasty. These data support the study of novel topical antiangiogenic therapies at the cornea to precondition such a cornea for future corneal grafting. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2010; 117: 1300-1305 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "909674fc5af05381946ec13d2c0b1bae",
  "timestamp": "2025-05-15T03:03:13.520141"
}