{
  "id": 9406,
  "title": "Determinants of banking stability in India",
  "abstract": "PurposeThis study aims to examine the various internal and external factors affecting the financial stability of Indian Commercial Banks. The aim is to improve the effectiveness of the Indian banking system in facilitating the transmission of monetary policy and to strengthen its resilience in the event of a banking crisis.Design/methodology/approachA panel data regression analysis is employed on unbalanced panel data of Indian commercial banks including public sector, private sector and foreign sector banks for the period of 2005-2022.FindingsThis study revealed that Indian banks with higher profits and high capitalization are more stable than others. However, banks with large bank size and high management costs are less stable as compared to other banks. In the case of macroeconomic variables, foreign exchange reserves have a significant positive impact on banking stability. Moreover, the unemployment rate has a significant negative impact on the banking stability of India.Research limitations/implicationsResearch identifies relevant micro and macroeconomic drivers pertaining to India's banking stability, a developing economy. These findings have significant implications and can attract the attention of analysts, regulators, bankers and academicians in this area. Nevertheless, the scope of the study is limited to the variables chosen to evaluate their contribution to banking stability, but other variables may influence Indian banking conditions.Practical implicationsIndian banks are advised by the research to place a high priority on profitability, capitalization and effective risk management. Customers and investors should choose banks with strong metrics. The priorities for policymakers should be preserving robust reserves and tackling unemployment with focused initiatives. Adopting digitalization can improve banks' customer service and operational effectiveness, which is important for overcoming economic obstacles. These tactics provide doable measures to improve the resilience and stability of the banking industry in India and other emerging nations.Originality/valueThis research differentiates from the rest by focusing solely on the Indian banking system, in contrast to previous ones that often treated India as part of a bigger part like the BRICS or South Asia continent. It acknowledges the need to comprehending the unique traits and difficulties faced by the Indian banking system. Moreover, the current study distinguishes itself by focusing on the combined impact of microeconomic and macroeconomic indicators in the Indian context, unlike earlier research that concentrated on assessing the effects of individual variables. The current study also investigated new variables like corporate governance and foreign exchange reserves in the context of Indian banking which have not been explored by existing literature. Research is also crucial in the context of the analysis's time frame, since it captures the period of economic transformation that included demonization, implementation of GST, major mergers and global COVID-19 pandemic.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "90acd7913ce6ce3101c2056334efae10",
  "timestamp": "2025-05-15T03:28:17.666829"
}