{
  "id": 9376,
  "title": "Factors associated with psychological distress, fear and coping strategies during the COVID-19 pandemic in Australia",
  "abstract": "Background The COVID-19 pandemic disrupted the personal, professional and social life of Australians with some people more impacted than others. Objectives This study aimed to identify factors associated with psychological distress, fear and coping strategies during the COVID-19 pandemic in Australia. Methods A cross-sectional online survey was conducted among residents in Australia, including patients, frontline health and other essential service workers, and community members during June 2020. Psychological distress was assessed using the Kessler Psychological Distress Scale (K10); level of fear was assessed using the Fear of COVID-19 Scale (FCV-19S); and coping strategies were assessed using the Brief Resilient Coping Scale (BRCS). Logistic regression was used to identify factors associated with the extent of psychological distress, level of fear and coping strategies while adjusting for potential confounders. Results Among 587 participants, the majority (391, 73.2%) were 30-59 years old and female (363, 61.8%). More than half (349, 59.5%) were born outside Australia and two-third (418, 71.5%) completed at least a Bachelor's degree. The majority (401, 71.5%) had a source of income, 243 (42.3%) self-identified as a frontline worker, and 335 (58.9%) reported financial impact due to COVID-19. Comorbidities such as pre-existing mental health conditions (AOR 3.13, 95% CIs 1.12-8.75), increased smoking (8.66, 1.08-69.1) and alcohol drinking (2.39, 1.05-5.47) over the last four weeks, high levels of fear (2.93, 1.83-4.67) and being female (1.74, 1.15-2.65) were associated with higher levels of psychological distress. Perceived distress due to change of employment status (4.14, 1.39-12.4), alcohol drinking (3.64, 1.54-8.58), providing care to known or suspected cases (3.64, 1.54-8.58), being female (1.56, 1.00-2.45), being 30-59 years old (2.29, 1.21-4.35) and having medium to high levels of psychological distress (2.90, 1.82-5.62) were associated with a higher level of fear; while healthcare service use in the last four weeks was associated with medium to high resilience. Conclusions This study identified individuals who were at higher risk of distress and fear during the COVID-19 pandemic specifically in the State of Victoria, Australia. Specific interventions to support the mental wellbeing of these individuals should be considered in addition to the existing resources within primary healthcare settings.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "90b8b6c41e09b2b069fc72fe3edc2971",
  "timestamp": "2025-05-15T03:28:17.558676"
}