{
  "id": 672,
  "title": "Leakage detection in natural gas pipeline based on unsupervised learning and stress perception",
  "abstract": "Natural gas pipeline leakage can cause serious financial losses to natural gas transportation and pose accidents to the environmental safety. Currently-used supervised learning methods heavily rely on sufficient pipeline failure historical data for their training. Therefore, we propose a novel detection approach based on unsupervised learning and stress perception for determining the leakage situation in pipelines. In this study, pipeline stress signals are first acquired based on residual magnetic effect. The relationship between residual magnetic and stress is built using improved sparrow search algorithm (ISSA) and extreme learning machine (ELM). Then, the Wasserstein generative adversarial network with gradient penalty (WGAN-GP) is deployed to learn suitable features from the stress signals under the pipeline normal condition, generating high-quality stress data features. Finally, the generated stress features are supplied to the Bayesian Gaussian mixture model (BGMM). And the weighted logarithm probability (WLP) is used as the health indicator for examining pipeline status. The results demonstrate that the relative error of residual magnetic stress model is controlled within 3 %, and the WLP value of fault samples is smaller than -100, so that the proposed method can discriminate the normal and leak conditions as well as the risk and severity of leakage. This study provides a theoretical basis and new perspective for pipeline leakage detection.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "90c2b926a00cee059ab8a588ce5573f4",
  "timestamp": "2025-05-15T01:53:59.303744"
}