{
  "id": 1894,
  "title": "APPLICATION OF THE RANDOM SURVIVAL FORESTS METHOD IN THE BANKRUPTCY PREDICTION FOR SMALL AND MEDIUM ENTERPRISES",
  "abstract": "Credit risk is considered to be a key risk in banking activity. The statistical and data mining models used during the assessment process of the SMEs' credit risk are mainly based on the financial data sourced from the financial statements. However, in the case of small and medium enterprises (SMEs), the non-financial factors seem to play a significant role when assessing the credit risk and this is the reason why the most frequently used ones will be discussed. The purpose of this paper was to check whether the inclusion of the non-financial factors (such as the age of the company, branch, location, legal form and number of employees) improves the prediction of the credit risk model. The combination of non-financial factors and financial ratios will be presented. During the model building process, the Random Survival Forests (RSF) method was applied. The results of the model were compared with those received using the single semiparametric Cox regression survival model. In the analysis the authors used a data sample consisting of 806 companies, including 312 bankruptcies, provided by financial institutions operating in the Polish market. Random Survival Forests provided not only better results but also more stable ones than the semiparametric Cox regression survival model.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "90ca4cbfb9c3f5e79c4a111966683d36",
  "timestamp": "2025-05-15T02:08:39.061177"
}