{
  "id": 1571,
  "title": "Cost-effectiveness of Prophylactic Laser Peripheral Iridotomy in Primary Angle-Closure Suspects",
  "abstract": "Purpose: To investigate the cost-effectiveness (CE) of prophylactic laser peripheral iridotomy (LPI) in primary angle-closure (PCA) suspects (PACSs). Design: Cost-effectiveness analysis utilizing Markov models. Subjects: Patients with narrow angles (PACSs). Methods: Progression from PACSs through 4 states (PCA, PCA glaucoma, blindness, and death) was simulated using Markov cycles. The cohort entered at 50 years and received either LPI or no treatment. Transition probabilities were calculated from published models, and risk reduction of LPI was calculated from the Zhongshan Angle Closure Prevention trial. We estimated costs of Medicare rates, and previously published utility values were used to calculate quality-adjusted life year (QALY). Incremental CE ratios (ICER) were evaluated at $50 000. Probabilistic sensitivity analyses (PSAs) addressed uncertainty. Main Outcome Measures: Total cost, QALY, and ICER. Results: Over 2 years, the ICER for the LPI cohort was > $50 000. At 6 years, the LPI cohort was less expensive with more accrued QALY. In PSA, the LPI arm was cost-effective in 24.65% of iterations over 2 years and 92.69% over 6 years. The most sensitive parameters were probability of progressing to PCA and cost and number of annual office visits. Conclusions: By 6 years, prophylactic LPI was cost-effective. The rate of progressing to PCA and differing practice patterns most impacted CE. With uncertainty of management of narrow angles, cost may be a decision management tool for providers. Financial Disclosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology Glaucoma 2023;6:332-341 2023 Published by Elsevier Inc. on behalf of the American Academy of Ophthalmology",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "90cb5926ed5355d9e089147fda96c186",
  "timestamp": "2025-05-15T02:05:08.095486"
}