{
  "id": 8419,
  "title": "Effects of livestock loss and emerging livestock types on livelihood decisions around protected areas: Case studies from China and India",
  "abstract": "Increasing livestock grazing in forests has intensified human-wildlife conflicts and caused habitat degradation for threatened species. To balance conservation and local community development, it is crucial to understand if livestock loss in natural habitats plays a role in household livelihood decisions. We used the giant panda habitat in China and the tiger habitat in India as case studies to investigate if livestock loss impacts livestock holding size and if higher loss rate shifts households away from livestock grazing in the future. We applied negative binomial regression and cost-benefit analysis to household level data from 281 Chinese households and 369 Indian households. We found that the livestock loss rate did not impact the number of livestock in China, but it did negatively impact the number of livestock in India. Chinese households were more constrained by labor availability for livestock expansion, while Indian households were limited by financial capacity. However, households tended to ignore the potential livestock loss in future livelihood decisions for both landscapes. Emerging livestock types could change the dynamic and the Indian case indicates a possible win-win solution. New hybrid cattle produced more than seven times the net benefit, but with only 46% potential cost of livestock loss compared to traditional cattle. Therefore, households can simultaneously produce more profits and reduce livestock loss by shifting to hybrid cattle. As higher profit is more important than perceived livestock loss risk in deciding the livelihood practices, better market instruments and assistance should be provided to promote the change.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "90ef9a33556a4a4921db4d90720f330e",
  "timestamp": "2025-05-15T03:18:51.539305"
}