{
  "id": 6080,
  "title": "Investigating membership attrition dynamics in community-based health insurance: a survival analysis of socioeconomic and program-specific determinants in the Amhara Region, Northwest Ethiopia",
  "abstract": "Background Despite substantial growth and increased enrollment in Ethiopia's CBHI program, achieving universal coverage and retaining members remain challenging. This study, however, focuses on the persistent issue of dropout rates, which threaten the program's sustainability, while previous research has often focused on enrollment. Method The dependent variable istime to membership attrition,defined as an event Dropout,with independent variables including socioeconomic and program factors. Using Cochran's formula, data were collected from 772 (208 failure) respondents across five administrative zones. Analysis was performed using Kaplan-Meier estimation, Cox Regression, and the Weibull AFT Model. Result Dropout rates peaked at an average membership duration of 4.09 years, with increasing hazard rates (Weibull shape parameter = 2.077, p < 0.001). The Kaplan-Meier analysis indicates safety net beneficiaries had a lower dropout rate (67.8%) than non-beneficiaries (76.6%) and longer survival (Chi-square = 4.083, p = 0.043). Respondents with 4-6 hectares had the shortest survival (5.88 years) and a higher dropout risk (B = 0.417, p = 0.042), while non-landowners had a higher attrition risk (HR = 1.266, p = 0.814), Farm owners had a lower dropout rate (70.7%) (Chi-square = 1.569, p = 0.021). Lower-middle-income members had a higher attrition risk (HR = 1.999, p = 0.042) with a mean survival of 6.28 years, compared to 6.47 years for upper-middle-income. Perceived healthcare quality influenced dropout risk, increasing it by 5.9% for fair quality than poor (HR = 3.368, p < 0.000), and significantly for good quality as well (HR = 2.284, p < 0.000). Moderate financial protection (not catastrophic spending) increased dropout risk by 7.3% compared to high protection (HR = 1.125, p = 0.040). Conclusion Dropout rates peak in the early years of membership and increase over time. Enrolling in safety nets and having smaller land sizes enhanced retention rates, while extensive landholdings and being classified as Lower-Middle Income led to higher dropout rates; however, ownership of modern amenities had minimal impact on retention. Perceived healthcare quality and financial protection significantly influence CBHI retention, while program service quality has little effect, underscoring the need for policies that prioritize improving service quality, accessibility, and affordability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9115dddb0169eebec28222cd3d6e4275",
  "timestamp": "2025-05-15T02:54:38.776430"
}