{
  "id": 3777,
  "title": "On the importance of the long-term seasonal component in day-ahead electricity price forecasting Part II - Probabilistic forecasting",
  "abstract": "A recent electricity price forecasting study has shown that the Seasonal Component AutoRegressive (SCAR) modeling framework, which consists of decomposing a series of spot prices into a trend-seasonal and a stochastic component, modeling them independently and then combining their forecasts, can yield more accurate point predictions than an approach in which the same autoregressive model is calibrated to the prices themselves. Here, we show that further accuracy gains can be achieved when the explanatory variables (load forecasts) are deseasonalized as well. More importantly, considering a novel extension of the SCAR concept to probabilistic forecasting and applying two methods of combining predictive distributions, we find that (i) SCAR-type models nearly always significantly outperform the autoregressive benchmark but are in turn outperformed by combined SCAR forecasts, (ii) predictive distributions computed using Quantile Regression Averaging (QRA) outperform those obtained from historical simulation and bootstrap methods, and (iii) averaging over predictive distributions generally yields better probabilistic forecasts of electricity spot prices than averaging over quantiles. Given that probabilistic forecasting is a concept closely related to risk management, our study has important implications for risk officers and portfolio managers in the power sector. (C) 2018 Elsevier B.V. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91187a3f469c9f84d5506f612d0553a5",
  "timestamp": "2025-05-15T01:20:36.109498"
}