{
  "id": 2292,
  "title": "DETERMINANTS OF STUDENT FINANCIAL RISK TOLERANCE: A SURVEY APPROACH",
  "abstract": "Financial risk tolerance affects financial decisions of individuals, from day-to-day personal finance management to long-term investment decisions. Financial risk tolerance is an individual characteristic of each financial market participant. Awareness of individual risk tolerance provides the opportunity of selecting suitable financial products and investment strategies. This field draws attention of wide scientific and professional community, but still without general conclusion. The assessment of risk tolerance is also subject of various financial studies that have considered the structure of the individual investor's portfolio and his risk tolerance. They also tested different demographic, social and psychological characteristics and their interdependence to risk tolerance. This paper studies the factors that might affect the risk tolerance among students in Croatia. The research considers the influence of socio-demographic characteristics, financial literacy, field of study and student level of education to risk tolerance on the convenience sample of students. The survey was conducted among 458 students, of which 238 students were from the Catholic University of Croatia and 220 students from the Faculty of Economics and Business, University of Zagreb. Regression analysis results indicated that risk tolerance is associated with gender, field of study and financial literacy. In addition, findings suggest that students in field of economy are characterized by higher risk tolerance than students in other fields of study. Furthermore, the discussion in the paper addresses the factors that influence the identified level of student risk tolerance. This research indicates the importance of deepening financial literacy among students with the intention to raise awareness about the existence of different types of financial risks and to recognize their inherent risk tolerance. Understanding the personal characteristics of each investor contributes to the selection of suitable portfolio of financial products and services that corresponds to his personal preferences and investment strategy with regard to time horizon concerning short and long-term goals.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9127163f77c282f40ed7529a082cab4e",
  "timestamp": "2025-05-15T02:13:31.854216"
}