{
  "id": 699,
  "title": "Strategic framework for natural disaster risk mitigation using deep learning and cost-benefit analysis",
  "abstract": "Given trends in more frequent and severe natural disaster events, developing effective risk mitigation strategies is crucial to reduce negative economic impacts, due to the limited budget for rehabilitation. To address this need, this study aims to develop a strategic framework for natural disaster risk mitigation, highlighting two different strategic implementation processes (SIPs). SIP-1 is intended to improve the predictability of natural disaster-triggered financial losses using deep learning. To demonstrate SIP-1, SIP-1 explores deep neural networks (DNNs) that learn storm and flood insurance loss ratios associated with selected major indicators and then develops an optimal DNN model. SIP-2 underlines the risk mitigation strategy at the project level, by adopting a cost-benefit analysis method that quantifies the cost effectiveness of disaster prevention projects. In SIP-2, a case study of disaster risk reservoir projects in South Korea was adopted. The validated result of SIP-1 confirmed that the predictability of the developed DNN is more accurate and reliable than a traditional parametric model, while SIP-2 revealed that maintenance projects are economically more beneficial in the long term as the loss amount becomes smaller after 8 years, coupled with the investment in the projects. The proposed framework is unique as it provides a combinational approach to mitigating economic damages caused by natural disasters at both financial loss and project levels. This study is its first kind and will help practitioners quantify the loss from natural disasters, while allowing them to evaluate the cost effectiveness of risk reduction projects through a holistic approach.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "912fff2580abd99f88dc8469bdb5bc68",
  "timestamp": "2025-05-15T01:41:29.871353"
}