{
  "id": 4075,
  "title": "Both Sides of the Coin: Developing a Multi-stage Rights Model to Classify Crypto-assets under the Corporations Act",
  "abstract": "In order to establish Australia as an economic hub for fintech, the Australian Government is reviewing the classification of crypto-assets for regulatory purposes. A crypto-asset is a digital representation of value which operates on a blockchain. There are many uses for crypto-assets outside of cryptocurrencies, including as coupon-like assets which offer utility within a network. These utility tokens, generally do not offer the token-holder any rights to financial benefits. Despite this, investors may be exposed to financial risk if they purchase utility tokens through an Initial Coin Offering (ICO) with the hopes that they will appreciate in value. Whether these assets should be subject to financial markets law is therefore uncertain. ASIC has stated in Information Sheet 225 that utility tokens will be interests in a managed investment scheme if they are sold through an ICO. If so, they will be considered financial products under Chapter 7 of the Corporations Act, and be subject to ongoing disclosure and compliance requirements that may make decentralisation impossible. This policy will undoubtedly hinder developers' ability to innovate in Australia. This article's purpose is thus to develop a framework for classifying tokens which protects investors without jeopardising Australia's ability to attract fintech innovation.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "913cfdde26d192ab25eb285cd704a915",
  "timestamp": "2025-05-15T02:33:03.372561"
}