{
  "id": 2834,
  "title": "Effect of Change in Surplus Ratio, Incurred Loss Ratio, Liquidity Ratio, Premium Growth Ratio, Size and Risk Based Capital to Predict the Possibilities of Financial Distress: The Case of Indonesian Non-Life Insurance Listed in Indonesia Insurance Directory",
  "abstract": "The insurance company has different characteristics with other companies, so that the performance appraisal of insurance company use specific ratios created by The National Association of Insurance Commissioners (NAIC). The aim of this study was to examine the effect of financial ratios of insurance company, namely change in surplus ratio, incurred loss ratio, liquidity ratio, premium growth, size and risk based capital ratio (RBC) to forecast the possibility of financial distress, a deteriorating financial condition prior to the bankruptcy of general insurance companies registered in Indonesia Insurance Directory in the period of 2010-2014. The insurance companies experiencing financial distress is determined based on negative net profit for two consecutive years. By using purposive sampling, 63 samples of insurance companies, 53 companies experiencing non-financial distress, 10 companies experiencing financial distress was obtained. The method used in this study was logistic regression. The result indicated that the variable of incurred loss ratio, liquidity (liabilities to liquid asset) ratio has positive and significant effect on the occurrence of financial distress. Size variable has a negative and significant effect on the occurrence of financial distress, while change in surplus ratio, premium growth ratio and risk based capital ratio have no significant effect on the insurance company's financial distress.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "914cb826b52308e928a21de4b501ec46",
  "timestamp": "2025-05-15T02:19:46.641842"
}