{
  "id": 671,
  "title": "The analysis of influence mechanism for internet financial fraud identification and user behavior based on machine learning approaches",
  "abstract": "The study is to explore the risks in the Internet finance and the factors affecting users' behavior under the background of big data. First, the risks of the Internet finance under the background of big data and the existing risk control modes are analyzed. Then, based on BP neural network (BPNN), an Internet financial fraud identification model is constructed, and corresponding touch rules are made. Its prediction performance is quantitatively compared with that of support vector machine and random forest algorithm. Finally, based on the structural equation model, the influence path of perceived security control on the Internet financial behavior is explored. The results show that, the applicants whose unit addresses are on blacklist have the highest touch fraud rate (14.16%). The precision rate (88.14%), accuracy rate (96.37%), recall rate (70.96%), and F-Score value (16.36) of the financial fraud identification model based on BPNN are the highest versus the other two algorithms, and the error detection rate (7.19%) is the lowest. The perceived security, identity authentication, non-repudiation of transactions, privacy protection, and control strength of data integrity positively affect users' trust, which further positively affects the attitude and intention of using the Internet finance, and the intention eventually affects users' behavior. Finally, some suggestions are put forward to improve the supervision of the Internet finance in China. To sum up, the Internet financial fraud identification model based on BPNN demonstrates satisfying performance and is worth of promotion. Additionally, the authentication technology, non-repudiation of transactions, privacy protection, data integrity, and users' sense of trust of the Internet finance have a significant impact on users' behavior.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91547aabf2cad14181c5b2857d64c084",
  "timestamp": "2025-05-15T01:53:59.301149"
}