{
  "id": 6191,
  "title": "The impact of multiple chronic diseases on hospitalizations for ambulatory care sensitive conditions",
  "abstract": "Background: The high financial burden of avoidable hospitalizations has led to an increase of the study of hospitalizations for ambulatory care sensitive conditions (ACSC). There is limited information on the impact of secondary diagnoses on these hospitalizations, although patients' social and demographic characteristics, as well as the coexistence of multiple diseases are often identified in the literature as risk factors for avoidable hospitalizations. This study explores the impact of chronic conditions on the likelihood of hospitalizations for ACSC. Methods: Data were extracted from the Portuguese hospital discharge database. Avoidable hospitalizations were identified according to the Canadian Institute for Healthcare Information, and chronic conditions were identified according to criteria set by the Agency for Healthcare Research and Quality. A retrospective study analysing all patients hospitalized for an ACSC and all patients hospitalized for non-ACSC was made, using multiple logistic regression models to identify the impact of chronic conditions on the risk of admission. Results: The risk of an avoidable hospitalization increases by a factor of 1.35 (95 % CI [1.34; 1.35]) for each additional chronic condition, and 1.55 (95 % CI [1.55; 1.56]) for each additional body system affected. The respiratory and circulatory systems have the most impact on the risk of ACSC, increasing the risk by 8.72 (95 % CI [8.58; 8.86]) and 3.01 (95 % CI [2.95; 3.06]), respectively. Conclusions: The number of chronic conditions and the body systems affected increase the risk of hospital admissions for ACSC.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9156406a1b0e3b3577f8cda8a1d2aff5",
  "timestamp": "2025-05-15T02:55:44.564500"
}