{
  "id": 4594,
  "title": "The impact of green finance and FinTech mechanisms on financial stability: evidence from advanced and emerging economies",
  "abstract": "PurposeThis study aims to examine the dynamic effect of FinTech on financial stability, with the moderating role of green finance (GF), its dimensions and mechanisms in the context of the spillover effects of the COVID-19 shock. This study used balanced panel data from 148 countries, including 76 developed and 72 emerging nations, from 2005 to 2022.Design/methodology/approachThe research utilized the dynamic two-step system (GMM), and robustness was performed with the bootstrapped panel quantile regression.FindingsThe findings reveal that FinTech significantly affects financial stability across the entire sample. The overall composite of GF boosts financial stability by improving financial soundness. The GF dimensions, such as environmental, resource and financial, positively influence FS, while the GF economic dimension hurts FS. The moderating role and all interaction terms of GF dimensions with FinTech contribute positively and significantly to FS. While the interaction term GF resources with FinTech negatively impacts FS, indicating that countries should utilize resources more efficiently. Additionally, the COVID-19 spillover effect negatively influences FS across all samples. In advanced countries, FinTech and green finance positively affect FS. In emerging countries, green finance (except for the resource dimension) and FinTech interactions enhance financial stability, (except for the environmental dimension), leading to environmental hazards from their highly intensive industrial carbon policies.Practical implicationsThe findings suggest that policymakers should prioritize promoting the adoption of initiatives related to FinTech and green finance by integrating sustainable transition finance policy frameworks to maintain stability and foster low-carbon economies for a sustainable future.Social implicationsImproved financial stability has more significant social effects, such as better investment instruments, confidence and economic growth. Policymakers can leverage these findings to establish resilient financial ecosystems, fostering sustainable economic development and decreasing the risk of financial crises.Originality/valueThis study offers novel insights into how FinTech and multi-dimensional green finance effect financial stability in advanced and emerging nations. It provides unique insights into context-specific dynamics and enhances the literature on financial stability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "916534d591f0d9e324ffbaa7d8c980e4",
  "timestamp": "2025-05-15T02:38:56.372857"
}