{
  "id": 8575,
  "title": "Association of maternal characteristics with child feeding indicators and nutritional status of children under-two years in Rural Ghana",
  "abstract": "Background Optimal nutrition during the first two years of a child's life is critical for the reduction of morbidity and mortality. In Ghana, majority of children miss out on optimal nutrition and only few (13%) of children receive a Minimum Acceptable Diet (MAD). Several studies have investigated the influence of community-level factors on infants and young children feeding (IYCF) practices. However, little is known about the influence of maternal factors on IYCF practices in rural settings. Therefore, this study assessed the influence of maternal factors on the feeding indicators and nutritional status of children aged 6-23 months in two administrative districts in Ghana. Methods Data were collected among 935 mothers who had children aged 6-23 months and accessed 21 Child Welfare Clinics within the study area. The study involved a face- to-face interview using structured questionnaires to capture maternal characteristics, dietary intake and anthropometric measurements of children. Multivariate logistic regression was used to study the association between maternal factors and child nutrition outcomes (MAD, dietary diversity score (DDS) and anthropometric indicators) using Stata 16.0 software. Results Being employed (AOR = 3.07, 95% CI: 1.71-5.49, p < 0.001) and attaining secondary or higher education (AOR = 2.86, 95% CI: 1.42-5.78, p = 0.003) were significant predictors of children receiving MAD. Similarly, having an average decision-making autonomy increased the child's odds of receiving MAD (AOR = 1.68, 95% CI: 1.02-2.76, p = 0.040). Children of mothers who attained secondary or a higher level of education (AOR = 0.59, 95% CI: 0.36 -0.97, p = 0.040) and those whose mothers were employed (AOR = 0.71, 95% CI: 0.47-1.07, p = 0.043) were associated with a reduced risk of underweight and stunting respectively. Children of mothers with average financial independence status were more likely to receive diversified meals (AOR = 1.55, 95% CI: 1.01-2.38, p = 0.045). Conclusions High educational level and being employed have positive influence on MAD, stunting and underweight of children. High decision-making power and average financial independence of mothers are good predictors of children receiving MAD. Family planning, women empowerment in decision-making, providing employment opportunities for mothers and promoting girl-child education are recommended.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91741c0e0fb814556867a310fcec0c7b",
  "timestamp": "2025-05-15T03:20:22.178161"
}