{
  "id": 6927,
  "title": "Sociodemographic inequities in dental care utilisation among governmental welfare recipients in Japan: a retrospective cohort study",
  "abstract": "Background Maintaining oral health is one of the global public health challenges. Income and out-of-pocket payments for dental care services are predictors of dental care utilisation. Although public assistance programmes guarantee income security for impoverished people, access barriers other than financial costs may cause unmet dental care needs. We aimed to explore the potential sociodemographic factors determining dental care utilisation among recipients of public assistance in Japan using linkage data of public assistance database and medical assistance claim data administered by municipalities. Methods This was a retrospective cohort study involving a sample of public assistance recipients. We extracted the recipients' sociodemographic data (age, sex, household number, employment status, nationality, disability certificates, and long-term care status) in January 2016 and observed them until December 2016 to identify incidences of dental care utilisation as outcomes. We performed a multivariable modified Poisson regression analysis with a robust standard error estimator to calculate the incidence ratio (IR) of dental care utilisation in each variable. Results We identified a total of 4497 recipients at risk. Among them, 839 recipients used dental care services. Younger age was associated with a higher incidence of dental care utilisation. The female recipients had a higher incidence of dental care utilisation when compared to the male ones (adjusted IR, 1.22; 95% confidence interval [CI], 1.08-1.38). Immigrant recipients had a higher incidence of dental care utilisation than the Japanese ones (IR, 1.53; 95% CI, 1.16-2.01). Recipients with mental disabilities had higher incidences than those without disability certificates (IR, 1.30; 95% CI, 1.08-1.56). Conclusions Non-financial sociodemographic inequities in dental care utilisation stemming from age, sex, nationality, and presence of mental disability were found despite minimum income protection and equitable financial dental service access amongst public assistance recipients in Japan. Providing targeted preventive care and treatments for dental care among underserved populations is required to tackle oral health inequities.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "917401a69df4be564044afad3a0fb271",
  "timestamp": "2025-05-15T03:03:13.436323"
}