{
  "id": 7001,
  "title": "Factors influencing parental functioning and satisfaction for veteran mothers during civilian transition",
  "abstract": "Objective Risk and protective factors associated with parental functioning (i.e., meeting child's emotional needs) and satisfaction (i.e., closeness) were examined among post-9/11 veteran mothers during their civilian transition. Background Post-military-separation stressors (e.g., relocation, benefit changes) can strain well-being and familial relationships. Stress, particularly in the presence of unresolved trauma from military-specific risks, can impinge upon parental functioning and satisfaction, negatively influencing child outcomes (e.g., social-emotional, academic, behavioral). Method A prospective cohort was identified from all active duty service members who separated in May-September 2016. Logistic regression analyses of surveys completed by post-9/11 veteran mothers (n = 711) assessed effects of protective (i.e., resilience) and military-specific risk factors (i.e., deployments) on parental functioning and satisfaction. Interactions between protective factors and deployments and combat (patrols and corollaries) were explored. Results Coping characteristics (e.g., healthy behaviors), absence of mental health conditions, and social supports were positively associated with parental functioning and satisfaction. Household financial security was not. Mothers who had deployed reported higher parental functioning and satisfaction. Mothers experiencing combat patrols were less likely to report high parental functioning. Conclusion Malleable protective factors positively influence parenting but do not buffer against combat exposure. Implications Interventions bolstering protective factors for veteran mothers can foster coping, reintegration, and positive child outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "918e1ba77db1729b87aba00d5fc1a8f3",
  "timestamp": "2025-05-15T03:03:55.846236"
}