{
  "id": 353,
  "title": "CNC milling cutters condition monitoring based on empirical wavelet packet decomposition",
  "abstract": "Machining is a versatile field in the manufacturing industry. In milling operations, tool wear is considered the most critical factor affecting the surface quality of the milled piece. Furthermore, the gradual tool wear impacts the milling process, leading to significant downtime, which has serious financial consequences. Unavoidably, a sustainable and reliable condition monitoring system must be developed to reduce the risk of downtime and enhance production quality. The deployment of prognostic and health management (PHM) solutions is becoming increasingly important. It is regarded as one of the main levers for monitoring tool wear status. In this paper, a novel methodology is proposed for extracting pertinent health indicators (HIs) that reflect the degradation behavior of a set of milling cutters and estimating their remaining useful lives (RULs). First, a new time-frequency signal-analysis approach, titled empirical wavelet packet decomposition (EWPD), is proposed to scrutinize the data collected via multi-sensor acquisition. This technique provides a new segmentation of the signal's Fourier spectrum, distributed on levels, to investigate a broader variety of frequency bands and enhance the traditional segmentation structure's performance. Second, a new health indicator is designed based on an innovative selection of the time-domain features computed for each frequency band over each level. Finally, the long short-term memory (LSTM) network is used to estimate the RUL of each cutter. A comparison between the suggested processing method and the wavelet packet transform (WPT) is made to support the hypothesis regarding the effectiveness of the proposed technique. Experimental outcomes seem to be satisfying.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9193f9fc2867788bb0873bbc80ae6544",
  "timestamp": "2025-05-15T01:36:59.869501"
}