{
  "id": 4462,
  "title": "Comparisons of the prevalence of and risk factors for elderly depression between urban and rural populations in Japan",
  "abstract": "Background: The aim of the present study was to investigate the differences in the prevalence of and risk factors for elderly depression between urban and rural areas in Japan and to further understanding of the features of elderly depression. Methods: A multistage, random sampling procedure and mailing method were used in urban and rural areas in Kumamoto Prefecture. A total of 2,152 participants aged 65 years and older were evaluated for depression using the Geriatric Depression Scale (GDS). Factors associated with depression were also examined. In order to assess the relationship between risk factors and subjective happiness, the Philadelphia Geriatric Center Morale Scale (PGC-MS) was used. Results: Depressive symptoms were associated with living alone, being unemployed, chronic illness, sleep disturbance, suicidal ideation, financial strain, and poor social support; the risk factors for elderly depression were almost the same in the two areas. Although three factors (financial strain, work status, and PGC-MS) were significantly associated with depression in both areas on logistic regression analysis, sleep disturbance was significant only for the urban area, and poor social support was significant only for the rural area. Conclusions: Although factors related to depression did not differ markedly between urban and rural elderly people, some risk factors differed between the two areas. Effective intervention programs for elderly depression should pay more attention to regional differences.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91966a6685a8ce960ac233990287b024",
  "timestamp": "2025-05-15T02:37:17.014645"
}