{
  "id": 801,
  "title": "Preference and Approval Models for Thai Leasing Businesses",
  "abstract": "In Thailand, the numbers of commercial and non commercial banks have increased which include leasing companies dramatically. Competition in the banking markets are severe. So the purpose of this paper is to explore which factors are important for customer preference to use service.In this paper, 48 factors are categorized by market mixed (7P) and 40 factors are categorized by criteria for credit worthiness consideration (5C's of credit). Questionaires are developed for survey. Neural network, a data mining tool, is used to develop framework for preference and approval models. However, input data is not well managed. As a result, Multivariate Adaptive Regression Splits (MARS) tool is used to solve this problem. Factors are grouped by clustering analysis and K-Means clustering. For more credible reliability, it uses cross validation which defines data 5-folds. The first model is called a preference model. It is used to predict if customer selects commercial banks, non commercial banks or leasing companies. When option is made, model would give information on the reasons. The benefit of this model is to address the strategy to any provider satisfy customer preference. The second model is an approval model. It is used to delicate risk for credit approval. Model would show suggestion, percentage of approval and financial amount.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9199e2f93b793b46a46ef7a41bd42c39",
  "timestamp": "2025-05-15T01:55:08.089022"
}