{
  "id": 5452,
  "title": "Orbital lymphoproliferative tumors: Analysis of clinical features and systemic involvement in 160 cases",
  "abstract": "Objective: To evaluate the risk for systemic lymphoma (SL) in the patients with orbital lymphoproliferative tumor (OLT). Design: Observational, retrospective case series. Participants: One hundred sixty consecutive cases with OLT. Methods: Clinical features and treatment method were collected retrospectively. Data from 106 patients without systemic disease at presentation were analyzed for their impact on the main outcome measure using univariate and multivariate regression models. Main Outcome Measure: Occurrence of SL diagnosed based on the 6 monthly systemic evaluation. Results: Of 106 patients with OLT alone, SL subsequently developed in 16% of patients and 84% patients remained free of SL. Of 17 patients in whom SL developed subsequently, 29% had marginal zone, B-cell lymphoma of the mucosa-associated lymphoid tissue (MALT) 24% had small lymphocytic lymphoma (SILL), 24% had atypical lymphoid hyperplasia (ALH), 6% each had mantle cell, follicular, and diffuse large B-cell lymphoma (DLCL). In these 17 patients, systemic disease appeared after a mean interval of 152 months, and the involved systemic sites were abdominal lymph nodes (LN) in 44% patients, pelvic LN in 40%, and head and neck LN in 31%. Of 17 patients, 53% had the same SL classification with orbital tumor and 47% had a different SL classification. Among 8 patients with different systemic and orbital lymphoma classifications, systemic SILL developed in 4 patients with orbital ALH and in 2 patients with MALT. Two patients with orbital SLL manifested systemic DLCL. Using Kaplan-Meier estimates of 106 OLT patients without systemic involvement, SL developed in 14% at 3 years, in 17% at 5 years, and in 33% at 10 years. Using Kaplan-Meier estimates of 24 patients with bilateral OLT alone, SL developed in 18% at 3 years, in 29% at 5 years, and in 72% at 10 years. In 82 patients with unilateral OLT alone, SL developed in 12% at 3, 5, and 10 years. Multivariate analysis showed that bilateral involvement at presentation was the only significant factor predictive of SL. Conclusions: Inpatients with OLT alone at presentation, SL eventually developed in 33% by 10 years in this retrospective case series. Classification of SL can be the same or different from OLT. Development of SL is significantly associated with bilateral involvement. Financial Disclosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "919a7229029bc19f3916573bf4798c7f",
  "timestamp": "2025-05-15T02:47:43.073473"
}