{
  "id": 4165,
  "title": "Authorship growth in contemporary medical literature",
  "abstract": "Objectives: The aims of this study were to investigate authorship trends among publications in high-impact, peer-reviewed specialty journals published within the last decade and to assess how publication practices differ among medical specialties. Methods: The National Institutes of Health's Portfolio Analysis platform, iCite, was queried for PubMed-indexed case reports, review articles, and original research articles published between 2005 and 2017 in 69 high-impact, clinical journals encompassing 23 medical specialties. Overall, 121,397 peer-reviewed publications were evaluated-of which, 45.1% were original research, 28.7% were review articles, and 26.3% were case reports. Multivariable regression was used to evaluate the magnitude of association of publication year on the number of authors per article by specialty and article type. Results: Original research articles have the greatest increase in authorship (0.23 more authors per article per year), as compared with review articles (0.18 authors per article per year) and case reports (0.01 authors per article per year). Twenty-two of the 23 specialties evaluated had increase in authorship in high-impact specialty journals. Specialty growth rates ranged from 0.42 authors/year (Neurology), Psychiatry (0.35 authors/year), General Surgery (0.29 authors/year), Urology (0.27 authors/year), and Pathology (0.27 authors/year). Specialties with a greater percentage of graduates entering academics had more authors per article; surgical specialties and length of residency were not found to be predictive factors. Conclusion: There has been substantial growth in the authorship bylines of contemporary medical literature, much of which cannot be explained by increased complexity or collaboration alone.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91a1e5f785323d9a4f9d32046355ba02",
  "timestamp": "2025-05-15T01:24:25.382477"
}