{
  "id": 3696,
  "title": "Non-financial variables related to governance and financial distress prediction in SMEs-evidence from Egypt",
  "abstract": "Purpose This study examines the effect of non-financial variables related to governance on the accuracy of financial distress prediction among Egyptian listed small and medium-sized enterprises (SMEs), by using the logistic regression technique. Design/methodology/approach This study used a sample of 24 Egyptian-listed SMEs in each year, totaling 120 firm observations, of which 25 were classified distressed and 95 of them non-distressed between 2014 and 2018. The variables for the study included five financial variables and thirteen non-financial variables related to governance. The models were developed using financial variables alone as well as combining financial and non-financial variables related to governance. Findings The results showed that the model with financial variables had a prediction accuracy of 91.7% , whereas models with a combination of financial and non-financial variables related to governance predict with comparatively better accuracy of 92.7 and 93.6% . Research limitations/implications Although the results seem to be conclusive, it could be noted that the non-distressed sample was not paired with the distressed sample. Other studies showed that paired samples increase the financial distress prediction rate. Furthermore, due to the small sample size, this study was unable to create a hold-out sub-sample for the accuracy test. Practical implications The proposed distress prediction model for SMEs is effective for stakeholders, including banks and other financial institutions, in the assessment of the credit risk of SMEs. Using such a model, they could better identify SMEs with a higher risk of failure in their lending decisions. Moreover, SME managers' could be interested in using such models as a tool for planning corrective action, in addition to planning and controlling current operations to avoid financial failure in the future. Originality/value This study contributes to financial distress prediction literature in different ways. First, few studies were conducted in the area of financial distress among SMEs. Second, neither of these studies was conducted within the Egyptian context, nor any of them had used non-financial variables related to governance in the prediction of financial distress among SMEs.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91ac0123f517e1add1d712ae85c063f0",
  "timestamp": "2025-05-15T02:29:00.186219"
}