{
  "id": 6418,
  "title": " Associations between maternal perceptions of social support and adolescent weight status: A longitudinal analysis ",
  "abstract": "Social support is a well -established predictor of improved physical health outcomes among adults. Establishing whether maternal social support may have an inter -generational positive impact on their child 's physical health will provide important information for developing potential interventions and policies. Elevated body mass index (BMI) is one indicator of child health that is linked to increased risk for cardiovascular disease and other morbidities later in life. There is some evidence that maternal social support is associated with improved child and adolescent weight status; however, no studies have examined whether specific aspects of social support are more impactful than others or whether support availability is differentially impactful across developmental stages. The present study examined whether maternal perceptions of specific types of social support (i.e., financial support, non -monetary instrumental support, partner emotional support, and having a close supportive contact) were associated with lower adolescent BMI z -scores using longitudinal data collected over a 15 -year period from the Future of Families and Child Wellbeing Study (n = 3146), which includes a high proportion of families experiencing socioeconomic disadvantage. Findings from linear regression models using specific types of social support measured across six waves of data collected over a 15 -year period indicated that maternal perceptions of greater financial support were associated with lower adolescent BMI z -scores at 15 years (B = -0.05, 95% CI: -0.10, -0.004, P = 0.04), while the other types of support were not. Additional timing analyses demonstrated that perceived financial support during late childhood to adolescence was associated with lower adolescent BMI z -scores (B = -0.06, 95% CI: -0.11, -0.01, P = 0.01), whereas associations between support during infancy and early childhood were not detected. Study findings provide important insights for developing interventions and policies that improve maternal social supports to benefit child health.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91ae9f96c82edf007919009f8516e998",
  "timestamp": "2025-05-15T02:58:05.581950"
}