{
  "id": 1147,
  "title": "Fuzzy Credit Risk Scoring Rules using FRvarPSO",
  "abstract": "There is consensus that the best way for reducing insolvency situations in financial institutions is through good risk management, which involves a good client selection process. In the market, there are methodologies for credit scoring, each analyzing a large number of microeconomic and/or macroeconomic variables selected mostly depending on the type of credit to be granted. Since these variables are heterogeneous, the review process carried out by credit analysts takes time. The objective of this article is to propose a solution for this problem by applying fuzzy logic to the creation of classification rules for credit granting. To achieve this, linguistic variables were used to help the analyst interpret the information available from the credit officer. The method proposed here combines the use of fuzzy logic with a neural network and a variable population optimization technique to obtain fuzzy classification rules. It was tested with three databases from financial entities in Ecuador - one credit and savings cooperative and two banks that grant various types of credits. To measure its performance, three benchmarks were used: accuracy, number of classification rules generated, and antecedent length. The results obtained indicate that the hybrid model that is proposed performs better than its previous versions due to the addition of fuzzy logic. At the end of the article, our conclusions are discussed and future research lines are suggested.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91b57ed1cf9eceee00cb2aaee59ca218",
  "timestamp": "2025-05-15T01:59:21.683650"
}