{
  "id": 5538,
  "title": "Relationship Between Social Risks and Diabetes Metrics in a US Health System",
  "abstract": "Objective: The primary aim of this cross-sectional analysis was to evaluate the association of multiple social risk domains on the attainment of a composite quality metric in patients with diabetes in a large US regional practice. Research Design and Methods: The study population included adult patients with type 2 diabetes empaneled to a family medicine clinician in Mayo Clinic Rochester or Mayo Clinic Health System. Patients met the diabetes metric (D5) if: HgbA1c < 8, Blood pressure < 140/90, statin use unless contraindicated, avoidance of tobacco use, and aspirin use if coexisting vascular disease. The D5 metric, demographic, and social risks year end 2022 data were collected from the electronic health record (EHR). A multiple logistic regression model was calculated for each social risk domain, controlling for demographic factors. Results: Among 44,010 patients with type 2 diabetes, the D5 metric was less likely to be met in those who were younger, nonwhite, rural, lower visit utilizers, or who had commercial or unknown insurance. Patients who gave high-risk answers to social risk domains of housing risk, financial risk, food insecurity, and transportation needs were significantly less likely to meet the D5 metric. Conclusions: This data reinforces the important clinical impact social risk factors have for primary care patients and highlights the need for more interventional studies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91c1987719fe4bb68ab3b15c65d7f12d",
  "timestamp": "2025-05-15T02:48:51.334294"
}