{
  "id": 2941,
  "title": "Equity index replication with standard and robust regression estimators",
  "abstract": "Approximate equity index replication, based on a linear regression setting, is critically reviewed. It is shown that tracking a performance index like the German DAX necessarily leads to violations of basic assumptions of the classical regression model. Violations occur even if the model is formulated in terms of stock price levels. When the model is based on discretely or continuously compounded returns the situation is more critical. Due to these violations, the optimality properties of the regression estimators are generally weak. In the time series context, outliers in financial time series may additionally affect the standard least squares estimator. Despite of these critical points, it is argued that regression techniques may still provide a useful tool for index replication. With respect to outliers, robust estimators can potentially provide an alternative to least squares. Hence, apart from least squares, a non-redescending and a redescending robust estimator is fitted. The empirical results for the DAX are obtained with a subset portfolio containing the most heavily weighted index members. Compared to a naive weighting scheme, the results document that least squares estimation highly improves out-of-sample replication performance. Typically, the use of robust estimators does not show replication improvements. However, when substantial market movements are present in the sample, superior replication can be obtained.",
  "year": 2000,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91cbe76193909acd008007bc090ed6a0",
  "timestamp": "2025-05-15T01:12:09.088244"
}