{
  "id": 1054,
  "title": "Cashless Japan: Unlocking Influential Risk on Mobile Payment Service",
  "abstract": "In Japan, cashless is not yet popular but government and companies are devoted to the development of mobile payment methods. This research collected 241 Japanese users and applied decision trees algorithm. Six types of perceived risks (financial, privacy, performance, psychological, security, and time) were used and the categorized class is intention to use mobile payment (low, medium, and high). We also compared different competitive models to examine the performance, including decision trees, kNN, Naive Bayes, SVM, and logistic regression and decision trees outperformed among all models. The findings indicated that privacy and performance risks are import to Japanese users. Safe, secured, reliable, and fast mobile payment environment are more important to low intention users (less concerns about financial risk). Financial loss, safe, secured, reliable, and fast mobile payment environment are more important to medium intention users (less concerns about time and security risk). Monetary loss, safe, reliable, and fast mobile payment environment are more important to high intention users (less concerns about security risk and psychological risk). The results can help Japanese companies unlock the perceived risk on mobile payment and furnish appropriate strategies to improve usage.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91cf99a631720334698dc257f5211177",
  "timestamp": "2025-05-15T01:58:08.622017"
}