{
  "id": 8003,
  "title": "Abuse of older adults before moving to old age homes in Pokhara Lekhnath Metropolitan City, Nepal: A cross-sectional study",
  "abstract": "Introduction The number of older individuals relocating from their homes to old age homes is increasing in Nepal. This study was conducted to assess the reasons why older people chose to move to old age homes, the status and forms of abuse they experienced, and the risk factors associated with their abuse before moving to old age homes. Materials and methods This study was a cross sectional study conducted among older adults currently residing in all the old age homes of Pokhara Lekhnath Metropolitan City. Complete enumeration of the respondents was done and data was collected consecutively, using a semi-structured interview schedule, from all older adults aged 60 years and above who had been living in the homes for at least a month. The total sample size was 109. The collected data was analyzed using descriptive statistics and binary logistic regression was used as an inferential statistics to determine the predictors of abuse. Results A majority of the respondents (56.0%) came to old age homes on their own volition, 24.7% reported that they came to the homes because they were physically weak and they had no one to care for them at their residence, while 11% reported that they were forcefully sent by their caregivers. Out of total respondents, 60.6% reported that they experienced some form of abuse before they came to the old age home: most frequent was caregiver neglect (34.9%) and verbal abuse (34.9%), while few experienced financial abuse (2.8%). Women were at a higher risk of abuse than men (p<0.05, OR = 4.430, CI = 1.695-11.577) prior to their transfer to old age homes. Conclusions A majority of the older adults who transferred to old age homes in Pokhara Lekhnath Metropolitan city had been earlier abused by their caregivers, mainly through neglect and verbal abuse, and women were at a higher risk for abuse than men.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91d92c18f893e790ae462c481ebfd2c8",
  "timestamp": "2025-05-15T03:14:07.314011"
}