{
  "id": 3328,
  "title": "Financial inclusion: Measures and applications to Africa",
  "abstract": "Financial inclusion (FI) is increasingly becoming a global policy priority because it enables access to financial services, such as savings, payments, risk management, and credit, to households and firms with a wide range of needs. However, to the best of our knowledge, no study has yet been undertaken on measures of FI and the nexus between FI and bank market structure in Africa. We used panel data from 17 African countries from 2004 to 2018 to measure FI and examine its nexus with bank market structure in these countries. We employed two-stage unsupervised machine learning to index FI: its dimensions in the first stage and overall FI in the second stage. Then, we employed an endogenous panel threshold model to examine bank market power and asset concentration impacts on FI. We found that bank market power enhances availability and accessibility dimensions but reduces the usage dimension. The impact of a higher regime market power on usage is worse than that of a lower regime market power. Asset concentration impacts on overall FI, availability, and usage are more pronounced under a lower regime concentration. The results imply that bank asset concentration and market power beyond thresholds are not desirable for promoting FI. The results also imply that scrutinizing potential sensitivity of the results to FI dimensions is vital. (C) 2021 Economic Society of Australia, Queensland. Published by Elsevier B.V. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91da2482890295e829de969ec7d99aae",
  "timestamp": "2025-05-15T02:25:13.669124"
}