{
  "id": 6354,
  "title": "Nine-Year Incidence and Risk Factors for Pterygium in the Barbados Eye Studies",
  "abstract": "Purpose: To present 9-year incidence data and associated risk factors for pterygium among black participants in the Barbados Eye Studies. Design: Population-based incidence study. Participants: A total of 1888 black participants, aged 40 to 84 years, who were free of pterygium at baseline and received an ophthalmologic study examination at the 9-year follow-up. Methods: Age and sex-specific 9-year incidence of pterygium is presented. Risk factors were initially identified using Mantel-Haenszel analyses, and significant factors (P<0.10) were subsequently included in multivariate logistic regression models. Odds ratios (OR) and 95% confidence intervals (Cl) are provided. Main Outcome Measures: Development of pterygium, defined as the presence of a raised fleshy growth that crosses the limbus and encroaches onto the clear cornea. Results: The 9-year incidence of pterygium was 11.6% (95% Cl, 10.1-13.1), with no clear pattern with increasing age and no statistically significant differences between genders. Multivariate logistic regression analyses indicated that having a lifetime outdoor job location was positively associated with the development of pterygium (OR = 1.51; 95% Cl, 1.05-2.16), whereas darker skin color (OR = 0.67; 95% Cl, 0.46-0.97) and use of any prescription lenses (OR = 0.58; 95% Cl, 0.42-0.81) were found to be protective factors. Conclusions: The incidence of pterygium was high in this population, for an average of 1.3% per year. Working outdoors increased the risk 1.5-fold, whereas having a darker skin complexion and using eyewear for either reading or distance substantially decreased the risk of developing pterygium. These data suggest that absorption of ultraviolet light plays a role in this condition and that preventive strategies are needed to decrease the burden of pterygium development in this and other populations. Financial Disclosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2008;115:2153-2158 (C) 2008 by the American Academy of Ophthalmology.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91db7e32d2549cd42890e0ee2fe91a25",
  "timestamp": "2025-05-15T02:57:07.773718"
}