{
  "id": 568,
  "title": "A pedo-geomorphological view on land use and its potential in the surroundings of the ancient Hispano-Roman city Munigua (Seville, SW Spain)",
  "abstract": "This study investigates the surroundings of Munigua (municipium Flavium Muniguense), a small Roman town in the ancient province of Hispania Baetica (SW Spain). The city's economy was based primarily on copper and iron mining, which brought financial prosperity to its citizens. Local production of agricultural goods is thought to have been of little importance, as the regional soil conditions do not seem to be suitable for extensive agriculture. To evaluate the recent soil agro-potential and to find evidence for prehistoric and historic land use in the surroundings of Munigua, we applied a pedo-geomorphological approach based on the physicochemical analysis of 14 representative soil and sediment exposures. Selected samples were analyzed for bulk chemistry, texture and phytoliths. The chronostratigraphy of the sequences was based on radiocarbon dating of charcoal samples. The site evaluation of the present-day soil agro-potential was carried out according to standard procedures and included evaluation of potential rootability, available water-storage capacity and nutrient budget within the uppermost 1 m. The results show that moderate to very good soil agro-potential prevails in the granitic and floodplain areas surrounding Munigua. Clearly, recent soil agro-potential in these areas allows the production of basic agricultural goods, and similar limited agricultural use should also have been possible in ancient times. In contrast, weak to very weak present-day soil agro-potential prevails in the metamorphic landscape due to the occurrence of shallow and sandy to stony soils. In addition, the study provides pedo-geomorphological evidence for prehistoric and historic land use in pre-Roman, Roman and post-Roman times. Catenary soil mapping in the vicinity of a Roman house complex reveals multi-layered colluvial deposits. They document phases of hillslope erosion mainly triggered by human land use between 4063 +/- 82 and 3796 +/- 76 cal BP, around 2601 +/- 115 cal BP, and between 1424 +/- 96 and 421 +/- 88 cal BP. Moreover, geochemical and phytolith analyses of a Roman hortic Anthrosol indicate the local cultivation of agricultural products that contributed to the food supply of Munigua. Overall, the evidence of Roman agricultural use in the Munigua area indicates that the city's economy was by no means focused solely on mining. The production of basic agricultural products was also part of Munigua's economic portfolio. Our geoarcheological study thus supports the archeological concept of economically diversified Roman cities in the province of Baetica and in Hispania.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91ef8f5196874de882f1388de12e24f9",
  "timestamp": "2025-05-15T00:37:38.152040"
}