{
  "id": 1781,
  "title": "A State-of-the-Art Review of Probabilistic Portfolio Management for Future Stock Markets",
  "abstract": "Portfolio management has long been one of the most significant challenges in large- and small-scale investments alike. The primary objective of portfolio management is to make investments with the most favorable rate of return and the lowest amount of risk. On the other hand, time series prediction has garnered significant attention in recent years for predicting the trend of stock prices in the future. The combination of these two approaches, i.e., predicting the future stock price and adopting portfolio management methods in the forecasted time series, has turned out to be a novel research line in the past few years. That is, to have a better understanding of the future, various researchers have attempted to predict the future behavior of stocks and subsequently implement portfolio management techniques on them. However, due to the uncertainty in predicting the future, the reliability of these methodologies is in question, and it is unclear to what extent their results can be relied upon. Therefore, probabilistic approaches have also entered the research arena, and attempts have been made to incorporate uncertainty into future forecasting and portfolio management. This issue has led to the development of probabilistic portfolio management for future data. This review paper begins with a discussion of various time-series prediction methods for stock market data. Next, a classification and evaluation of portfolio management approaches are provided. Afterwards, the Monte Carlo sampling method is discussed as the most prevalent technique for probabilistic analysis of stock market data. The probabilistic portfolio management method is applied to future Shanghai Stock Exchange data in the form of a case study to measure the applicability of this method to real-world projects. The results of this research can serve as a benchmark example for the analysis of other stock market data.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "91f21f939e20fc5ec338612293b7bf0d",
  "timestamp": "2025-05-15T00:59:23.047591"
}