{
  "id": 985,
  "title": "Bio-inspired Machine Learning for Distributed Confidential Multi-Portfolio Selection Problem",
  "abstract": "The recently emerging multi-portfolio selection problem lacks a proper framework to ensure that client privacy and database secrecy remain intact. Since privacy is of major concern these days, in this paper, we propose a variant of Beetle Antennae Search (BAS) known as Distributed Beetle Antennae Search (DBAS) to optimize multi-portfolio selection problems without violating the privacy of individual portfolios. DBAS is a swarm-based optimization algorithm that solely shares the gradients of portfolios among the swarm without sharing private data or portfolio stock information. DBAS is a hybrid framework, and it inherits the swarm-like nature of the Particle Swarm Optimization (PSO) algorithm with the BAS updating criteria. It ensures a robust and fast optimization of the multi-portfolio selection problem whilst keeping the privacy and secrecy of each portfolio intact. Since multi-portfolio selection problems are a recent direction for the field, no work has been done concerning the privacy of the database nor the privacy of stock information of individual portfolios. To test the robustness of DBAS, simulations were conducted consisting of f our categories of multi-portfolio problems, where in each category, three portfolios were selected. To achieve this, 200 days worth of real-world stock data were utilized from 25 NASDAQ stock companies. The simulation results prove that DBAS not only ensures portfolio privacy but is also efficient and robust in selecting optimal portfolios.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "920d86ce08cf07fb5ce398b0ccc0fafd",
  "timestamp": "2025-05-15T00:50:08.798260"
}