{
  "id": 8797,
  "title": "Symptoms of Depression in Kidney Transplant Recipients: A Cross-sectional Study",
  "abstract": "Background: Depression is associated with impaired quality of life and increased morbidity and mortality in patients with end-stage renal disease. Little is known about the prevalence and correlates of depression in kidney transplant recipients. In this study, we aimed to compare depressive symptoms between kidney transplant recipients and wait-listed dialysis patients and identify the correlates of depressive symptoms in the transplant recipient population. Study Design: Observational cross-sectional study using the Center for Epidemiologic Studies Depression Scale (CES-D) to assess the severity of depressive symptoms. A cutoff score of 18 was used to identify the presence of depression. Setting & Participants: 1,067 kidney transplant recipients and 214 wait-listed dialysis patients were asked to participate; the final analysis included 854 kidney transplant and 176 wait-listed dialysis patients, respectively. Predictors: Sociodemographic and clinical variables. Outcome: Severity of depressive symptoms and presence of depression (CES-D score >= 18). Results: The prevalence of depression was 33% versus 22% in wait-listed versus transplant patients, respectively (P = 0.002). In multivariate regression, number of comorbid conditions, estimated glomerular filtration rate, perceived financial situation, and marital status were significant and independent predictors of depression in the transplant recipient group. Treatment modality was associated significantly with the presence of depression, even after adjustment for clinical and sociodemographic variables (OR, 2.01; 95% CI, 1.25-3.23; P = 0.004). Limitations: Self-reported measurement of depressive symptoms. Conclusions: The prevalence of depression is lower in transplant recipients than in wait-listed patients. However, one-fifth of transplant patients are still at high risk of clinically significant depression. Comorbid conditions, socioeconomic status, and treatment modality predicted depressive symptoms in patients with end-stage renal disease. Am J Kidney Dis 55: 132-140. (C) 2009 by the National Kidney Foundation, Inc. Published by Elsevier Inc. All rights reserved.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "924c9d0cd0a62782842e497ebffa5437",
  "timestamp": "2025-05-15T03:22:26.086020"
}