{
  "id": 6570,
  "title": "Corporate Governance Mechanisms and the Financial Reporting: Evidence from Bangladesh Listed Companies",
  "abstract": "Effective corporate governance is the main requirement of corporate business in all over the world. It is the system by which companies are directed and controlled. The board of directors consists of the people who are responsible for directing the company towards success keeping in mind various factors such as financial and human resources, shareholder values, risk management, business ethics. The board of directors should include a minimum of three non-executive directors who are able to influence the board's decision. It is predetermined that non-executive directors can provide their independent view regarding business strategies, performances, appointments, resources and standard of conduct. Non-executive directors are the core of good governance. It creates the relationship among shareholders, stakeholders and the corporations as a whole, the relationship between corporations and markets and the relationship between the corporations and employees. Bangladesh shows that the corporate governance is mixtures of the property right system, separation of ownership structure. This paper aims to explore the empirical evidence whether corporate governance tools (Board of directors, ownership structure, and Audit committee and remuneration committee characteristics) affect the disclosure of financial reporting. The research sample collected from 239 Bangladesh listed companies in the Chittagong Stock Exchange (CSE) in the period of 2014. The sample used in a random sampling method and used regression analysis. Bangladesh listed companies are compliant with corporate governance disclosure requirements. Most of the corporate governance measurement elements are positive and statistically significant.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "924eab6775568fcc1619e82870f63f29",
  "timestamp": "2025-05-15T02:59:36.879643"
}