{
  "id": 3071,
  "title": "The Synergy of Financial Volatility between China and the United States and the Risk Conduction Paths",
  "abstract": "Based on monthly data of six major financial variables from January 1996 to December 2018, this paper employs a structural vector autoregressive model to synthesize financial conditions indices in China and the United States, investigates fluctuation characteristics and the synergy of financial volatility using a Markov regime switching model, and further analyzes the transmission paths of the financial risk by using threshold regression. The results show that there is an approximately three-year cycle in the financial fluctuations of both China and the United States, and such fluctuations have a distinct asymmetry. Two thresholds were applied (i.e., 0.361 and 0.583), taking the synergy index (SI) as the threshold variable. The impact of the trade factor is significant across all thresholds and is the basis of financial linkages. When the SI is less than 0.361, the exchange rate factor is the main cause of the financial cycle comovement change. As the financial volatility synergy increases, the asset factor and interest rate factor start to become the primary causes. When the level of synergy breaks through 0.583, the capital factor based on stock prices and house price is still the main path of financial market linkage and risk transmission, but the linkage of monetary policy shows a restraining effect on synergy. Therefore, it is necessary to monitor the financial cycle and pay attention to the coordination between countries in terms of policy regulation.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "92636b91f87ac130dd8c33a0136b5f31",
  "timestamp": "2025-05-15T02:22:25.059618"
}