{
  "id": 3295,
  "title": "Classification of Equity Instruments under IFRS 9: Determinants and Consequences",
  "abstract": "One of the main differences between International Financial Reporting Standard (IFRS) 9 Financial Instruments and International Accounting Standard (IAS) 39 Financial Instruments: Recognition and Measurement is the classification and measurement of equity instruments that are financial assets. Under IFRS 9, a firm must measure acquired equity instruments at fair value through profit or loss (FVPL) unless the firm irrevocably chooses at initial recognition to measure those assets at fair value through other comprehensive income (FVOCI). In this case, a firm must recognise all changes in FVOCI without the possibility of reclassifying these amounts into profit or loss. In this context, this study has two main objectives. First, it examines the frequency of firms that elect to classify equity instruments as FVOCI in the first year of IFRS 9 adoption and identifies the determinants of the decision to classify equity instruments as available for sale (AFS) (under IAS 39) or as financial assets at FVOCI (under IFRS 9). Second, it considers whether this choice has any influence on the value relevance of financial information. The results of a sample based on firms in the FTSE 100 and EURO STOXX 50 show that risk is the main determinant of the reclassification from AFS to FVOCI in the first year of IFRS 9 adoption, while the level of variable compensation for CEOs (for AFS) and the level of fair value hierarchy (for AFS and FVOCI) are the main determinants for the classification of equity instruments. Regarding the consequences of this change, the findings indicate that the prohibition of recycling for the FVOCI option under IFRS 9 leads investors to pay more attention to the changes in fair value as recognised in OCI.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9272cfb4049213f0f39f07dc06b49eca",
  "timestamp": "2025-05-15T02:24:39.714284"
}