{
  "id": 8951,
  "title": "The metabolite beta-aminoisobutyric acid and physical inactivity among hemodialysis patients",
  "abstract": "Objective: Physical inactivity is frequent in patients on hemodialysis (HD), and represents a reliable predictor of morbidity and mortality. Beta-aminoisobutyric acid (BAIBA) is a contraction-induced myokine, the plasma levels of which increase with exercise and are inversely associated with metabolic risk factors. The aim of this study was to ascertain whether physical inactivity and clinical parameters relate to plasma BAIBA levels in this patient population. Methods: Adult patients on HD were included, and the presence of physical inactivity was assessed. BAIBA levels were measured in these patients and in healthy individuals. We assessed barriers to physical activity, including 23 items regarding psychophysical and financial barriers. Body composition was assessed by bioimpedance and muscle strength by handgrip dynamometer. Nonparametric tests and logistic regression analyses were performed. Results: Forty-nine patients on HD were studied; 49% were physically active and 51% were inactive. Of the patients, 43 reported barriers to physical activity and 61% of inactive patients reported three or more barriers. BAIBA levels were lower in patients on HD with respect to controls (P < 0.001). Stratifying HD patients as active and inactive, both groups showed significantly lower BAIBA levels versus controls (P = 0.0005, P < 0.001, respectively). Nondiabetic patients on HD showed increased BAIBA levels compared with diabetic patients (P < 0.001). Patients on HD endorsing the two most frequent barriers showed lower BAIBA levels than those not reporting these barriers (P = 0.006). Active patients showed higher intracellular water (%) (P = 0.008), and active and inactive patients showed significant correlation between total body muscle mass and handgrip strength (P = 0.04, P = 0.005, respectively). Conclusions: Physical inactivity is highly prevalent among patients on HD and BAIBA correlates with barriers to physical activity reported by inactive patients. (C) 2016 Elsevier Inc. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "927870aa9314e071d3a256b458deadf8",
  "timestamp": "2025-05-15T03:23:56.133331"
}