{
  "id": 2168,
  "title": "Failing to Succeed: A Network Theoretic Comparison of Global Accelerators",
  "abstract": "Accelerators are firms that invest small amounts of capital in early-stage companies, typically for a 4% to 10% equity stake, and provide mentoring for limited time periods, typically 3 to 4 months, to help build the business case to support these firm's future funding needs. During the mentoring periods accelerator management is actively involved with the portfolio firms and provides extensive networking support. The 2012 publication U.S. Seed Accelerator Rankings identified 71 U.S. accelerators and noted that their numbers are growing rapidly. In the U.S. alone it is estimated that more than 1,400 start-up companies are mentored annually by such firms. Accelerators are also growing rapidly and have become critical nodes in the entrepreneurial ecosystem. Understanding relative accelerator performance and the characteristics driving superior performance can have a multiplier effect on overall start-up success. To that end, we consider two research questions in this paper: Do top-ranked accelerator portfolio firms display similar survival rates? And, what accelerator characteristics correlate with variations in portfolio firm survival? Network theory informs the hypotheses investigated in this study. In this study we compare the survival performance of accelerator portfolio firms in Silicon Valley and Ireland to those of other leading geographically dispersed accelerators. An analysis of the node characteristics in these ecosystems suggests that Silicon Valley portfolio firms will experience higher failure rates and Irish accelerator portfolio firms will experience lower failure rates then other regions. In contrast, network theory also suggests that hubs, such as accelerators, can help embed nodes, such as start-ups, in preferred networks and that such networking can enhance firm outcomes, such as survival. Network theory also suggests that establishing network ties comes at a cost, and that accelerator and start-up resources must be adequate to enable useful network connections. Smaller cohort sizes and larger capital investments are evaluated to determine if the additional resources resulting from these practices benefit firm survival. The resulting hypotheses are evaluated via t-tests and regression analyses on data from the portfolio firms of 18 top-ranked accelerators. Our results suggest that Irish accelerator portfolio firms experience lower failure rates than portfolio firms from other regions. Interestingly these results demonstrated only modest absolute differences in regional outcomes despite significant differences in the outcome objectives of the regional funding sources in Silicon Valley and Ireland which were considered in detail. Variation in accelerator practice on funding levels and cohort size were not found to significantly impact firm outcomes although accelerator experience was found to be significant to portfolio firm survival.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9283f5fde914da92bbb84147aef4127e",
  "timestamp": "2025-05-15T01:03:36.684897"
}