{
  "id": 5507,
  "title": "Assessment of Financial Toxicity Among Older Adults With Advanced Cancer",
  "abstract": "This cross-sectional study examines the prevalence of financial toxicity in older adults with advanced cancer, its association with health-related quality of life, and cost conversations between oncologists and patients. Question Among patients 70 years or older with advanced cancer, is financial toxicity (FT) associated with health-related quality of life (HRQoL), and are conversations between patients and oncologists held regarding cost of care? Findings In this cross-sectional study of 536 older patients with advanced cancer, FT was reported by 18% of participants and was associated with higher levels of depression, anxiety, and distress and lower HRQoL. Almost 50% of patients experiencing FT had a conversation with their health care professional about costs. Meaning In this study, patients 70 years or older were found to be at a high risk of FT; further research is warranted to create interventions that may help reduce this burden. Importance Financial toxicity (FT), unintended and unanticipated financial burden experienced by cancer patients undergoing cancer care, is associated with negative consequences and increased risk of mortality. Older patients (>= 70 years) with cancer are at risk for FT, yet data are limited on FT and whether oncologists discuss FT with their patients. Objective To examine the prevalence of FT in older adults with advanced cancer, its association with health-related quality of life (HRQoL), and cost conversations between oncologists and patients. Design, Setting, and Participants This cross-sectional secondary analysis was performed on baseline data from the Improving Communication in Older Cancer Patients and Their Caregivers study, a cluster randomized trial from 31 community oncology practices across the US that was conducted from October 29, 2014, to April 28, 2017. Participants included 536 patients with advanced cancer who answered 3 questions regarding financial toxicity. Data were analyzed from September 1, 2019, to May 1, 2020. Exposure Older patients undergoing cancer care treatments. Main Outcomes and Measures The main outcome looked at FT and its association with HRQoL. Three questions were used to identify patients 70 years or older experiencing FT. Multivariable linear regression models were used to assess the independent associations of FT with HRQoL. A single audio-recorded clinic transcript was analyzed within 4 weeks of enrollment for patients with FT. The framework method was used to identify frequency and themes related to cost conversations. Results This study evaluated 536 patients 70 years or older with advanced cancer. Ninety-eight patients (18.3%) reported FT; mean (SD) age was 76.4 (5.4) years; 59 (60.2%) were female, 14 (14.3%) were Black/African American, 91 (92.9%) were not employed, and 29 (29.6%) had Medicare as their sole insurance coverage. On multivariate regression analyses, FT was associated with higher levels of depression (beta = 0.81; 95% CI, 0.15-1.48), anxiety (beta = 1.67; 95% CI, 0.74-2.61), and distress (beta = 0.73; 95% CI, 0.08-1.39) and lower HRQoL (beta = -5.30; 95% CI, -8.92 to -1.69). Among those who reported FT, 49% had a conversation with their health care professional about costs. Most conversations (79%) were initiated by oncologists or patients. Four themes were generated from cost conversations: statements regarding cost of care, ability to afford medical prescriptions, indirect consequences associated with inability to work and provide for family, and cost burden in nontreatment domains. Conclusions and Relevance In this study, among older adults with advanced cancer, FT is associated with worse HRQoL. Almost half of conversations among patients reporting FT demonstrated costs are being actively discussed. Resources and interventions are needed to manage FT.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "92845dc271b179b2d7d2db3665fdee95",
  "timestamp": "2025-05-15T02:48:23.821614"
}