{
  "id": 812,
  "title": "Intelligent option portfolio model with perspective of shadow price and risk-free profit",
  "abstract": "Since Markowitz proposed modern portfolio theory, portfolio optimization has been being a classic topic in financial engineering. Although it is generally accepted that options help to improve the market, there is still an improvement for the portrayal of their unique properties in portfolio problems. In this paper, an intelligent option portfolio model is developed that allows selling options contracts to earn option fees and considers the high leverage of options in the market. Deep learning methods are used to predict the forward price of the underlying asset, making the model smarter. It can find an optimal option portfolio that maximizes the final wealth among the call and put options with multiple strike prices. We use the duality theory to analyze the marginal contribution of initial assets, risk tolerance limit, and portfolio leverage limit for the final wealth. The leverage limit of the option portfolio has a significant impact on the return. To satisfy the investors with different risk preferences, we also give the conditions for the option portfolio to gain a risk-free return and replace the Conditional Value-at-Risk. Numerical experiments demonstrate that the intelligent option portfolio model obtains a satisfactory out-of-sample return, which is significantly positively correlated with the volatility of the underlying asset and negatively correlated with the forecast error of the forward price. The risk- free option model is effective in achieving the goal of no drawdown and gaining satisfactory returns. Investors can adjust the balance point between returns and risks according to their risk preference.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "928dd4f669cb155b2ec70fda5f711d33",
  "timestamp": "2025-05-15T01:42:44.501880"
}