{
  "id": 3706,
  "title": "Do Independent Living Services Protect Youth Aging Out Foster Care From Adverse Outcomes? An Evaluation Using National Data",
  "abstract": "Objective: Youth aging out foster care are at high risk of experiencing adverse outcomes. Federal funded programs have provided independent living services (ILSs) to these youth. This study evaluated the effectiveness of the continuity of ILSs at ages 17-19 in protecting youth aging out foster care from homelessness and incarceration at ages 19-21. Method: This study used data on 4,853 foster youth from the National Youth in Transition Database and the Adoption and Foster Care Analysis and Reporting System. Logistic regression was used to regress two binary outcomes on seven ILS variables and covariates. Results: The results suggest that remaining in foster care, continuous receipts of academic support, and financial assistance services at ages 17-19 protected foster youth from experiencing homelessness. Remaining in foster care and continuous receipt of financial assistance services at ages 17-19 protected foster youth from incarceration at ages 19-21. But, surprisingly, continuous receipt of housing education and home management training, and health education and risk prevention training at ages 17-19 were each associated with increased risk of homelessness at ages 19-21. The results also showed statistically significant effects of several covariates. Conclusion: Implications are provided based on the importance of financial assistance and academic support services.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "928e0392d4874f541981d3fb55826d95",
  "timestamp": "2025-05-15T02:29:00.219216"
}