{
  "id": 7592,
  "title": "Predictors of Sustainability for Community-Managed Handpumps in Sub-Saharan Africa: Evidence from Liberia, Sierra Leone, and Uganda",
  "abstract": "Rural water supply sustainability has remained an enduring policy challenge in sub-Saharan Africa for decades. Drawing on the largest data set assembled on rural water points in sub-Saharan Africa to date, this paper employs logistic regression analyses to identify operational, technical, institutional, financial, and environmental predictors of functionality for over 25 000 community-managed handpumps in Liberia, Sierra Leone, and Uganda. Risk factors significantly associated with nonfunctionality across all three countries were (a) system age, (b) distance from district/county capital, and (c) absence of user fee collection. In at least one of the three countries, other variables found to have significant multivariable adjusted associations with functionality status included well type, handpump type, funding organization, implementing organization, spare parts proximity, availability of a handpump mechanic, regular servicing, regular water committee meetings, women in key water committee positions, rainfall season, and perceived water quality. While the findings reinforce views that a multifaceted range of conditions is critical for the sustainability of community-managed handpumps, they also demonstrate that these factors remain absent from a high proportion of cases. Governments and development partners must significantly strengthen postconstruction support for operation and maintenance systems, and greater efforts are needed to test and evaluate alternative models for managing handpump water supplies.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9290c57a70682daa12faf3b26a0b49ea",
  "timestamp": "2025-05-15T03:10:05.612202"
}