{
  "id": 4302,
  "title": "Predictors of Academic Productivity in Cardiac Surgeons: Quality Over Quantity",
  "abstract": "Introduction: Building a successful academic career is challenging. It is unclear which metrics of academic productivity best predict future success for cardiac surgeons. Methods: We collected academic cardiac surgeon profiles from the top 140 National Institutes of Health (NIH)-funded institutions. Publication information was obtained from Web of Science and the NIH iCite tool. Grant information was collected from NIH Research Portfolio Online Reporting Tools Expenditures and Results. Data were categorized into distinct time periods as follows for each surgeon: last 5 y of training (senior trainee), first 5 y as an attending (junior faculty), and after 5 y as an attending (established faculty). The primary outcomes of: (1) publications as established faculty and (2) receiving a K08 or R01 were analyzed using linear and logistic regression. Results: We analyzed 972 academic cardiac surgeons. Total publications as established faculty were predicted by citations per year of papers published as a senior trainee (P = 0.015) but not the number of publications as a senior trainee (P = 0.14). The proportion of basic or translational research (P = 0.27) and first author publications as a senior trainee (P = 0.18) did not predict total publications as established faculty. Being awarded a K08 or R01 was predicted by the number of publications as junior faculty (P = 0.001; odds ratio (OR) 1.02) and whether the surgeon was awarded an F32 (P = 0.0004; OR 3.97) but not the number of publications as a senior trainee (P = 0.49; OR 1.01). Publishing a higher proportion of senior author papers as junior faculty also predicted being awarded a K08 or R01 (P <0.001; OR 17.15). The surgeons in the top quartile by publication volume varied substantially across career time points. Conclusions: Research quality, not quantity, as a trainee predicts future academic productivity as an attending. Cardiac surgery trainees should prioritize learning how to conduct high-quality research and apply those skills as early attendings to position themselves for future academic success. (c) 2025 Elsevier Inc. All rights are reserved, including those for text and data mining, AI training, and similar technologies.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "92910440d8277e6aef951f7a3145f497",
  "timestamp": "2025-05-15T01:25:50.497997"
}