{
  "id": 9242,
  "title": "Prospective longitudinal study of 'Sleepless in Lockdown': unpacking differences in sleep loss during the coronavirus pandemic in the UK",
  "abstract": "Objectives COVID-19 is having a disproportionate impact on Black, Asian and minority ethnic (BAME) groups and women. Concern over direct and indirect effects may also impact on sleep. We explore the levels and social determinants of self-reported sleep loss among the UK population during the pandemic, focusing on ethnic and gender disparities. Setting This prospective longitudinal study analysed data from seven waves of the Understanding Society: COVID-19 Study collected from April 2020 to January 2021 linked to prepandemic data from the 2019 mainstage interviews, providing baseline information about the respondents prior to the pandemic. Participants The analytical sample included 8163 respondents aged 16 and above who took part in all seven waves with full information on sleep loss, defined as experiencing 'rather more' or 'much more' than usual sleep loss due to worry, providing 57 141 observations. Primary outcome measures Self-reported sleep loss. Mixed-effects regression models were fitted to consider within-individual and between-individual differences. Results Women were more likely to report sleep loss than men (OR 2.1, 95% CI 1.9 to 2.4) over the 10-month period. Being female, having young children, perceived financial difficulties and COVID-19 symptoms were all predictive of sleep loss. Once these covariates were controlled for, the bivariate relationship between ethnicity and sleep loss (1.4, 95% CI 1.6 to 2.4) was reversed (0.7, 95% CI 0.5 to 0.8). Moreover, the strength of the association between gender and ethnicity and the risk of sleep loss varied over time, being weaker among women in July (0.6, 95% CI 0.5 to 0.7), September (0.7, 95% CI 0.6 to 0.8), November (0.8, 95% CI 0.7 to 1.0) and January 2021 (0.8, 95% CI 0.7 to 0.9) compared with April 2020, but positively stronger among BAME individuals in May (1.4, 95% CI 1.0 to 2.1), weaker only in September (0.7, 95% CI 0.5 to 1.0). Conclusions The pandemic has widened sleep deprivation disparities, with women with young children, COVID-19 infection and BAME individuals experiencing sleep loss, which may adversely affect their mental and physical health.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "929a59986d911eaff422ad3803c02a7c",
  "timestamp": "2025-05-15T03:26:54.583698"
}