{
  "id": 7512,
  "title": "Assessing the impact of sociodemographic and lifestyle factors on oral health: a cross-sectional study in the Hungarian population",
  "abstract": "IntroductionOral health, a critical aspect of overall well-being, is influenced by various sociodemographic and lifestyle factors, with poor oral health associated with systemic diseases and diminished quality of life.MethodsThis cross-sectional study leverages data from the Hungarian European Health Interview Survey (EHIS) representative of the Hungarian population, to conduct a comprehensive examination of the intersection between these factors and oral health, aiming to identify potential risk factors and contribute to the development of targeted interventions. The research examined associations between sociodemographic/lifestyle factors and oral health. Statistical techniques included Pearson's Chi-square test, multivariate and ordinal logistic regression analyses. Weighting was applied to assure the representativeness of the population and enhance the validity of the survey results.ResultsThe study identifies gender, age, education, financial status, smoking, and self-perceived oral health as key factors influencing oral health outcomes. Notably, regular dental visits significantly reduced the risk of poor oral health and caries. Females, non-smokers, university graduates, high-income individuals, and those with good self-perceived health had fewer missing teeth and better self-perceived oral health. Teeth extractions due to decay, especially when not replaced, significantly increased the perception of poor oral health, while regular dental visits improved it.DiscussionThe study highlights the need for personalized oral health interventions considering the different sociodemographic and lifestyle factors, along with promotion of healthy lifestyle, more frequent dental office visits and equitable dental care access. The findings offer the potential to inform regional oral health policies and prevention strategies, improving oral health and overall wellbeing.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "92a4baa157d56ac6d5d3441fffcc06f2",
  "timestamp": "2025-05-15T03:09:07.395744"
}