{
  "id": 5776,
  "title": "Use of high-level health facilities and catastrophic expenditure in Vietnam: can health insurance moderate this relationship?",
  "abstract": "Background: Overcrowding of high-level health facilities is a major concern in a Vietnamese health system. This may increase an economic burden to the households since health insurance is still insufficient in providing financial risk protection. This paper sought to examine the association between the use of high-level health facilities and household-level expenditure status such as out-of-pocket (OOP), and catastrophic expenditure on health, as well as a moderating effect of health insurances in rural and urban districts of Vietnam. Methods: Data utilized a health system community survey collected between 2015 and 2017 in two districts of Vietnam (one from rural area in northern part, and the other one from urban area in sourthern part). The world Health Organization's definition of catastrophic expenditure was used. Multivariate tobit and logistic regression were employed for catastrophic expenditure and OOP respectively. Interaction term between health insurance status and visit frequency in high-level facilities was included to investigate the moderating effect of health insurance. Results: Health insurance status was associated with neither OOP health expenditure nor catastrophic expenditure occurrence, whereas visit frequency of high-level health facilities was strongly associated with both outcomes in both districts(e.g., for catastrophic expenditure, ORs are 1.77 and 1.30 in northern and southern district respecitvely. P values are < 0.001). Significant interaction between health insurance status and use of high-level facilities on catastrophic expenditure occurrence was found in Quoc Oai district (OR = 0.68, p < 0.05). Conclusions: The present study demonstrated negative financial impact of utilizing high-level facility on household financial status and weak role of health insurance in decreasing this impact. Multi-faceted approach is called for to mitigate the patient's financial burden.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "92bec902f46b1773d5f5275958fe4c91",
  "timestamp": "2025-05-15T02:51:29.998784"
}