{
  "id": 9014,
  "title": "Internal control, debt risk, CEO education and earnings management evidence from China",
  "abstract": "PurposeThis study aims to explore how earnings management techniques are affected by corporate financial debt risk (FDR), internal control (IC) effectiveness and CEO education.Design/methodology/approachThe study uses a sample from listed firms in China from 2010 to 2017, comprising different industries, including agriculture, forestry, livestock farming and fishing; mining; manufacturing; electric power, gas and water production and supply; construction; transport and storage; information technology; the real estate industry; social services; and communication and cultural. The regression analysis is used to test the hypotheses. The two-stage least squares technique is used to check for endogeneity issues.FindingsThe study finds that firms are less likely to manage real earnings when they have more robust IC and FDR. Likewise, companies with weak ICs are more likely to manipulate real earnings. Besides, the study finds an influence of CEO education on the relationship between IC, FDR and real earnings management (REM). These results can be applied to the sectors in the sample covered by the research, and the authors do not overlook the energy industry sector for the importance of its role in the economy.Research limitations/implicationsThere are some limitations for the researcher when performing any research, and this study is no exception. Researchers are urged to take these circumstances into consideration when generalizing or comparing the results because the methods used to calculate the measurement variables in each study may differ somewhat from those used in other research. In addition, expanding the current research design to incorporate additional nations may be an area of interest for future research and could aid in evaluating the effects of nation-specific elements (such as inflation, culture, legal systems and political considerations) on the usefulness of IC and decreasing FDR. Second, the current study focuses on the impact of IC and FDR on REM; this paper does not dissect the black box of IC and consider how each element affects earnings management. Future research may need to focus specifically on how effective IC would affect earnings management and precisely what IC mechanisms would discourage the management of earnings.Practical implicationsHelping companies listed in China to make decisions and improve investors' vision of the results of real companies' businesses, as well as helping management to avoid falling into debt risk and the consequent effects and manipulation of earnings.Originality/valueBy highlighting the significance of IC and debt risk in enhancing information quality in China, the results contribute to the body of work examining the relationship between IC, FDR and REM. In addition, this study uses a CEO's education to moderate this link.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "92db1863c2217247d95cc124b05c8902",
  "timestamp": "2025-05-15T03:24:54.864959"
}