{
  "id": 2782,
  "title": "Supply chain network structures and firm financial performance: the moderating role of international relations",
  "abstract": "PurposeThis paper examines the relationship between supply chain network structures and firm financial performance and the moderating role of international relations. In this study, which is grounded in social capital theory and applies the perspective of systemic risk, the authors theorize the effects of supply chain network structures on firm performance.Design/methodology/approachThe authors extracted data from two Chinese databases and constructed a supply chain network of the firms concerned based on nearly 4,300 supply chain relations between 2009 and 2018. The authors adopted the fixed effects model to investigate the relationship between supply chain network structures and firm financial performance.FindingsThe econometrics results indicate that network structures, including the degree, centrality, clustering coefficients and structural holes, are significantly related to firm financial performance. A significant and negative relationship exists between international relations and firm financial performance. The authors also find that international relations strongly weaken the relationship between supply chain network structures and firm financial performance.Originality/valueThis study, which collects secondary data from developing countries (e.g. China) and explores the impacts of supply chain network structures on firm stock performance, contributes to the existing literature and provides practical implications.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "92e316502abf66f56c09a78d51cfc3e1",
  "timestamp": "2025-05-15T02:19:08.441990"
}