{
  "id": 5378,
  "title": "Prevalence, Risk Factors, and Economical Cost of Work-Related Injuries Among Olive Workers in the Achaia Region, Greece",
  "abstract": "Background Olive gathering involves tree climbing, carrying heavy loads, navigating rough terrain, and using sharp tools. However, little is known about occupational injuries among olive workers. The aim of this study is to evaluate the prevalence and risk factors of occupational injuries among olive workers in a rural Greek area and to assess the financial burden on the health system and insurance funds.Methods A questionnaire was administered to 166 olive workers in the Aigialeia municipality in the Achaia region, Greece. The questionnaire contained detailed information on demographic characteristics, medical history, working environment, protective measures, gathering tools, and type and site of injuries. Moreover, data were recorded about the duration of hospitalization, medical examinations and treatment received, sick leaves, complications, and rate of re-injury. Direct economic costs were calculated for hospitalized and non -hospitalized patients. The associations between olive workers' characteristics, risk factors, and occupational injury within the last year were examined using log-binomial regression models.Results In total, 85 injuries were recorded in 50 workers. The prevalence of one or more injuries in the last year was 30.1%. Factors associated with a higher rate of injury were male gender, age > 50 years, working experience > 24 years, history of arterial hypertension and diabetes mellitus, climbing habits, and non-use of protective gloves. The average cost of agricultural injuries was more than 1400 euro per injury. The cost seems to be associated with the severity of the injury, as injuries requiring hospitalization were associated with increased costs, higher cost of medication, as well as more days of sick leave. Losses due to sick leave cause the greatest financial costs. Conclusions Farm-related injuries are quite usual among olive workers in Greece. Injury risk is influenced by gender, age, working experience, medical history, climbing habits, and use of protective gloves. Days off work have the greatest financial cost. These findings can be useful as a starting point to train olive workers to reduce the incidence of farm-related injuries in Greece. Knowledge of risk factors for farm-related injuries and diseases could help the development of proper interventions to minimize the problem.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "92f84801429a075940268a3d3b76a444",
  "timestamp": "2025-05-15T02:47:13.936511"
}