{
  "id": 9086,
  "title": "Adherence to childhood cancer treatment: a prospective cohort study from Northern Vietnam",
  "abstract": "Objectives Global incidence and attention to childhood cancer is increasing and treatment abandonment is a major cause of treatment failure in low- and middle-income countries. The purpose of this study was to gain an understanding of factors contributing to non-adherence to treatment. Design A prospective cohort study with 2year follow-up of incidence, family-reported motives and risk factors. Setting The largest tertiary paediatric oncology centre in Northern Vietnam. Participants All children offered curative cancer treatment, from January 2008 to December 2009. Primary and secondary outcome measures Family decision to start treatment was analysed with multivariable logistic regression, and family decision to continue treatment was analysed with a multivariable Cox model. This assessment of non-adherence is thereby methodologically consistent with the accepted definitions and recommended practices for evaluation of treatment abandonment. Results Among 731 consecutively admitted patients, 677 were eligible for treatment and were followed for a maximum 2years. Almost half the parents chose to decline curative care (45.5%), either before (35.2%) or during (10.3%) the course of treatment. Most parents reported perceived poor prognosis as the main reason for non-adherence, followed by financial constraints and traditional medicine preference. The odds of starting treatment increased throughout the study-period (OR 1.04 per month (1.01 to 1.07), p=0.002), and were independently associated with prognosis (OR 0.51 (0.41 to 0.64), p=<0.0001) and travel distance to hospital (OR 0.998 per km (0.996 to 0.999), p=0.004). The results also suggest that adherence to initiated treatment was significantly higher among boys than girls (HR 1.69 (1.05 to 2.73), p=0.03). Conclusions Non-adherence influenced the prognosis of childhood cancer, and was associated with cultural and local perceptions of cancer and the economic power of the affected families. Prevention of abandonment is a prerequisite for successful cancer care, and a crucial early step in quality improvements to care for all children with cancer.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "92fc753ec3a8e8961e33284417ba9e2d",
  "timestamp": "2025-05-15T03:25:27.720971"
}