{
  "id": 1569,
  "title": "RETRACTED: A K-Means Clustering Algorithm for Early Warning of Financial Risks in Agricultural Industry (Retracted Article)",
  "abstract": "As the primary industry, agricultural industry is the basis of guaranteeing people's basic life and national economic development. Agricultural industrial finance/financial is a weak link in the financial system, which seriously hinders the emergence of agricultural scale effect and the improvement in agricultural production efficiency. In order to find the financial risk of agricultural industry in time, this article proposes an agricultural industry financial risk early warning system based on improved K-means clustering algorithm. Because the traditional K-means algorithm is easy to fall into local optimization in the clustering process, the clustering effect is not reliable. In this article, the idea of immune cloning and particle swarm optimization location update is added to the grey wolf optimization algorithm. Grey wolf optimization algorithm and K-means algorithm are combined to solve the problem that K-means algorithm is easy to fall into local optimization. In the experimental part, through comparative verification, it can be found that the prediction performance of this system is superior to other models. Its practical application value is higher. Therefore, choosing this system for early warning of agricultural industry finance can effectively improve the accuracy of early warning and provide guarantee for the economic development of agricultural industry.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9317492e5fe66e9c8e26d23ff1ab71aa",
  "timestamp": "2025-05-15T02:05:08.086989"
}