{
  "id": 8277,
  "title": "Product market competition and audit fees: evidence from an emerging market",
  "abstract": "Purpose Product market competition may have various impacts on audit fees. On the one hand, according to the agency theory, product market competition can mitigate agency problems between management and shareholders. For clients with higher product market competition, auditors will lower the level of engagement risk assessment and reduce the required level of audit evidence, and hence audit fees will be lower. On the other hand, according to the audit risk model, product market competition will increase client business risk and audit engagement risk. Moreover, for clients with competition advantage, client business risk and audit engagement risk will be lower, and hence a lower audit fee. The paper aims to discuss this issue. Design/methodology/approach In this paper, the authors collect financial accounting data and audit fee data from CSMAR database. Our sample selection starts with all available observations on the Chinese listed companies during 2006-2011. Since there is a big difference in accounting practices between financial companies and other industries, the authors delete observations on financial companies. The authors further remove observations with missing data, yielding 6,709 observations for the final analysis. To define the industry, the authors use the first two digits of standard industry classification code set by China Securities Regulatory Commission. In order to reduce the effect of extreme observations, the authors also truncate the data at 1 and 99 percent. The authors use the Herfindahl-Hirschman index (HHI) and the natural logarithm of the number of listed companies within the industry to measure product market competition intensity. HHI is calculated as the sum of the squared percentage of revenues of the client firm among the total revenues of all public companies, i.e. HHI= n-ary sumation i=1N(si/S)2. N is the number of listed companies in the industry, S-i is the revenues for an individual firm and S is the total revenues of all public companies within the same industry. A higher HHI score indicates fewer companies dominate the industry and hence lower intensity of competition in the product market. The second measure of industry competition intensity is LNN, the natural logarithm of the total number of public companies in the same industry of a client firm. A larger value of LNN indicates a larger number of competitors in the industry, and a higher level of competition intensity. Following the literature (Kale and Loon, 2011), the authors use Lerner index (or price-cost margin (PCM)) to measure the listed company's competitive advantage. It is actually a measure of a firm's power to influence product prices in the industry. The authors adopt the Peress (2010) method to estimate Lerner index as net operating income, divided by sales, i.e. PCM=(Sales-COGS-Selling expenses-Administrative expenses)/Sales. A higher value of PCM indicates more product pricing power and a higher competitive advantage of a company. The authors also use Lerner index ranking (R_PCM) to measure the competitive advantage of a company in the industry. The authors sort PCM values in ascending order in each industry and divide into ten groups. Then, the authors assign a value from one to ten to each listed company within each group in each industry. A higher R_PCM value represents higher market power and higher competitive advantage of a company. Based on Simunic (1980) framework, the authors develop the following model to test the relationship between product market competition, competition advantage and audit fees: LNAF(it)=beta(0)+beta(1) PMCit+beta(2) SIZE(it)+beta(3) INVit+beta(4) RECit+beta(5) GROWTH(it)+beta(6) PRELOSSit+beta(7) LEVit+beta(8) QUICK(it)+beta(9) OPINit+beta(10) IBIG4(it)+beta(11) DBIG10(it)+beta(12) SWITCHit+beta(13) LOCATE(it)+beta(14) STATE(it)+ n-ary sumation beta YearDummies+epsilon(it). Findings Using a sample of 6,709 firm-year observations from the Chinese stock market for the period of 2007-2011, the authors find that the product market competition intensity has a negative impact on audit fees, which means that agency cost effect is dominant in audit pricing at industry level. In addition, a company's competitive advantage in the industry has a significant and negative impact on audit fees, which means that business risk effect also plays a critical role in audit pricing of individual engagement. The findings indicate that, in determining audit fees, auditors in the emerging market of China consider both the competition intensity of their clients' product market at the industry level and the competitive advantage of the specific clients within the industry. Originality/value The findings indicate that, in determining audit fees, auditors in the emerging market of China consider both the competition intensity of their clients' product market at the industry level and the competitive advantage of the specific clients within the industry.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "931e185d268fcd60a131a1e8453424fb",
  "timestamp": "2025-05-15T03:17:21.503734"
}