{
  "id": 3017,
  "title": "Market Efficiency and Stock Investment Loss Aversion Guide During COVID-19 Pandemic Events: The Case for Applying Data Mining",
  "abstract": "This study explores the late coronavirus disease 2019 (COVID-19) pandemic, particularly, 2022Q1 to 2022Q3, to analyze the stock returns of industries expected to have a direct impact. The aim is to identify the factors influencing stock returns and to provide investment strategies, focusing on investment risk control (loss aversion). A total of 193 common stocks listed on the Taiwanese stock market were collected from four major industries: sports, restaurants, biotechnology, and epidemic prevention. Using the past information set (2021Q4): variables in three dimensions-firm characteristics, financial indicators, and corporate governance-are used to construct a stock investment strategy model. Empirical evidence shows the existence of differences in the stock investment advantages of some industries and firm characteristics and the lack of investment advantages of epidemic prevention stocks in 2020. The decision-tree model has a precision of 79.4% and an accuracy of 72.0%. The five most important factors affecting stock returns are market value, cash flow adequacy ratio, return on assets, Tobin's Q, and price/book value. The scheme inducting three types of losses of return (loser) and one type of profit (winner) is summarized for reference. Second, it confirms the correlation between past information sets and stock returns, suggesting that Taiwan's stock market was inefficient during the late stage of the COVID-19 pandemic. Finally, this study's findings can be used as a reference for future fund managers and investors when handling similar events.JEL Classification: G11, G14, C88, I15 Stock Investment Losses Aversion during COVID-19 PandemicThis study explores the late COVID-19 pandemic, particularly, 2022Q1 to 2022Q3, to analyze the stock returns of industries expected to have a direct impact. The aim is to identify the factors influencing stock returns and to provide investment strategies, focusing on investment loss aversion. A total of 193 common stocks listed on the Taiwanese stock market were collected from four major industries: sports, restaurants, biotechnology, and epidemic prevention. Empirical evidence shows the existence of differences in the stock investment advantages of some industries and firm characteristics and the lack of investment advantages of epidemic prevention stocks in 2020. The decision-tree model has a precision of 79.4% and an accuracy of 72.0%. The five most important factors affecting stock returns are market value, cash flow adequacy ratio, return on assets, Tobin's Q, and price/book value. The scheme inducting three types of losses of return (loser) and one type of profit (winner) is summarized for reference. Second, shows that Taiwan's stock market was inefficient during the late stage of the COVID-19 pandemic. Finally, this study's findings can be used as a reference for future fund managers and investors when handling similar events.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "932d595a2ae710b9d1833df6e78446ca",
  "timestamp": "2025-05-15T02:21:52.151182"
}