{
  "id": 6181,
  "title": "Anxiety and depression among adult tobacco users during the COVID-19 restrictions in India",
  "abstract": "BackgroundThe world witnessed a highly contagious and deadly disease, COVID-19, toward the end of 2019. India is one of the worst affected countries. We aimed to assess anxiety and depression levels among adult tobacco users and people who recently quit tobacco during COVID-19 lockdown in India. Materials and methodsThe study was conducted across two Indian cities, Delhi and Chennai (July-August, 2020) among adult tobacco users (n = 801). Telephonic interviews were conducted using validated mental health tools (Patient Health Questionnaire-PHQ-9 and Generalized Anxiety Disorder-GAD-7) to assess the anxiety and depression levels of the participants. Descriptive analysis and multiple logistic regression were used to study the prevalence and correlates of depression and anxiety. ResultsWe found that 20.6% of tobacco users had depression symptoms (3.9% moderate to severe); 20.7% had anxiety symptoms (3.8% moderate to severe). Risk factors associated with depression and anxiety included food, housing, and financial insecurity. ConclusionDuring COVID-19 lockdown, mental health of tobacco users (primarily women) was associated with food, housing and financial insecurity. The Indian Government rightly initiated several health, social and economic measures to shield the most vulnerable from COVID-19, including a ban on the sale of tobacco products. It is also necessary to prioritize universal health coverage, expanded social security net, tobacco cessation and mental health services to such vulnerable populations during pandemic situations.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "933d467e0eeacda5fe50a96b17f9dd44",
  "timestamp": "2025-05-15T02:55:44.513074"
}