{
  "id": 3035,
  "title": "Board structure and risk-taking behavior: evidence from the financial sector of Pakistan",
  "abstract": "PurposeThe board structure (BS) is pivotal in modern corporate governance (CG). This study aims to investigate BS variables (BSIZE, BIND and chief executive officer [CEO] duality) and their correlation with risk-taking behavior indicators, enriching the understanding of how CG shapes financial institutions' (FIs) decision-making in Pakistan.Design/methodology/approachBy scrutinizing data from 67 financial entities listed on the Stock Exchange of Pakistan spanning from 2011 to 2022 through panel data regression techniques, the research emphasizes that BS holds a substantial influence over the risk tendencies exhibited by these firms.FindingsKey findings suggest that board size has a positive influence, aligned with previous CG research. Smaller boards perform better and avoid excessive risk-taking, contrasting some negative relationship claims. More independent directors are recommended to curtail risk and financial disruption. Holding both CEO and chair roles reduces risk exposure, resonating with reputational and employment risk theory. It is essential to recognize that BS's impact on risk-taking is nuanced and context-dependent.Practical implicationsPolicymakers, scholars, practitioners and investors working in the market for financial companies might greatly benefit from the empirical findings of this study. Imposing mandates on FIs to uphold adequate capital reserves functions as a safeguard against unforeseen losses, thereby diminishing the probability of unwarranted risk-taking.Originality/valuePrior studies in this domain predominantly focus on nonfinancial sectors. In addition, existing research often explores the relationship between BS and firm risk-taking solely within the banking sector, overlooking other FIs. This study contributes by using a comprehensive data set encompassing all types of FIs, thus extending the existing literature.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93470976646aa6594355d25884bc1d43",
  "timestamp": "2025-05-15T02:21:52.207982"
}