{
  "id": 1274,
  "title": "A Prediction Model for Stock Market: A Comparison of The World's Top Investors with Data Mining Method",
  "abstract": "Recently, many researches attempt to apply data mining methods to construct attractive decision support models for stock prediction. These models mainly focus on forecasting the price trend and providing advice for investors. According to the practical requirements, this paper proposes a model based on the combination of financial indicators and data mining methods to help fund managers make decision. Four industries were selected as our initial stock pool. One of the most popular data mining methods, support vector machine, was employed to construct a stock prediction model. The results indicate that our model is capable of selecting uptrend stocks. The predictive precision exceeds 60% for each industry in almost entire test period. The seven-year cumulative abnormal return exceeds 500%, much higher than the benchmark and even outperforms both Warren E. Buffett's and William J. O'Neil's investment methods. Although the return of our model is less than Richard Driehaus' in some of test years, the Sharpe ratio of our model is much higher in the whole seven-year test period, which indicates that the return series that Our model generated is more stable. Based on the above, a conclusion can be drawn that our model can provide sustained and effective guidance for fund managers on portfolio construction.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "934ab351a96339a0e1687c51c2f8c0de",
  "timestamp": "2025-05-15T00:53:42.176865"
}