{
  "id": 4244,
  "title": "High fluoride dentifrice for preventing and arresting root caries in community-dwelling older adults: A randomized controlled clinical trial",
  "abstract": "Objective: Self-administered non-invasive therapies with high-fluoride dentifrices are an attractive alternative to traditional restorative management of root carious lesions (RCLs), but the available evidence is still scarce, particularly in community-dwelling elders. The aim of this randomized controlled trial (RCT) was to compare the effectiveness of toothbrushing with 5,000 ppm versus 1,450 ppm fluoridated dentifrice (F- dentifrice) on preventing and arresting RCLs, in community-dwelling elders. Methods: A two years double-blinded RCT was carried out with 345 independently-living older adults, with at least one tooth with RCL. Participants were instructed to brush twice per day with either high-fluoride (5,000 ppm F) or the control dentifrice (1,450 ppm F). Incidence of new and arrested existing RCLs was recorded at two years and compared with the baseline data. Linear mixed regression model with repeated measures were used to test differences between groups (p < 0.05). Results: The percentage of teeth with active lesions varied significantly at two years, but in opposite directions for both groups. While the control group significantly increased the mean percentage of RCLs activity from baseline to two years, from 24.32% to 40.52%, the intervention decreased the percentage of activity from 29.74% to 3.72%. The incidence of RCL was 93.5% and 35.2% in participants of the 1,450 ppm and 5,000 ppm in the F- dentifrice groups, respectively, with a relative risk (RR) of 0.10 [CI: 0.05 - 0.19]. Conclusion: Non-invasive treatment with 5,000 ppm F dentifrice is more effective than conventional dentifrices in preventing and arresting RCLs in community dwelling elders. ClinicalTrials.gov NCT02647203. Clinical Significance: RCLs can be effectively prevented and arrested with the use of 5,000 ppm F dentifrice. Oral health programs directed to community-dwelling older adults might benefit from the inclusion of high fluoride dentifrice in their portfolio.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "934de9cd9206843f9056e62ab54e0268",
  "timestamp": "2025-05-15T01:25:23.219516"
}