{
  "id": 7284,
  "title": "Health and safety implications of recruitment payments in migrant construction workers",
  "abstract": "Background The Middle East construction sector is heavily reliant on a migrant workforce that predominantly originates from South Asia. It is common practice for migrant construction workers to pay a local labour recruiter the equivalent of one or more years' prospective overseas salary to secure employment, work and travel permits and transportation. The occupational health and safety implications of these financial arrangements remain unexplored. Aims To examine associations between payment to a labour recruiter, perceived general health and work-site accidents among migrant construction workers in the Middle East. Methods A questionnaire was completed by a convenience sample of predominantly Indian migrant construction workers drawn from a large construction project. The relationship between payment and risk of poor health and workplace accidents was assessed using multivariate logistic regression models (crude and adjusted for socio-demographic and occupational factors). Results There were 651 participants. The majority (58%) of migrant construction workers had paid a labour recruiter and similar to 40% had experienced a worksite accident. Between 3% (labourers) and 9% (foremen) perceived their health to be poor. Labourers and skilled workers who had paid a labour recruiter were significantly more likely to have experienced a worksite accident in the previous 12 months. Skilled workers, but not labourers and foremen, who had paid a labour recruiter were at increased risk of poor health. Conclusions The mechanisms linking labour recruiter payments to adverse safety and health outcomes warrant investigation with a view to developing interventions to erode these links.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9354743a5eb39f4e71f072b2fb28b1e9",
  "timestamp": "2025-05-15T03:07:02.616278"
}