{
  "id": 918,
  "title": "Effective Automated Feature Derivation via Reinforcement Learning for Microcredit Default Prediction",
  "abstract": "Microcredit is a new financial instrument serving the segment of population that typically lack collateral and are highly likely to be rejected by traditional financial institutions, by lending very small loans. For platforms that participate in such consumer finance activities, the key challenge lies in risk management and the popular credit scoring method predicting whether a borrower would default or not takes an important role in this field. However, the fact is that we are often facing mass of raw data and the traditional credit scoring is heavily depending on feature engineering involving domain expert knowledge, intuition and trial and error, which is often time consuming. It is very challenging to derive effective features from raw data as the searching space can be very large with noninformative features. In this paper, we propose a new performance-driven framework automated generating discriminating features from raw data via reinforcement learning to help improve the default prediction of the downstream classifier which may be a logistic regression or boosting tree. Specially, we first define a formal paradigm for the automated feature derivation framework which unifies the feature structure, its interpretation and the calculation logic together. For the particularity of the financial industry, the interpretation of the feature is often of high interest. Then we reformulate the feature generation problem as reinforcement learning by constructing a transformation link and regarding it as a sequential decision process. In addition, we carry out an effective practice on default prediction in consumer finance. Finally, experimental results on the data of user behavior log from 360 Financial show the significant improvement of the proposed method over our years of domain expert knowledge and the Genetic Programming. Moreover, this FDRL framework can be easily adapted to other applications due to its versatility.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "935b6ce63516d26463ee53c4ef54934a",
  "timestamp": "2025-05-15T01:56:49.542489"
}