{
  "id": 7023,
  "title": "Clinical and financial impact of intravenous erythromycin therapy in hospitalized patients",
  "abstract": "OBJECTIVE: TO determine the economic consequences of intravenous erythromycin use in hospital patients in a variety of clinical circumstances. DESIGN: Retrospective cohort study of patients with specified primary diagnosis-related group discharge diagnoses treated from January 1, 1990, to December 31, 1994, who received erythromycin, and a matched cohort group from the same period who did not receive erythromycin. SETTING: LDS Hospital, Salt Lake City, UT, a 520-bed teaching hospital. PATIENTS: A long-term archive of clinical and financial data from a computerized hospital information system was searched for patients meeting a strict case definition. This archive contained information on erythromycin exposure as well as concurrent drug therapy and adverse drug events that had been prospectively evaluated during hospitalization throughout the study and cohort periods. Detailed costs were available for each patient. MAIN OUTCOME MEASURE: Attributable differences in lengths of stay and total costs determined using linear regression modeling. RESULTS: For 797 erythromycin patients and 2771 cohort patients, we found an attributable increased length of stay of 2.14 days and an increased cost of hospitalization of $6061 for erythromycin case patients. Case patients also had a significantly increased risk of adverse drug events. Linear regression modeling showed that erythromycin use was significantly related to increased length of stay and cost of hospitalization. CONCLUSIONS: Intravenous erythromycin use has been associated with significant increases in hospital length of stay and total hospital cost.",
  "year": 1999,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9369f8d3ff7eb2731c75d3bb3f99a16d",
  "timestamp": "2025-05-15T03:04:22.987945"
}