{
  "id": 5796,
  "title": "Factors Influencing Informal Credit Access and Utilization among Smallholder Farmers: Insights from Mountainous Regions of Pakistan",
  "abstract": "Access to credit plays an important role in the adoption of modern agricultural practices, such as better seeds, pesticides, and fertilizers, as well as in the sustainable utilization of land by smallholder farmers. This study explores the dynamics of smallholders' access to and utilization of informal credit to manage local farming systems. The data were collected from rural households in the Dir Kohistan mountainous region of Pakistan in 2021. A bivariate probit model was employed to analyze the data from 300 randomly selected farming households. Our findings indicate that a significant proportion of respondents (70%) reported having access to informal credit, with 65% actively utilizing credit to bolster the economic viability of their farms. This study reveals various strategies that farmers employ in response to credit constraints. The majority of farmers (69%) prioritize meeting their own farm/household needs. Social networks, particularly friends, emerge as key sources of informal credit (58.1%). The results of the bivariate probit regression analysis identify positive relationships with fellow farmers and neighbors/relatives, along with a lower perceived risk, as the most significant factors influencing access to and utilization of informal credit. Therefore, our study recommends the promotion of relationships and linkages among farmers through facilitated networking events, introducing risk mitigation measures and promoting financial literacy programs to empower smallholder capacities on the credit market. Policymakers are urged to recognize the role of social relationships and consider policies that promote community credit practices for the overall financial well-being of farmers, especially in more isolated mountain areas.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "936d1263332e4ca166d76f4a4de582f2",
  "timestamp": "2025-05-15T02:51:30.083367"
}