{
  "id": 8194,
  "title": "Characteristics of Syncope Admissions Among Hospitals of Varying Teaching Intensity",
  "abstract": "Objectives: Previous work suggests that hospitals' teaching status is correlated with readmission rates, cost of care, and mortality. The degree to which teaching status is associated with the management of syncope has not been studied extensively. We sought to characterize the relation between teaching status and inpatient syncope management. Methods: We created regression models to characterize the relation between teaching status and cardiac ischemic evaluations (cardiac catheterization and/or stress test) during syncope admissions. Admissions with a primary diagnosis of syncope in Maryland and Kentucky between 2007 and 2014 were included. Results: The dataset included 71,341 syncope admissions at 151 hospitals. Overall, 15% of patients had an ischemic evaluation. There was a significantly lower likelihood of an ischemic evaluation at major teaching hospitals relative to nonteaching hospitals (adjusted odds ratio 0.75, 95% confidence interval 0.71-0.79), but a higher likelihood of an ischemic evaluation at minor teaching hospitals (adjusted odds ratio 1.21, 95% confidence interval 1.16-1.25). Conclusions: By definition, the syncope admissions included were unexplained or idiopathic cases, and thus likely to be lower-risk syncope cases. Those with a known etiology are coded by the cause of syncope, as dictated by coding guidelines. It is likely that many of these ischemic evaluations represent low-value care. Financial incentives and processes of care at major teaching hospitals may be driving this trend, and efforts should be made to better understand and replicate these at minor teaching and nonteaching hospitals.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "936d77b92092bd9754d46a93057fb739",
  "timestamp": "2025-05-15T03:16:17.418389"
}