{
  "id": 2899,
  "title": "Risk factors in Vietnamese financial stock returns",
  "abstract": "PurposeThe exclusion of financial stocks in well-known asset pricing models is problematic because they play an essential role not only in capital markets but also in the entire economy. This study aims to present evidence on risk factors affecting the expected returns of financial stocks in the context of a frontier emerging market such as Vietnam.Design/methodology/approachBased on data of 81 Vietnamese financial firms from 2011 to 2023, the authors perform the CAPM, three-factor, five-factor, and six-factor models of Fama and French (1993, 2015, 2018). Because provision could be an essential implication of default risk level, the authors build the provision factor by creating a zero-investment strategy that is long on financial stocks with low provision rates and short on high provision rate stocks. The effectiveness of asset pricing models is evaluated using regression analysis, the GRS test of Gibbons et al. (1989), the redundancy test of Fama and French (2018) and the cross-sectional test of Fama and MacBeth (1973).FindingsAlthough size and value risk premiums are prevalent in Vietnamese financial stocks, other firm-specific factors such as profitability, investment and momentum are not priced in financial stock returns. Empirical results document that provision is a relevant risk factor to financial stock returns. The three-factor model of Fama and French (1993) augmented with provision and turnover factors outperforms other models in explaining financial stock returns. Robustness tests lend further credibility to the findings.Originality/valueThis paper makes three key contributions. First, to the best of the authors' knowledge, this is the first study to examine risk factors that are priced in Vietnamese financial stocks. Second, the authors highlight the relevance of provision in financial stock pricing. Finally, it is not only an out-of-sample test for the prominent Fama-French asset pricing models but also contributes to investment strategies in Vietnamese financial stocks.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "937110c1bfbcef2735d7b13a8a177a69",
  "timestamp": "2025-05-15T02:20:16.951352"
}