{
  "id": 3268,
  "title": "Textual analysis and corporate bankruptcy: A financial dictionary-based sentiment approach",
  "abstract": "Current works in textual analysis for the financial reports are trying to quantify textual data as meaningful predictors for the future financial performance or stock returns. However, little works have been paid to determining predictors for enterprise survival using the feature-rich data as the textual financial reports. Our work proposes new financial sentiment measurements built on top of mining the textual reports using a financial sentiment dictionary and the rule-based sentiment analysis to determine whether the manager's reflections towards their company's performance are positive, negative, or neutral in the business and financial context. We examine the effects of the proposed measurements and compare them with other conventional predictors on forecasting the corporate liquidation. We especially emphasise on the predictivity of the textual analysis for credit risk modelling and how the textual-based predictors differ from the traditional predictors in terms of accurateness. Our research, which is carried on a large sample of the US enterprises with company characteristics, financial ratios, and financial sentiment measurements, show that the textual features built on the 10-K filings significantly improve classification performance of the prediction models on all segments including small and medium enterprise (SME), non-SME, and all samples.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9378c2ffc5d0012605ede3e5b35460e8",
  "timestamp": "2025-05-15T02:24:39.569568"
}