{
  "id": 408,
  "title": "Elements of strategic cost management: exploring relationship with strategic options",
  "abstract": "Objective: This study analyzes the relationship between Elements of Strategic Costs Management (SCM) and Strategic Options in companies listed in the Brazilian Stock Market. A total of 40 companies from different sectors were surveyed using Management Reports. Method: To categorize the data, we used a checklist composed of predefined categories and subcategories based on characteristics of the Elements and Strategic Options. For the analysis of the relationship between the variables, multiple linear regression by the Stepwise method was used. Originality/Relevance: The study starts from a gap in the theoretical cut-offs about the relation between strategic options and types of control adopted by the company, mainly related to the Elements of SCM. In Brazilian studies on SCM elements, it is the first to employ a framework that considers the three main strategic variables used in the SCM literature. Results: The relationship between strategic options and the use of certain elements was found. Elements related to cost analysis and structural determinants are most cited by prospective companies and companies that seek differentiation. Companies using hold strategy cite more elements linked to the actions of customers, suppliers, and strategic pricing. Activity-based costing / activity-based management, total cost of ownership, open accounting, quality cost management, and utilization of production capacity didn't show any relation to strategic options. Theoretical/Methodological contributions: It's unheard of the significant relationship found between analytical typology and certain elements since there was no such evidence in any other study addressed in this research. The study provides empirical evidence that Strategic Options relate to elements of SCM used by companies.",
  "year": 2020,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "938cbe520a164d5ffb8ea84e54d43cc7",
  "timestamp": "2025-05-15T01:31:50.646588"
}