{
  "id": 5880,
  "title": "Using Latent Class Analysis to Identify Profiles of Elder Abuse Perpetrators",
  "abstract": "Objectives: Research suggests that abuser risk factors differ across elder mistreatment types, but abuse interventions are not individualized. To move away from assumptions of perpetrator homogeneity and to inform intervention approaches, this study classifies abusers into subtypes according to their behavior profiles. Method: Data are from the Older Adult Mistreatment Assessment administered to victims by Adult Protective Service (APS) in Illinois. Latent class analysis was used to categorize abusers (N = 336) using victim and caseworker reports on abusers' harmful and supportive behaviors and characteristics. Multinomial logistic regression was then used to determine which abuser profiles are associated with 4 types of mistreatment-neglect, physical, emotional, and financial-and other sociodemographic characteristics. Results: Abusers fall into 4 profiles descriptively labeled Caregiver, Temperamental, Dependent Caregiver, and Dangerous. Dangerous abusers have the highest levels of aggression, financial dependency, substance abuse, and irresponsibility. Caregivers are lowest in harmful characteristics and highest in providing emotional and instrumental support to victims. The 4 profiles significantly differ in the average age and gender of the abuser, the relationship to victims, and types of mistreatment committed. Discussion: This is the first quantitative study to identify and characterize abuser subtypes. Tailored interventions are needed to reduce problem behaviors and enhance strengths specific to each abuser profile.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93a476f1c877d71962c1e6ccfb19e442",
  "timestamp": "2025-05-15T02:52:31.408572"
}