{
  "id": 8653,
  "title": "Food Insecurity Among Community College Caregivers During the COVID-19 Pandemic",
  "abstract": "Objective: The purpose of this paper was to examine variables associated with food insecurity among community college caregivers during the COVID-19 pandemic. Methods: We used data from a multi-institutional survey of 15,051 caregivers enrolled at 130 community colleges in 42 states in fall 2020. We used a logistic regression to examine whether demographic, academic, caregiving-related, financial, or COVID-19-related variables were associated with caregivers' food insecurity. Results: Over half (52%) of community college caregivers experienced food insecurity. Transgender caregivers, first-generation caregivers, and caregivers who were divorced or single, had multiple disabilities, were previously in foster care, and had a family that experienced trouble making ends meet growing up had significantly (p < .05) higher probabilities of experiencing food insecurity. Community college caregivers who used childcare and those with at least one child up to 12 years old also had increased probabilities of experiencing food insecurity. Moreover, caregivers who felt childcare was not affordable and believed that they did not earn enough money to make employment worthwhile after paying for childcare expenses had higher probabilities of experiencing food insecurity, as did those who experienced housing insecurity and used Pell grants, student loans, and support from friends or family to pay for college. Losing a job, experiencing cuts to work hours or wages, employment as a frontline worker, and contracting COVID were associated with higher probabilities of food insecurity. Contributions: Community college caregivers experienced high rates of food insecurity during the pandemic and some caregivers were at greater risk of exacerbated probabilities of food insecurity. We advocate for targeted interventions, wraparound services, and increased advocacy for legislation to support student caregivers.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93a732304a6d835b45e75bfa83a5e87d",
  "timestamp": "2025-05-15T03:20:55.989403"
}