{
  "id": 2972,
  "title": "Bank competition, regulatory capital, and risk taking: international evidence",
  "abstract": "PurposeMotivated by recent financial liberalization policies in emerging markets, this study investigates whether bank competition and regulatory capital affect bank risk taking in an international banking context.Design/methodology/approachBank competition is regressed, using GLS regression, on various measures of bank risk, to reflect regulatory, accounting and market-based risk-taking. The authors use a sample of publicly traded banks operating in Africa during 2004-2019.FindingsResults show that higher level of bank competition increases bank risk taking and results in greater financial fragility in the absence of banking capital regulations. Furthermore, larger capital adequacy ratios control the risk-taking incentives of managers and guard banks against the risk of default. Further tests confirm the significance of market-based risk measures over accounting and regulatory measures.Practical implicationsFindings are relevant to bank managers and regulators in their sustained effort of finding an optimal balance between bank competition and financial stability. Increased competition should be balanced with capital regulations to curtail bank excessive risky behavior and derive the social benefits of greater competition in the market while sustaining overall economic growth.Originality/valueThis study provides novel evidence in an international context. First, it uses regulatory, accounting and market-based measures of bank risk taking to reflect regulators', management and market participants' emphasis. Another original contribution is the investigation of bank competition across African economies characterized by financial liberalization, stringent banking system and interesting socio-economic challenges.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93b6393ffcbed2dd1ec4742c813ee294",
  "timestamp": "2025-05-15T02:21:19.207052"
}