{
  "id": 5423,
  "title": "Risk and risk management practices A comparative study between Islamic and conventional banks in Qatar",
  "abstract": "Purpose This study aims to compare types and levels of risk and risk management practices (RMPs) including the recognition, identification, assessment, analysis, monitoring and control of risk in both Islamic and conventional banks. Design/methodology/approach A questionnaire survey was conducted among the Islamic and conventional banks in Qatar, together with an analysis of archival data extracted from the Thomson Reuters Eikon database for the period 2009-2018. Data were analysed using descriptive statistics, ANOVA and regression analysis. Findings Islamic banks encounter unique types and levels of risk that are not encountered by conventional banks. In Islamic banks, risks such as those of operation and Sharia non-compliance are perceived to be higher, while in conventional banks other risks such as those of credit and insolvency are higher; other risks, for example, liquidity risk, are faced by both. RMPs are determined by understanding risk and risk management, risk identification, risk monitoring and control and credit risk analysis, but not by risk assessment and analysis. However, the RMPs of the two types of bank are not significantly different, except in the analysis of credit risk. Originality/value The study helps to explain the mixed results of previous studies that compare types and levels of risk and RMPs in Islamic and conventional banks. Using different types of data and analysis, it provides evidence from one of the fastest growing economies in the world. It also addresses the concerns over RMPs in banks since the global financial crisis.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93be2063b4b3971554cb992f3ec90610",
  "timestamp": "2025-05-15T02:47:42.884997"
}