{
  "id": 7178,
  "title": "Strategies for deep renovation market of detached houses",
  "abstract": "Deep renovation of the buildings is a key for sustainable development, however, the rate of deep renovation of residential buildings in the European Union (EU) is lower than what is required to meet the climate and energy goals. This paper analyses peculiarities and commonalities in market conditions and approaches to deep renovation of single-family (or detached) houses in Denmark and Sweden. The market analysis covers the Political, Economic, Social and Technical (PEST) dimensions and is based on systematic literature review and findings of market gap analysis. The PEST analysis is complemented with responses from 49 stakeholders/experts to examine the strengths, weaknesses, opportunities and threats (SWOT analysis) for deep renovation market. The synthesis of SWOT and PEST led to some strategies for deep renovation. Furthermore, policies and strategies adopted by some other countries have been discussed to place findings from this study in the regional and global context. Capacity building in designing and managing deep renovation with technological advancement and construction practices; and enforcement of quality assurance systems of artisans could avoid the perceived risk and inconveniences associated with renovation. Encouraging systematically planned stepwise deep renovation through One-Stop shop and linking such renovation with appropriate financing mechanism could attract more homeowners with financial limitations. Besides, clustering several houses in need of renovation and appropriate energy/carbon pricing mechanisms could make the renovation market more attractive for investors and construction companies. The findings of this paper are of interest for the construction companies, policymakers, investors, and analysts about deep renovation market.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93caeae09ce27dcbabbb005eab6c53e7",
  "timestamp": "2025-05-15T03:06:01.187513"
}