{
  "id": 2038,
  "title": "Assessment of contribution of Australia's energy production to CO2 emissions and environmental degradation using statistical dynamic approach",
  "abstract": "Energy production remains the major emitter of atmospheric emissions, thus, in accordance with Australia's Emissions Projections by 2030, this study analyzed the impact of Australia's energy portfolio on environmental degradation and CO2 emissions using locally compiled data on disaggregate energy production, energy imports and exports spanning from 1974 to 2013. This study employed the fully modified ordinary least squares, dynamic ordinary least squares, and canonical cointegrating regression estimators; statistically inspired modification of partial least squares regression analysis with a subsequent sustainability sensitivity analysis. The validity of the environmental Kuznets curve hypothesis proposes a paradigm shift from energy-intensive and carbon-intensive industries to less-energy-intensive and green energy industries and its related services, leading to a structural change in the economy. Thus, decoupling energy services provide better interpretation of the role of the energy sector portfolio in environmental degradation and CO2 emissions assessment. The sensitivity analysis revealed that non renewable energy production above 10% and energy imports above 5% will dampen the goals for the 2030 emission reduction target. Increasing the share of renewable energy penetration in the energy portfolio decreases the level of CO2 emissions, while increasing the share of non-renewable energy sources in the energy mix increases the level of atmospheric emissions, thus increasing climate change and their impacts. (C) 2018 Elsevier B.V. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93ce4a6bc2c790f10775e1d023a9a4d4",
  "timestamp": "2025-05-15T01:02:10.359535"
}