{
  "id": 9261,
  "title": "Racial disparities in pregnancy options counseling and referral in the US South",
  "abstract": "Objective: The objective of this study is to examine racial variation in receipt of counseling and referral for pregnancy options (abortion, adoption, and parenting) following pregnancy confirmation. Equitable offering of such information is a professional and ethical obligation and an opportunity to prevent racial disparities in maternal and child health. Data Source: Primary data from patients at southern United States publicly funded family planning clinics, October 2018-June 2019. Study Design: Patients at 14 clinics completed a survey about their experiences with pregnancy options counseling and referral following a positive pregnancy test. The primary predictor variable was patients' self-reported racial identity. Outcomes included discussion of pregnancy options, referral for those options, and for support services. Data Collection: Data from eligible patients with non-missing information for key variables (n = 313) were analyzed using descriptive statistics, chi(2) tests, and multivariable logistic regression. Principal Findings: Patients were largely Black (58%), uninsured (64%), and 18-29 years of age (80%). Intention to continue pregnancy and receipt of prenatal care referral did not differ significantly among Black as compared to non-Black patients. However, Black patients had a higher likelihood of wanting an abortion or adoption referral and not receiving one (abortion: marginal effect [ME] = 7.68%, p = 0.037; adjusted ME [aME] = 9.02%, p = 0.015; adoption: ME = 7.06%, p = 0.031; aME = 8.42%, p = 0.011). Black patients intending to end their pregnancies had a lower probability of receiving an abortion referral than non-Black patients (ME = -22.37%, p = 0.004; aME = -19.69%, p = 0.023). In the fully adjusted model, Black patients also had a higher probability of wanting access to care resources (including transportation, childcare, and financial support) and not receiving them (aME = 5.38%, p = 0.019). Conclusions: Clinical interactions surrounding pregnancy confirmation provide critical opportunities to discuss options, coordinate care, and mitigate risk, yet are susceptible to systemic bias. These findings add to limited evidence around pregnancy counseling and referral disparities. Ongoing assessment of pregnancy counseling and referral disparities can provide insight into organizational strengths or the potential to increase structural equity.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93e0fca48fc051483138c8efae2a0b15",
  "timestamp": "2025-05-15T03:26:54.629326"
}