{
  "id": 3563,
  "title": "The Relationship between Risk Disclosure and Firm Performance: Empirical Evidence from Saudi Arabia",
  "abstract": "This study aims to examine the moderating effect of risk management disclosure on the relationship between risk disclosure and firm performance as an attempt to contribute to the increasing body of literature concerning risk management disclosure by extracting new evidence from a fast-growing economic environment in Saudi Arabia. We used content analysis of cross-sectional data extracted from the audited annual reports of 72 non-financial Saudi listed firms in various non-financial sectors for the year 2018. Research hypotheses have been tested by using two robust statistical models (MM-Estimator Model and Robust Regression Model). The findings showed no evidence that risk disclosure and risk management disclosure matter concerning firm performance measured by the average of earning per share EPS when they are examined individually. However, when the moderating effect of risk management disclosure is considered, the results become significantly positive. These outcomes could explain one of the main reasons of the different and dissimilar findings of previous studies, which investigate the impact of risk disclosure and risk management disclosure on firm performance individually. Also, the results of this paper will help practitioners to reconsider the interacting relations of their risk disclosure and risk management disclosure actions on firm's performance.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93edd2176694f072dee9e57d9075ee3b",
  "timestamp": "2025-05-15T02:27:53.933014"
}