{
  "id": 6549,
  "title": "A Cross-Sectional Study on Socioeconomic Systems Supporting Outpatients With Parkinson's Disease in Japan",
  "abstract": "Objectives: We conducted a cross-sectional study to evaluate the socioeconomic systems supporting outpatients with Parkinson's disease (PD) in Japan. Methods: The study was performed in 2013 at two private hospitals and one clinic in Hokkaido Prefecture, Japan. A survey was conducted with 248 consecutive PD patients, and the data from 237 PD outpatients were analyzed after excluding 11 patients who did not meet inclusion criteria. Monthly medical and transportation payments as a PD outpatient were selected as outcome variables, and their association with various explanatory variables, such as utilization of support systems for PD outpatients, were evaluated using logistic regression model analysis. Results: After controlling for potential confounding variables, the utilization of the system providing financial aid for treatment for patients with intractable disease was significantly inversely associated with monthly medical payment among PD outpatients (OR 0.46; 95% CI, 0.22-0.95). Experience of hospital admission for PD treatment was significantly positively associated with monthly transportation payment (OR 4.74; 95% CI, 2.18-10.32). Monthly medical payment was also significantly positively associated with monthly transportation payment (OR 4.01; 95% CI, 2.23-7.51). Conclusions: Use of Japanese public financial support systems may be associated with reductions in medical payments for PD outpatients. However, those systems may not have supported transportation payments, and higher transportation payments may be associated with an increased risk of hospitalization.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93f43cb2e411c943d4173db1f27ec1c5",
  "timestamp": "2025-05-15T02:59:07.567996"
}