{
  "id": 5532,
  "title": "Roles of gender, social anxiety and extraversion in drinking patterns among Nigerian students",
  "abstract": "Background Effective interventions to curb the growing alcohol use problem in African countries require an understanding of critical factors associated with drinking patterns. Previous studies have examined the contributions of gender, social anxiety and extraversion in alcohol use, but little research exists on the operationalization of drinking patterns as high-risk situations for alcohol use, and the contributions of these factors. This study is aimed at filling this gap. Methods Participants were 276 students (males 52.2%) of a university in south-eastern Nigeria. They completed validated measures of social anxiety, extraversion and drinking patterns (financial, physiological, interpersonal, marital and emotional). Results Hierarchical multiple linear regression results showed that male students were more likely than female students to drink alcohol in situations related to financial, interpersonal, and emotional issues, but both genders were similarly involved in alcohol use in physiological and marital relationship issues. Social anxiety and extraversion did not have significant associations with drinking patterns. Being married or in romantic relationship was associated with higher drinking frequency. Conclusion Attention should be given to the use of alcohol in the context of romantic relationships for male and female students.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "93f7db33f84e38184b9ec8157b2acf3b",
  "timestamp": "2025-05-15T02:48:51.314464"
}