{
  "id": 9230,
  "title": "Understanding the long-term impact of flooding on the wellbeing of residents: A mixed methods study",
  "abstract": "As the effects of climate change become more visible, extreme weather events are becoming more common. The effects of flooding on health are understood but the long-term impact on the well-being of those affected need to be considered. This mixed methods secondary analysis of a cross-sectional survey examined the extent to which being flooded in the past is associated with ongoing concerns about flooding. Survey data were collected from residents in Hull 11 years after the initial flooding event. Respondents were asked about the floods in 2007 and their current level of concern about flooding. Ordinal logistic regression explored the effect of age and tenancy status as predictors of current concern. Textual data were analyzed using thematic content analysis. Responses were received from 457 households, of whom 202 (48%) were affected by flooding in 2007. A fifth of respondents were very concerned about future flooding. Those who were not flooded were significantly less concerned about the risk of future flooding (U = 33391.0, z = 5.89, p < 0.001). Those who reported negative health and wellbeing effects from the floods were significantly more concerned about future flooding than those whose health was not affected (U = 7830.5, z = 4.43, p < 0.001). Whilst some residents were reassured by the introduction of new flood alleviation schemes, others did not feel these were adequate, and worried about the impact of climate change. The financial and emotional impacts of the floods still resonated with families 11 years after the event, with many fearing they would not cope if it happened again. Despite the 2007 floods in Hull happening over a decade ago, many of those affected continue to experience high levels of anxiety when storms are forecast. Residents feel powerless to protect themselves, and many remain unconvinced by the presence of new flood alleviation schemes. However, with the ongoing threat of climate change, it may be that other residents are unrealistic in their expectation to be 'protected' from flood events. Therefore, public health agencies need to be able to mobilize organizations to come together to pro-actively support families affected by flooding, to ensure those in need do not fall through the gaps of public healthcare delivery.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9400257bf0262c615dca26e197d48d77",
  "timestamp": "2025-05-15T03:26:54.538917"
}