{
  "id": 5962,
  "title": "Firm performance and cost of equity capital: the moderating role of narrative risk disclosure quality in Egypt",
  "abstract": "This paper aims to examine the moderating effect of the narrative risk disclosure quality on the association between firm performance and the cost of equity capital in the Egyptian setting. Manual content analysis and factorial principal component techniques are used to quantify the quality dimensions of the narrative risk disclosures. The weighted average cost of equity is used to estimate the firms' costs of equity. A cross-sectional analysis was conducted over three years (2018-2020) for a sample of 73 non-financial firms listed on the Egyptian Stock Exchange (EGX100). Multiple OLS regression models are employed to test the hypotheses. The results reveal a negative association between firm performance and the cost of equity and, while such association strengthened when adding the narrative risk disclosure quality as a moderator variable. This suggests that risk disclosure is important to stockholders' investment decision-making in the Egyptian context. Based on the dearth of literature related to the economic reverberations of narrative risk disclosure quality in emerging economies, this study contributes to the risk reporting literature by providing evidence on the moderating effect of the narrative risk disclosure quality and its reverberations on the firm's cost of equity capital in one of the emerging economies as Egypt. With regard to the findings of this study, we expect to contribute to the practice and theory by providing new and different insights about the moderating effect of narrative risk disclosure on the association between firm performance and cost of equity capital.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "94043a60f6fd7bca986d54fe73c99e35",
  "timestamp": "2025-05-15T02:53:03.217580"
}