{
  "id": 5890,
  "title": "Estimating the impact of the outbreak of wars on financial assets: Evidence from Russia-Ukraine conflict",
  "abstract": "This study analyzes the performance of the Shanghai Composite Index, S&P 500 index, WTI oil price, and LBMA gold price when wars took place, especially the Russia-Ukraine conflict. We employ empirical methods to explore the stability, instantaneous shock, and short-term shock regarding the abovementioned financial assets. We first adopt the event study method to ascertain whether the cumulative abnormal returns of the selected assets are significant when wars break out. Then, we use the permutation test to examine the significance of price level changes. Results show that only the Shanghai Composite Index is relatively stable. Second, the difference -indifferences model indicates that the 3 unstable assets all suffered positive shocks in their price levels within several days after the Russia-Ukraine conflict broke out. The parallel trend test confirms the validity of establishing the difference-in-differences model. Third, regression discontinuity is designed to measure the impact in a longer event window, suggesting the robustness of conclusions of the difference-in-differences model and revealing an upward trend before the conflict and a downward trend after the conflict of the financial assets. The study suggests that investors consider adjustments to investment strategies and governments take precautions to diminish the risk of the outbreak of wars.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "940911c16e544298b8c48bb23614fe54",
  "timestamp": "2025-05-15T02:52:31.456412"
}