{
  "id": 8258,
  "title": "Debt Financing and Accounting Conservatism in Private Firms",
  "abstract": "This study investigates the role of public debt financing in shaping accounting conservatism in privately held companies. We focus on the change in conservatism of private firms following initial issuance of public debt and examine the effects of agency conflicts between bondholders and shareholders on the change in conservatism. Regression analyses on a large sample of public bond issues by Korean private firms reveal the following: First, private firms with public debt exhibit a higher degree of conservatism than those with exclusively private debt. The incremental effect of public debt on the level of conservatism is virtually equivalent in magnitude to that of public equity. Second, and more importantly, private firms that issue public debt for the first time show a significant increase in conservatism, whereas corresponding public firms do not. Third, private firms with high agency costs of public debt (characterized by high-information asymmetry and high credit risk) undergo a greater increase in conservatism following their initial bond issues than those with low agency costs. Further analysis shows that private firms sustain increased levels of conservatism even beyond the time period of average maturity of initial bonds and that bond investors reward this long-term commitment to conservative accounting by gradually reducing interest rates for seasoned bond issuers. The findings of this study shed light on how information demand arising from public debt issuance, especially by private firms with high ex ante agency costs, engenders conservative financial reporting in emerging markets.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "940b4a94cfe46dfeb512112ea7df6f87",
  "timestamp": "2025-05-15T03:16:49.068456"
}