{
  "id": 2367,
  "title": "The Impact of Digital Technologies and Sustainable Practices on Circular Supply Chain Management",
  "abstract": "Background: This study investigates how firms can enhance the functionality of their circular supply chains (CSCs) by adopting a portfolio of sustainable practices as well as digital technologies to increase performance. It analyzes the benefits that firms can obtain when investing in specific technologies to boost the impact of technologies and sustainable practices on CSCs, and further increase performance. Methods: We test several hypotheses by using structural equation modeling as well as multi-group analysis to verify whether CSCs can be achieved through sustainable practices and technologies and improve the firms' performance. Results: The empirical results partially support the research hypotheses. While the main research hypotheses are fully supported, the analysis of single digital technologies reveals that only a few solutions can contribute to both the management and the improvement of the CSC. Conclusions: Our findings demonstrate that the identification of green suppliers and ad hoc environmental regulations, combined with attention to the origin and provenance of raw materials, can promote a CSC. Moreover, transportation management systems (TMS) and the internet of things (IoT) are efficient technologies for managing transportation and product flow in the CSC. Furthermore, machine learning (ML) is effective in making positive green decisions, and 3D printing can extend product life.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "940ec27f9bdc5e9fa7b44d642fdff58e",
  "timestamp": "2025-05-15T01:06:10.743529"
}