{
  "id": 7666,
  "title": "The relationship between air pollution and diabetes: A study on the municipalities of the Metropolitan City of Milan",
  "abstract": "Aims: Urbanisation has been linked with an increased risk of developing diabetes mellitus, dramatically worsening the healthcare system's financial burden. Environmental influences are emerging among the causing factors of the urban diabetes epidemic. We evaluated the relationship between air pollution and the prevalence of diabetes in the Municipalities of the Metropolitan City of Milan, comprising more than 3,4 million citizens. Methods: The prevalence of diabetes in the resident population and the mean annual air concentrations of PM10 and NO2 were retrieved from the municipal Agency for Health Protection and the regional Agency for Ambient Protection datasets. Two linear regression models were estimated to inspect the relationships between the (logit-based transformed) diabetes prevalence and air pollution concentrations, namely: (i) PM10, and (ii) NO2. Both models were adjusted for five control variables, including the qualitative variable year (2011-2018). Results: Both models highlight a statistically significant positive relationship between air pollutants and diabetes prevalence. An increase of one PM10 or NO2 concentrations' unit translates into a rise of 0.81% or 0.41% in diabetes prevalence, respectively. Conclusion: Our results contribute to the ongoing research regarding health outcomes of urbanisation dynamics and should be considered in city planning policies. (C) 2021 Elsevier B.V. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9412980c0bb87c1c5b3224acd15b9382",
  "timestamp": "2025-05-15T03:11:04.495584"
}