{
  "id": 7271,
  "title": "Does reaction to controversy in corporate narratives depend on its significance for various stakeholders?",
  "abstract": "PurposeThe study aims to determine whether a relationship exists between the potential significance of corporate controversies for stakeholders and how organisations respond to them in their annual and sustainability reports.Design/methodology/approachThis paper employs content analysis on annual and sustainability reports of 48 listed companies from the Refinitiv database. The logit regression was used to estimate the model.FindingsThe study revealed that the main factors increasing the probability of a controversial issue being addressed in a corporate report are the controversy's potential significance, companies' financial performance and lawsuits.Research limitations/implicationsOur study has three major limitations. These are a relatively small sample of companies and reports, focusing on disclosures made in corporate reports and omitting other channels of communication, for example, social media, and a certain amount of subjectivity in the process of coding information.Social implicationsFormer studies show that corporations face a serious risk of their hypocritical strategies becoming too evident for stakeholder groups. Our findings suggest that the risk is already materialising and may undermine the idea of CSR and sustainability reporting.Originality/valueOur research focuses on high-profile adverse incidents widely reported in the media, the omission of which from corporate reports seems to constitute a particular case of organised hypocrite. It also demonstrates that companies use an impression management strategy to defuse adverse publicity and that major controversies cause minor ones to be omitted from their reports.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9415550efa55a1f970532b63c7770b05",
  "timestamp": "2025-05-15T03:07:02.543420"
}