{
  "id": 1203,
  "title": "The usage of logistic regression and artificial neural networks for evaluation and predicting property-liability insurers' solvency in Egypt",
  "abstract": "Unlike prior solvency prediction studies conducted in Egypt, this study aims to set up a real picture of companies' financial performance in the Egyptian insurance market. Therefore, 11 financial ratios commonly used by NAIC, AM BEST Company, and S & P Global Ratings were calculated for all property-liability insurance companies in Egypt from 2010 to 2020. They have been used to measure those companies' financial performance efficiency levels by comparing these ratios with the international standard limits. The financial analysis results for those companies revealed that property-liability insurers in Egypt do not have the same level of financial performance efficiency where those companies are classified into three groups: excellent, good, and poor. Furthermore, this paper investigates using the stepwise logistic regression model to determine the most factors among these selected financial ratios that influence those companies' financial performance. The results suggest that only three ratios were statistically significant predictors: Risk retention rate, Insurance account receivable to total assets, and Net profit after tax to total assets. Finally, this paper presents the multi-layers artificial neural network with a backpropagation algorithm as a new solvency prediction model with perfect classifying accuracy of 100%. The trained ANN could predict the next fiscal year with a prediction accuracy of 91.67%, and this percent is a good and favorable result comparing to other solvency prediction models used in Egypt.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "94195fefd0b69b1b3265b9f688b11dc0",
  "timestamp": "2025-05-15T01:59:56.369629"
}