{
  "id": 5762,
  "title": "What health policy makers need to know about mismatches between public perceptions of disease risk, prevalence and severity: a national survey",
  "abstract": "Objectives The aim of this study was to assess people's perceptions of their personal risk, population prevalence and perceived severity in relation to three key health conditions (cancer, heart disease and hearing loss), gauge the size of any misperceptions, and identify correlates of such misperceptions. Design This study was a cross-sectional survey. Study sample A total of 10,401 adults representative of the UK population were participated in the study. Results Clear majorities of people incorrectly believe that they are at greater personal risk of cancer (>75%), that cancer is more prevalent in the population (>50%) and that cancer is more disabling (>65%), than either heart disease or hearing loss. In turn, people consistently regard their personal risk of hearing loss, the population prevalence of hearing loss and the severity of hearing loss as lower than either cancer or heart disease. Multiple regression analyses showed inconsistent patterns of relationships between people's beliefs, sociodemographic characteristics and their health behaviours. Conclusions Accuracy in beliefs about cancer, heart disease and hearing loss is low, and the relationships between these beliefs, their potential antecedents and consequences are complex. Policy makers should ensure close adherence to evidence or risk-making decisions that are costly both in financial terms and in terms of suboptimal population subjective well-being.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "941d2a6e8a41bb690f8caa9e10969924",
  "timestamp": "2025-05-15T02:50:54.027476"
}