{
  "id": 3278,
  "title": "Coordinated expansion planning of transmission and distribution systems integrated with smart grid technologies",
  "abstract": "Integration of smart grid technologies in distribution systems, particularly behind-the-meter initiatives, has a direct impact on transmission network planning. This paper develops a coordinated expansion planning of transmission and active distribution systems via a stochastic multistage mathematical programming model. In the transmission level, in addition to lines, sitting and sizing of utility-scale battery energy storage systems and wind power plants under renewable portfolio standard policy are planned. Switchable feeders and distributed generations are decision variables in the distribution level while the impact of demand response programs as a sort of behind-the-meter technologies is accommodated as well. Expansion of electric vehicle taxi charging stations is included as a feasible option in both transmission and distribution levels. In order to deal with short-term uncertainty of load demand, renewable energy sources output power, and the charging pattern of electric vehicle taxis in each station, a chronological time-period clustering algorithm along with Monte Carlo simulation is utilized. The proposed model is tackled by means of Benders Dual Decomposition (BDD) method. The IEEE RTS test system (as the transmission system) along with four IEEE 33-node test feeders (as distribution test systems) are examined to validate effectiveness of the proposed model.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "941ef58769c1536ebc77548a3282b458",
  "timestamp": "2025-05-15T01:15:26.166088"
}