{
  "id": 504,
  "title": "Data-driven product configuration improvement and product line restructuring with text mining and multitask learning",
  "abstract": "In the era of big data, data-driven product configuration improvement and product line restructuring are two important and interrelated problems, and joint decision-making regarding these two problems needs to be tackled. There are two difficulties to achieve the joint decision-making. One is to obtain consumer choice probabilities related to improved product configurations, and the other is to obtain the best product configuration portfolio. In this study, a framework combining text mining and multitask learning is developed to deal with the difficulties. In the framework, improved product configurations are generated using online reviews and transaction data of the target product and its competitors. A one-to-many mapping from customer requirements to improved product configurations is realized by using a multitask support vector machine to obtain consumer choice probabilities for the improved product configurations. The profit maximization models considering the customer choice probabilities are then developed to obtain the best product configuration portfolio. A case study of Huawei P20 series smartphones is used to illustrate the effectiveness of the proposed methods. The results indicate that the multitask support vector machine obtained a higher prediction accuracy than two single-task learning and two other multi-task learning methods, and the proposed framework has the ability to increase the profits produced by the best product configuration portfolio.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "94215c152dc904b58c989f1a4c25e159",
  "timestamp": "2025-05-15T00:44:20.944779"
}