{
  "id": 8371,
  "title": "Retinal Crystals in Type 2 Idiopathic Macular Telangiectasia",
  "abstract": "Purpose: To characterize the phenotype and investigate the associations of intraretinal crystalline deposits in a large cohort with type 2 idiopathic macular telangiectasia (MacTel). Design: Case-control study. Participants: Patients with and without retinal crystals from the Macular Telangiectasia Project, an international multicenter prospective study of type 2 MacTel. Methods: Grading of stereoscopic 30-degree color fundus (CF), confocal blue light reflectance (CBR), red-free (RF), and infrared (IR) images was performed according to the MacTel Natural History Study protocol and staged using the classification system devised by Gass and Blodi. Spectral domain-optical coherence tomography (SD-OCT) and adaptive optics imaging were used for a finer analysis of the phenotype. Associations between crystals and other characteristics of the disease, as well as potential risk factors, were investigated. Main Outcome Measures: Presence of crystals, fundus signs of MacTel, clinical characteristics, and presence of potential risk factors of MacTel. Results: Of 443 probands enrolled in the MacTel study, 203 (46%) had crystalline deposits present; 60% of the cases were bilateral at baseline. Eyes with crystals had a mean letter score of 70.7 (standard deviation [SD] = 15.9), whereas those without crystals had a mean letter score of 66.5 (SD = 15.5, P < 0.001). Crystals were present at all stages of the disease and showed high reflectivity within a wide wavelength range. They were located at the anterior surface of the nerve fiber layer, arranged along the nerve fibers, within an annular area centered on the fovea. Significant associations of crystalline deposits were found with a loss of retinal transparency, macular pigment optical density (MPOD) loss, fluorescein leakage, retinal thickness, and a break in the inner segment/outer segment junction line. Associations with environmental risk factors were not found. Conclusions: Intraretinal crystals are a frequent phenomenon associated with type 2 MacTel. They may appear at all stages and aid in the early diagnosis of the disease. Their morphology further implicates Muller cells in the pathogenesis of the disease. Insight into their physical and chemical properties may provide clues to the metabolic pathways involved in the pathogenesis of the disease. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2011; 118: 2461-2467 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "943c8db8c476437cd6a9c4698a37c5de",
  "timestamp": "2025-05-15T03:18:19.527193"
}