{
  "id": 6056,
  "title": "Global epidemiology of HTLV-I infection and associated diseases",
  "abstract": "Epidemiologic aspects of human T-lymphotropic virus type I (HTLV-I) infection have been thoroughly studied over the course of approximately 25 years since its first description. The geographic distribution of the virus has been defined, with Japan, Africa, Caribbean islands and South America emerging as the areas of highest prevalence. The reasons for HTLV-I clustering, such as the high ubiquity in southwestern Japan but low prevalence in neighboring regions of Korea, China and eastern Russia are still unknown. The major modes of transmission are well understood, although better quantitative data on the incidence of transmission, and on promoting/inhibiting factors, are needed. Epidemiologic proof has been obtained for HTLV-I's causative role in major disease associations: adult T-cell leukemia (ATL), HTLV-associated myelopathy/tropical spastic paraparesis (HAM/TSP), HTLV-associated uveitis and infective dermatitis. However, more and better studies are needed for other apparent disease outcomes such as rheumatologic, psychiatric and infectious diseases. Since curative treatment of ATL and HAM/TSP is lacking and a vaccine is unavailable, the social and financial cost for the individual, his/her family and the health system is immense. For this reason, public health interventions aimed at counseling and educating high-risk individuals and populations are of paramount importance.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "943e65d81e468604a0c2fe3c501b3904",
  "timestamp": "2025-05-15T02:54:03.515547"
}