{
  "id": 911,
  "title": "Diagnostics of systemic risk impact on the enterprise capacity for financial risk neutralization: the case of Ukrainian metallurgical enterprises",
  "abstract": "Research background: A significant share of Ukrainian enterprises in modern conditions is accompanied by unprofitability of their activity. On the back of Ukrainian enterprises unprofitability, there is a problem of methodical provision of financial risk management, which lies in the fact that a major part of scientistific works in this area focus on the study of internal factors and indicators of financial risk. At the same time, the system risk is levelled out. Purpose of the article: The aim of the study is the improvement of enterprises' financial risk management tools based on the assessment of the company's ability to neutralize financial risk taking into account systemic risk effects. Methods: The methodological apparatus includes: The weight center method; expert appraisal method; multidimensional factor analysis method; neural network apparatus. Findings & Value added: As a result of the study, an approach to assessing the impact of system risk on the ability of an enterprise to neutralize financial risk is developed. The expert evaluation method is based on an integrated model that allows for estimation of the ability of metallurgical enterprises to neutralize financial risks. The system risk factors, namely the factor of commodity markets state, the political and demographic, fiscal, monetary factors as well as the factor of the external balance financial estimates, were determined. By constructing a neural network, elasticity of enterprises' ability to neutralize financial risk in relation to systemic risk factors was calculated. The proposed approach allows for conducting preventive financial risk diagnostics on the basis of assessing the current financial status and the ability to neutralize financial risk in an open economic system - taking into account the system risk impact.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "94405caefb788637a604bb4f68636d18",
  "timestamp": "2025-05-15T01:56:17.618200"
}