{
  "id": 3741,
  "title": "Do stock markets exhibit cyclical market efficiency? Emerging markets' perspective",
  "abstract": "This article assesses cyclical market efficiency under different market conditions. We examine the cyclical return predictability, the time-varying effectiveness of trading strategies and their profitability, along with the relationships between volume and price. We select a diverse set of indices namely Nifty Next 50, BSE Sensex, IBOV (Brazil) and JSE (South Africa) and use the data for the years 2005 to 2022. We use linear and non-linear autocorrelation tests, regression analysis and Granger causality tests to explore the different phases of market efficiency across these indices. Our results offer a multifaceted understanding of market efficiency, highlighting various aspects of the data across different regions and market structures. We cross-validate our findings, adding robustness to our understanding of the manifestation of the adaptive market hypothesis (AMH) in the global stock markets. We use a rolling window framework and structural break tests to ensure that our findings are resilient to potential structural changes. The results reveal varying degrees of market efficiency across all indices, providing useful implications for both academia and industry. Our results show that portfolio diversification benefits exist. Future research could examine whether the markets across and within countries offer diversification benefits.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9454bedfd177737291019bbd052f06a6",
  "timestamp": "2025-05-15T01:20:35.929137"
}