{
  "id": 7333,
  "title": "The Impact of Corporate Credit Ratings Change on Stock Returns of Firms Listed on JSE Exchange",
  "abstract": "In the recent past, South Africa endured sovereign rating downgrades and has averted a downgrade to junk status from Moody's and Standard & Poor's (S&P) in December 2015. Despite a negative outlook on the economy, the JSE exchange reached the unprecedented levels of performance in the first half of 2015 indicating a negative relationship between the economy and the stock market performance. This relationship is surprising as the literature shows that there is a positive relationship between the economy and the stock market performance. The apparent disconnect between South African economy and the stock market raises a question of whether, at micro-economic level, a change in company's credit rating would also not have/have any impact on its share price performance. Thus, do the rating agencies have a role in the stock markets? But more importantly, what are financial metrics that are essential in differentiating credit upgrades and downgrades. The purpose of this study is to establish whether company's share price reacts to a change in its credit rating by the international rating agencies and investigate the financial risk factors that differentiate downgrades from upgrades. The event study methodology is utilized to measure firm's share abnormal return of companies listed on the JSE Exchange that had a rating change between 2000 -2015 and logistic regression is used to establish the factors influencing the credit rating. The initial findings indicate that there is no significant impact evident on equity prices when companies' credit rating upgrades are announced by the rating agencies, indicating that the upgrades are largely anticipated by the market at the time that they are announced. However, the market reacts significantly negatively when companies' credit rating downgrades are announced. This negative reaction to downgrades suggests that only credit rating downgrades contain relevant pricing information. This finding corroborate the findings of, for example, Dichev and Piotroski (2001); Ferreira and Gama (2007); Jorion and Zhang (2007); Kenjegaliev et al. (2016) and Poornima et al. (2015). On the other hand, in SA, financial factors such as interest cover and firm earnings differentiates upgrades from downgrades implying that managers can predict whether they will get a downgrade or upgrade.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9481466fa8762165fdc58e823e43be6e",
  "timestamp": "2025-05-15T03:07:31.881768"
}