{
  "id": 1546,
  "title": "Probabilistic DEAR models",
  "abstract": "The differential equation associated regression (DEAR) is a flexible and powerful data mining modeling approach, which is intended to catch up the first-order nonlinear trend (i.e., regularity) governing the behavior of the data under investigation. DEAR modeling is a formal mathematical-statistical representation of the so-called grey differential equation model. It should be pointed out that DEAR models were originally proposed on the random fuzzy theoretical foundation. Nevertheless, DEAR models can be defined on any measure theoretic platform, for example, probabilistic, fuzzy, or uncertain measure foundation as long as the model and approximation two constituting components are appropriately specified. In this paper, we re-examine the compositional elements of DEAR models and the potential model selection portfolio in the statistical machine learning (SML) algorithm developments. Then the differential equation backed DEAR may contribute to the SML algorithm significantly, particularly, in developing robot movement system, where the motion laws are expressed directly by a set of differential equations. Under a statistical decision theoretical framework, a DEAR model which is constituted by a random function with a linear difference equation-wise regression as the central tendency and a variance bound specified by Gaussian error analysis theory is developed delicately, in which the prior distribution will be facilitated by a Gaussian process such that the replication of sampling for estimating the weight matrix will be avoided. We not only address the model selection compositional elements of the SML algorithm but also address the optimization scheme, which is called lambda-global optimization scheme to make the DEAR learning as one of the fastest, most efficient and accurate SML algorithm.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "949d927b86b880ad05d92104e4a272f4",
  "timestamp": "2025-05-15T00:57:12.605865"
}