{
  "id": 1518,
  "title": "Assessing portfolio vulnerability to systemic risk: a vine copula and APARCH-DCC approach",
  "abstract": "This study evaluates the sensitivity and robustness of the systemic risk measure, Conditional Value-at-Risk (CoVaR), estimated using the vine copula and APARCH-DCC models. We compute the CoVaR for the two portfolios across five allocation strategies. The novel vine copula captures the complex dependence patterns and tail dynamics. The APARCH DCC incorporates volatility clustering, skewness, and kurtosis. The results reveal that the CoVaR estimates vary based on portfolio strategy, with higher values for the cryptocurrency portfolio. However, CoVaR appears relatively robust across strategies compared to Delta CoVaR. The cryptocurrency portfolio has a greater overall vulnerability. The findings demonstrate the value of CoVaR estimated via the vine copula and APARCH-DCC in assessing portfolio systemic risk. This advanced approach provides nuanced insights into strengthening risk management practices. Future research could explore the sensitivity of the CoVaR to different weighting schemes, such as equal versus market-weighted portfolios. Incorporating the Gram-Charlier expansion of normal density into the APARCH specification enables a nonparametric, data-driven fitting of the residual distribution. Furthermore, comparing the CoVaR to another systemic risk measure could provide further insights into its reliability as a systemic risk measure.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "949e1b971e39016fa6b543a88c1a8cfb",
  "timestamp": "2025-05-15T00:56:39.059481"
}