{
  "id": 9071,
  "title": "Group-Based Trajectory Modeling to Identify Patterns and Predictors of Adherence to Oral Endocrine Therapies in Underserved Population of Greater Houston Area",
  "abstract": "Background: Poor adherence to oral endocrine therapy (OET) is a significant problem among patients with hormone receptor-positive breast cancer as it results in higher risk of recurrence and mortality. Non-adherence to OET is prevalent among underserved patients, often attributable to socioeconomic factors and limited healthcare access. We evaluated OET adherence patterns over time using group-based trajectory modeling (GBTM) and identified predictors of suboptimal adherence trajectory among patients seen at Harris Health System, serving underserved patients in Houston, Texas. Methods: A single-center, retrospective study was conducted from October 2019 through December 2020. OET adherence was measured using proportion of days covered (PDC). A logistic GBTM was conducted using 2- 5 adherence groups considering the Bayesian information criteria, clinical relevance, and a 5% minimum membership requirement. Multinomial logistic regression was used to assess the predictors of non-adherence trajectories. Results: Among 496 patients, majority were Hispanic (62.50%) or African American (15.12%) and < 65 years of age (82.66%). Four distinct adherence trajectories were identified: consistent high adherence (41.4%); constant PDC at similar to 0.6 (32.6%); rapid decline (14.6%); low adherence with gradual decline (11.5%). African Americans had higher likelihood of having low adherence with gradual decline [odds ratio (OR): 2.462 (confidence interval (CI): 1.1149- 5.276), p=0.0205]. Patients with diabetes were more likely to have constant PDC at similar to 0.6 [OR: 1.714 (CI: 1.042- 2.820), p=0.0338]. Longer time (4 or greater years) on therapy predicted low adherence with gradual decline [OR: 2.463 (CI: 1.266- 4.793), p=0.008) and constant PDC at similar to 0.6 (OR: 1.966 (CI: 1.141- 3.388), p=0.0149] trajectories. Conclusion: The identified predictors, including comorbidities like diabetes, African American descent, and longer OET treatment are crucial considerations when developing patient-centered interventions to enhance OET adherence among underserved populations. These insights can guide the implementation of initiatives such as mobile health applications, community-based educational programs, and financial aid efforts.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "94a742612c0ad61f358b600c402d98cb",
  "timestamp": "2025-05-15T03:25:27.635263"
}