{
  "id": 8685,
  "title": "Long-term outcome of hepatitis delta in different regions world-wide: Results of the Hepatitis Delta International Network",
  "abstract": "Background and AimsChronic hepatitis delta represents a major global health burden. Clinical features of hepatitis D virus (HDV) infection vary largely between different regions worldwide. Treatment approaches are dependent on the approval status of distinct drugs and financial resources.MethodsThe Hepatitis Delta International Network (HDIN) registry involves researchers from all continents (Wranke, Liver International 2018). We here report long-term follow-up data of 648 hepatitis D patients recruited by 14 centres in 11 countries. Liver-related clinical endpoints were defined as hepatic decompensation (ascites, encephalopathy and variceal bleeding), liver transplantation, hepatocellular carcinoma or liver-related death.ResultsPatient data were available from all continents but Africa: 22% from Eastern Mediterranean, 32% from Eastern Europe and Central Asia, 13% from Central and Southern Europe, 14% from South Asia (mainly Pakistan) and 19% from South America (mainly Brazil). The mean follow-up was 6.4 (.6-28) years. During follow-up, 195 patients (32%) developed a liver-related clinical event after 3.5 (+/- 3.3) years. Liver cirrhosis at baseline and a detectable HDV RNA test during follow-up were associated with a worse clinical outcome in multivariate regression analysis while patients receiving interferon alfa-based therapies developed clinical endpoints less frequently. Patients from South Asia developed endpoints earlier and had the highest mortality.ConclusionsThe HDIN registry confirms the severity of hepatitis D and provides further evidence for HDV viraemia as a main risk factor for disease progression. Hepatitis D seems to take a particularly severe course in patients born in Pakistan. There is an urgent need to extend access to antiviral therapies and to provide appropriate education about HDV infection.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "94aed5dc53976a0b96aba4a19665ff7c",
  "timestamp": "2025-05-15T03:21:24.669984"
}