{
  "id": 4348,
  "title": "Comparisons of information asymmetry measures in the Korean stock market",
  "abstract": "Measuring information asymmetry is an important issue in modern finance. Although there are various information asymmetry measures in the literature, there is no systematic analysis of the merits and drawbacks of these measures. Naturally, the choice of an information asymmetry measure is left to individual researcher's arbitrary decision. This paper attempts to compare various information asymmetry measures. For the analysis, we choose measures derived from four econometric models that are widely used in the market microstructure literature: the Huang and Stoll model (1997; HS), the Madhavan, Richardson, and Roomans model (1997; MRR), the Hasbrouck (1991), Foster and Viswanathan (1993) model (HFV), and Easley, Hvidkjaer, and O'Hara's (2002) PIN (Probability of informed trading) measure. Conceptually, these four measures share the sprit of the Glosten and Milgrom model (1985), in which information asymmetry induces bid-ask spread. In the model, a market maker sets bid and ask prices continuously, and her price-setting behavior is affected by information asymmetry. However, the four measures are differently implemented. HS, MRR and HFV explain the price-setting behavior of the market maker using price changes and an indicator representing the initiator of a trade. HS decomposes the bid-ask spread into three components: adverse selection cost, inventory holding cost, and order processing cost. MRR decomposes the bid-ask spread into two components, adverse selection cost and order processing cost, and considers a first autocorrelation of the trade direction variable. HFV measures the adverse selection cost by using the price impact on the unexpected volume. On the other hand, Easley, Hvidkjaer, and O'Hara's (2002) PIN measure is very different. The PIN measure utilizes the assumption that the market maker infers the probability of private information from the order imbalance (the number of buy-initiated trades minus the number of sell-initiated trades) and sets bid and ask prices. Since it is impossible to examine the motive of each investor directly, it is difficult to judge which measure is closer to the truth. Thus, we employ two indirect methods. First, we calculate the correlations of the measures to investigate the consistency among the four measures. Second, we assess which measure is more reasonable by regressing each information asymmetry measure on various firm characteristic variables that are likely to affect the information asymmetry of a firm; i.e, firm size, BE/ME, turnover, residual volatility, analyst coverage, and industry dummy variables. We estimate the four measures using 416 Korea Stock Exchange common stocks listed during the period from January 1, 2002 to March 31, 2002. The correlation results show that the HS, MRR, and HFV measures are highly correlated with each other (0.706-0.895 in Spearman correlation), but these three measures are weakly correlated with PIN (0.186-0.309 in Spearman correlation). Changing the assumption underlying PIN to that many information events may occur in a day improves the correlation only a little bit. The inconsistency between the former three measures and PIN suggests that arbitrary choice of an information asymmetry measure may cause a serious problem. We also investigate if each of the four measures has a reasonable relationship with the aforementioned firm characteristic variables in a cross-sectional regression framework. We find that the HS, MRR, and HFV measures have significantly negative relationships with firm size and turnover ratio, which is reasonable given the existing literature. However, PIN does not show a significant relationship at all. PIN estimated by using an intra-day model has a more reasonable relationship, but the relationship is still weak. Thus, the result indicates that the HS, MRR, and HFV measures are likely to be better measures of information asymmetry than PIN. Among the former three measures, the HS and MRR measures are more reliable than the HFV measure because the adjusted RI of the HFV regression is very low. The modified PIN estimated by using an intra-day model is more reliable than the PIN estimated by using the daily model. We further partition the samples into five portfolios based on the average number of trades. The correlations among the HS, MRR, and HFV measures are strongest for the portfolio with the greatest number of trades. In the cross-sectional regressions, portfolios with a greater number of trades have a more significant relationship with firm characteristic variables and a higher adjusted R-2. In general, all of the four measures (including PIN) become more reliable as the number of observations increases.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "94c156debd9baf3cbe8e73f870e538c3",
  "timestamp": "2025-05-15T01:26:26.198879"
}