{
  "id": 2599,
  "title": "Social performance, financial risk and financial performance in microfinance institutions",
  "abstract": "PurposeThis paper examine whether social performance moderates the linkage between financial risk and financial performance in microfinance institutions (MFIs). The study focuses on the financial self-sufficiency and long-term sustainability of MFIs.Design/methodology/approachThe empirical study uses unbalanced panel data of 2,694 worldwide MFIs from 2009 to 2019. In the first step, the study inspects the impact of social performance and risk on financial performance, proxied as return on assets and operational self-sufficiency. In the second stage, moderated hierarchical regression is applied to test whether social performance moderates the relationship between risk and financial performance. Lastly, the study confirms the significant moderation effects with slope tests.FindingsThe study detects robust evidence that financial risk is negatively related to financial performance. Though social performance exhibits a weak positive link with financial performance in silos, the evidence of its moderating effects on risk is mixed and significant. Social performance indicators, such as the borrower retention rate and female representation, positively moderate the relationship between financial risk and financial performance. The study documents that social performance impacts financial performance and operational self-sufficiency through risk moderation. Thus, social performance fosters the sustainability of these institutions over the long haul.Research limitations/implicationsThe study is relevant to academics and theorists to consider the stakeholder approach in microfinancing. In the context of stakeholder theory, the study advances the specific social responsiveness process, namely stakeholder engagement.Practical implicationsThe evidence that socially sensitive operations can curtail the adverse effects of credit risks on financial performance signify the required attention to social performance. For MFI managers and practitioners, the findings justify the business case for social performance. Stakeholder engagement, under the auspices of social responsiveness, acts as a risk-mitigation mechanism to eventually foster financial performance and self-sufficiency.Social implicationsThe study motivates MFIs to do more for their stakeholders and society by highlighting the benefits of social performance.Originality/valueThe study reaffirms that social performance remains at the epicenter of the MFIs' mission and is an essential risk mitigation mechanism. The study adds to the extant literature on stakeholder engagement and its effects on MFIs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "94d655efc3333e3dc68b233863b25a76",
  "timestamp": "2025-05-15T02:17:01.788489"
}