{
  "id": 7709,
  "title": "Fever and neutropenia hospital discharges in children with cancer: A 2012 update",
  "abstract": "Fever and neutropenia (FN) is a common precipitant for hospitalization among children with cancer, but hospital utilization trends are not well described. This study describes national trends for hospital discharges for FN among children with cancer for the year 2012, compared with the authors' previous analysis from 2009. Data were analyzed from the Kids' Inpatient Database (KID), an all-payer US hospital database, for 2012. Pediatric patients with cancer who had a discharge for FN were identified using age <= 19years, urgent or emergent admit type, nontransferred, and a combination of International Classification of Diseases, Ninth Revision, Clinical Modification (ICD-9-CM) codes for fever and neutropenia. The authors evaluated factors associated with a short length of stay (SLOS). Sampling weights were used to permit national inferences. In 2012, children with cancer accounted for 1.8% of pediatric hospital discharges (n = 120,675), with 12.2% (n = 13,456) of cancer-related discharges meeting FN criteria. Two fifths of FN discharges had a SLOS, which accounted for $91 million (2015 US$) in hospital charges. The majority had no serious infections; most common infections were viral infection (9.6%) or upper respiratory infection (9.6%). Factors significantly associated with SLOS included having a diagnosis of ear infection (odds ratio [OR] = 1.54, 95% confidence interval [CI]: 1.16-2.03), soft tissue sarcoma (OR = 1.47, CI: 1.10-1.95), and Hodgkin lymphoma (OR = 1.51, CI: 1.09-2.10), as compared with not having those diagnoses. SLOS admissions continue to be rarely associated with serious infections, but contribute substantially to the burden of hospitalization for pediatric FN. Implementation of risk stratification schemas to identify patients who meet low-risk criteria may decrease financial burden.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "94e11d30c252fcebfd8da7d5f8c288a0",
  "timestamp": "2025-05-15T03:11:04.650954"
}