{
  "id": 8284,
  "title": "Financial Toxicity in Women With Breast Cancer Receiving Radiation Therapy: Final Results of a Prospective Observational Study",
  "abstract": "Purpose: We sought to quantify financial toxicity (FT) present in a prospective cohort of women with breast cancer (BC) receiving radiation therapy (RT), identify predictors of FT, correlate FT with health-related quality of life (QoL), and determine whether duration of RT is associated with FT. Methods and Materials: Consecutive patients with stage I-III BC completed Functional Assessment of Cancer Therapy-G7 (FACT G7), a tailored FT questionnaire, and Comprehensive Score for Financial Toxicity (COST) scoring within 1 month of RT completion. Lower scores on FACT-G7 (range, 0-28) and COST (range, 0-44) indicate worse QoL and FT. Group comparisons were performed with a 2-sample t test and chi(2) tests for continuous and categorical variables, respectively. Pearson correlation was used to associate COST with FACT-G7. Linear and multiple regression were used to evaluate predictors of COST. Results: One hundred eight enrolled patients were eligible for analysis with completed COST scores, including 56, 42, and 10 patients treated with long-, intermediate-, and short-course RT. Mean COST score was 28.6 and mean FACT-G7 was 18.4. Among patients treated with intermediate-and long-course RT (n = 98), marital status (higher COST associated with married status relative to other), medication cost (higher COST for no significant medication costs relative to significant medication costs), employment type (lower COST associated with disabled status or unemployed, higher COST with retired status relative to working), and surgery type (higher COST for lumpectomy relative to mastectomy) were significantly associated with COST score by multivariable analysis (all P values < .05). RT length group was not associated with COST (P = .79). COST and FACT-G7 were strongly correlated for the overall cohort (P < .0001). Conclusions: In this prospective study of women with BC receiving RT, distinct factors including surgery type were significantly associated with FT. FT was strongly correlated with health-related QoL. Increased characterization of the relationship between FT and health related QoL for women with BC receiving RT and defining clinical predictors of FT may help guide future studies investigating optimal targeted interventions for patients with BC at high risk for FT. (C) 2021 American Society for Radiation Oncology. Published by Elsevier Inc. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "94f07254e2c065c1eddfb4b305c38f49",
  "timestamp": "2025-05-15T03:17:21.531829"
}