{
  "id": 3951,
  "title": "The relationship between interorganizational information systems and operations performance",
  "abstract": "Purpose - The purpose of this study is to explore the relationship between interorganizational information system (IOIS) adoption in supplier coordination and operations performance improvements. Design/methodology/approach - The paper focuses on the association between dyadic and multilateral IOISs and improvements in performance priorities associated with stable and dynamic supply networks, using data on 201 manufacturers in 13 countries from the international manufacturing strategy survey (IMSS) database. Regression models were used to test relationships between IOIS adoption and operations performance improvements. Findings - Analysis indicates that dyadic IOISs; appear to be more associated with the performance priorities of stable supply chains (cost, delivery, and quality), while multilateral IOISs appear to be more associated with the performance priorities of dynamic supply chains (flexibility and quality). Research limitations/implications - Survey data were collected in the years 2000 and 2001. Some of the conclusions might be reassessed in light of recent developments in information technology. Data were limited to medium/large manufacturers of fabricated metal products, machinery, and equipment. Practical implications - Findings suggest that the choice of IOISs must follow the company's product portfolio and supply chain configuration. Dynamic networks with innovative products may benefit from multilateral IOISs; stable networks with functional products may benefit from dyadic IOISs. Originality/value - This appears to be the first study to provide empirical evidence to performance effects of IOISs in light of existing supply chain frameworks.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "95031032728c2c6a117442f04f9f5444",
  "timestamp": "2025-05-15T01:22:39.312463"
}