{
  "id": 7766,
  "title": "American Joint Committee on Cancer Classification Predicts Outcome of Patients with Lacrimal Gland Adenoid Cystic Carcinoma",
  "abstract": "Purpose: To investigate whether American Joint Committee on Cancer (AJCC) classification at initial diagnosis of lacrimal gland adenoid cystic carcinoma predicts outcome of treatment on local recurrence. Design: Retrospective chart review. Participants: Consecutive patients with adenoid cystic carcinoma of the lacrimal gland treated at 8 institutions between January 1986 and December 2007. Methods: Clinical records, including pathology reports and imaging studies, were reviewed. Main Outcome Measures: AJCC classification, histologic subtype, local recurrence rate, and survival. Results: AJCC classification at initial diagnosis was assessable for 53 patients and was as follows: T1N0M0, 7 patients; T2N0M0, 8 patients; T3aN0M0, 14 patients; T3aNxM0, 1 patient; T3aN0M1, 1 patient; T3bN0M0, 13 patients; T3bN0M1, 1 patient; T4aN0M0, 2 patients; T4bN0M0, 4 patients; T4bN0M1, 1 patient; and T4bNXM0, 1 patient. Thirty-eight (72%) of the 53 patients had >T3 tumors at presentation. Of the 38 patients with >T3 tumors, 20 were treated with orbital exenteration and postoperative adjuvant radiotherapy (RT), 6 were treated with orbital exenteration without RT, and 12 were treated with globe-preserving surgery (110 with RT and 2 without RT). Of the 15 patients with T3 tumors, the risk of local recurrence (in the orbit or skull base) was higher in patients treated with conservative surgery as opposed to orbital exenteration and RT. Only 4 (20%) of the 20 patients treated with orbital exenteration and RT had local recurrence, compared with 3 (50%) of the 6 patients treated with orbital exenteration without RT and 8 (67%) of the 12 patients treated with globe-preserving surgery. Overall, 17 (45%) of the 38 patients with >T3 tumors and only 1 (7%) of the 15 patients with T3 disease at initial diagnosis correlates with worse outcomes than does AJCC",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "950974e1e24d983a2b713892d7346a5c",
  "timestamp": "2025-05-15T03:12:11.474368"
}