{
  "id": 9129,
  "title": "COVID-19 pandemic and the prevalence of domestic violence against Iranian married women",
  "abstract": "Aim: Domestic violence is an important public health and human rights problem. In most countries of the world, including Iran, the COVID-19 pandemic made quarantine necessary to reduce the disease transmission rate. Therefore, due to the spread of the COVID-19 disease and the emergence of mandatory quarantine conditions, the present study was conducted to determine the prevalence of domestic violence against women during the COVID-19 pandemic in Iran.Methods: In this cross-sectional study, which was done in 2020, 240 married women were investigated. Due to the COVID-19 pandemic, data collection was performed through virtual networks using standard questionnaires. Data were analyzed using SPSS. Descriptive statistics (relative frequencies, mean, and standard deviation) were used to determine the extent of violence. Independent t-test and Chi-square were used to analyze the data of the relation between the types of violence with independent variables. Also, the data were analyzed using the logistic regression model.Results: In this study, 240 married women with a mean age of 36.27 were studied. The highest frequency was related to social violence (56.3%), and the lowest was related to financial and verbal violence (11.7%). In addition, a significant relationship was observed between sexual violence and age (p-value < 0.05). A significant relationship was also observed between social violence and education [(OR = 1.99)] Jobs [(OR = 2.4, CI = 95%, 1.30-4.4), quarantine duration [(OR = 1.94, CI = 95%, 0.98-3.7)] and underlying diseases [OR = 1.90].Conclusion: The high prevalence of domestic violence against women during quarantine indicates the poor health of women in society. Therefore, the roots of violence against women and methods to reduce this problem should be sought. Therefore, identification of subjects at risk and raising women's knowledge may be useful for the prevention of domestic violence and its physical and psychological complications.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9514230331a342935dc9b2a5b110929f",
  "timestamp": "2025-05-15T03:25:54.579184"
}