{
  "id": 6524,
  "title": "The effect of rare events on information-leading role: evidence from real estate investment trusts and overall stock markets",
  "abstract": "The information relationship between real estate investment trusts and stock markets has garnered significant interest in finance; however, the time-varying information flow between the two can vary due to different market conditions. This study scrutinizes the information-leading roles between the real estate investment trust sector and overall stock markets under various market conditions. Shannonian transfer entropy, used for identifying information-leading roles, can reveal nonlinear interactions between two markets; however, the results can be hindered by rare events, such as sporadically occurring episodes. Therefore, this study introduces R & eacute;nyian transfer entropy to examine the role of rare events in the information flow between the two markets. This conjecture is confirmed using the COVID-19 pandemic as a natural experiment setting of rare events. The results reveal notable findings. (i) R & eacute;nyian transfer entropy can accurately capture the impact of rare events regardless of the sample period, including the changes in information-leading roles when volatility clustering strengthens. Furthermore, (ii) the significance of liquidity and market efficiency produces different information flows depending on market status. The findings suggest that investors can use R & eacute;nyian transfer entropy to accurately identify information-leading roles between assets under various market conditions, facilitating optimal portfolio allocation. Moreover, policymakers can benchmark this approach to identify financial risk contagion paths, enabling regulators to implement timely policy actions to mitigate market risks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9515cbdeb3d76193fa1b651b72ccb833",
  "timestamp": "2025-05-15T02:59:07.451509"
}