{
  "id": 2179,
  "title": "The prediction algorithm of credit risk of science and technology finance based on cloud computing",
  "abstract": "In order to effectively guarantee the effect of credit risk prediction of science and technology finance and improve the ability of risk prediction, a credit risk prediction algorithm of science and technology finance based on cloud computing is proposed. The logistic regression model is used to predict, and the financial indicators of science and technology credit are selected as the model covariates. According to the characteristics and strong correlation of many financial indicators of science and technology credit, this paper constructs the final index system of online supply chain technology credit risk evaluation based on SMEs. Then the principal component analysis method is used to select the principal component. Combined with the penalty method, the data space dimension of financial indicators is further reduced, and the unrelated principal components are obtained. On this basis, a logistic regression model is established to predict the credit risk by taking the selected main components as covariates. The experimental results show that the algorithm has a good fit to the credit risk of 16 science and technology credit enterprises, and the risk prediction ability is significantly improved, which can effectively guarantee the effect of science and technology credit risk prediction.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "951eaf2294fb8af269824e7668706c56",
  "timestamp": "2025-05-15T02:12:17.377972"
}