{
  "id": 317,
  "title": "Option Pricing with Fractional Stochastic Volatilities and Jumps",
  "abstract": "Empirical studies suggest that asset price fluctuations exhibit long memory, volatility smile, volatility clustering and asset prices present jump. To fit the above empirical characteristics of the market, this paper proposes a fractional stochastic volatility jump-diffusion model by combining two fractional stochastic volatilities with mixed-exponential jumps. The characteristic function of the log-return is expressed in terms of the solution of two-dimensional fractional Riccati equations of which closed-form solution does not exist. To obtain the explicit characteristic function, we approximate the pricing model by a semimartingale and convert fractional Riccati equations into a classic PDE. By the multi-dimensional Feynman-Kac theorem and the affine structure of the approximate model, we obtain the solution of the PDE with which the explicit characteristic function and its cumulants are derived. Based on the derived characteristic function and Fourier cosine series expansion, we obtain approximate European options prices. By differential evolution algorithm, we calibrate our approximate model and its two nested models to S & P 500 index options and obtain optimal parameter estimates of these models. Numerical results demonstrate the pricing method is fast and accurate. Empirical results demonstrate our approximate model fits the market best among the three models.",
  "year": 2023,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9526bb01d3b371b69e952a79d9fbe1db",
  "timestamp": "2025-05-15T01:30:46.330194"
}