{
  "id": 6130,
  "title": "The capital flow of stock market studies based on epidemic model with double delays",
  "abstract": "Herd behaviour, or contagion behaviour, has been proven to exist in the Chinese stock markets. Based on that, this paper seeks to discover the implied mechanism that represents how capital flowed in the market by using an epidemic model. First, we apply the Lyapunov function to prove the locally asymptotical stability and globally asymptotical stability of the epidemic model that is constructed. Second, we use the CSAD (cross-sectional absolute deviation of returns) method to test for the existence of herd behaviour in China's stock markets. Finally, starting with the risk-free interest rate, we analyse each parameter of the financial epidemic model. We conclude that a case such as the endemic equilibrium (theta > 1) exists in the corresponding epidemic model of China's stock markets, and the local equilibrium and global equilibrium are included. The herd behaviour provides us evidence for further studying the funds' contagion behaviour. We find that when the effective infectious rate of funds (lambda) equals 0.08 (a special economic node), its value corresponds to the capital saturation level (i = 15%). We also find that in the case of normal market fluctuations, the removal rate of funds (gamma) ranges from 0.005 to 0.03. In addition, the study of the delay items shows that the first delay item contributes greatly to the stability of the equilibrium point, and thus we can control the size of the delay items with the policy change in order to achieve the purpose of macro-economic regulation. The result of the parameter inversion algorithm has no difference from the simulation results. It shows clearly that the application of the Bayesian neural network on parameter inversion is feasible. (C) 2019 Elsevier B.V. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9531123240ea61e002cc54928f8399ac",
  "timestamp": "2025-05-15T02:55:12.875991"
}