{
  "id": 4885,
  "title": "The effect of competition in the product market and financial flexibility on business strategy",
  "abstract": "Purpose This study aims to track product market competition and financial flexibility on firms' business strategies. Design/methodology/approach For this purpose, 187 listed firms on the Tehran Stock Exchange were selected by the systematic elimination for 2012-2018. The hypotheses were examined using the linear regression model. Ittner and Larcker's (1997) model assesses the business strategy (dependent variable). The Herfindahl-Hirschman index is used to assess the product market competition (independent variable). Finally, the Frank and Goyal's (2009) model investigates financial flexibility (independent variable). Findings The findings indicate that competition in the product market has significantly declined the resort of defensive and invasive business strategies and intensified opportunistic analytical and opportunistic strategies, benefiting from financial flexibility and facilitating defensive and opportunistic adaptation and decreased analytic and invasive strategies. Besides, the product market competition contributes to the firm's financial flexibility and analytical, opportunistic, invasive and defensive strategies. Most of the studies in the field of business strategy analyzed some factors, such as performance (Zhang, 2016), tax avoidance (Higgins et al., 2015) and share pricing risk (Habib and Hasan, 2017). There is no study to assess the effect of business strategy on product market competition and financial flexibility. Originality/value The present study's findings provide some invaluable concepts for firm managers on the significance of competition in the product market and financial flexibility. Focusing on competition intensity and flexibility level can deal with the board's ambiguities on market structure and competitive status. The use of profitably competitive investment opportunities leads to selecting the most beneficial strategies, leading to a more efficient allocation of scarce resources and, finally, the enhancement of organizational performance.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "953c7a3210e8348d3a93a28b64fcc415",
  "timestamp": "2025-05-15T02:42:04.865126"
}