{
  "id": 2667,
  "title": "Short-term price forecasting in the Iberian electricity market: Sensitivity assessment of the exogenous variables influence",
  "abstract": "The short-term electricity price forecasting plays a critical role in the increasingly complex liberalized electricity market framework, in which market players compete and in which operators try to ensure market efficiency, stability and security of supply. Additionally, new paradigms in terms of the consumer profile and retail pricing schemes, disaggregated and unpredictable portfolio of generation, coupled with a few others, introduces an added degree of uncertainty to a vital commodity in our daily lives. This challenging scenario promotes research and the adoption of newer methods for short-term price forecasting. Since a better handling of the surrounding variables can help participants to better optimize their bidding strategies and market providers to better adjust the market balancing. Acknowledging some of the inadequacies in the field, as well as the need to establish a foreground in terms of the benefit (extent) of the addition of exogenous information, to obtain a superior forecast, a sensitivity analysis is conducted in this work. As such a well-established machine learning based method, a feedforward dense network, with an optimized framework, is used to gauge the individual and combined influence of the different selected variables. The chosen case study comprises the 2019 day-ahead price data from the interesting Iberian Electricity Market, given the relatively high levels of renewable energy generation. Numerical testing revealed a disconnection between the best input data combination and the common Pearson correlation analysis. Considerable MAPE and RMSE error variation are seen for the different combinations.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "95530a460a44124862942630d16e33f9",
  "timestamp": "2025-05-15T01:09:14.934456"
}