{
  "id": 5829,
  "title": "Towards early forest fire detection and prevention using AI-powered drones and the IoT",
  "abstract": "Wildfires are a significant natural hazard, resulting in financial losses, human deaths, and environmental damage. Due to the rising severity and frequency of wildfires, wildfire management and detection have recently received increased attention worldwide. Monitoring potential risk areas and early fire detection are critical factors for shortening the reaction time and reducing the potential damage. Conventional wildfire detection techniques like satellite imaging and remote camera -based sensing need more latency and low reliability. To tackle these limitations, this paper proposes a novel airborne UAV-based IoT (UIoT) system for wildfire sensing, detection, and extinguishing. It presents the design of low-cost and low -maintenance fire -detecting IoT nodes for large-scale deployment. It also proposes, investigates, and reports on several connectivity architectures using the LoRaWAN protocol for UIoT systems. We geolocate forest trees in a terrain -mapping exercise for precise fire localization. We then deploy an autonomous drone with a visual camera that utilizes our novel classification network to detect the presence of fire followed by fire detection and particle filter -based tracking to center fire at the center of the frame. We use a cloud back -end server for monitoring, analysis, and reporting. Our results show that our low-cost and long-range IoT nodes accurately detect fire within 15 min after fire ignition. Our fire classification network achieved an accuracy of 99.46% and a mean average precision of 99.64%. Numerical results suggest that the proposed UAV-IoT-based fire classification offers a fast and reliable wildfire recognition and extinguishing solution while minimizing power consumption and increasing the battery lifespan.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "95588fdb40ca228e2322c57f802ef39a",
  "timestamp": "2025-05-15T02:51:58.561130"
}