{
  "id": 220,
  "title": "Socially Responsible Investment Portfolio Construction with a Double-Screening Mechanism considering Machine Learning Prediction",
  "abstract": "Although socially responsible investment (SRI) has developed into an important investment style, only a small number of studies discuss SRI portfolio construction. In view of the overwhelming breakthrough of machine learning in prediction, this paper proposes SRI portfolio construction models by combining a double-screening mechanism considering machine learning prediction and an extended global minimum variance (GMV) model (or extended maximum Sharpe ratio (MSPR) model), which are, respectively, named double-screening socially responsible investment (DSSRI) portfolio models I and II. The proposed models consist of two stages, i.e., stock screening and asset allocation. First, this paper develops a novel double-screening mechanism incorporating environmental, social, and corporate governance (ESG) and return potential criteria to ensure that high-quality stocks with good ESG performance and high-return potential are input into the optimal portfolio. Specifically, to obtain accurate stock return predictions, an extreme learning machine model optimized by the genetic algorithm is employed to predict stock prices. Next, to trade off the financial and ESG objectives of SRI investors, an extended GMV model (or extended MSPR model) considering the ESG factor is introduced to determine the capital allocation proportion of the stocks. We take the A-share market of China as the sample to verify the effectiveness of the proposed models. The empirical results demonstrate that compared with alternative models, the proposed models can yield better annualized return and ESG score performance as well as competitive Sharpe ratio performance.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "955af597539d3381b27877eedeae343c",
  "timestamp": "2025-05-15T00:40:34.190596"
}