{
  "id": 8230,
  "title": "Factors associated with intimate partner violence by a former partner by immigration status and length of residence in Canada",
  "abstract": "Purpose: We examined intimate partner violence (IPV) by a former partner among Canadian-born and immigrant women by length of residence in Canada. Methods: Data from a 2009 national, population-based, telephone survey were used to determine the prevalence of and factors associated with any type of IPV (emotional, financial, physical, and/or sexual) by a former partner with whom there had been contact in the previous 5 years among immigrant women 0 to 19 years in Canada, 20 or more years or longer in Canada, and Canadian-born women (n = 1681). Results: Of immigrant women in Canada for 0 to 19 years, 41.6% had experienced IPV by a former partner; for immigrant women in Canada for 20 or more years or longer, 60.6%, and Canadian-born women, 61.5% (P = .0423). In a logistic regression model adjusted for age and other sociodemographic characteristics, immigrant women in Canada for 0 to 19 years were less likely than Canadian-born women to experience any IPV (odds ratio, 0.266; 95% confidence interval, 0.130-0.544). There was no difference in the occurrence of any IPV between immigrant women in Canada 20 or more years or longer and Canadian-born women. Conclusions: High rates of any IPV by a former partner were found for both Canadian-born and immigrant women. Within immigrant communities, specific prevention campaigns should address the high risk of experiencing IPV at later stages of resettlement. (C) 2012 Elsevier Inc. All rights reserved.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "955d6b91f677a7e29cf469f3c4468aaf",
  "timestamp": "2025-05-15T03:16:48.928552"
}