{
  "id": 9206,
  "title": "Implementation of hypofractionated prostate radiation therapy in the United States: A National Cancer Database analysis",
  "abstract": "Purpose: Preclinical and clinical research over the past several decades suggests that hypofractionated (HFxn) radiation therapy schedules produce similar treatment outcomes compared with conventionally fractionated (CFxn) radiation therapy for definitive treatment of localized prostate cancer (PCa). We sought to evaluate national trends and identify factors associated with HFxn utilization using the US National Cancer Database. Methods and materials: We queried the National Cancer Database for men diagnosed with localized (N0, M0) PCa from 2004 through 2013 treated with external beam radiation therapy. Patients were grouped by dose per fraction (DpF) in Gray: CFxn was defined as DpF <= 2.0, moderate HFxn as DpF > 2.0 but < 5.0, and extreme HFxn as DpF >= 5.0. Men receiving DpF < 1.5 or > 15.0 were excluded, as were those receiving < 25 or > 90 Gy total dose. Multiple logistic regression was performed to identify demographic, clinical, and treatment factor associations. Results: A total of 132,403 men were identified, with 120,055 receiving CFxn, 7264 moderate HFxn, and 5084 extreme HFxn. Although CFxn was by far the most common approach over the analysis period, HFxn use increased from 6.2% in 2004 to 14.2% in 2013 (P < .01). Extreme HFxn use increased the most (from 0.3% to 8.5%), whereas moderate HFxn utilization was unchanged (from 5.9% to 5.7%). HFxn use was independently associated with younger age, later year of diagnosis, non-black race, non-Medicaid insurance, non-Western residence, higher income, academic treatment facility, greater distance from treatment facility, low-risk disease group (by National Comprehensive Cancer Network criteria), and nonreceipt of hormone therapy. Conclusions: Although CFxn remains the most common radiation therapy schedule for localized PCa, use of HFxn appears to be increasing in the United States as a result of increased extreme HFxn use. Financial and logistical factors may accelerate adoption of shorter schedules. Considering the multiple demographic and prognostic differences identified between these groups, randomized outcome data comparing extreme HFxn to alternatives are desirable. (C) 2017 American Society for Radiation Oncology. Published by Elsevier Inc. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "956367777f6f3cdb2512a0da6599e118",
  "timestamp": "2025-05-15T03:26:26.044028"
}