{
  "id": 7454,
  "title": "Youth Relationships in the Era of COVID-19: A Mixed-Methods Study Among Adolescent Girls and Young Women in Kenya",
  "abstract": "Background: Measures to mitigate COVID-19's impact may inhibit development of healthy youth relationships, affecting partnership quality and sexual and reproductive health (SRH) outcomes. Methods: We conducted a mixed-methods study to understand how COVID-19 affected girls' and young women's relationships in Kenya. Bivariate and multivariate logistic regression examined factors associated with relationship quality dynamics and SRH outcomes among 756 partnered adolescents aged 15-24 years. Qualitative data from in-depth interviews were analyzed using inductive thematic analysis to explore youth perceptions of how intimate relationships changed during COVID-19. Results: Nearly three-quarters of youth described changes in relationship quality since COVID-19 began, with 24% reporting worsening. Reduced time with partners was the strongest predictor of changed relationship quality. Youth experiencing complete or partial COVID-19-related household income loss had heightened risk of deteriorating partnerships (relative risk ratio = 2.43 and 2.02; p < .05); those whose relationships worsened were more likely to experience recent intimate partner violence, relative to no relationship change (20.8% vs. 3.5%; p < .001). Qualitative analysis revealed how COVID-19 mitigation measures hindered intimate relationships, school closures accelerated marriage timelines, and economic hardships strained relationships, while increasing early pregnancy risk and girls' financial dependency on their partners. Conclusions: COVID-19 disrupted adolescent girls' and young women's romantic relationships, depriving some of partner emotional support and exposing others to sexual violence, early pregnancy, and economically motivated transactional relationships. Increased social support systems, including access to psychosocial services, are needed in low-income communities in Kilifi, Kisumu, and Nairobi, in particular the informal settlement areas, to mitigate COVID-19's consequences on girls' SRH. (C) 2021 Society for Adolescent Health and Medicine. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "958cf279ceea6a26c05825818c73de1b",
  "timestamp": "2025-05-15T03:08:37.975944"
}