{
  "id": 3836,
  "title": "The nexus between country risk and exchange rate regimes: A global investigation",
  "abstract": "Using a sample of 110 countries over the period 1984-2013, this paper examines the impacts of country risks on choosing a specific exchange rate regime (first by utilizing the Levy-Yeyati and Sturzenegger de facto classification and then robusting it by the IMF de jure measurement) relative to other regimes via the panel multinomial logic approach. Empirical findings are as follows. First, in the full samples case we provide evidence that government is more likely to implement a flexible regime, but less likely to adopt a fixed regime, under a low level of composite and financial risk. Second, we find that Eurozone countries are more likely to choose a fixed exchange rate regime with a decrease in the level of country risk and favor a flexible regime in response to a shock from an increase of risk, which is opposite to non-Eurozone countries. Third, we note that high-risk countries are more likely to choose a fixed regime with a low level of composite and political risk in the government, but do not adjust the exchange rate regime as a shock absorber when facing economic and financial risks. It is interesting to see that those countries with relatively low risk display almost opposite results versus high-risk economies. Overall, we believe that it is critically important to account for political economy variables in a government's exchange rate policy decisions, especially for country risks. All results are robust to the panel ordered probit model.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9599196df347803c99333a99b80c9d69",
  "timestamp": "2025-05-15T02:30:28.728713"
}