{
  "id": 6230,
  "title": "Studying the impoverishing effects of procuring medicines: a national study",
  "abstract": "BackgroundOne of the main treatment procedures is through medicine prescription. Considering the rising burden of drug costs, we conducted this study to estimate the impoverishing effects of medicine on Iranian households.MethodWe carried out calculations based on the Iranian National Household Survey for the year 2013. Amoxicillin, atorvastatin and metformin were the drugs selected. Three different poverty lines were applied. Impoverishment was estimated for various scenarios. Additionally, the associations of some demographic factors were tested. Excel 2013 and SPSS v.19 were used.ResultsMany households fell under the poverty line after purchasing drugs. Procuring original brand (OB) drugs caused more poverty than lowest-priced generic (LPG) equivalents. The logistic regression testing showed that the age, gender and literacy of the head of household and the size of the household were associated with impoverishment.ConclusionThis study showed that purchasing medicines increases the impoverishment risk of households. This risk is an index used to assess financial protection against health costs, which is in turn an indicator of health equity. The results will be of practical use for policymakers when addressing different scenarios of setting medicines prices as well as when considering alternatives for cost shifting for cross subsidies in pharmaceutical procurement.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "95a079ca4f63bc1cec2826463c8ddf6e",
  "timestamp": "2025-05-15T02:56:10.879475"
}