{
  "id": 2610,
  "title": "The relationship between admission exam and students' performance on an undergraduate interior design program",
  "abstract": "The article investigates the relationship between admission exam and students' performance on an interior design program. To achieve the objective of the study, a survey was conducted of 50 students from an interior design program. The performance of these 50 students was tracked from year 1 to year 4 of their degree program. Paired samples testing and linear regression analysis were performed. Then, the study randomly evaluated the admission criteria of 33 Council for Interior Design (USA) accredited programs (in 4 countries: USA, Canada, United Arab Emirates, and Qatar. The study reveals that there is no significant relationship between admission exam (skill exam) and students' performance. There is also a significant difference in performance in an admission exam and the performance for students who hold a scholarship and for local compared with international students. The regression analysis, demonstrated that holding a scholarship and nationality are associated with performance in an admission exam. The critical evaluation of 33 Council for Interior Design (USA) accredited programs showed that a variety of different admission criteria were used (e.g. skill exam, portfolio, and high school/college GPA). In particular, 61% of the sample universities included submission of a design portfolio (USA: 37%; Canada: 92%; United Arab Emirates: 100%; Qatar: 100%) as part of the requirements for admission. The study also suggested that the Council for Interior Design (USA) should provide general guidelines on admission criteria for undergraduate interior design programs. Policy implications are also offered.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "95bf5113698ff1db8c6dcbe4d968fbdf",
  "timestamp": "2025-05-15T01:08:41.893545"
}