{
  "id": 5646,
  "title": "Carbon risk and green transition: evidence from China",
  "abstract": "Carbon risk may have potential influences on the green transition of enterprises. This paper thoroughly investigates the effect and mechanism of carbon risk on the transition towards sustainability. We use quantitative regression models and a panel of Chinese manufactural listed companies from 2011-2020. There is strong evidence manifesting that the effect of carbon risk on corporate green transition is positive and statistically significant. The green transition is marked by the overall encouragement of exploratory, exploitable, autonomous, and collaborative green innovation. The mechanism test indicates that the enhancement of internal R&D transformation and the pressure of external stakeholders are two fundamental pathways by which carbon risk influences the green transition. Additional examination reveals that the beneficial impact is particularly noticeable for companies that have limited capital intensity, minimal governmental assistance, reduced financial limitations, and are state-owned enterprises. These results are robust to resolve the problem of endogeneity by means of instrumental variables, Heckman two-step, placebo test, propensity score matching and difference-in-difference ways. Against the background of carbon neutrality, it is of great significance to examine the relationship between carbon risk and corporate green transition. The conclusion complements the knowledge of carbon risk and green transition, as well as provides theoretical insights and practical enlightenment for the green transition of manufacturing enterprises in emerging economies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "95c427b198a21d569c70ad4801fb8b29",
  "timestamp": "2025-05-15T02:49:50.352508"
}