{
  "id": 4275,
  "title": "Public perceptions of wave energy development on the west coast of North America: Risks, benefits, and coastal attachment",
  "abstract": "While solar and wind energy continue to grow as significant sources of renewable energy, a global energy transition away from fossil fuels will require an expanding portfolio of generating resources. Marine renewable energy has the potential to contribute greatly in the coming decades, as the more predictable nature of wave energy can support the resiliency of the power grid and complement solar and inland wind generation. Yet, the broad deployment of marine energy technologies like wave energy will depend on public support, making it critical to identify the relevant factors associated with public attitudes and risk/benefit perceptions. This paper draws on social representations theory to specifically examine perceptions of wave energy on the west coast of North America, a site chosen because of the high suitability for wave energy generation and the fact that one of only three wave energy test sites in the world is under development off the coast of Oregon. Using an online survey in June 2020, we recruited a sample of 2000 respondents from California, Oregon, Washington, and British Columbia. We found a majority of respondents held positive attitudes to wave energy, but respondents also had low familiarity - with a quarter of respondents lacking sufficient information to form an opinion. We used logistic regression to identify factors correlated with wave energy attitudes, finding that respondents who were more supportive of wind and solar energy, more optimistic about new technology, and reported more familiarity with wave energy were significantly more likely to have a positive impression of wave energy. Respondents with higher levels of place attachment to coastal areas were more split, as they perceived higher benefits of wave energy - but also higher risks. Our results indicate broad appeal of wave energy on the west coast, but we caution policymakers and developers to not take initial siting processes for granted. As experience has shown for offshore wind, broad appeal does not guarantee a smooth siting process in a local context. The role of place attachment to coastal areas must be taken seriously or risk alienating local communities.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "95deb0e8bfb8036c3b55724c0b9def57",
  "timestamp": "2025-05-15T01:25:23.327429"
}