{
  "id": 3120,
  "title": "Mortality of elder financial and psychological abuse victims in rural Malaysia: a prospective cohort study",
  "abstract": "Objectives To determine the longitudinal impact of elder financial and psychological abuse on risk of death among older Malaysians. Design 7-year prospective cohort study. Baseline data were collected in late 2013 and respondents were followed up in June 2020. Setting Kuala Pilah, Negeri Sembilan, Malaysia. Participants 1927 community-dwelling older adults aged 60 or older randomly sampled from the national census. Individuals with severe cognitive impairment were excluded. Outcome measure Mortality data were provided by the Malaysian National Registration Department and linked to respondents' national identification numbers. Kaplan-Meier curves and Cox regression were used to examine victims' survival periods and the impact of abuse on risk of death. Results Overall, 450 respondents (23.4%) died after 7 years. Among financial and psychological abuse victims, death percentage was 25.8% compared with 23.3% among those who did not experience these types of abuse. Kaplan-Meier curves showed shorter survival among abuse victims, but Cox regression found no significant impact of financial and psychological abuse on mortality risk (HR 1.05, 95% CI 0.78 to 1.41). Among all the variables studied, only cognitive impairment led to higher mortality risk (HR 1.32, 95% CI 1.03 to 1.69). Conclusion Our findings contradict prior empirical studies that supported the link between elder abuse and neglect (EAN) and mortality, even though we focused on two abuse subtypes. Results in this study are more in line with the recently emerging evidence that showed no association between EAN and mortality.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "95ec5547a3c9d8d36c777086d0c3c029",
  "timestamp": "2025-05-15T02:22:56.656107"
}