{
  "id": 3231,
  "title": "Bank FinTech and credit risk: comparison of selected emerging and developed countries",
  "abstract": "PurposeThis paper aims to explore FinTech's global impact in 40 countries, including the top 20 developing and developed nations, investigates FinTech's complicated effects in emerging and mature economies, considering bank-specific characteristics, macroeconomic variables, market rivalry and technology.Design/methodology/approachFixed effect regression is used to examine the baseline model before adding the efficient generalized method of moments (GMM) model to resolve endogeneity-induced biases. The panel regression model requires an efficient GMM estimate and a linear panel model with non-linear moment conditions. This research also uses a sequential test for multiple breaks at unknown breakpoints, comparing F-statistics to critical values at various significance levels.FindingsThe results show that NPL is substantially affected by prior NPL, with the preceding period's greater NPL raising it and the two periods before decreasing it. Digital lending (DL) proportionally raises NPLs. Innovation-driven emerging countries have more NPLs and faster FinTech growth due to rapid adoption beyond restrictions. Rapid FinTech advances require stronger regulation for financial inclusion and economic progress in developing countries. Additionally, DL usage has remained steady due to gradual technology adoption, while digital capital raising has consistently grown, showing resilience to market shocks.Research limitations/implicationsDue to FinTech's quick innovation and legislative changes, conclusions should be applied cautiously. There may be gaps in the study on varied settings and long-term effects.Practical implicationsFinTech credit expansion globally drives central banks and authorities to monitor economic conditions, advise monetary policies and resolve competitive and regulatory arbitrage concerns. Studies show digital banking's reach into underprivileged communities helps mortgage financing. Financial firms using FinTech for credit risk management show a dedication to risk assessment and decision-making. The practical effects show that FinTech adoption, credit risk and financial inclusion have pros and cons in different economic circumstances.Social implicationsAs central authorities use FinTech data for policy decisions, there's potential for enhanced financial inclusion, fostering social equity and empowerment. In economies with high financial exclusion, FinTech development becomes a catalyst for broader access to financial services. However, concerns about FinTech's correlation with traditional banks underscore the need for robust regulatory frameworks to ensure fair competition and consumer protection. Striking a balanced approach to FinTech adoption can lead to a more inclusive financial landscape, positively impacting individuals and communities traditionally underserved by conventional banking systems.Originality/valueThis research stands out in its comprehensive exploration of FinTech effect to the bank credit risk, delving into economic, regulatory and societal aspects. The focus on global FinTech credit expansion uniquely highlights the interconnected roles of central banks, regulatory authorities and financial institutions, outlining potential risks and benefits. The study's nuanced analysis of FinTech's impact on credit risk and financial inclusion provides distinctive insights, stressing the need for balanced adoption to foster inclusive economic growth. In essence, this research brings an original perspective to the intricate interplay between FinTech and global financial dynamics.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "95f4bf2ce53351254e2ced95870e8fff",
  "timestamp": "2025-05-15T02:24:05.095190"
}