{
  "id": 4991,
  "title": "Risk factors for self-reported high symptom cluster burdens in patients with breast cancer undergoing chemotherapy in China: A cross-sectional study",
  "abstract": "Background and Aims: Further exploration is needed to recognize symptom clusters and categorize subgroups with distinct cluster patterns and associated risks, focusing on symptoms that are highly self-reported by patients with breast cancer undergoing chemotherapy. This study aimed to identify subgroups and risk factors for self-reported high symptom cluster burden among patients with breast cancer undergoing chemotherapy. Methods: A total of 647 participants who met the inclusion criteria were included in the study, with data collected on demographics, disease information, self-reported symptoms, and psychosocial factors. Latent class analysis was utilized to identify the subgroup, while logistic regression was used to pinpoint predictive risk factors. Results: Latent class analysis revealed three subgroups: the high burden of all symptoms group (n = 107, 16.54%), the high burden of psychological symptoms group (n = 103, 15.92%), and the low burden of all symptoms group (n = 437, 67.54%). Patients in the high burden of all symptom group and high burden of psychological symptom group exhibited significantly worse function outcomes (p < 0.001). Predictive risk factors for the high burden of all symptom group included older age, lower self-efficacy, worse body image, and a higher financial burden. Similarly, patients with high burden of psychological symptom were more likely to have low self-efficacy, poor body image, and a high financial burden. Conclusio: The study demonstrated the importance of giving more attention to patients with breast cancer who are at risk of developing into membership of high symptom cluster burden group.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9621f9fde2797db0ba7284c685109a93",
  "timestamp": "2025-05-15T02:43:06.787661"
}