{
  "id": 5927,
  "title": "Predictors of adverse gambling related consequences among adolescent boys",
  "abstract": "Although gambling is illegal for minors, adolescents do gamble and even higher proportions of adolescents than adults are at risk to become problem gamblers. Moreover, many adolescents suffer from a wide range of gambling related harms, and this study sought to examine what predicts different adverse consequences of adolescent gambling. Our aim was to test whether various cognitive, motivational and behavioural factors were associated with psydiosocial consequences and loss of control, and with interpersonal and financial consequences of gambling, as measured by the Canadian Adolescent Gambling Inventory, the only instrument developed specifically for use on adolescents. The data was collected on a convenience sample of 1330 male Croatian students (Mage = 16.58, SDage = 1.16) from all three types of secondary education in Croatia. Results show that a high proportion of adolescents gamble, and that almost half of them are either at risk or can already be considered problem gamblers. Sport betting, VLT machines and betting on virtual horse races were the most frequent gambling activities for Croatian high-school boys. Hierarchical regression models showed that psychosocial consequences and loss of control can be predicted by higher frequency of gambling, previous experience with winning money and a specific motivation to earn money gambling, to become a better gambler and with having a drive to continue gambling after winning. On the other hand, interpersonal and financial consequences were predicted again by a higher frequency of gambling, the motive to be a better gambler and the drive to continue gambling after winning, but also by specific motivation to relax and feel better. Having more cognitive distortions, specifically having poorer understanding of chance and probabilities and more superstitious beliefs, as well as engagement in general risky and antisocial behaviour also predicted more interpersonal and financial consequences. Findings are discussed in the context of practical implications for prevention programs of adolescent gambling. (C) 2016 Elsevier Ltd. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9632ad97cccaa018e545aecc2270a09f",
  "timestamp": "2025-05-15T02:53:03.062061"
}