{
  "id": 3664,
  "title": "Analyzing energy intensity of Indian Chemical industry: A panel data approach",
  "abstract": "The chemical industry is directly or indirectly connected with almost every industrial process and holds a crucial place in the economic and social advancement of India. At the same time it is however, the second highest energy intensive industry in the country. Thus, we attempt to look into the factors that affect the energy intensity of Indian chemical industry. We collect a panel dataset including a total of 2613 chemical firms for the period 2010 to 2021 for our analysis. We carry out our empirical testing under both linear and non-linear framework by employing fixed effect regression and panel quantile regression methods respectively. We find that energy intensity for the sample chemical firms increases due to poor labour productivity, huge plant and machinery, outsourcing operations, and more use of IT -enabled services. On the other hand, use of better quality raw material and advanced technology can help optimising the energy intensity. We also discover that profitable firms and firms larger in size are energy efficient. Based on the findings, we suggest professional training programs and vocational skill development programs for enhancing labour productivity. Profitable firms are suggested to invest in technological up -gradation and energy saving technology. We believe the findings of the study can provide a portfolio of variables to the managers and policy makers in order to diversify their attention to find all possible ways to reduce energy intensity of the Indian chemical firms.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "963c5a014cc86a2f60a94644d2b43985",
  "timestamp": "2025-05-15T01:19:26.205208"
}