{
  "id": 8929,
  "title": "Safety Knowledge, Safety Behaviors, Depression, and Injuries in Colorado Farm Residents",
  "abstract": "Background Changing safety behavior has been the target of injury prevention in the farming community for years but significant reductions in the number of farming injuries have not always followed. This study describes the relationships between safety knowledge, safety behavior depression, and injuries using 3 years of self-reported data from a cohort of farm residents in Colorado. Methods Farm operators and their spouses (n = 652) were recruited in 1993 from a farm truck registration list using stratified probability sampling. Respondents answered ten safety knowledge and ten safety behavior questions. The Center for Epidemiologic Studies Depression (CES-D) scale was used to evaluate depression. The most severe farm work related injury over a 3-year period was the outcome variable. Factor analysis was used to produce a single measure of safety knowledge for logistic regression models to evaluate the relationships between injuries, safety knowledge, and behaviors. Results Safety knowledge was significantly associated with wearing personal protective equipment. None of the safety behaviors were significantly associated with injuries. In the presence of depression, low safety knowledge increased the probability of injury (OR 3.87, 95% CI 1.00-15.0) in models adjusted for age, sex, hours worked per week, and financial problems. Compared to those not depressed, those depressed with a low safety score showed significantly greater risk of injury than those depressed with a high score in adjusted models (OR 3.09, CI 1.31-7.29 vs. OR 0.86, CI 0.31-2.37). Conclusions Future work on injuries in the farming community should include measures Of mood disorders and interactions with safety, perceptions and knowledge. Am. J. Ind. Med. 5 3:47-54, 2010. (C) 2009 Wiley-Liss, Inc.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9646d6bc01c50263f0577d872e544c04",
  "timestamp": "2025-05-15T03:23:56.056271"
}