{
  "id": 8443,
  "title": "The Association of Frequency of Worry About Financial Debt With Substance Use Among Adults in Ontario, Canada",
  "abstract": "BackgroundFinancial debt and associated stress might increase the risk of substance use problems or exacerbate existing ones. Little evidence is available about the degree of debt stress and its association with substance use. The objective of this study was to examine the associations of the frequency of worry about debt with heavy episodic drinking (HED), daily smoking, e-cigarette use, and cannabis use in the past 30 days.MethodsData were utilized from the 2020/2022 Monitor study, a repeated cross-sectional survey of adults 18 years and older in Ontario, Canada. The surveys employed a web-based panel survey of 6038 adults and collected data on debt-related stress, HED, tobacco smoking, e-cigarettes, and cannabis use in the past 30 days. Odds ratios (OR) were estimated from logistic regression models accounting for sociodemographic factors.ResultsOverall, 18.4% of respondents reported that they were worried about their debt most or all of the time. Accounting for household income, educational status, employment status, and other factors, the results revealed that there was a dose-response relationship between the frequency of worry about debt and substance use including daily smoking, e-cigarette use, and cannabis use in the past 30 days compared to those who were not worried at all about their debt. Sex differences were also found in the association between worry about debt and e-cigarette use.ConclusionsThe frequency of worry about debt might have an important role in substance use, which suggests that financial well-being is vital in substance use prevention and harm reduction.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96476a01d5ea20c4c37ef345738adc18",
  "timestamp": "2025-05-15T03:18:51.635950"
}