{
  "id": 7059,
  "title": "High Food Prices and the Global Financial Crisis Have Reduced Access to Nutritious Food and Worsened Nutritional Status and Health",
  "abstract": "A global economic and financial crisis is engulfing the developing world, coming on top of high food and fuel prices. This paper assesses the impact of the crises on food consumption, nutrition, and health. Several methods were applied, including risk analysis using the cost of the food basket, assessment surveys, simulations, regression analysis using a food consumption score (FCS), reflecting diet frequency and diversity, and a review of the impact of such dietary changes on nutritional status and health. The cost of the food basket increased in several countries, forcing households to reduce quality and quantity of food consumed. The FCS, which is a measure of diet diversity, is negatively correlated with food prices. Simulations show that energy consumption declined during 2006-2010 in nearly all developing regions, resulting potentially in an additional 457 million people (of 4.5 billion) at risk of being hungry and many more unable to afford the dietary quality required to perform, develop, and grow well. As a result of the crises, large numbers of vulnerable households have reduced the quality and quantity of foods they consume and are at risk of increased malnutrition. Population groups most affected are those with the highest requirements, including young children, pregnant and lactating women, and the chronically ill (particularly people with HIV/AIDS and tuberculosis). Because undernutrition during the first 2 y of life has life-long consequences, even short-term price rises will have long-term effects. Thus, measures to mitigate the impact of the crises are urgently required. J. Nutr. 140: 153S-161S, 2010.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "964ca42cc6ef0d4b3234b6dbd7ff6a68",
  "timestamp": "2025-05-15T03:04:23.056099"
}