{
  "id": 552,
  "title": "Exploring the impact of financial literacy on predicting credit default among farmers: An analysis using a hybrid machine learning model",
  "abstract": "This study explores whether financial literacy can enhance the ability to predict credit default by farmers using machine-learning models. It introduces a hybrid model combining k-means clustering and Adaboost to predict loan default using data on 10,396 farmers who obtained credit from Chinese rural commercial banks, including demographics, household finance, credit history, and financial literacy. We systemically compare the results of models with and without financial literacy variables, which indicate significant improvement in the predictive accuracy about credit risk when financial literacy factors are included. Our findings confirm that financial literacy is a crucial indicator of farmers' ability to make informed financial decisions, reducing their likelihood of loan default and suggesting its utility as a screening tool or supplementary credit risk assessment variable. This research has profound implications for financial inclusion and credit risk management, indicating that financial institutions can leverage financial literacy data to evaluate farmers' creditworthiness and design effective financial education programs. This study enriches the literature on credit risk prediction by introducing financial literacy as a predictor of credit default.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9653484b1b4046f7c655a9bf63a42a30",
  "timestamp": "2025-05-15T01:52:12.291879"
}