{
  "id": 4632,
  "title": "Does ESG always improve corporate performance? Evidence from firm life cycle perspective",
  "abstract": "In this study, drawing on firm life cycle theory, we focus on the corporate performance of Environmental, Social, and Governance (ESG) engagement via financial stress and consider the moderate effect of transparency, financial slack, and environmental uncertainty. The industry-year fixed effects panel regression analysis is executed based on the data including 11,742 firm-year observations for 1,486 Chinese A-share listed companies from 2010 to 2020. The results show that ESG performance can significantly improve corporate performance at all life cycle stages, especially when the corporate is in the growth stage. Moreover, the mechanism analysis shows that the financial risk mediates the relation between ESG performance and corporate performance for the corporates in the growth and maturity stages. The association between ESG and corporate performance is more pronounced when corporate information disclosure quality is high. Moreover, financial slack moderates and undermine the association between ESG and corporate performance in the maturity stages. Similarly, for the maturity and decline stages of corporate, environmental uncertainty moderates and undermines the association between ESG and corporate performance. Besides offering scientific evidence for the role of ESG ratings in relieving financial pressure and promoting corporate performance in growth and maturity stages, the results can also inform the regulators and/or investors of the benefit of engaging in corporates sustainability transition, which has implications for both the success of the regulatory regime and the advancement of long-term investment philosophy.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9663e9e24476ce92cbd62904f5a874b0",
  "timestamp": "2025-05-15T02:39:26.966141"
}