{
  "id": 7562,
  "title": "Trends in vascular risk factors, stroke performance measures, and outcomes in patients with first-ever ischemic stroke in Taiwan between 2000 and 2012",
  "abstract": "Background: With the aging of the population in Taiwan, the financial burden of stroke on the healthcare system is expected to rise. We aimed to investigate the trends in vascular risk factors, adherence to stroke performance measures, and stroke outcomes based on a nationwide representative sample. Methods: Adult patients hospitalized for first-ever ischemic stroke between 2000 and 2012 were identified from a nationwide administrative database. The study period was divided into 1-year intervals. The Cuzick test and the Cochran-Armitage test were used to determine the significance of changes over time. Trends in stroke outcomes as a function of year were assessed using logistic regression, controlling for age, sex, comorbidity, and stroke severity. Results: A total of 11,462 patients (mean age 67.3 years, female 40.9%) were hospitalized. Between 2000 and 2012, the prevalence of hypertension, diabetes mellitus, hyperlipidemia, and atrial fibrillation increased while the prevalence of coronary artery disease decreased. The proportion of patients taking antihypertensive or anti diabetic medication prior to stroke decreased, whereas the proportion of patients taking lipid lowering medication increased. Adherence to the five selected performance measures significantly improved. A significant decreasing trend in the proportion of recurrent stroke or all-cause death within one year was observed regardless of whether adjustment for age, sex, comorbidity, and stroke severity was made. Conclusions: Despite the rising prevalence of vascular risk factors, improved adherence to stroke performance measures was accompanied by better stroke outcomes. (C) 2017 Elsevier B.V. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96646451dc57b8f3e4668809079afe8d",
  "timestamp": "2025-05-15T03:09:36.992064"
}