{
  "id": 5563,
  "title": "Role of User Benefit Awareness in Health Coverage Utilization among the Poor in Cambodia",
  "abstract": "The objective of this study was to understand the steps to health coverage benefit utilization in Cambodia toward improving access to health care and financial risk protection for the poor. We particularly examine the role of user awareness in the pathway to care seeking and benefit utilization with respect to the Health Equity Funds (HEF). Using 2016 survey data that were nationally representative of households with children under two years of age, we used a series of logistic regression models to evaluate associations between respondents' awareness of benefits, public health care seeking behaviors, coverage benefit claims, and out-of-pocket expenditures. Beneficiaries were generally aware of their entitlements, although their awareness of specific benefits, such as transport reimbursement, was relatively lower. Awareness of free services at public health centers was associated with twice the odds of having ever visited a public provider for outpatient care, while awareness of free services at public hospitals was associated with higher odds of always seeking inpatient care in the public sector. Study findings point to the decision of where to seek care as the critical point in the pathway to HEF utilization. If the decision had already been made to go to a public provider, it was likely that HEF benefits were claimed. Interventions that prompt appropriate care seeking in the public sector may do the most to improve HEF utilization and subsequently improve access to care through sufficient financial risk protection.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96680387c1301961211ff2fb3f21294b",
  "timestamp": "2025-05-15T02:49:21.590630"
}