{
  "id": 5820,
  "title": "Systematic map of the literature on carbon lock-in induced by long-lived capital",
  "abstract": "Long-lived capital-stocks (LLCS) such as infrastructure and buildings have significant and long-lasting implications for greenhouse gas emissions. They contribute to carbon lock-in and may hinder a rapid decarbonization of energy systems. Here we provide a systematic map of the literature on carbon lock-in induced by LLCS. Based on a structured search of the Web of Science and Scopus, we identified 226 publications from 38 095 search results using a supervised machine learning approach. We show biases toward power generation and toward developed countries. We also identify 11 indicators used to quantify carbon lock-in. Quantifications of committed emissions (cumulative emissions that would occur over the remaining operational lifetime of an asset) or stranded assets (premature retirement/retrofitting or under-utilization of assets along a given pathway) are the most commonly used metrics, whereas institutional indicators are scarcely represented. The synthesis of quantifications shows that (i) global committed emissions have slightly increased over time, (ii) coal power plants are a major source of committed emissions and are exposed to risk of becoming stranded, (iii) delayed mitigation action increases stranded assets and (iv) sectoral distribution and amount of stranded assets differ between countries. A thematic analysis of policy implications highlights the need to assure stability and legitimacy of climate policies and to enable coordination between stakeholders. Carbon pricing is one of the most cited policy instrument, but the literature emphasizes that it should not be the only instrument used and should instead be complemented with other policy instruments, such as technical regulations and financial support for low carbon capital deployment. Further research is warranted on urban-scale, in developing countries and outside the electricity generation sector, notably on buildings, where stranded assets could be high.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9669603dd7656821d983a2b14858766b",
  "timestamp": "2025-05-15T02:51:58.522376"
}