{
  "id": 1478,
  "title": "An efficient and versatile Kriging-based active learning method for structural reliability analysis",
  "abstract": "In structural reliability analysis, the development of an efficient and versatile active learning method applicable to problems of varying complexities remains a challenging task. The critical contribution of this work is the elegant implementation of the Kriging-based importance sampling and dimension reduction techniques within an active learning framework. Specifically, the proposed algorithm employs a dimension reduction technique that considers the contributions of important and unimportant random variables, enabling it to handle high-dimensional problems effectively. To exploit the merits of the adaptive Kriging method, a quasi-optimal importance sampling density is established based on the predictive information provided by the Kriging model. Additionally, a novel learning function allocation (LFA) strategy is proposed to automatically select the appropriate learning function from a portfolio of options. This facilitates the selection of new samples near the limit state surface with significant contributions to the failure probability. Moreover, an efficient stopping criterion is introduced to terminate the active learning process at an appropriate stage effectively. In other words, the proposed method inherits the merits of Adaptive Kriging, Dimension Reduction, and Importance Sampling, hence named AK-DRIS in this study. The overall performance of AK-DRIS is verified through several numerical examples of different complexities.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "966a92bcd4558bcecf434520b53b7880",
  "timestamp": "2025-05-15T00:56:08.390122"
}