{
  "id": 4190,
  "title": "From resources to resilience: Understanding the impact of standard of living and energy consumption on natural resource rent in Asia",
  "abstract": "As Asia faces the dual challenges of rapid economic expansion and mounting environmental pressures, the region's ability to balance growth with sustainability has become a focal point of global discourse. With increasing energy demands, escalating COQ emissions, and widening income inequality, an integrated approach to managing natural resources has never been more critical. This study responds to this urgent need by examining the complex interplay between energy consumption, living standards, and natural resource rents-factors that will determine whether Asia can sustain its growth without depleting its ecological assets. Our analysis incorporates key variables such as standard of living, income inequality, renewable and nonrenewable energy consumption, COQ emissions, gross fixed capital formation, and foreign direct investment, all of which play crucial roles in shaping natural resource rents across Asian economies. Using Moment Quantile Regression (MMQR), we uncover nuanced insights into how these factors interact across different economic contexts. The findings reveal a negative correlation between higher living standards and resource rents, indicating that countries like Japan and South Korea, which have transitioned to more diversified, technology-driven sectors, demonstrate a pathway for sustainable growth. Conversely, economies like Indonesia and Malaysia, with lower living standards and higher dependence on resource rents, face challenges related to income inequality and environmental degradation. Renewable energy consumption positively impacts resource rents, while reliance on fossil fuels has a detrimental effect, reinforcing the need for energy portfolio diversification. A strong link between COQ emissions and resource rents highlights the necessity of balancing economic growth with environmental preservation. This study provides policymakers with actionable insights, emphasizing the importance of adopting sustainable energy practices, addressing income inequality, and managing foreign investments responsibly to ensure long-term resilience and prosperity in Asian economies while safeguarding vital natural resources for future generations.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "966b874ad8d5a648832c2183ed005503",
  "timestamp": "2025-05-15T01:24:51.387685"
}