{
  "id": 7054,
  "title": "Determinants Of Farm Households' Participation in Microfinance Program and Its Impact on Their Livelihoods: The Case of Boneya Boshe Woreda of East Wollega Zone, Oromia, Ethiopia",
  "abstract": "Microfinance is an institution that provides access to various financial services such as credit, savings, leasing to low-income clients. Therefore, the objective of this study was to identify factors that affect farm households' participation in microfinance programs and its impact on their livelihoods). In order to achieve these objectives, both primary and secondary data were collected. Primary data was collected using semi-structured questionnaire and interview. While secondary data was collected from different published and unpublished documents. Multi-stage stratified sampling technique and systematic random sampling technique were followed to reach 364 sample respondents out of 4,045 total farm households of the selected kebeles. Descriptive, inferential, and econometric methods were used to analyze the data. Binary Logit regression model and Propensity Score matching technique were applied by using stata software version 15. Logistic regression result indicates that program participation was significantly and positively affected by family size, education level, farm size, risk perception, extension visit and training access of household head whereas distance of household home from microfinance office has negative effect. The result of sensitivity test using Rosenblum bounds also implies that the estimated impact result was insensitive to unobserved characteristics. Furthermore, PSM result indicates that microfinance program has a significant and positive impact on income of participant households. Finally, the study recommends that microfinance institutions and other concerned stakeholders should broaden their outreach and expand their access to rural areas in enhancement of rural farm households' livelihoods.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "966c26ec9ff0dd7cdf0075e6233c908f",
  "timestamp": "2025-05-15T03:04:23.047476"
}