{
  "id": 7714,
  "title": "The influence of IFRS mandatory adoption on value relevance of intangible assets in Italy",
  "abstract": "Purpose Following the mandatory IFRS adoption in 2005, the Continental European accounting systems changed. This study investigates if it influenced the value relevance of intangible assets in Italy. Design/methodology/approach To measure the value relevance of intangible assets of non-financial firms listed on Borsa Italiana from 2000 to 2015, this study isolates the impact of several classes of intangible assets on stock prices and then classifies firms according to intangible asset intensity. Findings Goodwill, intellectual property and other rights, start-up costs or other intangible assets are significantly correlated with stock prices when Italian accounting standards were applied prior to 2005, whereas research and development expenditures are not associated with stock prices. The mandatory IFRS adoption has exerted positive effects only for goodwill and research and development expenditures, and it is negative for start-up costs. Further, when intangible-intensive firms are considered in the post-IFRS adoption period, declining value relevance exists relative to intellectual property and other rights or research and development expenditures; goodwill and other intangible assets increase in value relevance. Research limitations/implications This study is subject to country-specific determinants and firm-specific characteristics. It treats accounting standards as exogenous, and the classification reflects the concentration of intangible assets in an industry. By relying on investors' assessments of risk, it does not sufficiently explore the risk conveyed by future abnormal earnings and earnings volatility. Practical implications This study offers insights for measuring and reporting intangible assets, by specifying that their value relevance depends on their level and aggregation. Originality/value This study investigates the value relevance of intangible assets in the post-IFRS period, in reference to intangible-intensive firms. It also divides intangible assets into several classes to specify the value relevance of goodwill.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "967e3dfa3e99401ad7fc21215be7c42c",
  "timestamp": "2025-05-15T03:11:38.423850"
}