{
  "id": 6271,
  "title": "Assessment of clinical miscoding errors and potential financial their implications on healthcare management - A case of local hospital in Najran, Saudi Arabia",
  "abstract": "Background: Healthcare systems can potentially improve their safety, quality of service, and performance efficiency with a cost reduction, through the introduction and implementation of healthcare information management systems. This study aims to examine the frequency of miscoding errors in principal and secondary diagnoses, exploring demographic and coder-related factors contributing to these errors through the use of the QuadraMed system. The study also investigates the association of coding errors with patient safety and service quality to estimate the potential financial implications resulting from these inaccuracies in the healthcare system. Methods: This analytical cross-sectional retrospective study was conducted at a local hospital in Najran, Saudi Arabia, from July 2021 to February 2022 using the International Statistical Classification of Diseases and Related Health Problems, Tenth Revision, Australian Modification (ICD-10-AM) coding system. The costing and financial data were collected from the reimbursement department for eligible 750 patient cases in terms of payment mode, services availed, and length of stay. The financial claims were evaluated to estimate the impact on the quality of service and patient safety. The reimbursement amount was calculated based on codes. The data were analyzed using SPSS and the odds ratio was calculated to estimate the risk of major coding errors in different departments. Results: Primary codes 240 (32%) and 40 (5.3) secondary codes were reviewed and percentages and inaccuracies were calculated after recording. The percentage of inaccurate medical codes in principal diagnosis was 57 (26.8%) and the percentage of inaccurate medical codes in secondary diagnosis was 21 (9.9%). The primary diagnostic codes have more coding errors with a total number of 240 (32%) coding errors with a moderate level of agreement between the original coder and independent coder with a kappa value of 0.462. The identified recording was done by the independent coder, and the secondary diagnostic code showed 40 (5.3%) cases, with a poor kappa value of 0.128. The results showed the highest number of primary diagnostic codes was among surgery clinics 79 (63.2%). The highest number of secondary diagnostic codes were reported among consultant clinics 12 (9.6%) Conclusions: The study concludes that the identification of miscoding in the healthy population has a financial impact on the healthcare organization's infrastructure.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96861e5fb4600322fa400920d579fb1e",
  "timestamp": "2025-05-15T02:56:37.274399"
}