{
  "id": 8204,
  "title": "Make it easy: the effect of prospectus readability on IPO performance",
  "abstract": "Purpose - Understanding the determinants of a corporate initial public offering (IPO) success is essential for reducing investors' valuation uncertainty when participating in share offerings. In this sense, this study contributes to the existing debate by examining IPO prospectus readability. The authors specifically investigate how clear and more informative insights into pure corporate key financial numbers can lead to a higher valuation for the company after the listing process. Design/methodology/approach - Through a sample of European IPOs, the authors employ a cross-sectional regression to test the relationship between prospectus readability through the Flesch reading ease (FRE) score and companies' market-to-book ratio at the period end date after the listing process. Findings - The study findings show a positive impact of higher readability on the post-IPO market-to-book ratio. Thus, clear and more informative communication results in stocks being traded at a premium to their book value. This study presents a concrete call for firms to increase corporate documents' readability to mitigate the risk of withdrawing or spoiling corporate market access. Specifically, enhanced clarity and transparency increase investors' confidence, facilitating a better understanding of companies' intrinsic value and the overall IPO process. The authors conducted several tests to validate the results. Originality/value - To the best of the authors' knowledge, this is among the first works to explore the relationship between the readability of corporate prospectus and the sustained IPO success in the European context.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "969df02746569c828edc248cb1616166",
  "timestamp": "2025-05-15T03:16:17.450613"
}