{
  "id": 1422,
  "title": "The Multifactor Quantitative Investment Model Based on Association Rule Mining and Machine Learning",
  "abstract": "The security information database has accumulated a large amount of historical data due to the continuing development of the securities market. People are concerned about how to fully utilize these data to investigate the securities market's law. In the financial field, financial asset pricing is a major issue. To some extent, the size of the return is determined by the difference between asset prices and their intrinsic value. The total global investment scale of quantitative funds will surpass 20 billion yuan by the end of 2021. Global asset management firms have turned to quantitative funds as their most important investment tool. Quantitative investment applies a specific investment idea to a specific model by creating specific indicators and parameters and then executes the investment strategy, greatly increasing the breadth and depth of investment. The goal of investors is to understand risk and maximize returns on investment. Researchers and investors alike value quantitative investment because of its scientific and efficient operation. In quantitative stock selection, a multifactor stock selection model is a critical tool for building a portfolio. This paper builds a multifactor investment strategy based on the relevant factors of corporate finance and valuation, selects the portfolio, and calculates the excess return using a machine learning classification algorithm.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96a1ceba827460b6cf97ae43fe84db87",
  "timestamp": "2025-05-15T02:03:00.618611"
}