{
  "id": 3884,
  "title": "Quantile modeling for environmental risk: SAARC's journey with green finance, policies, and regulations",
  "abstract": "Environmental risk assessment and management have become critical issues facing global climate change and its multifaceted consequences. The 2030 United Nations Sustainable Development Goal (SDG) 13 prioritizes a sustainable environment and urgent climate change mitigation. The present study aimed to make accountability of environmental risk through green finance, financial development, policies, and regulations in SAARC countries. Using data from 2005 to 2022, the panel quantile regression (PQR) approach is applied to estimate the long-run coefficients at lower, middle, and upper quantiles. Overall, the study results indicate heterogeneity in the parameters impacting the environmental risk in SAARC. The findings from the PQR unveiled that green finance contributes to mitigating environmental risk in higher quantiles. Financial development contributes to environmental risk in the middle (40th to 60th) and higher quantiles (70th to 90th). It is concluded that the appropriate business regulatory framework reduces environmental risk in higher quantiles, and poor and lowrated policies increase it in the middle, and higher quantiles. Nevertheless, foreign direct investments increase environmental risk in lower and middle quantiles. Overall, there is a heterogeneity in the results; however, the amplitude of their parameters varied substantially. The quantile slope equality (QSE), symmetric quantile (SQ) tests, and fully modified ordinary least square (FMOLS), also confirmed the robustness of the results. Finally, the empirical findings of this study have prudent policy implications for the stakeholders concerning environmental risk.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96a79922df0c7e34720a014833b0dc43",
  "timestamp": "2025-05-15T02:30:58.295551"
}