{
  "id": 3134,
  "title": "Adapted Neuro-Fuzzy Inference System on indirect approach TSK fuzzy rule base for stock market analysis",
  "abstract": "Nowadays because of the complicated nature of making decision in stock market and making real-time strategy for buying and selling stock via portfolio selection and maintenance, many research papers has involved stock price prediction issue. Low accuracy resulted by models may increase trade cost such as commission cost in more sequenced buy and sell signals because of insignificant alarms and otherwise bad diagnosis in price trend do not satisfy trader's expectation and may involved him/her in irrecoverable cost. Therefore, in this paper, Neuro-Fuzzy Inference System adopted on a Takagi-Sugeno-Kang (TSK) type Fuzzy Rule Based System is developed for stock price prediction. The TSK fuzzy model applies the technical index as the input variables and the consequent part is a linear combination of the input variables. Fuzzy C-Mean clustering implemented for identifying number of rules. Initial membership function of the premise part approximately defined as Gaussian function. TSK parameters tuned by Adaptive Nero-Fuzzy Inference System (ANFIS). Proposed model is tested on the Tehran Stock Exchange Indexes (TEPIX). This index with high accuracy near by 97.8% has successfully forecasted with several experimental tests from different sectors. (C) 2009 Published by Elsevier Ltd.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96ae5a8cb3126ac630889abbe6c17d47",
  "timestamp": "2025-05-15T01:13:45.301919"
}