{
  "id": 7947,
  "title": "Survival Analysis of Down Syndrome Cohort in a Tertiary Health Care Center in India",
  "abstract": "Objective To identify the major causes of death in Down Syndrome (DS), the ages at which mortality rates are the highest and recognize factors associated with it. Methods The prospective cohort-based study was carried out in a tertiary health care center. Children with DS (n=543) counseled at the Center of Medical Genetics, Sir Ganga Ram Hospital from 2005 through 2009 were followed up in year 2010. Survival curves and Cox's proportional hazards regression analysis were used to determine the effect of different variables on survival. Results Total mortality was 13 %, of which 80.3 % was in children less than 2 y of age. Presence of congenital heart disease (CHD) increased the risk of mortality by 5.7 folds (p=0.001). A definitive survival benefit after cardiac intervention was noted, although it differed with the type of CHD. Sex, maternal age at time of birth and karyotypes did not show a significant correlation with survival. Conclusions The higher DS infant mortality observed in the present study could be attributed to financial constraints of the families and misconceptions amongst health professionals. It is recommended that a nation-wide DS registry be created to study the morbidity and mortality in Down syndrome from birth. The findings of this study will help clinicians in making management decisions and enable better counseling.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96b104a256efc56556536b68be85735a",
  "timestamp": "2025-05-15T03:13:30.703695"
}