{
  "id": 5548,
  "title": "The Behavioural Pattern of Investment in the Financial Market: A Study of the Individual Investors",
  "abstract": "Most financial theories are based on the assumption that everyone is logical and considers all available information before making decisions, which is not the case in reality. This study aims to analyse the behavioural determinants that drive the investment decision of individual investors in J & K. Non-probability convenience sampling was adopted; through which 392 responses from individual investors were gathered using a self-administered questionnaire. The t-test and ANOVA were used to determine the effect of demographics on investment behaviour (IB), whereas logistic regression was used to determine the impact of IB determinants on investment decision-making. The findings show that the investment decisions of investors in Jammu and Kashmir (J & K) are significantly influenced by age and occupation. The results also indicate that cognitive bias, investment goals and saving orientation have a substantial influence on IB but overconfidence, risk perception and decision influencers do not have any significant impact on the investment decision of individual investors in J & K. By gaining awareness of these determinants, investors can make more rational investment decisions, leading to enhanced market efficiency and achieving better outcomes in the financial market.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96b3f38ab5c34cb35fc90445629a98e2",
  "timestamp": "2025-05-15T02:48:51.362913"
}