{
  "id": 5503,
  "title": "Impact of Fintech on Bank Risk-Taking: Evidence from China",
  "abstract": "This article focuses on the relationship between Fintech and bank risk-taking behavior. Since Robo-Advisor is one of the mature applications of Fintech, we found that the development of Fintech will have a greater impact on small and medium-sized banks through the establishment of a Robo-Advisor model. This paper uses a benchmark regression model to analyze the municipal digital financial inclusion index compiled by Peking University and the annual report data of 155 small and medium-sized banks from 2011 to 2016. We found that the development of Fintech has significantly reduced bank risk-taking level. This result is still valid after the robustness test of replacing the bank's risk-taking index and replacing the Fintech development index. We used the urban innovation index as an instrumental variable to deal with the endogenous problem, and obtained consistent estimation results. The test of the intermediary effect shows that the development of Fintech will affect the bank risk-taking through channels such as the bank's internal interest margin, management capabilities, the bank's external competition intensity, and residents' saving willingness. Heterogeneity analysis shows the reduction effect of Fintech on bank risk-taking is more pronounced in banks in eastern and western regions in China, the large banks and the urban commercial banks.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96d36545e0e2c61300fd6bd83e7f4005",
  "timestamp": "2025-05-15T02:48:23.804982"
}