{
  "id": 4333,
  "title": "Risk management and bank performance: evidence from the MENA region",
  "abstract": "Purpose The credit crunch of 2008 and recent COVID-19 influences underscored the importance of liquidity and credit risk management in businesses and financial institutions. The purpose of this study is to investigate the impact of liquidity risk and credit risk management on accounting and market performances of banks operating in the Middle East and North Africa (MENA) region. Design/methodology/approach This study uses a panel data regression analysis on a sample of 51 listed commercial banks operating in 10 MENA countries during the period 2010-2018. Findings The results show that credit risk management does not affect the accounting performance of banks, while it has a non-linear, convex relationship with market performance. Surprisingly, liquidity risk management is not a significant driver for either performance measure in studied banks. However, when a bank combines credit risk management with liquidity risk management efforts, liquidity risk management actions return significant results on both performances, illustrated by an inverted U-shaped relationship. In addition, this study examines the joint impact of both risks on bank performance. This study reveals that accounting and market performances are differently affected by joint risk management efforts. Their impact depends on the combination of risk management ratios upon which banks choose to focus their efforts. Practical implications The findings help bankers and regulators further consider non-linearities and offer them new tools for managing the impact of credit and liquidity risk interactions towards achieving more financial stability. Originality/value These results contribute to traditional banking in offering bankers and regulators new tools for managing the impact of credit and liquidity risk interactions on bank performance.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "96f0d31f2fdf41ffb81ba55cee08cddc",
  "timestamp": "2025-05-15T02:36:05.188642"
}