{
  "id": 3134,
  "title": "Sovereign Wealth Fund Ownership and Financial Performance of Companies Listed on the Warsaw Stock Exchange",
  "abstract": "Sovereign Wealth Funds are investment vehicles established in order to manage in a profit oriented way pool of national wealth for future generations. Nowadays over 70 funds exist and operate on global financial markets. Similarly to other institutional investors, Sovereign Wealth Funds possess huge amounts of capital. What distinguishes them the most from other financial institutions is the fact that they are owned, managed and controlled by sovereign states, have limited liquidity needs, a lower-than-market-average-level of redemption risk, a long-term, intergenerational investment horizon and relatively high risk tolerance. The aim of this study is to test empirically the impact of Sovereign Wealth Funds' ownership on the financial performance of targeted companies. Using the data of companies listed on the Warsaw Stock Exchange, we employ regression to analyze the relationship between the funds' investment and financial performance of the company. The empirical findings of this research suggest that Sovereign Wealth Funds' ownership has a positive influence on the price to book value of the firm. This article contributes to ongoing research in the field of studies related to financial aspects of SWF's investment behavior by providing empirical evidence from emerging market.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97077a80a1cc4a441de3d0c440312da6",
  "timestamp": "2025-05-15T02:22:56.721189"
}