{
  "id": 9296,
  "title": "Child centered literacy orientation: A form of social capital?",
  "abstract": "Objective. To describe the home literacy environment and to identify financial, human, and social capital variables associated with the presence or lack of Child Centered Literacy Orientation (CCLO) in families with young children who regularly attend pediatric primary care clinics. Design. Cross-sectional case-control analysis of structured parent interviews conducted in two hospital-based and four community-based pediatric clinics in New England. Subjects. Parents of 199 healthy 1- to 5-year-old children whose mean age was 30 +/- 15 (SD) months were interviewed. Parents were primarily mothers (94%) with a mean age of 28 +/- 7 (SD) years 60% of whom were single. Educational levels of study parents varied: 43% had not graduated from high school, 29% had a high school equivalency, and 28% had at least a year of college or vocational training. This was a multiethnic parent group. Sixty-five percent were bilingual or non-English speaking. Fifty-eight percent were born outside of the continental United States. Parents were primarily of low-income status with 85% receiving Women, Infant, and Children (WIC) food supplements, Aid to Families With Dependent Children, and/or Medicaid. Results. Half of the parents interviewed reported that they rarely read books. Sixty percent of children had fewer than 10 books at home and two-thirds of these households contained fewer than 50 books total. When asked open-ended questions, 28% of parents said that sharing books with their child was one of their three favorite activities together, 14% said that looking at books was one of their child's three favorite things to do, and 19% reported sharing books at bedtime at least six times each week. Thirty-nine percent of families had at least one of these three literacy-related responses present and so were said to have a CCLO. A backwards stepwise multiple logistic regression on CCLO was performed with family financial, human, and social capital variables. Parents married or living together (odds ratio [OR] 2.56, 95% confidence interval [CI] = 1.21-5.42), higher adult-to-child ratios in the home (OR 1.92, 95% CI = 1.20-3.05), households speaking only English (OR 2.67, 95% CI = 1.24-5.76), parents reading books themselves at least a few times a week (OR 2.86, 95% CI = 1.38-5.91), and homes with more than 10 children's books (OR 3.3, 95% CI = 1.6-6.83), were all independently and significantly associated with the presence of CCLO. Older child age and higher parent education remain in the model but were not significant at the P < .05 level. Ethnicity and income status were dropped for lack of additional significance from this model, which described 24% of the variance in CCLO. Conclusion. Although two-parent families and higher adult-to-child ratios in the home appear to be social capital variables with protective effects, low-income, single-parent, and minority or immigrant families are at significant risk for lacking both children's books and a CCLO. We suggest that CCLO may itself be another form of social capital reflecting parental goals and expectations for their children. We speculate that interventions which provide children's books and information about reading with children to impoverished families with young children may facilitate more parent-child book sharing. Pediatricians and other primary care providers serving underserved populations may have a unique opportunity to encourage activities focusing on young children and promoting literacy.",
  "year": 1999,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "970f924f282627fe26a2e1872d01e307",
  "timestamp": "2025-05-15T03:27:25.025576"
}