{
  "id": 508,
  "title": "Digitalization Canvas - Towards Identifying Digitalization Use Cases and Projects",
  "abstract": "Nowadays, many companies are running digitalization initiatives or are planning to do so. There exist various models to evaluate the digitalization potential of a company and to define the maturity level of a company in exploiting digitalization technologies summarized under buzzwords such as Big Data, Artificial Intelligence (AI), Deep Learning, and the Industrial Internet of Things (IIoT). While platforms, protocols, patterns, technical implementations, and standards are in place to adopt these technologies, small-to mediumsized enterprises (SME) still struggle with digitalization. This is because it is hard to identify the most beneficial projects with manageable cost, limited resources and restricted know-how. In the present paper, we describe a real-life project where digitalization use cases have been identified, evaluated, and prioritized with respect to benefits and costs. This effort led to a portfolio of projects, some with quick and easy wins and some others with mid-to long-term benefits. From our experiences, we extracted a general approach that could be useful for other SMEs to identify concrete digitalization activities and to define projects implementing their digital transformation. The results are summarized in a Digitalization Canvas.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "970f08ef7f9b65e3331e352cea976a95",
  "timestamp": "2025-05-15T00:37:01.682164"
}