{
  "id": 344,
  "title": "Integrating AI and OR for investment decision-making in emerging digital lending businesses: a risk-return multi-objective optimization approach",
  "abstract": "This study investigates the application of operational research techniques to optimize investment decisions in peer-to-peer (P2P) lending platforms, focusing on balancing risk and return for investors. The study proposes a multi-objective decision-making model that leverages data from the Lending Club, the largest P2P marketplace in the United States, to minimize risk and maximize returns. To address the data imbalance, the model uses classification techniques including logistic regression, decision trees, random forests, and light gradient boosting machines (LGBM), which are supported by the synthetic minority oversampling technique (SMOTE). While a convolutional neural network (CNN) predicts net present value (NPV), logistic regression is used to assess risk. The nondominated sorting genetic algorithm II (NSGA-II) is then used for portfolio optimization, producing returns of over 7% with risk levels that are comparable with conventional methods. Sensitivity analysis highlights the importance of investment allocation strategies by emphasizing that portfolio returns are more sensitive to changes in investments than risk. This study contributes to the operational research literature on risk management, investment modeling, and practical decision support systems in financial services by integrating advanced AI-based computational methods and optimization tools. HIGHLIGHTSThe multi-objective model seeks to balance risk reduction with return maximization.The LGBM, logistic regression, random forest, and decision tree models are assessed.The NSGA-II algorithm is used to optimize the portfolio model.A sensitivity analysis is used to evaluate the investment amounts.The results provide wisdom on return optimization and risk reduction in P2P lending.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9712fd15e7b10cb945d6395ccd1914b8",
  "timestamp": "2025-05-15T01:49:41.061955"
}