{
  "id": 5352,
  "title": "Analyzing Insolvency Drivers and Developing Credit Rating System for Small and Medium-sized Enterprises in Russia",
  "abstract": "Small and medium-sized enterprises (SMEs) play a key role in the Russian economy. However, banks and investors are reluctant to provide debt financing to these firms. This is underpinned by SMEs' speculative credit quality and information asymmetry between borrowers and lenders. In this study, we aim to identify the insolvency drivers of Russian SMEs and compare them with those in other markets. The relevance of the study is underpinned by the scarcity of research in this field and the high demand for an accurate rating system for domestic SMEs. Logistic regression was selected as the modeling method. The sample contained 177 non-financial domestic SMEs over the period 2015-2019. The set of explanatory variables consisted of firm-specific financial, categorical, and macroeconomic factors. An accuracy ratio of >80% was achieved. We found that, unlike those in Asian emerging markets, financial factors explained around 70% of domestic SMEs' credit health. Significant financial factors included profitability, debt leverage, and coverage ratios and the term structure of debt. Non-financial drivers included ownership of the firm by large businesses (or group of companies), firm size, and territory of operation within Russia. Among macroeconomic drivers, the unemployment level was the most significant driver of SMEs' credit quality. In addition, we developed a rating system for domestic SMEs and determined the relative benchmarks from Expert RA and Moody's agencies. We found that the existing scales of rating agencies did not provide the granular assessment of SMEs' creditworthiness. This confirmed our hypothesis that distinct rating frameworks and methodologies for domestic SMEs in the Russian market are imperative. As shown in the literature, the greater the rating granularity and transparency, the more enhanced the debt market's appropriate risk-return tradeoff analysis.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "971401ee53709bd831739ea0773560fa",
  "timestamp": "2025-05-15T02:46:44.974542"
}