{
  "id": 7972,
  "title": "IMPACT OF ARTIFICIAL INTELLIGENCE USING THE ROBOTIC PROCESS AUTOMATION SYSTEM ON THE EFFICIENCY OF INTERNAL AUDIT OPERATIONS AT JORDANIAN COMMERCIAL BANKS",
  "abstract": "This study aims to examine the impact of artificial intelligence through robotic process automation systems on internal audit operation efficiency in Jordanian commercial banks. The study uses a descriptive methodology to evaluate how robotic process automation systems enhance the different dimensions of internal audit efficiency: planning, management, execution, and communication. The study designed a structured questionnaire for data collection. The sample consisted of 12 commercial bank employees whose working processes are directly affected by robotic process automation system procedures which puts them in a unique position to comment on the practical applicability of this technology and its implications for internal audit. In this study, 480 electronic questionnaires were distributed via Google Forms, and 390 completed forms were collected for further analysis. The study employs descriptive statistics and advanced statistical techniques, such as linear regression analysis, for data analysis. The findings indicate that robotic process automation systems enhance the internal audit process by reducing the cost of operations, eliminating human errors, and smoothing work processes. The robotic process automation system will allow continuous auditing, real-time risk management, and proper reporting; hence, it will change the role of internal auditors and, in the end, improve organizational compliance and performance. This study asserts that the banking industry must integrate AI-driven automation to maintain its competitiveness in the constantly changing financial landscape.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9719b77ece63516a71d01e7c0b80cb2f",
  "timestamp": "2025-05-15T03:14:07.168394"
}