{
  "id": 5683,
  "title": "A risk identification model for ICT supply chain based on network embedding and text encoding",
  "abstract": "Public bidding for the information and communication technology (ICT) products offers an external regulatory perspective to identify endogenous risks of ICT supply chain. Owing to the multi-level outsourcing, the modeling methods of the first-order topological similarity are prone to misjudgment. Moreover, only using basic structural attributes (such as enterprise type, registered capital, etc.) is difficult to accurately quantify the enterprise' supply capacity, resulting in the models cannot identify the risky nodes with insufficient supply capacity. In this work, a risk identification Model for ICT supply chain based on Network Embedding and Text Encoding (NETEM) is proposed. In addition to the basic business features of enterprises, the DeepWalk is utilized to obtain the high-order topological representation of the ICT supply chain. Meanwhile, the TextCNN combined with keyword sequence extraction is utilized to supplement text semantic information, and excavate the association between business scope and supply capacity of enterprises. Finally, the basic business features, high-level topological features and text semantic features are spliced to obtain the final enterprise node representation vector, then the node risk classification model is trained. In addition, an ontology is developed for ICT supply chain integration and risk knowledge reuse. The experimental results show that NETEM improves the F1 value of the optimal baseline algorithm by 7.3% on the ICT risk identification data set, and the case study in financial industry demonstrates that the model can be practically applied to identify the risk of supply interruption.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "972af57eb176bfc0241c2aeb2a2c3c05",
  "timestamp": "2025-05-15T02:50:21.222435"
}