{
  "id": 8527,
  "title": "Health-related quality of life and psychological distress among cancer survivors in Southeast Asia: results from a longitudinal study in eight low- and middle-income countries",
  "abstract": "Background: A better understanding of health-related quality of life (HRQoL) and psychological distress in cancer survivors can raise awareness, promote the development of policies in cancer survivorship care, and facilitate better targeted use of limited resources in low-and middle-income countries (LMICs). The main objectives of this paper were therefore to assess HRQoL and the prevalence of psychological distress amongst cancer survivors in Southeast Asia and identify risk factors of these outcomes. Methods: The ACTION study was a longitudinal study in eight LMICs in Southeast Asia with 5249 first time cancer survivors followed up at 1 year after diagnosis. HRQoL was assessed using the EORTC QLQ-C30 and EQ-5D. Psychological distress (anxiety and depression) was assessed using the Hospital Anxiety and Depression Scale. General linear models and multiple logistic regression were used to identify independent predictors of HRQoL and psychological distress. Results: One year after diagnosis, the mean EORTC QLQ-C30 global health score for survivors was 66.2 out of 100 (SD 22.0), the mean index score on the EQ-5D was 0.74 (SD 0.23), 37% of survivors had at least mild levels of anxiety, and 46% showed at least mild levels of depression. Poorest HRQoL and highest prevalence of anxiety and depression were seen in patients with lung cancer and lymphomas, while highest scores and least psychological distress were seen in female patients with breast and cervical cancer. The most significant predictor of poor HRQoL and psychological distress outcomes was cancer stage at diagnosis. Age, co-morbidities, treatment, and several socioeconomic factors were associated with HRQoL and psychological distress. Conclusions: Cancer survivors in LMICs in Southeast Asia have impaired HRQoL and substantial proportions have psychological distress. Patients with advanced cancer stages at diagnosis and those in a poor socioeconomic position were most at risk of such poor outcomes. Supportive interventions for cancer patients that address wider aspects of patient wellbeing are needed, as well as policies that address financial and other barriers to timely treatment.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9736d2230e2624875b97ebb49315a24a",
  "timestamp": "2025-05-15T03:19:52.048741"
}