{
  "id": 3397,
  "title": "Changes in sustainable growth dynamics: The case of China and Russia gas industries",
  "abstract": "In this research, the authors try to find solutions for Russian and Chinese gas companies' sustainable growth. With the help of Lasso regression, linear regression and forecasting model, the authors define financial and nonfinancial indicators influence the Chinese and Russian gas companies' sustainable growth rate. Results indicate that the most influential nonfinancial factors for the Russian gas companies' sustainable growth rate are Energy Return on Investment and Return on Labor indicators while financial factors are the cost of the company, net working capital return on fixed assets, and debt-equity ratio. The situation is not the same for Chinese gas companies where the most significant non-financial factors are energy savings, return on ecological protection expenses and financial are a cost of the company, net profit growth, current ratio and earnings before interests and taxis. All three suggested scenarios for the Russian gas industry are quite positive with the most probable scenario having a 5-10% sustainable growth rate growth until 2030. There is a risk of descent in the level of the Chinese gas companies' sustainable rate if they would concern only financial questions. In another case, if China's gas companies choose the way to focus on energy efficiency, energy savings and environmental protection, the high level of the sustainable growth rate growth until 2030 would be observed as predicted by research calculations.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97362aad0fc52bfcc50f8840c1f62738",
  "timestamp": "2025-05-15T02:25:40.219506"
}