{
  "id": 6134,
  "title": "Hierarchizing caries risk factors among first-year university students in Nice (France): a cross-sectional study",
  "abstract": "Background: The purpose of this study was to rank the risk factors for dental caries among first-year university students in Nice (France). Methods: All first-year students are required to undergo a compulsory preventive medical examination. Among these students, volunteers were offered a dental visit. Information was collected through an interview followed by an oral examination. We assessed the volunteers' oral hygiene habits (daily toothbrushing frequency, type of toothbrush used, frequency of toothbrush replacement, place of toothpaste purchase, and flossing), daily health-related behaviors (number of main daily meals, daily sugary intakes, smoking, alcohol consumption, consumption of cannabis or other drugs), oral-health-related behaviors (self-reported oral health, dental visits during the past year, reason for the last dental consultation, and failure to seek dental care due to financial reasons), and oral health issues (dental crowding, oral hygiene, presence of caries, presence of pit and fissure sealant remnants). The dependent variable was the presence of at least one untreated carious lesion. The data were subjected to univariate analyses to select explanatory variables, and subsequently, a logistic regression was performed. Results: Six hundred twenty-nine students aged 18.8 +/- 1.6 years were enrolled in this study. The sex ratio was 0.72, with a strong predominance of the female gender. Only 59.3% of the students had never experienced dental caries, while 22.4% had already undergone restorative procedures and did not have any carious lesion at the time of the examination, and 11.6% presented with carious lesions and had never been treated by a dentist. Lastly, 6.7% had carious lesions despite evidence of prior restorative procedures. The multivariate analysis revealed the following pejorative risk factors: failure to seek dental care due to financial reasons (OR: 3.06, 95% CI: 1.40-6.70), poor oral hygiene revealed during the oral examination (OR: 2.59, 95% CI: 1.60-4.20), and poor self-reported oral health (OR: 2.43, 95% CI: 1.24-4.77). Conversely, the analysis revealed the following protective factors: preventive visits to the dentist (OR: 0.63, 95% CI: 0.41-0.99), the use of an electric toothbrush (OR: 0.36, 95% CI: 0.17-0.77), and sealant remnants (OR: 0.22, 95% CI: 0.05-0.97). Conclusions: The highest-ranking caries risk factor for the study population was the financial barrier.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "974917911709b2e75401de84418d7951",
  "timestamp": "2025-05-15T02:55:12.887140"
}