{
  "id": 7823,
  "title": "Long-term effects of housing damage on survivors' health in rural China: Evidence from a survey 10 Years after the 2008 Wenchuan earthquake",
  "abstract": "Background: Disaster experiences have long-term health effects. However, less is known about the pathways of the association between disaster experiences and people's long-term health. We aimed to examine the long-term (10-year) effect of housing damage in the 2008 Wenchuan earthquake on survivors' health and to explore the pathways of the long-term effect. Methods: We used data from a survey conducted in 2018 in rural areas affected by the 2008 Wenchuan earth-quake. The survey collected information on housing damage caused by the earthquake from survivors aged 18 years old or above. Our primary outcome was dichotomous self-rated health in 2018. We considered decreased living standards and debt burden as mediators. To examine the long-term effect of housing damage on health, we performed multivariable binary logistic regression models. We also performed mediation analyses using the KHB-method. Results: Compared with no/slight damage, serious damage (odds ratio (OR): 1.50, 95% confidence interval (CI): 1.11,2.04) and collapse (OR: 1.57, 95% CI: 1.13,2.18) were associated with a higher risk of poor health. Decreased living standards and debt burden mediated 8.49% and 4.79%, respectively, of the association between serious damage and poor health and 10.64% and 6.10%, respectively, of the association between collapse and poor health. Conclusion: Housing damage in a natural disaster is a long-term risk for survivors' health. Long-term policies and interventions are necessary to protect and promote the health of survivors who experience housing damage. In addition to house reconstruction assistance, policies and interventions can be designed to promote living standards and financial situations to protect survivors' health.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "974facd692d6a687b058ccab17247004",
  "timestamp": "2025-05-15T03:12:36.410258"
}