{
  "id": 7938,
  "title": "Association of Catastrophic Health Expenditure With the Risk of Depression in Chinese Adults: Population-Based Cohort Study",
  "abstract": "Background:Depression is one of the most common mental illnesses, and it may have a lasting effect on one's whole life. As a form of financial hardship, catastrophic health expenditure (CHE) may be associated with depression. However, current evidence about the relationship between CHE and the risk of depression is insufficient. Objective:This study aimed to explore the relationship between CHE and the risk of depression among Chinese adults. Methods:In this study, we used 3 waves of the China Family Panel Studies (CFPS) from 2012, 2016, and 2018. The CFPS are a nationally representative study covering 25 of 31 provinces in Chinese mainland and representing nearly 94.5% of the total population. We selected eligible household heads as participants, divided them into 2 groups by CHE events at baseline (exposed group: with CHE; unexposed group: without CHE), and followed them up. Households with CHE were defined as having out-of-pocket medical expenditures exceeding 40% of the total household nonfood expenditure, and people with depression were identified by the 8-item Centre for Epidemiological Studies Depression Scale (CES-D). We first described the baseline characteristics and used logistical regression to estimate their effects on CHE events. Then, we used Cox proportional hazard models to estimate adjusted hazard ratios and 95% CIs of depression among participants with CHE compared with those without CHE. Finally, we analyzed the subgroup difference in the association between CHE and depression. Results:Of a total of 13,315 households, 9629 were eligible for analysis. Among them, 6824 (70.9%) were men. The mean age was 50.15 (SD 12.84) years. Only 987 (10.3%) participants had no medical insurance. The prevalence of CHE at baseline was 12.9% (1393/9629). Participants with a higher family economic level (adjusted odds ratio [aOR] 1.15, 95% CI 1.02-1.31) and with the highest socioeconomic development level (aOR 1.18, 95% CI 1.04-1.34) had a higher prevalence of CHE than reference groups. During a median of 71 (IQR 69-72) person-months of follow-up, the depression incidence of participants with CHE (1.41 per 1000 person-months) was higher than those without CHE (0.73 per 1000 person-months). Multivariable models revealed that the adjusted hazard ratio for the incidence of depression in participants with CHE was 1.33 (95% CI 1.08-1.64), and this association appeared to be greater in participants without outpatient services (for interaction, P=.048). Conclusions:CHE was significantly associated with increased risk of depression among Chinese adults. Concentrated work should be done to monitor CHE, and more efforts to ensure financial protection need to be made to prevent depression, especially for people with high health care needs.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "974f77a6b4ebffe8e183cb1e2a5ed9de",
  "timestamp": "2025-05-15T03:13:30.683688"
}