{
  "id": 4617,
  "title": "Firm-level political risk and corporate innovation: evidence from US listed firms",
  "abstract": "Purpose The study examines the association between firm-level political risk and corporate innovation and also this study explores how financial constraint and growth level of a firm influence this association. Design/methodology/approach A sample of 14,140 firm-year observations of the US firms from 2003 to 2020 is used. Unlike prior studies, this study uses a firm-level measure of political risk recently developed by Hassan et al. (2019) and measure innovation by patent and patent citation data and a text-based measure. A regression technique is used for empirical testing. Findings This study finds that firm-level political risk is negatively associated with innovation and also document that firm-level political risk has a negative impact on innovation for financially constrained and high growth firms. The overall results are robust after addressing the issue of potential endogeneity using entropy balancing and two-stage least squares regression techniques. This study also documents qualitatively consistent results after using alternative measures of innovation as well as firm-level political uncertainty. Research limitations/implications The findings of this study could help the managers to make better investment decision and improve economic efficiency through understanding the effect of firm-level political risk on innovation activities. Originality/value The study concentrates on firm-level political risk and innovation and presents new insights that political risk at the microlevel is an important determinant for investment in innovative activities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "975ef1ea323ab91754539db30beb4fd0",
  "timestamp": "2025-05-15T02:39:26.919528"
}