{
  "id": 3455,
  "title": "Taming global flood disasters. Lessons learned from Dutch experience",
  "abstract": "There is a growing international recognition that flood risk management in optima forma should be a programmed and flexible process of continuously improving management practices by active learning about the outcome of earlier and ongoing interventions and drivers of change. In the Netherlands, such a long-term, adaptive flood risk management strategy is now being implemented. This so-called second Delta Programme aims to identify and exploit opportunities and capitalize on short-term benefits and opportunistic synergies that arise from change and will require adaptive policymaking. It also requires the financial and institutional means to operate in a long-lasting way, which at the very least, means engaging stakeholders, gathering and disseminating results and adaptation of future plans. Transferring the Dutch approach to other countries is a major challenge that calls for fundamental changes in institutional arrangements at various levels and thus requires customized programmes for strategic institutional change. Recent examples of transfer will provide important lessons of how institutional change can successfully occur and will contribute insights for other countries that attempting to reform their flood risk management strategies. Continuous monitoring and evaluation and sharing international experiences will become crucial for the effective delivery and wider uptake of these new strategies around the globe.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9762963d90563e5f5c1e7688de1ff5d9",
  "timestamp": "2025-05-15T02:26:09.244188"
}