{
  "id": 8597,
  "title": "Influence of Flavors and Nicotine Concentration on Nicotine Dependence in Adolescent and Young Adult E-Cigarette Users",
  "abstract": "Objective: The objective of this study is to examine the relationships between e-cigarette flavors, nicotine concentration, and their interaction on measures of nicotine dependence. Methods: Survey data are drawn from a cross-sectional convenience sample of past 30-day e-cigarette users aged 15 to 24 years (N = 2037) collected between October 2020 and November 2020. Participants were asked to provide information about the e-cigarette products they used most regularly. Only those with available information on flavors (fruit, mint, menthol/ice, and tobacco), nicotine concentration (0-2.9%, 3-4.9%, and 5% or greater), and time to first vape after waking (within 30 minutes, greater than 30 minutes) were included in analyses (N = 1430). Generalized linear regression models were used with log link and binary distribution to assess the relationship between flavors, nicotine concentration, and nicotine dependence. Effect modification by nicotine concentration was assessed using an interaction term for flavors by nicotine concentration. Models were adjusted for age, race/ethnicity, gender, and financial situation. Findings: Fruit, mint, and menthol flavor user groups had a very similar dose-response relationship between nicotine concentration and prevalence of vaping within 30 minutes. These groups showed that the prevalence of vaping within 30 minutes gradually increased as nicotine concentration increased. Meanwhile, tobacco flavor user groups demonstrated a decrease in prevalence of vaping within 30 minutes, as nicotine concentration increased. Conclusion: Results highlight the need for understanding how e-cigarette product characteristics like flavors and nicotine concentration can facilitate nicotine dependence to e-cigarettes. Findings suggest that comprehensive e-cigarette product regulation of all flavors and reducing nicotine concentration will help to reduce the risk for nicotine dependence among young people.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "976fa291fade0bbd73765c660188f9ef",
  "timestamp": "2025-05-15T03:20:22.310277"
}