{
  "id": 3552,
  "title": "Financial Toxicity of Long-Term Survivors Who Underwent Pancreatoduodenectomy for Pancreatic Ductal Adenocarcinoma",
  "abstract": "BackgroundPancreatoduodenectomy (PD) for pancreatic cancer has a profound impact on patients' lives. However, the long-term financial implications are poorly understood.ObjectiveAssess the financial burden of long-term survivors who underwent PD.MethodsPatients who underwent PD between January 2011 and June 2019 were identified. To evaluate the long-term financial burden, patients surviving >= 3 years post-resection were prospectively surveyed using the Comprehensive Score for financial Toxicity (COST-FACIT) and a customized institutionally developed questionnaire. A logistic regression model predicting high financial toxicity was used to identify predictive factors.ResultsAmong 238 eligible patients, 137 (57.6%) responded. Responders had a median age of 66 (59-73) years, with 86.7% identifying as financial prosperous or comfortable. However, 33.3% experienced financial distress due to treatment costs, 27.3% demonstrated high financial toxicity on the COST-FACIT survey, and 37.2% made sacrifices to afford treatment. Only 8.9% stated that the treatment costs influenced their decisions, and the majority (85.9%) did not discuss financial implications with healthcare providers. Multivariable analysis identified younger age as a risk factor for high financial toxicity.ConclusionOne in three long-term survivors experienced high financial toxicity, with younger age being a predictor. This emphasizes the need for efforts to provide comprehensive support and guidance to patients to navigate their oncological journey.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97860108a847acbc33841b15240b1da9",
  "timestamp": "2025-05-15T02:27:19.129540"
}