{
  "id": 3735,
  "title": "Financial toxicity in sarcoma patients and survivors in Germany: results from the multicenter PROSa study",
  "abstract": "Purpose Cancer patients have been shown to frequently suffer from financial burden before, during, and after treatment. However, the financial toxicity of patients with sarcoma has seldom been assessed. Therefore, the aim of this study was to evaluate whether financial toxicity is a problem for sarcoma patients in Germany and identify associated risk factors. Methods Patients for this analysis were obtained from a multicenter prospective cohort study conducted in Germany. Using the financial difficulties scale of the EORTC QLQ-C30, financial toxicity was considered to be present if the score exceeded a pre-defined threshold for clinical importance. Comparisons to an age- and sex-matched norm population were performed. A multivariate logistic regression using stepwise backward selection was used to identify factors associated with financial toxicity. Results We included 1103 sarcoma patients treated in 39 centers and clinics; 498 (44.7%) patients reported financial toxicity. Sarcoma patients had 2.5 times the odds of reporting financial difficulties compared to an age- and sex-matched norm population. Patient age < 40 and > 52.5 years, higher education status, higher income, and disease progression (compared to patients with complete remission) were associated with lower odds of reporting financial toxicity. Receiving a disability pension, being currently on sick leave, and having a disability pass were statistically significantly associated with higher odds of reporting financial toxicity. Conclusion Financial toxicity is present in about half of German sarcoma patients, making it a relevant quality of life topic for patients and decision-makers.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97aeca1189fc9c00ab4d2e8f5e2260c1",
  "timestamp": "2025-05-15T02:29:28.025116"
}