{
  "id": 357,
  "title": "Machine-Learning-Based Rotating Detonation Engine Diagnostics: Evaluation for Application in Experimental Facilities",
  "abstract": "Real-time monitoring of combustion behavior is a crucial step toward actively controlled rotating detonation engine (RDE) operation in laboratory and industrial environments. Various machine learning methods have been developed to advance diagnostic efficiencies from conventional postprocessing efforts to real-time methods. This work evaluates and compares conventional techniques alongside convolutional neural network (CNN) architectures trained in previous studies, including image classification, object detection, and time series classification, according to metrics affecting diagnostic feasibility, external applicability, and performance. Real-time, capable diagnostics are deployed and evaluated using an altered experimental setup. Image-based CNNs are applied to externally provided images to approximate dataset restrictions. Image classification using high-speed chemiluminescence images and time series classification using high-speed flame ionization and pressure measurements achieve classification speeds enabling real-time diagnostic capabilities, averaging laboratory-deployed diagnostic feedback rates of 4-5 Hz. Object detection achieves the most refined resolution of 20 mu s in postprocessing. Image and time series classification require the additional correlation of sensor data, extending their time-step resolutions to 80 ms. Comparisons show that no single diagnostic approach outperforms its competitors across all metrics. This finding justifies the need for a machine learning portfolio containing a host of networks to address specific needs throughout the RDE research community.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97b1a50740fa3350b81182c191241334",
  "timestamp": "2025-05-15T00:42:32.486592"
}