{
  "id": 3700,
  "title": "Comparing the Impacts of Past Major Events on the Network Topology Structure of the Malaysian Consumer Products and Services Sector",
  "abstract": "Financial networks can be built to observe complex stock market dynamics through the analysis of stock closing price data. In this study, networks of three major events are constructed to compare their impacts on the Consumer Products and Services sector of Bursa Malaysia. Using the threshold method, the 2008 global financial crisis, 2015 stock market crash in China and COVID-19 pandemic networks are built upon 134, 156 and 162 stocks respectively. To comprehend embedded network structures during volatile periods of time, topological properties of the networks are examined. Consequently, this study reveals that stock market networks tend to have high global clustering coefficient values as they herd together during major events. The networks also have small average path lengths, leading to the revelation that this sector of the market possesses small-world properties. Furthermore, fluctuations in the magnitude of negative correlation coefficients are found as a good indicator of triggering events taking place. Networks in the Malaysian stock market tend to have heavy-tailed degree distributions that signify the presence of hubs. While the Travel, Leisure and Hospitality subsector emerges as the epicenter of the sector during normal and calm periods, the hubs identified via centrality measures have a tendency to shift over time, reflecting an evolving market structure. Overall, the impacts brought forth by COVID-19 are more drastic than that of the other two major events. In exploring the intrinsic properties of the Malaysian stock market, the right measures in administering market policies and making data-driven portfolio decisions can be made.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97bbe5753a087bdabf0d651a6f3fa8d4",
  "timestamp": "2025-05-15T01:20:03.385703"
}