{
  "id": 6733,
  "title": "The executive pay gap and stock price crash risk: Promotion or suppression?",
  "abstract": "BackgroundIn recent years, cases of stock price crash have continued to emerge. However, yet little research to date has investigated the compensation incentives of top management team (TMT) affect the risk of stock price crash. Nor has research considered the impact of the executive pay gap on the stock price crash risk. Especially, as the egalitarianism was broken in the compensation system, and the increase of the degree of marketization of salaries, the executive pay gap has shown an expanding trend. Under this circumstance, we would systematically examine the association between the extent of executive pay gap and its future stock price crash risk. Design, methodology, and approachBased on the sample of A-Share non-financial listed companies in Shanghai and Shenzhen Stock Exchange, we used firm FE regression method to empirically examine the relationship of the internal and external compensation gaps of executives and crash risk, as well as its contigency variables and inner mechanism. FindingsThe empirical results show that there is a U-shaped relationship between the internal and external pay gap of executives and future crash risk. After passing the endogenous test and the robustness test, the conclusion still holds. Further research shows that the U-shaped relationship between the pay gap and crash risk is more pronounced, when firms are affiliated with the non-state-owned enterprise or its compensation fairness is lower. Finally, the quality of information disclosure plays a mediation effect when executive pay gap affects stock price crash risk. Originality and valueAccording to the economic and behavior perspectives, we explored the impact of compensation structure on stock price crash risk from the pay gap of executives for the first time, and extended the emerging literature of forecasting future stock price crash risk and executive pay gap. In addition, a key implication of our findings is that more guidance for firms is provided to design the compensation structures and to reduce stock price crash risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97ccc81fe787d5e5a346739092db2a48",
  "timestamp": "2025-05-15T03:01:03.582697"
}