{
  "id": 2880,
  "title": "Forecasting SMEs' credit risk in supply chain finance with an enhanced hybrid ensemble machine learning approach",
  "abstract": "In recent years, financial institutions (FIs) have tentatively utilized supply chain finance (SCF) as a means of solving the financing issues of small and medium-sized enterprises (SMEs). Thus, forecasting SMEs' credit risk in SCF has become one of the most critical issues in financing decision-making. Nevertheless, traditional credit risk forecasting models cannot meet the needs of such forecasting. Many researchers argue that machine learning (ML) approaches are good tools. Here we propose an enhanced hybrid ensemble ML approach called RS-MultiBoosting by incorporating two classic ensemble ML approaches, random subspace (RS) and MultiBoosting, to improve the accuracy of forecasting SMEs' credit risk. The experimental samples, originating from data on forty-six quoted SMEs and seven quoted core enterprises (CEs) in the Chinese securities market between 31 March 2014 and 31 December 2015, are collected to test the feasibility and effectiveness of the RS-MultiBoosting approach. The forecasting result shows that RS-MultiBoosting has good performance in dealing with a small sample size. From the SCF perspective, the results suggest that to enhance SMEs' financing ability, 'traditional' factors, such as the current and quick ratio of SMEs, remain critical. Other SCF-specific factors, for instance, the features of trade goods and the CE's profit margin, play a significant role.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97d1e02499cfe0f12dbf153deb75ab81",
  "timestamp": "2025-05-15T02:20:16.863764"
}