{
  "id": 8912,
  "title": "The health status of postpartum immigrant women in Taiwan",
  "abstract": "Aims. This study aims to contribute to the current body of literature by examining immigrant womens postpartum health in the context of Taiwan, in particular, their experience with postpartum stress and depression as well as the levels of social support available to them. This study also aims to identify predictors of their postpartum health status. Background. While there has been considerable research on the risk factors for poor postpartum health in the general population, research on the factors influencing immigrant womens postpartum health has been limited. Design. A non-experimental research design. Methods. We collected data from a sample of 340 immigrant postpartum women who could speak Mandarin Chinese, recruited from 10 general hospitals and one obstetric clinic in Taiwan from March 2005 September 2006. The Hung Postpartum Stress Scale, Beck Depression Inventory-II, Social Support Scale and Chinese Health Questionnaire were used in this study. Results. We found that immigrant womens postpartum health status differed significantly in relation to their key helpers, depression status, levels of postpartum stress and social support. The logistic regression analysis showed that a one-point increase in immigrant womens postpartum stress increased the probability of suffering from minor psychiatric morbidity by 1.04 times. Conclusions. These findings suggest that health care professionals should pay attention not only to immigrant postpartum womens basic financial and support needs but also to their postpartum stress and stressors. Relevance to clinical practice. The use of trained community health advocates in partnership with registered nurses can help meet the needs of postpartum women and improve maternal and infant health through their home visits. These nursing interventions should be tailored specifically to decrease immigrant Asian womens postpartum stress and improve their overall health status and well-being.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97db768364f78e5fc71cc2f519b6094f",
  "timestamp": "2025-05-15T03:23:27.898373"
}