{
  "id": 3430,
  "title": "The effect of shariah board characteristics, risk-taking, and maqasid shariah on an Islamic bank's performance",
  "abstract": "Shariah supervisory boards are a key feature of shariah governance (SG), providing additional monitoring and oversight. A suitable SG mechanism enhances risk mitigation and improves Islamic bank (IB) performance without violating shariah principles. This study examines the impact of the shariah supervisory board (SSB), maqasid shariah, and risk-taking on Islamic bank performance globally. Quantitative research design with a Dynamic panel regression approach is used with a two-step generalized method of moments (GMM) with data from the Bankscope database for 2014-2018. The findings of this study show that characteristics of SSB and risk-taking have a significant impact on IB performance. This study proves that higher SSB characteristics in terms of size, expertise, level of education, cross-membership and reputation encourage the better performance of Islamic banks. Higher risk-taking illustrates that Islamic banks are more efficient, resulting in better financial performance. Compliance with maqasid sharia indicates that sharia banks comply with Islamic laws so that the resulting performance meets financial aspects and sharia principles. SSB functions as a monitor for Islamic banks so that they operate according to sharia principles, which are reflected in the maqasid sharia elements. Therefore, a higher quality SSB and a higher maqasid shariah index score positively affect the financial performance of IBs.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97f06db77c0765860818847596647201",
  "timestamp": "2025-05-15T02:26:09.150182"
}