{
  "id": 3943,
  "title": "Climate change financial disclosure and firm performance: empirical evidence from Indian energy sector based on TCFD recommendations",
  "abstract": "Purpose The paper aims to examine the climate change-related disclosure patterns of listed Indian firms and its impact on firm performance. Specifically, it strives to analyse the conformance of the selected firms with the recommendations of the Task Force on Climate-related Financial Disclosures (TCFD) established by the Financial Stability Board of G20 nations. Design/methodology/approach The study conducts content analysis of the annual reports and/or sustainability reports of 22 selected firms from the energy sector for the period spanning 2018-2019 and 2019-2020 based on the four-fold recommendations of TCFD, namely, governance, strategy, risk management and target and metrics, to compute the overall and respective climate-change disclosure scores. Further, a panel data regression model is used to appraise the impact of such disclosure on the performance of the firms. Findings The findings of the study indicate that the disclosure level of Indian firms in the energy sector is moderate. The regression results establish a positive relation between climate change-related financial disclosure and firm performance indicating that firms can witness improved financial performance by disclosing more information on climate change. Originality/value This is the first study in the Indian context to evaluate the climate change-related disclosure practices of the selected firms based on the TCFD's recommendations and to trace its association with the performance of the firms. The results of the study shall hence be of relevance for the policymakers and diverse stakeholders.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97f3df5079532807154a374a8d2ed82c",
  "timestamp": "2025-05-15T02:31:28.444919"
}