{
  "id": 222,
  "title": "Artificial neural network for option pricing with and without asymptotic correction",
  "abstract": "This paper proposes a mixed approach of asymptotic expansion (AE) and artificial neural network (ANN) methods for option pricing in order to improve computational speed, stability, and approximation accuracy. In practice, there is wide use of complex stochastic volatility models (SVMs) which can allow for skew and smile shapes. However, under these models, it is usually hard to obtain analytical solutions for options written on the asset price. AE can compute option prices and their sensitivities effectively, but it can usually only compute a finite sum of terms of the complete solution because, as the expansion order increases, both analytical and numerical calculations become tedious and messy and the computational cost grows exponentially. On the other hand, using ANN one can separate the pricing procedure into two steps: (1) approximating ANN that can be trained offline and (2) using the ANN predicted option price obtained online. The offline procedure has an extremely high-computational cost because it requires tens to hundreds of thousands of Monte Carlo (MC) or PDE numerical simulations in order to train several hidden layers and several dozens of nodes. Moreover, deep learning (DL) for option pricing shows unstable behaviour and poor quality because the sensitivity of the derivatives price with respect to the input often takes a bell-shape, which induces rapid changes in value. By combining the strong points and making up for the weak points of the two methods, our new approach offers the following improvements: (1) much less training data, layers, and nodes are required: (2) the offline training becomes more robust and the online predictions produce more stable and accurate results: and (3) it significantly speeds up the offline calculations.",
  "year": 2021,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "97f96ac9cde55bfcd85ca8b7e898cd2c",
  "timestamp": "2025-05-15T01:29:44.184643"
}