{
  "id": 6697,
  "title": "Predicting individual risk for medial tibial stress syndrome in navy recruits",
  "abstract": "Objectives: Quantifying individual risk for medial tibial stress syndrome (MTSS) is valuable due to the high prevalence, substantial financial and service costs, and lengthy recovery time of the condition. Identification of those at risk is a key first step in prevention of the condition. This study aimed to test a suite of best evidence risk factors in a cohort of Navy recruits and to develop a predictive model for individuals at risk of MTSS. Design: Prospective cohort study of Navy recruits undergoing initial training Methods: A prospective cohort design, this study screened recruits by assessing gender, MTSS history, years of running experience, orthotic use, BMI, navicular drop, ankle plantarflexion and hip external rotation at the beginning of basic training. Follow-up was conducted at completion of training (11 weeks). Results: Volunteers included 123 recruits (28 females and 95 males). Thirty developed MTSS (19 males and 11 females). Stepwise logistic regression of one half of the data produced a significant model (p < 0.001), comprising female gender (OR 4.4, 95% CI 1.0, 18.9, p = 0.05), MTSS history (OR 18.3, 95% CI 3.6, 91.5, p < 0.01) and increased hip ER (OR 1.1 per degree, 95% CI 1.0, 1.202, p = 0.05). Findings validated with the other half of the cohort and receiver operating characteristic curve analysis showed the model had 82% sensitivity and 84% specificity. Conclusions: This predictive model provides military institutions, clinicians and instructors with a strong and accurate calculator for predicting an individual recruit's risk of MTSS. (C) 2017 Sports Medicine Australia. Published by Elsevier Ltd. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9806cf91ff9e9b0925bc1fc89e98989a",
  "timestamp": "2025-05-15T03:00:35.487845"
}