{
  "id": 50,
  "title": "A Fuzzy Neural Network-Based Intelligent Warning Method for Financial Risk of Enterprises",
  "abstract": "The fast warning for financial risk of enterprises has always been a realistic demand for their managers. Currently, this mainly relies on expert experience to make comprehensive analysis from massive business data. Benefitting from the strong computational performance of deep learning, this paper proposes a fuzzy neural network (FNN)-based intelligent warning method for financial risk of enterprises. An improved FNN structure with time-varying coefficients and time-varying time lags is established to extract features of enterprises from complex financial context. The algorithm of fuzzy C-means and fuzzy clustering based on sample data are studied. In this paper, the fuzzy C-means algorithm is used to cluster the samples, the input sample set is preprocessed, a new set of learning samples is formed, and then the neural network is trained. The enterprise financial risk sample and its modular FNN model are established, and the evaluation of the enterprise financial risk sample is simulated. Then, a decision part is added following the FNN part to output the warning results. After that, we have also conducted a case study as simulation experiments to evaluate the proposed technical framework. The obtained results show that it can perform well in the fast warning of financial risk for enterprises.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "980ff2ae080ecd6859ad1f5d6bc1ba35",
  "timestamp": "2025-05-15T01:46:03.897848"
}