{
  "id": 4183,
  "title": "The impact of perceived risk on the capital market's reaction to outsourcing announcements",
  "abstract": "Outsourcing is a widely accepted option in strategic management, which, like every business venture, bears opportunities and risks. Supplementing the popular area of research on the merits of outsourcing, this paper examines how stockholders rate corporate sourcing decisions with regard to the risk they associate with this transaction. Using event study methodology and multivariate cross-sectional OLS-regression, we analyze a sample of 182 outsourcing transactions in the global financial services industry between 1998 and 2004 in order to investigate the risk-specific drivers of excess returns to shareholders. The analysis studies the impact of risk-specific independent variables, including transaction size, length, outsourced business functionality, and experience with outsourcing. Our findings indicate that risk-mitigating strategies have significant explanatory power, indicating that the capital market's reaction to an outsourcing announcement might at least partly be forecast. Results show a positive correlation between market reaction and business process outsourcing by financial services companies. We also find strong evidence indicating that capital markets react positively to relatively large transactions compared to the market capitalization of the outsourcing firm. For service providers our results show that traditional IT-related sourcing projects or the insourcing of administrative processes have a significant positive correlation with market reaction.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9816cb4dec4c919eb278f25dd3f46f27",
  "timestamp": "2025-05-15T02:34:13.412187"
}