{
  "id": 9321,
  "title": "Interest rate regulation, earnings transparency and capital structure: evidence from China",
  "abstract": "Purpose The purpose of this paper is to use samples from Chinese-listed companies to investigate the effects of interest rate deregulation and earnings transparency on company's capital structure in China over the period of 2003-2015. In particular, the authors study the link between state-owned enterprises (SOEs), economic growth targets and marketization in China's unique institutional context. Design/methodology/approach Based on the methodology of quantitative analysis, the authors use baseline and cluster analysis for all samples with full set of controls, for robustness tests of alternative proxy of interest rate control by using a cluster analysis at the firm level, regarding endogeneity tests conducted fixed effect model with adding instrument variables (IV), two-period factors regression method via IV and system generalized method of moments for dynamic analysis. Findings The results show that earnings transparency increases firm leverage and the additional tests suggest that such an effect takes place via a mechanism by reducing the cost of debt finance. However, information transparency could moderate the effects of interest rate deregulation on corporate capital structure. In addition, it finds that SOEs are less sensitive toward the changes of interest rates in China because lending to SOEs is policy-oriented and lacks of market evaluation of business risk. Government control is conducive to enhancing the transparency of the whole industry; however, market-oriented reform is conducive to enhancing the transparency of the company's own information. Social implications The social implication of this paper lies in the fact that first, it provides additional evidence on the effect of market-oriented reforms through how the information transparency interacts with the financial decisions making of corporations. Second, it offers policy implication to banking market deregulation in China. Originality/value The paper makes contribution to the relationship between earnings disclosure quality and capital structure in the Chinese unique institutional context. This research tests the existing literature, such as Francis et al. (2004) and Zhang and Lu (2007), and suggests that informationally transparent firms have a higher debt ratio and lower effective interest costs on bank loans. In addition, this paper further explores the role played by interest rate deregulation in corporate finance, and in turn market fund allocation. This paper sheds new light on information transparency and explores the relationship between earnings disclosure quality and debt financing behaviors of Chinese publicly listed companies over the period of 2003-2015.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "981b0635e7791e1fbd2cfe2f40c243c8",
  "timestamp": "2025-05-15T03:27:53.313681"
}