{
  "id": 1104,
  "title": "Supervised and Unsupervised Learning for Fraud and Money Laundering Detection using Behavior Measuring Distance",
  "abstract": "Money laundering is the process of making large amounts of fund obtained from criminal activities appear to originate from a legitimate source. Fraud occurs when a person or business intentionally deceives another with promises of services or financial benefits that do not exist or were misrepresented. Fraud and Money laundering detections require to analyze abnormal behavioral patterns. To develop a detection model, we present a machine learning-based model which incorporates risk scoring and statistical clustering approaches. Given a customer represented by its values in a set of attributes, we define its Customer Behavior Score based on its percentile rank in each attribute, which measures the behavior of the customer against the median or normal customers in the group. The Customer Behavior Score induces a distance, called Behavior Measuring Distance, between any two customers. The k-medoids clustering technique based on the Behavior Measuring Distance is then applied iteratively to classify customers. The key features of the model are that the abnormality of customers' behaviors are measured based on their percentile ranks in their respective classes and that such measurement is dynamically updated based on the reclassification after each iteration during the training. Finally, the model is tested using the country risk data collected from public and internal sources, and the model outcomes are compared against a benchmark model. The experimental results show convergence and effectiveness of the model.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98282a346234966e2e32db4f7febfb1f",
  "timestamp": "2025-05-15T01:58:43.518574"
}