{
  "id": 1601,
  "title": "A decision analysis study of the value of a liver biopsy in nonalcoholic steatohepatitis",
  "abstract": "Objectives: Nonalcoholic fatty liver disease (NAFLD) is an increasingly prevalent clinical syndrome reflecting a mixture of pathological liver histology with the potential to progress to cryptogenic cirrhosis. Liver biopsy (LB) is the only way to determine the severity of disease. However, LB is invasive, has complications and financial costs. The aim of this study is to determine the benefits of early LB for diagnosis and early treatment. Methods: A decision tree model tracked the potential outcomes of NAFLD between an LB-directed approach vs. no initial LB. Each specific biopsy category determined subsequent care actions. The baseline probabilities were determined by literature review and expert opinion. Results: An initial LB strategy was projected to have a lower mortality compared with the no initial LB group and fewer transplant eligible patients after 5 years. If the prevalence of NAFLD is increased, the mortality increases in both the study groups. With improved efficacy of medical and/or surgical intervention, the mortality rate was decreased. Conclusion: This decision tree model provides a context for balancing the risk and benefit of LB in NAFLD. With early biopsy, and early intervention, the relative return of preventing advanced liver disease per LB was high.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "982cf6f53f4bfe5b7b678a796952faae",
  "timestamp": "2025-05-15T02:05:08.246452"
}