{
  "id": 1584,
  "title": "Credit Evaluation of Technology-Based Small and Micro Enterprises: An Innovative Weighting Method Based on Machine Learning and AHP",
  "abstract": "Technology-based small and micro enterprises play a crucial role in national economic and social development. Managing their credit risk effectively is key to ensuring their healthy growth. This study is based on corporate credit management theory and Wu's three-dimensional credit theory. It clarifies the credit concept and measurement logic of these enterprises, considering their unique development characteristics in China. A credit evaluation system is constructed, and an innovative method combining machine learning with comprehensive evaluation is proposed. This approach aims to assess the credit status of technology-based small and micro enterprises in a thorough and objective manner. The study finds that, first, the credit level of these enterprises is currently moderate, with little variation. Second, financial information remains a key factor in credit evaluation. Third, the ML-AHP (Machine Learning-Analytic Hierarchy Process) combined weighting method effectively integrates subjective experience with objective data, providing a more rational assessment. The findings provide theoretical references and practical guidance for the healthy development of technology-based small and micro enterprises, early credit risk warning, and improved financing efficiency.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9852a87564cbae6aef0b7151ab553c2b",
  "timestamp": "2025-05-15T02:05:08.156289"
}