{
  "id": 9379,
  "title": "Menstruation and social inequities in Spain: a cross-sectional online survey-based study",
  "abstract": "BackgroundAvailable research suggests that menstrual inequity has an impact on (menstrual) health outcomes and emotional wellbeing. It is also a significant barrier to achieve social and gender equity and compromises human rights and social justice. The aim of this study was to describe menstrual inequities and their associations with sociodemographic factors, among women and people who menstruate (PWM) aged 18-55 in Spain.MethodsA cross-sectional survey-based study was conducted in Spain between March and July 2021. Descriptive statistical analyses and multivariate logistic regression models were performed.ResultsA total of 22,823 women and PWM were included in the analyses (Mean age = 33.2, SD = 8.7). Over half of the participants had accessed healthcare services for menstruation (61.9%). The odds for accessing menstrual-related services were significantly higher among participants with university education (aOR: 1.48, 95% CI, 1.13-1.95). Also, 57.8% reported having had partial or no menstrual education pre-menarche, with odds being higher among participants born in non-European or Latin American countries (aOR: 0.58, 95% CI, 0.36-0.93). Lifetime self-reported menstrual poverty was between 22.2-39.9%. Main risk factors for menstrual poverty were identifying as non-binary (aOR: 1.67, 95% CI, 1.32-2.11), being born in non-European or Latin American countries (aOR: 2.74, 95% CI, 1.77-4.24), and not having a permit to reside in Spain (aOR: 4.27, 95% CI, 1.94-9.38). Completed university education (aOR: 0.61, 95% CI, 0.44-0.84) and no financial hardship < 12 months (aOR: 0.06, 95% CI, 0.06-0.07) were protective factors for menstrual poverty. Besides, 75.2% reported having overused menstrual products due to lack of access to adequate menstrual management facilities. Menstrual-related discrimination was reported by 44.5% of the participants. Non-binary participants (aOR: 1.88, 95% CI, 1.52-2.33) and those who did not have a permit to reside in Spain (aOR: 2.11, 95% CI, 1.10-4.03) had higher odds of reporting menstrual-related discrimination. Work and education absenteeism were reported by 20.3% and 62.7% of the participants, respectively.ConclusionsOur study suggests that menstrual inequities affect a high number of women and PWM in Spain, especially those more socioeconomically deprived, vulnerabilised migrant populations and non-binary and trans menstruators. Findings from this study can be valuable to inform future research and menstrual inequity policies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "985a424a7b0d162469175f154583cbec",
  "timestamp": "2025-05-15T03:28:17.568997"
}