{
  "id": 9325,
  "title": "Adjuvant Interferon Therapy for Patients with Uveal Melanoma at High Risk of Metastasis",
  "abstract": "Purpose: To examine whether interferon (IFN)-alfa-2a treatment after radiation or enucleation reduces death rates in patients with uveal melanoma. Design: Interventional, comparative case series. Participants: Subjects were identified through the ocular oncology clinic of the Massachusetts Eye and Ear Infirmary. Patients eligible for the study were at increased risk of metastasis because of the presence of at least one of the following characteristics: age >= 65 years, largest tumor diameter (LTD) >= 15 mm, ciliary body involvement of the tumor, or extrascleral tumor extension. Methods: Between May 1995 and June 1999, 121 patients with choroidal or ciliary body melanoma began a 2-year course of therapy (3 MIU IFN-alfa-2a subcutaneously 3 times per week), initiated within 3 years of primary therapy. All patients underwent regular monitoring for drug toxicity. To evaluate IFN-alfa-2a efficacy, we selected a series of historical controls frequency-matched (2:1) to IFN-alfa-2a-treated patients on age (+/-5 years), LTD (+/-3 mm), gender, and survival time between primary therapy and initiation of IFN therapy. Survival status was ascertained for all patients through December 2006. Main Outcome Measures: Melanoma-related mortality, metastasis, IFN-related toxicities. Results: Fifty-five patients (45%) completed therapy; the median dose for IFN-alfa-2a-treated patients was 792 MIU (85% of the theoretic dose). The median follow-up time in the IFN-alfa-2a-treated group was approximately 9 years. Treatment and control groups were similar with respect to age (P = 0.78), LTD (P = 0.38), and gender (P = 1.0). Of 363 patients, 108 developed metastasis under observation; 42 of these were IFN-alfa-2a-treated patients. Cumulative 5-year melanoma-related death rates were 17% in the radiation or enucleation-only group, 15% in those who completed the entire IFN-alfa-2a course, and 35% in those who discontinued IFN-alfa-2a therapy. In multivariate Cox regression, IFN-alfa-2a had no significant influence on melanoma-related mortality (rate ratio = 1.02, 95% confidence interval, 0.68-1.5, P = 0.91) or all-cause mortality (rate ratio = 0.84, 95% confidence interval, 0.58-1.2, P = 0.34). Conclusions: Interferon-alfa-2a has no material influence on survival in patients with choroidal melanoma. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2009; 116:2206-2212 (C) 2009 by the American Academy of Ophthalmology.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "985a0610311b9c86dfe1096f4f5b00c4",
  "timestamp": "2025-05-15T03:27:53.321671"
}