{
  "id": 4131,
  "title": "SOME APPROACHES TO THE LANGUAGE COMPETENCES ASSESSMENT SYSTEM IN THE RUSSIAN FEDERATION",
  "abstract": "The article considers modern criteria for evaluation and monitoring the quality of knowledge in language competencies while mastering a foreign language. The European language standard is being promoted in the Russian educational system. The possibility of using the European language portfolio as a tool for improving the quality of education and a means of developing autonomy and self-assessment of knowledge by the learner is also under consideration in Russia. Scholars suggest the use of training platforms and learning portals as a series of effective tools for assessing and monitoring knowledge. Today many practicing authorities discuss the advantages and disadvantages of various forms of assessment and monitoring of knowledge. The basic set of competences, the possession of which is an indicator of the comprehensive knowledge of a foreign language has now been determined: linguistic, professional and extra-linguistic competencies, as well as the classification of the main stages of knowledge monitoring have been determined. The issue of possibility for constructing an objective system of assessing language knowledge, the questions of unification of evaluation criteria is a vital problem of modern Russian pedagogy. The implementation of the main directions of modernization of Russian higher and secondary education and the requirements for the training of a modern specialist involves improving the quality of language education at all levels of the educational process. Teaching foreign languages is an indispensable element of the educational model and one of the most important elements of training a specialist of any profile. The model of quality system for multilevel language training of students has been developed taking into account the assimilation of the experience of the European language standard and the competence and personality-oriented approach, traditional for Russian pedagogy.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9866d67be350a8afa246a8939d541667",
  "timestamp": "2025-05-15T01:23:58.170680"
}