{
  "id": 5749,
  "title": "How national culture affects IPO decisions? Evidence from Europe and Asia",
  "abstract": "Purpose The purpose of this paper is to investigate which cross-country characteristics influence the going-public decisions and how the cultural values of the countries affect initial public offering (IPO) firms' profitability and risk of financial distress. Design/methodology/approach Using a sample of privately held and firms that went public on the European and Asian Stock Exchanges between 2007 and 2011, this paper applies probit model and ordinary least squares regression to examine which cross-country characteristics could affect the decision to go public and how cultural values affect the profitability and risk of IPO firms.[AQ1] In addition, to overcome multicollinearity concerns caused by the use of Global Leadership and Organizational Behavioural Effectiveness culture dimensions, this paper factor analyses the dimensions using principal component analysis. Findings The results are as follows. First, this paper finds that firms in tradition-oriented countries are less likely to go public, while firms in result-oriented countries are more likely to hold an IPO. Second, this paper finds that country characteristics (i.e. financial deepening and taxation) affect the going-public decision. Third, this paper documents that IPO firms in traditionally and result-oriented countries have positive profitability and less risk of financial distress. Practical implications This study is intended for all those European and Asian policymakers and managers who want to improve their knowledge about what different indicators can establish the decision of firms that going-public facing different stages of their lifecycle. Specifically, policymakers wishing to promote IPO-activity in their countries may find it useful to strengthen the set of formal-institutions both to reduce corporate-taxation and to reduce the uncertainty associated with first-time share issuance and investment in such initiatives. This study is also intended for managers of companies that are not yet publicly-traded on their national stock-markets to be helpful to their decision-making processes. Originality/value This paper aims to extend the growing literature on the effects of cross-country factors on economic decision-making in finance and particularly adds to research that investigates the influence of these factors on the IPO decision of European and Asian firms.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98847b713a3e8e530f9bef23888d788d",
  "timestamp": "2025-05-15T02:50:53.980934"
}