{
  "id": 9338,
  "title": "The Research of the Investment-type Insurance Products Impact on Insurance Companies' Solvency-Taking Ampang Insurance as an Example",
  "abstract": "On February 23, 2018, Ampang Insurance Group was taken over by CIRC (China Insurance Regulatory Commission) due to the insufficient solvency problems and so on. In order to promote the safety of Ampang Insurance Group risk management, to ensure its solvency sufficient and maintain its smooth operation, the CIRC agreed to use the insurance guaranty fund to add 60.804 billion yuan to Ampang Insurance Group which sparked heated debates on March 28, 2018. And the investment-oriented insurance products, such as universal coverage, have played a huge role in the incident. In the past two years, in order to standardize the development of universal insurance business and implement the insurance policy concept, the CIRC has introduced a number of related provisions. And on the scale of the universal insurance, account management, the level of protection and so on have been perfected and standardized. Based on the above background, this paper takes the Ampang Insurance Group as an example, to explore the inherent relationship between the investment insurance products and the solvency of insurance companies. First, this paper makes a brief introduction about the solvency and the universal insurance and other investment-type products. And then, this paper theoretically analyzes the relationship between the investment-type insurance products and the insurer's solvency. Following the 2013-2017 financial data of the Ampang Insurance Group and the sales data of investment insurance products as a sample, the solvency status of the Ampang Insurance Group in 2013-2017 is calculated. And the regression analysis of the universal insurance premium income ratio, the traditional insurance premium income ratio and the solvency status of the Ampang Insurance Group is respectively performed for the Ampang Insurance Group in this decade. For the Ampang Insurance Group, the study concludes: the universal insurance and the share of unit-linked insurance products has a negative correlation with its solvency, and expanding its size is not good for solvency; the effect of ordinary insurance products on the solvency of insurance companies is not significant. Finally, on the basis of the above research results, this paper puts forward some substantive suggestions from the two aspects of investment insurance products and insurance companies ' solvency optimization, hoping to enhance the insurance level of investment-type insurance products, prevent related risks, protect the interests of policy holders, and promote the orderly and healthy development of the insurance industry.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9887b5ad4018a23c9fd70af23c57e491",
  "timestamp": "2025-05-15T03:27:53.364959"
}