{
  "id": 4650,
  "title": "A rational expectations test of the size anomaly",
  "abstract": "A large body of empirical evidence has documented the existence of excess risk-adjusted returns to small firms. This study presents an alternative method of resting for the small firm effect by examining the relationship between the actual price of a stock and the theoretical price computed using a perfect foresight: discounted cash flow model. The specific research question is whether firm size is significant in explaining cross-sectional pricing errors. In addition, this study jointly tests for the influence of several other variables linked to the size effect by previous studies. A multiple regression model is developed including variables measuring the neglected firm effect, agency costs, the degree of financial and operating leverage, market value to book; value ratios, the price earnings ratio, and three different measures of risk. A size variable is also included in the cross-sectional regression to measure the residual impact of firm size on the magnitude of common stock pricing errors for individual firms. The regression model is tested empirically on a sample of approximately 1300 firms over the period beginning September 1986 and ending December 1990. The results show that the size variable is insignificant for quarters not including the month of January, and significant for quarters including the month of January. This confirms earlier studies indicating that the size effect occurs primarily in January. The significance of the size effect is sensitive to the specification of the regression equation. The market value to book value and risk coefficients are also significant for the period tested and have the predicted signs.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98999eed90bdb574356230fe1d86d2c2",
  "timestamp": "2025-05-15T02:39:27.011305"
}