{
  "id": 6077,
  "title": "Does COVID-19 influence the maturity management of industrial sectors? Evidence from global data",
  "abstract": "Purpose This study aims to understand how the COVID-19 pandemic dramatically impacts the maturity of all industrial sectors globally. This paper analyses the general patterns of managing maturity in terms of performance and risk-taking of S&P 500 industrial sectors while determining their association with COVID-19. Design/methodology/approach To analyse the immediate response of COVID-19 on maturity management, the authors gather time-series daily index data of S&P sectors from October 2019 until June 2020 from Bloomberg. The authors select this study period to show the immediate effect of COVID-19 on industrial sector maturity management. The performance and volatility of stock are proxies for managing the maturity of each sector. The authors use vector auto-regression (VAR) methodology to determine the impact of global coronavirus. Findings This study's findings suggest that the information technology sectors outperform the other sectors; in contrast, the utility sector exhibits the worst performance during a pandemic. Furthermore, the real estate sector depicts a higher level of systematic risk pattern than other sectors. Interestingly, the empirical result of VAR shows that almost every sector is significantly negatively affected by this pandemic; however, the consumer discretionary sector is immune to it. Research limitations/implications Overall, this study's findings for individual economic sectors demonstrate that the managing maturity of each sector acts differently to the coronavirus outbreak. This study offers insights to researchers, policymakers, regulators, financial report users, investors, employees, clients and society. Originality/value This paper contributes to the existing literature on managing the maturity of industry sectors in terms of observing their trends during the financial crisis.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98a0acf5751a43a3fd169712bd8625a8",
  "timestamp": "2025-05-15T02:54:38.763411"
}