{
  "id": 3697,
  "title": "The WERA cancer center matrix: Strategic management of patient access to precision oncology in a large and mostly rural area of Germany",
  "abstract": "Purpose: Providing patient access to precision oncology (PO) is a major challenge of clinical oncologists. Here, we provide an easily transferable model from strategic management science to assess the outreach of a cancer center. Methods: As members of the German WERA alliance, the cancer centers in W & uuml;rzburg, Erlangen, Regensburg and Augsburg merged care data regarding their geographical impact. Specifically, we examined the provenance of patients from WERAs molecular tumor boards (MTBs) between 2020 and 2022 (n = 2243). As second dimension, we added the provenance of patients receiving general cancer care by WERA. Clustering our catchment area along these two dimensions set up a four-quadrant matrix consisting of postal code areas with referrals towards WERA. These areas were re-identified on a map of the Federal State of Bavaria. Results: The WERA matrix overlooked an active screening area of 821 postal code areas - representing about 50 % of Bavarias spatial expansion and more than six million inhabitants. The WERA matrix identified regions successfully connected to our outreach structures in terms of subsidiarity - with general cancer care mainly performed locally but PO performed in collaboration with WERA. We also detected postal code areas with a potential PO backlog - characterized by high levels of cancer care performed by WERA , low levels or no MTB representation. Conclusions: The WERA matrix provided a transparent portfolio of postal code areas, which helped assessing the geographical impact of our PO program. We believe that its intuitive principle can easily be transferred to other cancer centers.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98ad5fc04fde6ce171a150275928bd78",
  "timestamp": "2025-05-15T01:20:03.374645"
}