{
  "id": 837,
  "title": "Use of portfolios in teaching communication skills and professionalism for Portuguese-speaking medical students",
  "abstract": "Objectives: This study aimed to analyse the effect of a portfolio with three activities fostering students' reflection, self-efficacy and teaching of communication skills and professionalism. Methods: A cross-sectional study was applied with a sample of third- and fourth-year medical students in one Portuguese and three Brazilian universities. A three-activity portfolio (course evaluation and learning, self-efficacy activity and free reflective writing) was used during a two-month course on communication skills and professionalism. The 69 students enrolled in the course were invited to complete the three-activity portfolio via Likert-type questionnaires, open-ended questions and narrative. Content and lexical analysis and the Reflection Evaluation for Learners' Enhanced Competencies Tool (REFLECT) were used for assessing the qualitative data. The questionnaires were evaluated using principal components analysis and Cronbach's alpha. Pearson's correlation was applied to portfolio activities. Results: Of the 69 participants, 85.5% completed at least one activity. Reflecting on what they learned in the communication module, the students did not mention professionalism themes. In the self-efficacy activity on communication, 25% of the fragments were related to professionalism themes. There was a negative correlation between students' self-efficacy and the REFLECT rubric score (r((19))=-0.744; p<0.0001). Conclusions: Teachers must consider the activity's influence on the reflections when assessing the portfolio. This model of a three-activity portfolio provided diverse ways of encouraging and assessing reflections, supporting teaching improvement and adaptation, evaluating students' self-efficacy and showing that students' higher reflective capacity may promote feelings of low effectiveness.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98bdc2785eb2ee0fc3d396958f90f201",
  "timestamp": "2025-05-15T00:48:22.529009"
}