{
  "id": 7456,
  "title": "Factors associated with underutilization of antenatal care services in Indonesia: results of Indonesia Demographic and Health Survey 2002/2003 and 2007",
  "abstract": "Background: Antenatal care aims to prevent maternal and perinatal mortality and morbidity. In Indonesia, at least four antenatal visits are recommended during pregnancy. However, this service has been underutilized. This study aimed to examine factors associated with underutilization of antenatal care services in Indonesia. Methods: We used data from Indonesia Demographic and Health Survey (IDHS) 2002/2003 and 2007. Information of 26,591 singleton live-born infants of the mothers' most recent birth within five years preceding each survey was examined. Twenty-three potential risk factors were identified and categorized into four main groups, external environment, predisposing, enabling, and need factors. Logistic regression models were used to examine the association between all potential risk factors and underutilization of antenatal services. The Population Attributable Risk (PAR) was calculated for selected significant factors associated with the outcome. Results: Factors strongly associated with underutilization of antenatal care services were infants from rural areas and from outer Java-Bali region, infants from low household wealth index and with low maternal education level, and high birth rank infants with short birth interval of less than two years. Other associated factors identified included mothers reporting distance to health facilities as a major problem, mothers less exposed to mass media, and mothers reporting no obstetric complications during pregnancy. The PAR showed that 55% of the total risks for underutilization of antenatal care services were attributable to the combined low household wealth index and low maternal education level. Conclusions: Strategies to increase the accessibility and availability of health care services are important particularly for communities in rural areas. Financial support that enables mothers from poor households to use health services will be beneficial. Health promotion programs targeting mothers with low education are vital to increase their awareness about the importance of antenatal services.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98c427faaef6e7f29c3eb0f996c11885",
  "timestamp": "2025-05-15T03:08:37.979509"
}