{
  "id": 4947,
  "title": "The Relationship Between Psychological Distress and Perception of Emotional Support in Medical Students and Residents and Implications for Educational Institutions",
  "abstract": "Objective Psychological distress is pervasive among medical students and residents (MSR) and is associated with academic under-performance, decreased empathy, burnout, and suicidal ideation. To date, there has been little examination of how demographic and socioeconomic factors influence trainee's psychological distress levels, despite suggestion that financial concerns are a common source of stress. Recent Canadian studies examining the prevalence of distress, burnout, and resilience in MSR are limited. Methods Undergraduate and postgraduate medical trainees attending a Canadian university were surveyed. The questionnaire included standardized instruments to evaluate psychological distress, burnout, and resilience. Additional items explored MSR living and domestic circumstances, and anticipated debt upon training completion. Ordinary least squares regression models determined predictors of psychological distress, risk for burnout, and resiliency. Logistic regression of psychological distress predicted risk of MSR contemplating dropping out of their training program. Results Feeling emotionally/psychologically unsupported while attending university was a key predictor of psychological distress and burnout, while feeling supported reduces this risk. Risk for burnout increased with each year of medical training. Psychologically distressed MSR were at significantly greater odds of contemplating dropping out of their medical training program. Conclusions Our results point to the important opportunity universities and medical schools have promoting MSR well-being by reducing institutional stressors, as well as teaching and promoting self-care and burnout avoidance techniques, instituting wellness interventions, and developing programs to identify and support at risk and distressed students.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98c95d99e689310b0f8f295a305f9d0e",
  "timestamp": "2025-05-15T02:42:36.207710"
}