{
  "id": 7576,
  "title": "A Comprehensive Efficiency Assessment of Vietnamese Banks: Based on the Two-stage SBM-DEA Model with Undesirable Outputs",
  "abstract": "This study investigates the efficiency of Vietnamese commercial banks amid rapid economic reforms and digital transformation. Utilizing a novel two-stage slacks-based measure (SBM) data envelopment analysis (DEA) model that incorporates undesirable outputs-specifically non-performing loans (NPLs)-the research evaluates the operational and profitability-risk management efficiency of 29 banks over the period 2018-2023. In the first stage, banks' operational performance is measured by examining the effectiveness of inputs such as the number of employees, total fixed assets, and operating expenses in generating deposits and loans. The second stage assesses how these intermediate outputs are transformed into financial returns while mitigating risks. Additionally, a Tobit regression analysis identifies key determinants affecting efficiency scores, including bank-specific characteristics (e.g., bank size, listing status, state ownership, cost-to-income ratio, and capital adequacy ratio) as well as macroeconomic and regulatory factors. The findings indicate that operational inefficiencies are the primary source of overall performance gaps, with high operating costs and scale-related challenges reducing efficiency, while strong state backing and robust capital positions contribute to improved outcomes. This study contributes to the literature by refining DEA applications in emerging markets and offers practical insights for policymakers and bank managers aiming to enhance banking performance through targeted operational improvements and strategic regulatory interventions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98ce67a3e393bbb52de2eabc2f9054a6",
  "timestamp": "2025-05-15T03:10:05.531117"
}