{
  "id": 8882,
  "title": "Effects of individual and neighborhood social risks on diabetes pay-for-performance program under a single-payer health system",
  "abstract": "Background: Enrollment in and adherence to a diabetes pay-for-performance (P4P) program can lead to desirable processes and outcomes of diabetes care. However, knowledge is limited on the potential exclusion of patients with individual or neighborhood social risks or interruption of services in the disease-specific P4P program without mandatory participation under a single-payer health system.Objective: To investigate the impact of individual and neighborhood social risks on exclusion from and adherence to the diabetes P4P program of patients with type 2 diabetes (T2D) in Taiwan.Methods: This study used data from Taiwan's 2009-2017 population-based National Health Insurance Research Database, 2010 Population and Housing Census, and 2010 Income Tax Statistics. A retrospective cohort study was conducted, and study populations were identified from 2012 to 2014. The first cohort comprised 183,806 patients with newly diagnosed T2D, who had undergone follow up for 1 year; the second cohort consisted of 78,602 P4P patients who had undergone follow up for 2 years after P4P enrollment. Binary logistic regression models were used to examine the associations of social risks with exclusion from and adherence to the diabetes P4P program.Results: T2D patients with higher individual social risks were more likely to be excluded from the P4P program, but those with higher neighborhood-level social risks were slightly less likely to be excluded. T2D patients with the higher individual-or neighborhood-level social risks showed less likelihood of adhering to the program, and the person-level coefficient was stronger in magnitude than the neighborhood-level one. Conclusions: Our results indicate the importance of individual social risk adjustment and special financial in-centives in disease-specific P4P programs. Strategies for improving program adherence should consider indi-vidual and neighborhood social risks.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98d60e936dd01810949c4e40190d410f",
  "timestamp": "2025-05-15T03:23:27.801739"
}