{
  "id": 4199,
  "title": "Catastrophic health care expenditure and impoverishment in Bhutan",
  "abstract": "Monitoring financial hardship due to out-of-pocket spending on health care is a critical determinant of progress towards universal health coverage. This study investigates the occurrence, intensity and determinants of catastrophic health expenditure and impoverishment in Bhutan using three rounds of the cross-sectional Bhutan Living Standard Surveys carried out in 2007, 2012 and 2017. We use a composite financial hardship measure defined as households experiencing either catastrophic health expenditure or impoverished/further impoverished due to health spending or both. We calculated concentration indices to examine socio-economic inequalities. We used logistic regression to examine the factors associated with financial hardship. We find that, in the context of a significant increase in living standards, there is a sharp increase in the incidence of catastrophic health expenditure (using 40% of capacity to pay) and impoverishment (based on equivalized average food-share-based poverty line) between 2007 and 2017. In 2017, catastrophic health expenditure was estimated at 0.51%, impoverishment at 0.32% and further impoverishment at 1.93% of the population, cumulating to financial hardship affecting 2.55% of the population. Financial hardship particularly burdened rural dwellers and poorer households. Transportation costs almost doubled the risk of facing financial hardship. Households that were poor, had an unemployed head, were larger and had more elderly members had higher odds of financial hardship. This evidence should prompt policy and programmatic interventions to support Bhutan's progress towards universal health coverage.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98e2d40bcdf7f6ffbf92aab835ad906d",
  "timestamp": "2025-05-15T02:34:13.460685"
}