{
  "id": 1073,
  "title": "Integrating Local Learning to Improve Deep-Reinforcement-Learning-based Pairs Trading Strategies",
  "abstract": "Instead of trying to predict unpredictable market trends, influenced by various complex factors that are challenged to be fully captured in a machine learning model, financial experts often adopt pairs trading. This strategy involves simultaneously trading two stocks to eliminate market trends. The portfolio value of a carefully selected stock pair oscillates around a mean level, with investors longing the underpriced and shorting the overpriced portfolios to profit or stop loss when the portfolio's value reverts or diverges significantly. The timing of trading actions highly depends on the characteristics of constituent stocks and significantly influences trading performance. Past literature either trains a single machine learning model with all stock pairs' trading data or multiple models, each for a specific stock pair. While the former approach avoids overfitting due to sufficient data, it struggles to capture the unique characteristics of different stock pairs. Conversely, the latter approach focuses on specific pairs but faces limited training data. To address this dilemma, our paper leverages local learning to recommend the best trading actions. We group trading data by similarity and train each model with data from a specific group. The trained model then predicts optimal actions for stock pairs in that group. Using Gaussian mixture models for data grouping in local learning outperforms other methods in scenarios with limited data for most stock pairs.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98e495b14a5f64cbdafc74256263ce92",
  "timestamp": "2025-05-15T00:51:25.945956"
}