{
  "id": 2218,
  "title": "Bank financial sustainability evaluation: Data envelopment analysis with random forest and Shapley additive explanations",
  "abstract": "Ensuring financial sustainability is imperative for a financial institution's overall stability. To mitigate the risk of bank failure amid financial crises, effective management of financial sustainability performance becomes paramount. This study introduces a comprehensive framework for the accurate and efficient quantification, indexing, and evaluation of financial sustainability within the American banking industry. Our approach begins by conceptualizing financial sustainability as a multi-stage, multifactor structure. We construct a composite index through a three-stage network data envelopment analysis (DEA) and subsequently develop a random forest classification model to predict financial sustainability outcomes. The classification model attains an average testing recall rate of 84.34 %. Additionally, we employ SHapley Additive exPlanations (SHAP) to scrutinize the impacts of contextual variables on financial sustainability performance across various substages and the overall banking process, as well as to improve the interpretability and transparency of the classification results. SHAP results reveal the significance and effects of contextual variables, and noteworthy differences in contextual impacts emerge among different banking substages. Specifically, loans and leases, interest income, total liabilities, total assets, and market capitalization positively contribute to the deposit stage; revenue to assets positively influences the loan stage; and revenue per share positively affects the profitability stage. This study serves the managerial objective of assisting banks in capturing financial sustainability and identifying potential sources of unsustainability. By unveiling the black box of financial sustainability and deciphering its internal dynamics and interactions, banks can enhance their ability to monitor and control financial sustainability performance more effectively.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98eb52f132978088924eee42bf870886",
  "timestamp": "2025-05-15T02:12:50.951419"
}