{
  "id": 3992,
  "title": "A bird's eye view on the use of whole exome sequencing in rare congenital ophthalmic diseases",
  "abstract": "Phenotypic and genotypic heterogeneity in congenital ocular diseases, especially in anterior segment dysgenesis (ASD), have created challenges for proper diagnosis and classification of diseases. Over the last decade, genomic research has indeed boosted our understanding in the molecular basis of ASD and genes associated with both autosomal dominant and recessive patterns of inheritance have been described with a wide range of expressivity. Here we describe the molecular characterization of a cohort of 162 patients displaying isolated or syndromic congenital ocular dysgenesis. Samples were analyzed with diverse techniques, such as direct sequencing, multiplex ligation-dependent probe amplification, and whole exome sequencing (WES), over 20 years. Our data reiterate the notion that PAX6 alterations are primarily associated with ASD, mostly aniridia, since the majority of the cohort (66.7%) has a pathogenic or likely pathogenic variant in the PAX6 locus. Unexpectedly, a high fraction of positive samples (20.3%) displayed deletions involving the 11p13 locus, either partially/totally involving PAX6 coding region or abolishing its critical regulatory region, underlying its significance. Most importantly, the use of WES has allowed us to both assess variants in known ASD genes (i.e., CYP1B1, ITPR1, MAB21L1, PXDN, and PITX2) and to identify rarer phenotypes (i.e., MIDAS, oculogastrointestinal-neurodevelopmental syndrome and Jacobsen syndrome). Our data clearly suggest that WES allows expanding the analytical portfolio of ocular dysgenesis, both isolated and syndromic, and that is pivotal for the differential diagnosis of those conditions in which there may be phenotypic overlaps and in general in ASD.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "98f817fdd1d8ca6fbd1c975c5da162ff",
  "timestamp": "2025-05-15T01:23:07.230980"
}