{
  "id": 567,
  "title": "A Survey on recent advances in reinforcement learning for intelligent investment decision-making optimization",
  "abstract": "Reinforcement learning (RL) has emerged as a powerful tool for optimizing intelligent investment decision-making. With the rapid evolution of financial markets, traditional approaches often struggle to effectively analyze the vast and complex datasets involved. RL-based methods address these challenges by leveraging neural networks to process large-scale financial data, dynamically interacting with market environments to refine strategies, and designing tailored reward functions to achieve diverse investment objectives. This paper provides a comprehensive review of recent advancements in RL for investment decision-making, with a focus on four key areas, i.e., portfolio selection, trade execution, options hedging, and market making. These four problems represent highly challenging instances of multi-stage , multi-objective decision optimization in investment, highlighting the strengths of RL-based methods in effectively balancing trade-offs among different objectives over time. Detailed comparison work of state-of-the-art RL-based methods is presented, analyzing the action spaces, state representations, reward structures, and neural network architectures. Finally, the paper discusses some new challenges and point out some directions for future research in the field.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "99025aa50f8f5720d6ca49bb36f2b850",
  "timestamp": "2025-05-15T00:45:01.321776"
}