{
  "id": 4914,
  "title": "Stablecoins: Classification, functional features and development prospects",
  "abstract": "The article is devoted to stablecoins and their prospects for use in the financial market. The authors propose the interpretation and classification of stablecoins and analyze their functional features and development prospects. Also impact of the global economic crisis on stablecoins is analyzed. The findings illustrated that stablecoins differ from traditional electronic money, as well as classic cryptocurrencies, and they can be interpreted as hybrid digital financial assets. Currently, the commonest digital coins with a stable rate are local stablecoins with backing. At the same time, both in terms of capitalization and transaction volume, dominated by centralized fiat-backed and gold-backed stablecoins. Decentralized non-backed stablecoins are not widespread, despite a number of technological innovations that may underlie their stabilization mechanism. The authors have identified main scenarios for the use of local and global stablecoins in the near future. It was observed that at a time of decreased volatility stablecoins are currently predominantly used as a tool to minimize the risk of price volatility in the crypto-assets market. In contrast, the growing interest in applying of global stablecoins under the new reduction volatility mechanisms, may encourage the extensive use of stablecoins in both retail and wholesale payments at the international level. In addition, the development of global stablecoins may entail risks to financial stability and the functioning of monetary systems, to minimize which it is necessary to develop a regulatory framework and financial procedures that take into account the possibility of a wide circulation of stablecoins.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "991c00d45f10b430c8f1622065285dec",
  "timestamp": "2025-05-15T02:42:36.108205"
}