{
  "id": 8838,
  "title": "Rates and correlates of health maintenance behaviors after living kidney donation",
  "abstract": "Context and Objective-Donating a kidney may provide an opportunity for donors to reevaluate their health maintenance behaviors (eg, regular exercise, smoking cessation, medical checkups). Although the effect of donation on donors' health, quality of life, and financial outcomes has received growing attention, no studies have examined whether donation is related to changes in health maintenance behaviors. The study aims were to (I) describe and compare kidney donors' health maintenance behaviors before and after donation, and (2) determine the correlates of health maintenance behaviors after donation. Design, Setting, Participants and Measures-We conducted a telephone-interview study with 85 randomly selected laparoscopic kidney donors in a major US transplant center to assess health behaviors before and after donation, postdonation characteristics (eg, quality of life, postsurgical pain), and demographics. Results-Sample demographics included a median age of 48 years; 55% were female, 82% were white, 71% were married, and 52% were college graduates. Few health behaviors changed significantly from before to after donation. Only the rate of medical checkups increased after donation (P<.001). Logistic regression was used to examine the association of demographics and postdonation characteristics with postdonation health maintenance behaviors, after adjusting for predonation behavior. Older age, higher income, less postsurgical pain, and better physical functioning were associated with more exercise after donation. Longer time since donation was associated with a higher prevalence of obesity. Conclusions-These results may help identify donors who are at greater risk for poor health maintenance behaviors after donation and suggest areas of health behavior that should be the focus of education sessions before donation. (Progress in Transplantation. 2012;22:147-154) (C) 2012 NATCO, The Organization for Transplant Professionals doi: http://dx.doi.org/10.7182/pit2012287",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "99240ccdd6e306082d5b7396f7ed4e53",
  "timestamp": "2025-05-15T03:22:57.910874"
}