{
  "id": 9356,
  "title": "Medical Attrition from Commanders Training in the Israeli Defense Forces (IDF): A Cross-sectional Study on 23,841 Soldiers",
  "abstract": "Introduction: Attrition from training is associated with substantial financial and personnel loss. There is a plethora of medical literature and research of attrition rates related to initial/phase 1 training (basic combat training); however, the analysis of second phase training (commanders training, consisting of schools that qualify junior commanders and officers for infantry and non-infantry combat units) is limited. The purpose of this study is to perform a comprehensive survey regarding to medical attrition from commanders training in the IDF (Israeli Defense Forces) in order to present the commanders of the IDF a detailed situation report that will serve as an evidence-based platform for future policy planning and implementation. Methods: A cross-sectional study including all soldiers (23,841) who participated in commanders training in the IDF in the period of 2012-2015 was performed. Soldiers for whom the attrition reason (medical or not medical) was missing were excluded from this study. Data were collected from the adjutancy-computerized system as well as the IDF's computerized medical consultation records package (CPR). Descriptive statistics were performed using mean, standard deviation, and median in order to express results. For the determination of statistical significance, chi-square test, Student's t-test, and Poisson regression models were used. Results: Out of 23,841 soldiers that participated in this study, 75% (17,802) were males and 25% (6,039) were females. The overall attrition rate was 0.7% (164). The attrition rate for males was 0.86% (148 out of 17,082 males) and 0.26% (16 out of 6,039 females) for females. After adjusting for training unit, age, and BMI, the risk for attrition was 1.6 (160%) times higher for males as compared with females, and this result was statistically significant (IRR = 1.6, p = 0.01, CI 1.1, 2.2). The re-injury rate was 41% (68 out of 164 soldiers). The three most frequent diagnoses for attrition were orthopedics (66%), general surgery diagnoses (12%), and diagnoses related to internal medicine (11%). Out of 107 soldiers that attired due to orthopedic reasons, 36 (34%) suffered from calf and ankle injuries, 22 (21%) attired due to diagnoses related to the lower back, and 22 (21%) attired due to diagnoses related to the knee region. The highest attrition rate was encountered in the school for infantry junior command (2.2%) and the lowest rate was encountered in the officer training school for non-infantry units (0.11%). After adjusting for age and BMI, the risk for ankle injury was 2.55 (255%) times higher for soldiers in the school for infantry junior command as compared with soldiers in the officer school for infantry units (IRR = 2.55 p = 0.017, CI 1.18, 5.47). Conclusion: The attrition rate from commanders training in the IDF is low, and at this point, however, due to lack of uniform criteria for attrition, it cannot serve as an objective measure. We suggest measuring and discussing overuse injury rates (which is the most frequent cause of attrition), instead. Based on our results, we recommend an implementation of a better medical screening policy in order to reduce the re-injury rates during commanders training.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "992fbf2a8f860d12043544fb3b511687",
  "timestamp": "2025-05-15T03:27:53.420993"
}