{
  "id": 7147,
  "title": "Economic insecurity during the Great Recession and metabolic, inflammatory and liver function biomarkers: analysis of the UK Household Longitudinal Study",
  "abstract": "Background Economic insecurity correlates with adverse health outcomes, but the biological pathways involved are not well understood. We examine how changes in economic insecurity relate to metabolic, inflammatory and liver function biomarkers. Methods Blood analyte data were taken from 6520 individuals (aged 25-59 years) participating in Understanding Society. Economic insecurity was measured using an indicator of subjective financial strain and by asking participants whether they had missed any bill, council tax, rent or mortgage payments in the past year. We investigated longitudinal changes in economic insecurity (remained secure, increase in economic insecurity, decrease in economic insecurity, remained insecure) and the accumulation of economic insecurity. Linear regression models were calculated for nine (logged) biomarker outcomes related to metabolic, inflammatory, liver and kidney function (as falsification tests), adjusting for potential confounders. Results Compared with those who remained economically stable, people who experienced consistent economic insecurity (using both measures) had worsened levels of high-density lipoprotein (HDL)-cholesterol, triglycerides, C reactive protein (CRP), fibrinogen and glycated haemoglobin. Increased economic insecurity was associated with adverse levels of HDL-cholesterol (0.955, 95% CI 0.929 to 0.982), triglycerides (1.077, 95% CI 1.018 to 1.139) and CRP (1.114, 95% CI 1.012 to 1.227), using the measure of financial strain. Results for the other measure were generally consistent, apart from the higher levels of gamma-glutamyl transferase observed among those experiencing persistent insecurity (1.200, 95% CI 1.110 to 1.297). Conclusion Economic insecurity is associated with adverse metabolic and inflammatory biomarkers (particularly HDL-cholesterol, triglycerides and CRP), heightening risk for a range of health conditions.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9936ffa316f65534308c80dcbc8c638a",
  "timestamp": "2025-05-15T03:05:32.081267"
}