{
  "id": 8837,
  "title": "An epidemiological study of emotional and behavioral disorders among children in an urban slum",
  "abstract": "Although mental health research in India has gained momentum in recent years and several epidemiological studies have begun to quantify psychiatric morbidities, there are few community-based epidemiological studies focusing specifically on prevalence and associated risk factors of emotional and behavioral disorders among children. A cross-sectional study was conducted in an urban slum of Karimnagar, Andhra Pradesh among 370 children selected by simple random sampling. Strength and difficulty questionnaire (SDQ) was used to estimate the prevalence of emotional and behavioral disorder. A semi-structured questionnaire was used to evaluate the social predictors of the condition, health-seeking behavior, and its impact on educational status of the children. Maternal depression was evaluated using Patient Health Questionnaire (PHQ-9). Eighty-three (22.43%) children had an abnormal score on at least one domain of SDQ. Logistic regression analysis indicated that male gender (odds ration (OR)=5.51), under-nutrition (OR=2.74), low socioeconomic status (OR=3.73), nuclear family (OR=1.89), working status of the mother (OR=2.71), younger age of the mother at the birth of the child (OR=3.09), disciplinary method (OR=2.31), financial problem at home (OR=13.32), alcoholic father (OR=11.65), conflicts in family (OR=7.29), and depression among mother (OR=3.95) were significant predictors. There was a significant impact on educational performance (p=0.008) and parents had little awareness regarding the condition. The high frequency of emotional and behavioral problems, its impact on educational performance of the children, associated adverse social factors, poor knowledge, and treatment-seeking behavior of the parents in an urban slum warrants immediate attention. The interrelation of all these factors can be utilized to plan a continuum of comprehensive services that focus on prevention, early identification, and effective intervention strategies with community involvement.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "994d14a2f8ec2a9595e67e12154649a6",
  "timestamp": "2025-05-15T03:22:57.909371"
}