{
  "id": 3645,
  "title": "An integrated fuzzy credit rating model using fuzzy-BWM and new fuzzy-TOPSIS-Sort-C",
  "abstract": "Financial institutions use credit rating models to make lending, investing, and risk management decisions. Credit rating models have been developed using a variety of statistical and machine learning methods. These methods, however, are data-intensive and dependent on assumptions about data distribution. This research offers an integrated fuzzy credit rating model to address such issues. This study proposes an integrated fuzzy credit rating model to reduce such problems. The study applies the fuzzy best-worst method (fuzzy-BWM) to obtain the weight of criteria that affect creditworthiness and fuzzy technique for order of preference by similarity to ideal solution (fuzzy-TOPSIS)-Sort-C to evaluate the borrowers. The BWM was found consistent amongst existing multi-criteria decision-making (MCDM) methods, and consistency further improves when BWM is extended to a fuzzy version. The study applies TOPSIS-Sorting along with fuzzy theory to overcome human uncertainty while making a decision. TOPSIS-sorting has been found capable of handling rank reversal problems that persist in the TOPSIS method. The fuzzy-TOPSIS-Sort-C method is applied to evaluate borrowers based on the characteristic profile of the identified criteria. The proposed model's efficacy has been illustrated with a case study to rate fifty firms with real-life data. The proposed model results are compared with previous studies and commercially available ratings. The model results show better accuracy in terms of accuracy and true-positive rates to predict default. It can help financial institutions to find potential borrowers for granting credit.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9963ac8e81dd1664ae5cd2a7a80689dc",
  "timestamp": "2025-05-15T02:28:29.380338"
}