{
  "id": 6652,
  "title": "Factors influencing hazard management by municipalities: The case of coastal communities",
  "abstract": "As climate and anthropogenic changes increase the vulnerability of coastal areas around the world, the threat (and reality) of coastal hazards grows. These threats arise particularly at a local level, calling out for more knowledge on how to best support coastal municipalities to deal with natural and human-induced hazards. This study seeks to add to the understanding through an examination of local-level experience with hazard planning and responses carried out by coastal municipalities, producing insights on how to reduce their vulnerability and support their resilience. It explores the factors influencing coastal municipalities' management of relevant hazards to achieve comprehensive multi-hazard risk reduction and adaptation. We do so through a national survey of Canada's coastal municipalities which assessed experience with hazards, risk perception, hazard prioritization, and the extent and specifics of hazard responses. We characterize the determinants of coastal municipalities' behaviour and intervening factors, and conduct regression analyses to explain coastal municipalities' risk perception, hazard prioritization, implementation of management processes for dealing with hazards, and the number of implemented or planned hazard responses. Six key factors were identified that influence hazard responses at the municipal level: experience with hazards; competing priorities; hazard visibility; access to resources (financial and technical capacity) and governance (institutional setting and political capacity). We conclude that municipal hazard responses can be reinforced by increasing the effectiveness of risk communication, promoting participatory processes, providing support for municipalities' identified needs and priorities, ensuring municipalities have access to relevant information and expertise, and implementing integrated coastal governance and management.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "996421de67ebd2c5c3e48ec21f3f08e8",
  "timestamp": "2025-05-15T03:00:05.065685"
}