{
  "id": 579,
  "title": "Financial Management of Listed Companies Based on Convolutional Neural Network Model in the Context of Epidemic",
  "abstract": "The goal of financial management is to manage the purchase and sale of assets, the rational financing of funds, the management of cash flow in operations, and finally, the reasonable distribution of company profits in a certain task situation, which is simply the management of the three statements of the enterprise. The core issue of the financial mechanism is how to choose a centralized or decentralized management model, which requires the company to consider the internal and external environment, and according to the development of the company, the quality of employees and business characteristics of various factors, in order to make the best choice of the company's financial management model. Therefore, in the context of the epidemic, this article conducts research related to the financial management of listed companies based on convolutional neural network models (radial basis neural network, generalized regression neural network, wavelet neural network, and fuzzy neural network). This article, firstly, discusses the basic theories of macro- and micro-financial management of enterprises and financial management of listed enterprises, secondly, examines the overall financial management model of listed enterprises in China through methods such as the convolutional neural network model research method introduced in this article, and then, after an overall examination and analysis of the financial management situation of X-listed enterprises, finds the macro- and micro-status quo of financial management of listed enterprises in China under the epidemic, and in the sub. On the basis of the status quo, suggestions are made to build a financial management model that combines centralization and decentralization and to build a group financial risk management system.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "996cf9375a9d4404b374415241a2ffb8",
  "timestamp": "2025-05-15T01:52:49.417618"
}