{
  "id": 6713,
  "title": "Movie Score Predication Model Based on Multiple Nonlinear Regression",
  "abstract": "In the movie industry, the ability to predict a movie's score before its theatrical release can decrease its financial risk. However, accurate predicctions are not easily obtained. To improve the accuracy and scientificity of movie score prediction, this paper proposes a multiple nonlinear regression movie score prediction model (MSPM) in exponential form. Firstly, the influencing factors of film scoring are analyzed. A single problem is selected for the variables of the existing prediction model. This model combines the metadata variables of the film itself and the characteristic variables of film members to conduct quantitative and qualitative analysis on the factors affecting film scoring. Secondly, MSPM is established and the concept of index is introduced. In order to avoid the redundancy of explanatory variables in the MSPM model, the AIC values of the MSPM model and its five sub-models are also calculated to ensure the necessity of selecting explanatory variables. Douban data set is selected to predict movie scores. Finally, compared with linear regression model (Ys) and equal scale model (YM), the actual movie score and predicted value were compared. The results showed that MSPM had the highest prediction effect. Experiments show that the model is effective and robust, and reveals the relationship between film scores and related variables. Real-world data confirms that the MSPM model is a timely and appropriate framework for measuring movie scores.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9970818e504adaccdf57de49045d2062",
  "timestamp": "2025-05-15T03:01:03.514264"
}