{
  "id": 9369,
  "title": "Prevalence of metabolic syndrome and its association with selected factors among people with psychiatric conditions in Ethiopia: a systematic review and meta-analysis",
  "abstract": "BackgroundMetabolic syndrome is a cluster of metabolic risk factors, including glucose intolerance, dyslipidemia, central obesity, high triglyceride levels, and low levels of high-density lipoprotein. It is the commonest type of co-morbidity among people with psychiatric conditions particularly in low and middle-income countries due to poor health care systems and financial burden. Metabolic syndrome among people with psychiatric conditions may be due to prolonged use of psychiatric medications, diminished quality of life, and personal and behavioral-related factors. Except for single studies with fluctuating reports, there is no nationwide study conducted on the prevalence of metabolic syndrome among people with psychiatric conditions in Ethiopia. Thus, this review aims to estimate the pooled prevalence of metabolic syndrome and its association with selected factors among people with psychiatric conditions in Ethiopia.MethodsWe conducted a thorough search of PubMed, Scopus, Wiley online library, African journals online, and Google Scholar. For analysis, STATA version 14 software was used. A funnel plot and Egger's regression test statistic were used to find the potential reporting bias. A fixed effect model was used to contrast summary effects, odds ratios, and 95% confidence intervals all over research findings. The Newcastle-Ottawa Scale (NOS) was used to evaluate the quality of each included study.ResultsEight articles were included in the final review after retrieving 9,714 articles through electronic database searching. By using the national cholesterol education adult treatment panel criteria, the pooled prevalence of metabolic syndrome among people with psychiatric conditions in Ethiopia was found to be 37.33% (95%CI: 24.52-50.14). Being female AOR = 2.66; 95% CI: 0.89, 7.92), urban residency (AOR = 2.84; 95% CI: 0.56, 14.45), physical inactivity (AOR = 3.80; 95% CI: 1.61, 8.98), alcohol consumption (AOR = 4.53; 95% CI: 1.62, 12.71) and body mass index higher than the normal range (AOR = 4.66; 95% CI: 1.22, 17.85) were the factors significantly associated with metabolic syndrome among people with psychiatric conditions. According to the review, schizophrenic-form disorder, delusional disorder, major depressive disorder, schizophrenia, bipolar disorder, and schizoaffective disorder were the frequently reported psychiatric conditions.ConclusionThis systematic review and meta-analysis revealed that the magnitude of metabolic syndrome among people with psychiatric conditions in Ethiopia was high and female gender, physical inactivity, alcohol consumption, and body mass index higher than the normal range were the factors that determined the occurrence of metabolic syndrome. Thus, policymakers, clinicians, and other concerned stakeholders must reinforce effective strategies in the control, timely screening, prevention, and management of metabolic syndrome among people with psychiatric conditions.Protocol registrationPROSPERO CRD42023405293.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "99746273d3882608d7d805430274dc7a",
  "timestamp": "2025-05-15T03:28:17.525917"
}