{
  "id": 4961,
  "title": "Profitability of Non-Life Insurance and its Driving Dynamics in Ethiopia",
  "abstract": "Recently, profitability is considered as a central issue to the company's overall operational activities and improving the company's financial performance is highly contributing to the development of the country economy. This study intends to investigate the driving factors of profitability in the insurance sector in Ethiopia with special reference to non-life insurance companies, data obtained from audited financial statement of twelve (12) insurers for a period of six years (2011-2016) with total of 72 observations through panel data by using Ordinary -Least-Square (OLS). The results of panel least square regression analysis indicate that industry concentration ratio and leverage have statistically significant and positive impact whereas diversification, underwriting risk and reinsurance dependence has a negative and statistically significant relationship with non-life insurance companies' profitability. However, there were no support of firm liquidity, real GDP growth rate and Inflation impact on profitability of non-life insurance companies in Ethiopia. In this study, the perceived drivers of profitability was estimated as a result of low amount of revenues collected from the general insurance in Ethiopia The management bodies of non-life insurance companies (line) should give high attention on firm and industry related variables, particularly by adopting better risk management strategies as well as better internal control to achieve superior profitability.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9987c43ff3e1aad4a02992ec431a9ca7",
  "timestamp": "2025-05-15T02:42:36.321406"
}