{
  "id": 4969,
  "title": "Effects of Physician-targeted Pay for Performance on Use of Spontaneous Breathing Trials in Mechanically Ventilated Patients",
  "abstract": "Rationale: Pay for performance is an increasingly common quality improvement strategy despite the absence of robust supporting evidence. Objectives: To determine the impact of a financial incentive program rewarding physicians for the completion of daily spontaneous breathing trials (SBTs) in three academic hospitals. Methods: We compared data from mechanically ventilated patients from 6 months before to 2 years after introduction of a financial incentive program that provided annual payments to critical care physicians contingent on unit-level SBT completion rates. We used Poisson regression to compare the frequency of days on which SBTs were completed among eligible patients and days on which patients were excluded from SBT eligibility among all mechanically ventilated patients. We used multivariate regression to compare risk-adjusted duration of mechanical ventilation and in-hospital mortality. Measurements and Main Results: The cohort included 7,291 mechanically ventilated patients with 75,621 ventilator days. Baseline daily SBT rates were 96.8% (hospital A), 16.4% (hospital B), and 74.7% (hospital C). In hospital A, with the best baseline performance, there was no change in SBT rates, exclusion rates, or duration of mechanical ventilation across time periods. In hospitals B and C, with lower SBT completion rates at baseline, there was an increase in daily SBT completion rates and a concomitant increase in exclusions from eligibility. Duration of mechanical ventilation decreased in hospitalC but not in hospital B. Mortality was unchanged for all hospitals. Conclusions: In hospitals with low baseline SBT completion, physician-targeted financial incentives were associated with increased SBT rates driven in part by increased exclusion rates, without consistent improvements in outcome.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "999de01028d7f29eb34b83e5fb025860",
  "timestamp": "2025-05-15T02:43:06.687468"
}