{
  "id": 9205,
  "title": "Development of the Intimate Partner Violence During Pregnancy Instrument (IPVPI)",
  "abstract": "Background: Intimate partner violence (IPV) during pregnancy can lead to negative consequences for both the mother and offspring. Although IPV is recognized as a worldwide public health issue, its prevalence is considered to be underestimated because cases are likely underreported, suggesting that there might be unmeasured IPV. The aim of this study was to develop an instrument to detect IPV in pregnant women. Methods: A total of 6,590 women in Aichi prefecture, Japan, who took part in a 3 or 4 month infant health checkup program, participated in the study. Questionnaires assessing history of IPV during pregnancy (physical abuse and verbal abuse), maternal characteristics, partner's characteristics, and household characteristics were mailed to women before, or distributed at, the checkup. Women returned the questionnaires to the checkup sites or mailed them back to the health centers. A prediction model for history of IPV was then generated using potential risk factors selected based on the literature. Results: Among 6,530 women who responded to either question on IPV during pregnancy (response rate = 67.3%), the rate of participants who experienced any IPV during pregnancy was 11.1%(physical IPV = 1.2%; verbal IPV = 10.8%). Multiple logistic regression analyses showed that maternal age (< 25 years old), multiparity, history of artificial abortion, negative feelings when the pregnancy was confirmed (e.g., confused), having no one to provide support during pregnancy, having relationship problems with their partner, paternal smoking during pregnancy, and difficult financial status were associated with any abuse from the partner. Based on the analysis, the Intimate Partner Violence during Pregnancy Instrument (IPVPI) was developed, comprising of eight questions to detect unmeasured IPV in pregnant women, and showed moderate predictive power (area under receiver operating characteristic curve = 0.719, 95% confidence interval: 0.698 to 0.740) ranging from 0 to 16 with a cut-off point of 2 (sensitivity = 79.5%, specificity = 47.1%). Conclusion: The IPVPI, which allows to ask indirect questions rather that asking directly about experience of IPV, might be helpful to detect unmeasured IPV in pregnant women in fields of primary healthcare and obstetrics. Further research longitudinal studies are needed to improve the sensitivity and specificity of the IPVPI.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "99a6041ce3ad9b429c39163a6e9d4921",
  "timestamp": "2025-05-15T03:26:26.040536"
}