{
  "id": 9116,
  "title": "Algorithms and heuristics of health technology assessments: A retrospective analysis of factors associated with HTA outcomes for new drugs across seven OECD countries",
  "abstract": "Context: Positive health technology assessment (HTA) outcomes can have important implications for equity, efficiency and timely patient access to novel therapies. Several outcomes and dimensions of benefit beyond utility feed into HTA processes.Objective: We analyse a proprietary dataset of HTA outcomes in 7 countries, to (a) test whether HTA decisionmaking is grounded in welfarist or extra-welfarist approaches; and (b) empirically determine the factors associated with positive HTA outcomes, the time to achieve these and establish the magnitude of inter-country differences in assessment processes.Methods: Data were extracted from publicly available HTA reports on drugs that received marketing authorisation between 2009 and 2018 (N = 1415). The outcomes of interest were the probability of positive HTA outcomes and the time-to-HTA outcome; these were examined with respect to clinical, regulatory, product- and disease-related, evidence uncertainty and contextual variables. Econometric models utilising survival analysis and multinomial logistic regression were specified.Findings: Positive HTA outcomes accounted for 87.3% of the sample (n = 1235), of which 71% (n = 1004) were restricted. Drugs with positive HTA outcomes were subject to clinical restrictions (n = 652, 46%), financial risksharing (n = 439, 31%) or had been rejected at least once (n = 282, 20%). Significant predictors of positive HTA outcomes were orphan drugs with cancer indications, high quality of evidence linked to clinical and economic evidence uncertainties which had been overcome, and contextual considerations, particularly innovativeness and unmet need. Comparative analyses revealed systematic differences between countries in their propensity to accept the same drugs, particularly oncology and orphan drugs.Conclusions: Our results are contextual and reinforce arguments in favour of explicitly accounting for social value judgements, establishing separate assessment frameworks for highly uncertain products, adopting risk mitigation strategies for novel therapies with early phase evidence, and sharing of HTA practices across settings. Lastly, HTA agencies have adopted an extra-welfarist approach to value assessment and resource allocation.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "99cae2203bd9f01c974305312421ecd2",
  "timestamp": "2025-05-15T03:25:54.538001"
}