{
  "id": 3556,
  "title": "The nexus between capital structure, firm-specific factors, macroeconomic factors and financial performance in the textile sector of Pakistan",
  "abstract": "The study aimed to analyse the role of the capital structure in the financial performance of 90 textile firms listed in Pakistan Stock Exchange (PSX) during the period 2008-2017. The dependent variable was return on equity as a proxy for financial performance. The independent variables were the debt to equity, total debt to total assets, asset turnover ratios, sales growth, taxation, and export growth, while the firm size was taken as a control variable. The panel regression estimation technique was employed for analysis purposes, and both cross-sectional and time-series data were collected for this study. This study used the random-effect regression estimation model based on the Hausman diagnostic test statistics. The results indicate that the capital structure debt to equity variable has a negative and significant relationship with financial performance while the asset turnover ratio and firm performance showed a negative and statistically insignificant relationship. Export growth and sales growth have a considerable positive connection with financial performance; however, firm size has a negative and significant impact on firm performance, in favour of our alternative research hypothesis. The remaining variables include tax payable and the total debt to total assets ratio, which have an insignificant connection with financial performance (ROE) and validate the agency theory. With better corporate governance by putting more pressure on managers or increasing managerial ownership, institutional investors can reduce the capital, leverage risk and the overall firm capital cost that help to improve the firm's financial performance and economic stability.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "99cb89bc580e0e8b40e81cd2eb6269fc",
  "timestamp": "2025-05-15T02:27:19.133264"
}