{
  "id": 7708,
  "title": "Risks of adverse events in colorectal patients: population-based study",
  "abstract": "Background: Postoperative (PO) outcomes are rapidly being integrated into value-based purchasing programs and associated penalties are slated for inclusion in the near future. Colorectal surgery procedures are extremely common and account for a high proportion of morbidity among general surgery. We sought to assess adverse events in colorectal surgical patients. Methods: We performed a retrospective study using the Nationwide Inpatient Sample database, 2008-2012. Patients were identified using International Classification of Diseases, Ninth Revision, Clinical Modification codes and classified based on procedure indication: colon cancer, benign polyps, diverticulitis, inflammatory bowel disease, and ischemic colitis. The outcome of interest was inpatient adverse event identified by Agency for Healthcare Research and Quality's patient safety indicators (PSIs). Results: We identified 1,100,184 colorectal patients who underwent major surgery; 2.7% developed a PSI during their hospital stay. Compared to all colorectal patients, those with ischemic colitis had significantly higher risk-adjusted rates per 1000 case for pressure ulcer (50.20), failure to rescue (211.30), central line bloodstream infection (2.33) and PO DE/deep vein thrombosis (16.02), and sepsis (46.99), whereas benign polyps were associated with significantly lower risk-adjusted rates per 1000 cases for pressure ulcer (11.48), failure to rescue (84.79), central line bloodstream infection (0.97) and PO pulmonary embolism/deep vein thrombosis (4.81), and sepsis (11.23). Compared to both patient demographic and clinical characteristics, the procedure indication was the strongest predictor of any PSI relevant to colorectal surgery; patients with ischemic colitis had higher odds of experiencing a PSI (odds ratio, 1.84; 95% confidence interval, 1.71-1.99) compared with cancer patients. Conclusions: Among colorectal surgery patients, inpatient events were not uncommon. We found important differential rates of adverse events by diagnostic category, with the highest odds ratio occurring in patients undergoing surgery for ischemic colitis. Our work elaborates the need for rigorous risk adjustment, quality improvement strategies for high-risk populations, and attention to detail in calculating financial incentives in emerging value-based purchasing programs. (C) 2016 Elsevier Inc. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "99cc31a2699e47d4006dd5d52570abbe",
  "timestamp": "2025-05-15T03:11:04.645136"
}