{
  "id": 7752,
  "title": "Adherence to anti-tuberculosis treatment among pulmonary tuberculosis patients: a qualitative and quantitative study",
  "abstract": "Background: Tuberculosis (TB) patients have difficulty following a long- term treatment regimen. Efforts to improve treatment outcomes require better understanding of adherence as a complex behavioral issue and of the particular barriers to and facilitators of patient adherence. Methods: This study was carried out in Jiangsu Province of China with both quantitative and qualitative approaches. For the quantitative study, 780 sputum-smear positive TB patients consecutively registered since 2006 in 13 counties (districts) were queried with a structured questionnaire. Patients who had missed 10% of their total prescribed doses of TB drugs were deemed as non-adherent. Risks for non-adherence were estimated by computing odds ratios (ORs) and their 95% confidence intervals (95% CIs) using a logistic regression model. We also invited 20 TB patients and 10 local health workers for in-depth interviews. We then used content analysis based on this qualitative study to explore factors associated with non-adherence. Results: The proportion of non-adherence among 670 patients was 12.2%. Univariate analysis showed that patients, who were illiterate, divorced/widowed, lacked health insurance and were migrants, were more likely to be non-adherent. The crude ORs (95% CIs) were 2.38(1.37-4.13), 2.42(1.30-4.52), 1.89(1.07-3.32) and 1.98(1.03-3.83), respectively. The risk of non-adherence was lower among patients whose treatment was given under direct observation by village doctors or regular home visits by health workers, with ORs (95% CIs) of 0.19(0.10-0.36) and 0.23(0.10-0.51), respectively. In multivariate analysis, factors associated with non-adherence included illiteracy (OR: 2.42; 95% CI: 1.25-4.67) and direct observation by village doctors (OR: 0.23; 95% CI: 0.11-0.45). The in-depth interviews indicated that financial burdens and extra medical expenditures, adverse drug reactions, and social stigma were additional potential factors accounted for non-adherence. Conclusion: More importance should be given to treatment adherence under the current TB control program. Heavy financial burdens, lack of social support, adverse drug reactions and personal factors are associated with non-adherence. Direct observation and regular home visits by health workers appear to reduce the risk of non-adherence. More patient-centered interventions and greater attention to structural barriers are needed to improve treatment adherence.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "99d4576316bd923b11ca72d77950e8b8",
  "timestamp": "2025-05-15T03:11:38.576648"
}