{
  "id": 8042,
  "title": "The Risk of Catastrophic Healthcare Expenditures Among Prostate and Bladder Cancer Survivors in the United States",
  "abstract": "Little is known about financial toxicity among survivors of urologic cancer. Prostate and bladder cancer survivors were identified from the Medical Expenditure Panel Survey from 2011 to 2019. Respondents with bladder cancer had significantly greater prevalence of catastrophic health care expenditures compared to adults without cancer, and Black respondents were significantly more likely than their White counterparts to incur ongoing catastrophic costs.Introduction: Little is known about the rates of catastrophic health care expenditures among survivors of prostate and bladder cancer or the factors that place patients at highest risk for undue cost. Materials and Methods: The Medical Expenditure Panel Survey was utilized to identify prostate and bladder cancer survivors from 2011 to 2019. Rates of catastrophic health care expenditures (out-of-pocket health care spending > 10% household income) were compared between cancer survivors and adults without cancer. A multivariable regression model was used to identify risk factors for catastrophic expenditures.Results: Among 2620 urologic cancer survivors, representative of 3,251,500 (95% CI 3,062,305-3,449,547) patients annually after application of survey weights, there were no significant differences in catastrophic expenditures among respondents with prostate cancer compared to adults without cancer. Respondents with bladder cancer had significantly greater rates of catastrophic expenditures (12.75%, 95% CI 9.36%-17.14% vs. 8.33%, 95% CI 7.66%-9.05%, P = .027). Significant predictors of catastrophic expenditures in bladder cancer survivors included older age, comorbidities, lower income, retirement, poor health status, and private insurance. Though White respondents with bladder cancer had no significantly increased risk of catastrophic expenditures, among Black respondents the risk of catastrophic expenditures increased from 5.14% (95% CI 3.95-6.33) without bladder cancer to 19.49% (95% CI 0.84-38.14) with bladder cancer (OR 6.41, 95% CI 1.28-32.01, P = .024). Conclusions: Though limited by small sample size, these data suggest that bladder cancer survivorship is associated with catastrophic health care expenditures, particularly among Black cancer survivors. These findings should be taken as hypothesis-generating and warrant further investigation with larger sample sizes and, ideally, prospective investigation.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "99f01ba198b43ddcc344a3f09c904a62",
  "timestamp": "2025-05-15T03:14:37.360105"
}