{
  "id": 8085,
  "title": "Determining the impacts of hospital cost-sharing on the uninsured near-poor households in Vietnam",
  "abstract": "Objectives: The study objective was to identify the size of different hospital financing sources for different hospital services and their impact on the uninsured. Methods: A panel dataset of 84 public general hospitals (2005-2008) with cross-section data on hospital activity and hospital revenue was created and used to calculate unit costs of different hospital services by applying multiple regression models. The resulting risk of catastrophic health expenditure (CHE) was estimated based on official income statistics. Results: Average user fees (UF) for outpatient visits and inpatient bed days were US$4.13 and US$20.27, while actual full costs (AFC) were US$8.41 and US$36.66, respectively. These unit costs were 2.5 times higher in hospitals at the central versus the provincial level. UF for surgical inpatient bed days were 3.6 times that of non-surgical treatments (US$47.50 vs. 12.87) and AFC 5.0 times (US$101.72 vs. 20.08). UF accounted for 44.6%-77.9% of the AFC, the rest (22.1%-55.4%) was provided by direct government support (DGS). One surgical inpatient treatment at either central or provincial hospital level and one non-surgical inpatient treatment at central hospital level, immediately pushed uninsured near-poor households at risk of CHE. Conclusions: Around 45% of hospital AFC was paid by DGS, the larger rest by UF. UF have become a great financial burden on the uninsured near-poor households, who have to pay for these out-of-pocket and therefore may not utilize even necessary services. If the rate of DGS were reduced, this would have the effect of increasing UF, but the savings to Government could be spent on subsidizing insurance to ensure that a larger part of the population can cover UF through insurance, especially the near-poor households.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "99f6e38418d9ef61d0f1d58059e35524",
  "timestamp": "2025-05-15T03:15:09.341191"
}