{
  "id": 69,
  "title": "Enterprise Financial Risk Management Using Information Fusion Technology and Big Data Mining",
  "abstract": "This paper aims to study enterprise Financial Risk Management (FRM) through Big Data Mining (BDM) and explore effective FRM solutions by introducing information fusion technology. Specifically, big data technology, Support Vector Machine (SVM), Logistic regression, and information fusion approaches are employedto study the enterprise financial risks indepth.Among them, the selection offinancial risk indexes has a great impact on the monitoring results of the SVM-based FRM model; the Logistic regression-based FRM model can efficientlyclassify financial risks; theinformation fusion-based FRM model uses a fusion algorithm to fuse different information sources. The results show that the SVM-based and Logistic regressionbased FRM models can manage and classify enterprise financial risks effectively in practice, with a classification accuracy of 90.22% and 90.88%, respectively; by comparison, the information fusion-based FRM modelbeats SVM-based and Logistic regression-based FRM models by presenting a classification accuracy as high as 95.18%. Therefore, it is concluded that the information fusion-based FRM is better than the SVM-based and Logistic regression-based models; it can integrate and calculate multiple enterprise financial risk data from different sources and obtain higher accuracy; besides, big data technology can provide important research methods for enterprise financial risk problems; SVM-based FRM model and Logistic regression-based FRM model can well classify enterprise financial risks, with relatively high accuracy.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a084ad8638742338d18e9c4e2b71073",
  "timestamp": "2025-05-15T01:46:39.470771"
}