{
  "id": 5731,
  "title": "Modeling Suicide Attempt: A Population-Based Case-Control Study",
  "abstract": "Background: Suicide risk factors can be used to develop tools for suicide attempt prediction and prevention. Objectives: We aimed to design a model to evaluate the risk of suicide related to socio-economic, demographic, health, and drug dependency factors. Methods: This case-control study was conducted in a 15-65-year-old population of Golestan province, Iran. The case group included 414 individuals with a history of suicide in 2019, and the control group had 408 individuals without suicide attempts. Demographic, psychosocial health, and drug dependency data were collected. Modeling was carried out using multivariate logistic regression. The performance of suicide-predicting models was assessed, and a nomogram for the probability of suicide was drawn. Results: A multivariate logistic regression model with age, gender, education level, mother's education level, marital status, life satisfaction, membership in cyberspace, sleep disorders, alcohol abuse, having suicidal thoughts, the interaction of gender with life satisfaction, and the interaction of gender with mother's education level was the best predicting model of suicide attempt (AUC = 0.934, CI: 0.91 - 0.95). The variables of father's education level, occupation, job satisfaction, household size, financial status, regular exercise, guardianship status, history of self-harm, history of suicide attempt in the family, smoking and drug abuse had no significant relationship with suicide attempt. 5.1. Conclusions: The results suggest that designed models can help mental health service providers to identify high-risk individuals early. So we can better manage suicide and reduce its economic, social, and health burdens.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a0cb6090ec2760a8e6d52e8a0bec0d4",
  "timestamp": "2025-05-15T02:50:53.894594"
}