{
  "id": 3628,
  "title": "A composite blockchain associated event traceability method for financial activities",
  "abstract": "The existing blockchain system mostly adopts the equal mining mode. All bookkeepers (entities) record the ledgers on a single main chain, and the data storage is random. Moreover, in complex or classified financial scenarios, the data of the main chain is difficult to realize association or regular storage, resulting in low efficiency of storage and query. At the same time, in the existing blockchain system, event traceability is mostly only found in the source block, and the implicit association between entities cannot be identified, so the query has limitations. To solve these problems, this paper proposes a composite blockchain associated event tracing method. This method firstly constructs the blockchain composite chain storage structure model, proposes the concept of private chain and alliance chain, and realizes the adaptive data association storage in complex or classified scenarios. Secondly, on the basis of obtaining the event source entity block, the auxiliary storage space is established to transfer storage relevant data. A tracing method of associated entity block based on the Apriori algorithm is proposed, and then the obtained traceability entity block is constructed as the source event correlation graph, so as to describe the association relationship between the event entities. Finally, a risk assessment system based on reinforcement learning is proposed to realize the risk assessment of traceability entity. Experiments show that the composite blockchain associated event tracing method proposed in this paper can reduce 60% of the storage overhead, improve 90% of the query accuracy and 50% of the security. can reduce the storage overhead by 60%, improve the query accuracy by 90% and improve security by 50%.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a0dd4a59911f60be8d8facacfaf8554",
  "timestamp": "2025-05-15T02:28:29.304617"
}