{
  "id": 3401,
  "title": "A classification scheme for productivity management in e-commerce services",
  "abstract": "This paper investigates service classification schemes in order to understand how to increase productivity in services. A useful model for this purpose is the one proposed by Schmenner in 2004. However, this model is limited to traditional services, and it does not consider the unique characteristics of e-commerce business, which create new trends in productivity management. Accordingly, we conduct a Systematic Literature Review (SLR) to develop a classification scheme, which would be suitable for e-commerce services. Based on this research, a multidimensional model is proposed splitting the Schmenner's 'degree of variation' dimension into two axes: degree of interaction with customers and degree of customisation for customers. In addition to these theoretical contributions to Schmenner's matrix, the SLR complements the previous reviews presented by authors such as Cook, D. P., Goh, C., & Chung, C. H. (1999. Service typologies: A state of the art survey. Production and Operations Management, 8(3), 318-338) and Van der Valk, W., & Axelsson, B. (2015. Towards a managerially useful approach to classifying services. Journal of Purchasing and Supply Management, 21(2), 113-124). The value of this paper to managers is the recognition of differences in productivity management between these two types of services: managers can overcome the traditional trade-off cost versus customisation and explore e-commerce to increase their profits while increasing customisation for their customers. Moreover, the model proposed in this paper can be used to assist organisations in strategic planning and service portfolio management.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a1843e0c25901da7e82b8cc0b3425cc",
  "timestamp": "2025-05-15T01:16:55.410414"
}