{
  "id": 5775,
  "title": "Aircraft Insurance Costs Management for Sustainable General Aviation: Insights From General Aviation Enterprises in China",
  "abstract": "Little research has examined how to effectively reduce general aviation aircraft (GAA) insurance costs (premiums), even though it has grown to be a heavy financial burden adversely affecting the sustainable development of general aviation (GA). In contrast to previous research that dealt solely with airline insurance, this research studies the insurance cost management issue of GAA from the perspective of supply and demand. Specifically, this paper focuses on analyzing significant factors influencing GAA insurance premiums and the degree of incidence with the risk system. This empirical research is based on a unique dataset of GA enterprises in China during 2017 to 2019 and utilizes the second synthetic of gray incidence analysis (SSDGIA) model and entropy weight analysis. First, it is found that the fleet profile, loss record, and individual GA operational performance are the critical elements related to premiums. Additionally, there is an increasing dependence of premiums on direct loss performance. Second, the degree of incidence between premiums and the risk system (<0.8) constructed within the Human Factors Analysis and Classification System (HFACS) framework is below the expected level. The latent risk factors related to loss make a small contribution. Such findings will contribute to GA development through cost reduction and risk management. GAA operators and owners could save premium expenses by optimizing their risk management decisions and operations. The results also provide an important theoretical basis for the regulatory agency to speed up the optimization of GA risk information analysis and disclosure system. With complete GA risk information support, insurers could further improve GA risk assessment and determine long-term competitive premium rates.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a1862fbc51844ece4b7fcc5bc9b248e",
  "timestamp": "2025-05-15T02:51:29.987278"
}