{
  "id": 8567,
  "title": "Financial exposure to environmental liabilities in Lake Huron drainage area farmlands: a GIS and hedonic pricing approach",
  "abstract": "Purpose This paper aims to quantify the impact of environmental contamination on farmland valuation. It applies data fusion and hedonic pricing approaches to quantify the contribution of nitrogen and phosphorus loading on farmland sales transactions. It further suggests approaches to improve internalization of environmental cost in valuation approaches using shadow pricing. The work informs the field of environmental, social and governance (ESG) investing by fusing environmental data with financial transactions. Design/methodology/approach This paper is an empirical study implementing hedonic pricing of farmland in the Lake Huron major drainage area. Data sources and fusion were derived from AcreValue, the United States Department of Agriculture's Gridded Soil Survey Geographic database (gSSURGO) and the United States Geological Survey's Spatially Referenced Regression on Watershed Attributes database (SPARROW). Findings The results suggest that environmental contamination has statistically significant positive determination power on farmland prices such that prices increase with contamination. Conventional metrics such as percentage of cultivated land in the parcel, root zone depth, whether the parcel is designated by the Natural Resource Conservation Service as prime farmland, and the size of the farmland parcel contribution to farmland value as well. The results indicate that environmental impacts are not accurately accounted for in farmland transactions. Research limitations/implications This paper points to inaccurate valuation of environmental contamination in farmland value. While geocoding allowed for positioning of farmland sales transactions relative to modeled areas of contaminant loading in the Lake Huron drainage area, the interpretation indicates that value is driven by cultivation. Hence, generalization to other areas needs a cautious approach. Empirical testing across locations and drainage areas with diverse farmland features will serve to verify the modeled data used in this study. Practical implications The lack of integration of externalities in land valuation has implications on lending and disclosure practices, as financial service providers increasingly seek to account for ESG risk on their loan books and broader investment portfolios. The impact of farmland accounting practices for contamination such as shadow pricing may impact land valuation based on future cash flows, and may serve to inform sustainability-linked lending practices to farm operations. Originality/value This is the first paper to fuse data from AcreValue, gSSURGO and SPARROW to discover the explanatory power of nutrient contamination in farmland value in the Lake Huron major drainage area.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a26bf0c847e673d0e8d08bbc614fc78",
  "timestamp": "2025-05-15T03:20:22.145978"
}