{
  "id": 3099,
  "title": "Do Diversified Export, Agriculture, and Cleaner Energy Consumption Induce Atmospheric Pollution in Asia? Application of Method of Moments Quantile Regression",
  "abstract": "Sustainable development remains unattainable unless we move to reduce the negative impact of economic factors on environmental quality. It is noteworthy to provide new evidence on whether and how the empirical association between export diversification, agricultural value-addition, renewable energy, and regulatory quality with greenhouse gas (GHG) emissions evolved in Asian countries from 1996 to 2014. The study examines the relationships between these variables using current panel data techniques. The econometric procedure includes second-generation cointegration and unit root tests together with a novel Method of Movements Quantile Regression (MMQR). This approach offers an asymmetric relationship between the variables and is very robust to outliers compared to traditional quantile regression. The empirical outcomes show that export diversification, renewable energy, and regulatory quality are significantly and negatively associated with GHG emissions. In contrast, agricultural value-added in Asia has become a source of increased GHG emissions. Our findings are also robust with alternate specifications, including fully modified, dynamic and fixed effect regressions. This study will help policymakers for diversifying their export portfolio while ensuring a sustainable environment in Asia.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a2a212845dd6e8488b561f5df9525e7",
  "timestamp": "2025-05-15T01:13:45.117433"
}