{
  "id": 1931,
  "title": "Enterprise Risk Evaluation and Forecast-Empirical Evidence of Chinese Listed Companies from 2009-2010",
  "abstract": "This paper is to evaluate and forecast the risk of Chinese listed companies through Dynamic Bayesian Network Classification Model and risk forecasting index system. The result shows that the listed companies in 2009 are all have certain level financial and operating risk. Among them, 11.62% have high financial risk and 21.76% have high operating risk. Looked from the Industry distribution. Electricity. Gas and Water Production and Supply, Electronics, Real Estate, Metallurgy, Agriculture, Forestry, Animal husbandry and Fishery, Pharmaceuticals, Biological and Comprehensive Industries have higher financial risk. Mining, Electronics, Real Estate, Textile, Clothing and Fur Industry, Transportation, Storage, Metallurgy,Agriculture, Forestry, Animal husbandry and Fishery, Wholesale, Retail and Comprehensive Industries have higher operating risk. Similarly, listed companies in 2010 also have certain level financial and operating risk; 12.37% of them have higher financial risk and 18.44% have higher operating risk. Electricity. Gas and Water Production and Supply, Electronics, Real estate, Metallurgy, Agriculture, Forestry, Animal husbandry, Fishery, Pharmaceuticals, Biological, Wholesale and Retail, Food and Beverage and Comprehensive Industries have higher financial risk. Mining, Electronics, Real Estate, Mechanicals, Equipment and Instrument, Metallurgy, Wholesale and Retail. Servicing and Comprehensive Industries have higher operating risk.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a2d25e31874194ae7b892cc09838527",
  "timestamp": "2025-05-15T02:09:14.348745"
}