{
  "id": 9287,
  "title": "Economic rehabilitation management among patients with chronic low back pain",
  "abstract": "Background and study purpose. Back pain causes high costs to society. In Germany, these amount to an estimated total of 5 billion euro of direct costs per year and 13 billion euro of indirect costs, the latter being caused by incapacity to work. The purpose of this study is to develop a concept for economic rehabilitation management. This concept is based on the managed care approach and aims at improving efficiency of care. Methods. The concept development consists of a theoretical and an empirical part. The method of the theoretical part is based on a systematic literature review on managed care (not included in this article), health systems research and the analysis of economic incentives. For the empirical investigation, long term effects and costs were calculated. For the evaluation of effects, we psychometrically tested and used the Euro-Qol (EQ-5D) as a measure of health-related quality of life (HRQL). The calculation of costs (both direct and indirect) is based on routine data of payers, a cost diary and the internal cost accounting systems of rehabilitation clinics. We statistically analysed the cost distribution and identified predictors of the management targets (e.g., costs of care) by means of regression analyses. Results. The market-driven managed care approach is based on three tools: (1) a primary care system with case management and gatekeeping, (2) direct influence on providers by utilisation review and setting guidelines, and (3) indirect influence by setting supply-side economic incentives via the remuneration mode. The third managed care toot is most important when managing the rehabilitation of working age patients with chronic low back pain from an economic point of view. This concept consists of three components: (1) a case-based budget for direct costs;this is a prospective remuneration mode for an integrated primary care network including a rehabilitation facility, (2) retrospective bonus payments which are related to savings of indirect costs, and (3) retrospective bonus payments which are related to the effectiveness of rehabilitation, i.e. gains in HRQL. Common features of the three management components are a long-term perspective (e.g.,from admission to a rehabilitation clinic until six months after discharge) and risk-adjustment of the three management targets (i.e., direct and indirect costs and gains in HRQL) in order to avoid selection and to limit the financial risk for providers. The EuroQol instrument shows acceptable psychometric properties in the rehabilitation setting for back pain patients. This instrument may yield two kinds of preference-based index values, one reflecting the preferences of the general population and one those of the patient. The Pearson correlation of these two approaches is fair, but there is a systematic difference. Empirical investigation shows that the distribution of both direct and indirect costs is skewed to the right. Statistically relevant predictors of the management targets are incapacity to work and HRQL at admission. Conclusions. Economic rehabilitation management might help to save money and to improve health outcomes, thus increasing the efficiency of care. The results of our empirical studies show the feasibility of tools for the economic management of rehabilitation. Risk adjustment of the management components is of paramount importance.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a4528334191b385a12277b8bace2e3f",
  "timestamp": "2025-05-15T03:27:24.985517"
}