{
  "id": 5615,
  "title": "ESG scores and stock returns during COVID-19: an empirical analysis of an emerging market",
  "abstract": "PurposeThe COVID-19 pandemic resulted in a dramatic downturn in the global stock markets. Investors look for safe stocks that can provide better risk-adjusted returns. Stocks with higher Environmental, Social, and Governance (ESG) scores can be good choices for investors. This study focuses on this argument by examining the relationship between ESG indicators and stock returns while considering financial and macroeconomic variables.Design/methodology/approachIn this study, 39 non-financial firms listed in Nifty-50, for which data is available, have been included. Panel data from 2018 to 2021 is collected to examine this relationship in the presence of COVID-19. Additionally, the panel regression method is used.FindingsThe empirical findings indicate a positive relationship between ESG scores and stock returns. This relationship holds even when the control variables like Return on Assets (ROA), Gross Domestic Product (GDP), Return on Equity (ROE), age, size, leverage of the firm, inflation, and crisis period are used in the model.Originality/valueThis study contributes by examining the linkage between ESG indicators and stock return while controlling the impact of the financial and macroeconomic variables in Indian markets, which has not been undertaken so far. Moreover, this is the first study to use the ESG score data of S&P Global, which gives more weight to the material factors of a firm.Peer reviewThe peer review history for this article is available at: https://publons.com/publon/10.1108/IJSE-10-2023-0819.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a49b3981f2a5b63c14785f78e832ea7",
  "timestamp": "2025-05-15T02:49:50.197992"
}