{
  "id": 8493,
  "title": "Living with an inborn error of metabolism detected by newborn screening-Parents' perspectives on child development and impact on family life",
  "abstract": "Background Newborn screening for inborn errors of metabolism is regarded as highly successful by health professionals. Little is known about parents' perspectives on child development and social impact on families. Methods Parents of 187 patients with metabolic disorders detected by newborn screening rated child development, perceived burdens on child and family, and future expectations on a questionnaire with standardized answers. Parental ratings were compared with standardized psychometric test results. Regression analysis was performed to identify factors associated with extent of perceived burden. Results In 26.2 % of patients, parents perceived delays in global development and/or specific developmental domains (physical, social, intellectual, language). Parents expected normal future development in 95.7 %, and an independent adult life for their child in 94.6 %. Comparison with psychometric test results showed that parents of children with cognitive impairments tended to overrate their child's abilities. Mild/medium burden posed on the family (child) by the metabolic disorder was stated by 56.1 % (48.9 %) of parents, severe/very severe burden by 19.3 % (8.6 %). One third of families reported financial burden due to the metabolic disorder. Dietary treatment and diagnoses with risk for metabolic decompensation despite treatment were associated with higher perceived burden for the family. Disorders rated as potentially very burdensome by experts were not rated accordingly by parents, demonstrating different perspectives of professionals and parents. Conclusion Although newborn screening leads to favourable physical and cognitive outcome, living with a metabolic disorder may cause considerable stress on patients and families, emphasizing the need for comprehensive multidisciplinary care including psychological and social support.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a5cdd3a50dff36ed113d78f414f404c",
  "timestamp": "2025-05-15T03:19:21.344634"
}