{
  "id": 7129,
  "title": "Fuzzy Integrated Delphi-ISM-MICMAC Hybrid Multi-Criteria Approach to Optimize the Artificial Intelligence (AI) Factors Influencing Cost Management in Civil Engineering",
  "abstract": "This research paper presents a comprehensive study on optimizing the critical artificial intelligence (AI) factors influencing cost management in civil engineering projects using a multi-criteria decision-making (MCDM) approach. The problem addressed revolves around the need to effectively manage costs in civil engineering endeavors amidst the growing complexity of projects and the increasing integration of AI technologies. The methodology employed involves the utilization of three MCDM tools, specifically Delphi, interpretive structural modeling (ISM), and Cross-Impact Matrix Multiplication Applied to Classification (MICMAC). A total of 17 AI factors, categorized into eight broad groups, were identified and analyzed. Through the application of different MCDM techniques, the relative importance and interrelationships among these factors were determined. The key findings reveal the critical role of certain AI factors, such as risk mitigation and cost components, in optimizing the cost management processes. Moreover, the hierarchical structure generated through ISM and the influential factors identified via MICMAC provide insights for prioritizing strategic interventions. The implications of this study extend to informing decision-makers in the civil engineering domain about effective strategies for leveraging AI in their cost management practices. By adopting a systematic MCDM approach, stakeholders can enhance project outcomes while optimizing resource allocation and mitigating financial risks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a5f9d448f0c3f4a5535d20b5098c15d",
  "timestamp": "2025-05-15T03:05:32.020697"
}