{
  "id": 9017,
  "title": "The identification and classification of contributing factors to technical knowledge valuation at the related commercialisation level using the hierarchical analysis",
  "abstract": "PurposeThis study aims to determine the contributing factors to technical knowledge valuation at the related quadruple levels of commercialisation, including the idea, benchtop technical knowledge, prototype technical knowledge and commercialised technical knowledge, and then classify the factors by the valuation objectives. Design/methodology/approachThe study method is descriptive-causal, and documentation tools of published scientific research articles in authentic local and international journals were used to extract the contributing factors to technical knowledge valuation. Moreover, the Likert spectrum-based questionnaire is used to determine the weight of each determined component. On the other hand, hierarchical analysis is used based on the extracted results from the distributed classification questionnaire among scholars to determine the allocable weight of each component. FindingsThe results indicate that at the idea step, the highest ranks among the contributing factors to technical knowledge valuation are for the indicators of innovation rate enhancement, novelty, creation of new products, profitability growth and dependence decline. In the benchtop technical knowledge step, the indicators of profitability growth, product quality enhancement, novelty, production risk drop, innovation rate enhancement, production costs drop, product price competitiveness and independence from rare machinery have the highest impact coefficients on valuation. Moreover, the prioritisation of factors in prototype technical knowledge shows that the indicators of productive risk decline, infrastructure, decrease in product delivery time, productivity growth and profitability growth are the most critical factors in technical knowledge valuation. Finally, profitability growth factors, production cost drop, productive risk drop, creating a new product, product price competitiveness and dependence decline determine the most valuable technical knowledge in the commercialisation phase. Research limitations/implicationsThe most salient innovation of the study involves the development levels of technical knowledge in the commercialisation cycle for determining the contributing factors to technical knowledge valuation and using multivariate decision-making methods to classify the so-called factors. The major limitation can be the context of the study because the paper was carried out by Iranian assessors and specialists using the experiences, opinions and approaches of opinion leaders based on the dominant social, cultural and accounting background of a developing country, not a developed one. Originality/valueThis paper is applicable because it elucidates the technical knowledge valuation factors for managers and owners of technological and knowledge-based companies to facilitate value determination and register the technical knowledge of innovative products in financial statements for the logical presentation of available intangible assets in the economic unit. Besides, in the high-tech area, collecting information from the contributing factors to technical knowledge valuation provides an opportunity to support intellectual property rights and facilitate transaction processes. Finally, in legal areas, in cases of breaching intellectual property rights relative to technical knowledge, the determination of technical knowledge value provides a solid basis for estimating the damage rate.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a69ed797c3c75722fa7c8bc0a904cfb",
  "timestamp": "2025-05-15T03:24:54.868634"
}