{
  "id": 9013,
  "title": "Accuracy of a diagnostic model based on serum biochemical parameters in detecting cows at an increased risk of chronic fascioliasis",
  "abstract": "In adult cattle Fasciola hepatica infection usually follows a chronic subclinical course, and reduces both the milk yield and milk quality, resulting in considerable financial losses. Effective control of the disease is based on reliable identification of asymptomatically infected individuals, which now requires special parasitological or serological diagnostic tests. It is also known that F. hepatica infection induces alterations in some serum biochemical parameters. Therefore, the study was conducted to develop a model based on serum biochemical parameters allowing to identify cows at higher risk of chronic fascioliasis. Six hundred sixty eight adult dairy cows from 97 herds located in central and northeastern Poland were clinically examined, and blood and fecal samples from them were collected for a routine monitoring of fascioliasis and metabolic profile. Using the combination of fecal sedimentation test and indirect ELISA based on excretory/secretory products 203 cows, apparently healthy in clinical examination, were definitively classed as affected by (47 cows, 23.2%) or free from (156 cows, 76.8%) chronic fascioliasis. Their serum was screened for the activity of 4 enzymes (gamma-glutamyl transpeptidase, glutamate dehydrogenase, aspartate aminotransferase, creatine kinase) and concentration of 18 other components (total bilirubin, total protein, albumin, globulin, urea, glucose, non-esterified fatty acids, (beta-hydroxybutyrate, sodium, potassium, chloride, calcium, magnesium, copper, zinc, iron, selenium, and haptoglobin). Logistic regression analysis was used to build 4 multivariable models allowing for identification of cows at risk of chronic fascioliasis. Then, the accuracy was compared between the models using the area under the receiver operating characteristic curve (AUROC), and an optimal cut-off value was determined for the most accurate model using Youden J index. The most accurate proved to be the model based on glutamate dehydrogenase activity and globulin, urea (all three positively linked with risk of chronic fascioliasis), and selenium concentration (negatively linked) adjusted by the access to pasture and cow's age. At the optimal cut-off of 0.37 this model had sensitivity of 85.1% (CI 95%:72.3%, 92.6%), specificity of 90.4% (CI 95%:84.7%, 94.1%), positive likelihood ratio of 8.8 (CI 95%:5.4, 14.5), and negative likelihood ratio of 0.16 (CI 95%:0.08, 0.33). This model performed significantly better than model including only gamma-glutamyl transpeptidase or model including both y-glutamyl transpeptidase and aspartate aminotransferase (both also adjusted by the access to pasture and cow's age), and was the only model which performed significantly better than the basic model based solely on the access to pasture and cow's age.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a7209abc79fb6abdca02c18f8f5f970",
  "timestamp": "2025-05-15T03:24:54.857645"
}