{
  "id": 7070,
  "title": "Risk of severe periodontal disease in a Swedish adult population - A cross-sectional study",
  "abstract": "In this study, potential risk factors for severe periodontal disease were identified in a cross-sectional sample from the county of Jonkoping, Sweden. 547 adults 20-70 years of age were categorised clinically and radiographically by level of periodontal disease experience. These levels were used to divide the sample into groups - individuals without any reduction in periodontal bone level (60%) and those with severe periodontal bone loss (13%) - which were then used in univariate and multivariate logistic regression analyses as dependent variable. Demographic, socio-economic, general health, smoking habits, clinical, and dental care variables were used in the different regression analyses. In the univariate model, age (20-70 years) was found to be correlated with more severe periodontal disease experience (odds ratio: 1.13; 95% CI: 1.10-1.17). The association with periodontal disease was more pronounced for the older age groups (50, 60, and 70 years). A negative financial situation was also related to severe periodontal bone loss when regressed univariately (odds ratio 2.20 [95%. 1.04-4.68]). Moderate-heavy smoking (greater than or equal to 10 cigarettes/day) appeared to be associated with severe periodontal destruction with an odds ratio of 9.78 (95% CI: 3.62-36.42). Of the clinical variables in the univariate model, higher mean levels of supragingival dental plaque and the presence of subgingival calculus were related to more severe periodontal disease with odds ratios of 1.02 (95%. 1.01-1.03) and 2.96 (95%. 1.50-5.88), respectively. When the same variables were regressed multivariately, age (continuous) (odds ratio 1.17 [95% CI: 1.12-1.22]), moderate-heavy smoking (odds ratio 11.84 [95% CI: 4.19-33.50]), and higher mean levels of plaque (odds ratio 1.02 [95% CI: 1.00-1.03]) remained significant. Light smoking (1-9 cigarettes/day) was not significantly associated with severe periodontal disease in the 2 regression models. The present study demonstrated that smoking, greater age, and higher mean levels of plaque are potential risk factors for severe periodontal disease in this specific population.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a7aca81714a68fb81bc592e9bbb04e6",
  "timestamp": "2025-05-15T03:05:03.372629"
}