{
  "id": 5693,
  "title": "Quarantine and demographic characteristics as predictors of perceived stress and stress responses during the third year of COVID-19 in China",
  "abstract": "BackgroundQuarantine as one of the most effective epidemic prevention measures, significantly increased people's stress levels. Ongoing monitoring of the stress status of people under quarantine during the pandemic is an important part of assessing the long-term impact of COVID-19 on mental health. This study aimed to gain a more comprehensive understanding of the stress status of people under quarantine, including perceived stress and stress responses, during the third year of the COVID-19 pandemic in China. MethodsAn anonymous online survey was conducted among 464 participants from 39 cities in China from March 31 to April 12, 2022. The survey included three questionnaires: a self-designed questionnaire collecting demographic information and quarantine characteristics, the Perceived Stress Scale (PSS-10) and the Stress Response Questionnaire (SRQ). The t-test or one-way ANOVA or the Welch F-test were used to examine the differences among demographic and quarantine variables of perceived stress and stress responses, then multiple linear regressions were performed to identify the predictors of perceived stress and stress responses. Results428 valid respondents were finally included. The average scores of perceived stress, total stress response, emotional response, physical response, and behavioral response were 14.70 +/- 7.02, 50.24 +/- 22.48, 20.35 +/- 9.99, 15.23 +/- 7.25, and 11.39 +/- 5.27, respectively. The regression analysis showed that the degree of financial worries and days of continuous quarantine were the predictors of perceived stress. The degree of financial worries was a vital factor in predicting total stress response, emotional response, physical response and behavioral response, and in predicting emotional response, age was also a significant predictor. ConclusionThe stress status of individuals under quarantine was generally stable but still needs further attention during the third year of the COVID-19 pandemic. People who are young, have a high degree of financial worries and have been quarantined for a long time may be at a higher risk of perceived stress and stress responses. Relevant authorities should pay closer attention to the risk groups, and additional support and assistance might be required for those mostly worried about their financial situations under quarantine.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a897b8a236d542ba88290107a65f1d4",
  "timestamp": "2025-05-15T02:50:21.308528"
}