{
  "id": 6539,
  "title": "Resource Utilization for Observation-Status Stays at Children's Hospitals",
  "abstract": "BACKGROUND AND OBJECTIVE: Observation status, in contrast to inpatient status, is a billing designation for hospital payment. Observation-status stays are presumed to be shorter and less resource-intensive, but utilization for pediatric observation-status stays has not been studied. The goal of this study was to describe resource utilization characteristics for patients in observation and inpatient status in a national cohort of hospitalized children in the Pediatric Health Information System. METHODS: This study was a retrospective cohort from 2010 of observation-and inpatient-status stays of <= 2 days; all children were admitted from the emergency department. Costs were analyzed and described. Comparison between costs adjusting for age, severity, and length of stay were conducted by using random-effect mixed models to account for clustering of patients within hospitals. RESULTS: Observation status was assigned to 67 230 (33.3%) discharges, but its use varied across hospitals (2%-45%). Observation-status stays had total median costs of $2559, including room costs and $678 excluding room costs. Twenty-five diagnoses accounted for 74% of stays in observation status, 4 of which were used for detailed analyses: asthma (n = 6352), viral gastroenteritis (n = 4043), bronchiolitis (n = 3537), and seizure (n = 3289). On average, after risk adjustment, observation-status stays cost $260 less than inpatient-status stays for these select 4 diagnoses. Large overlaps in costs were demonstrated for both types of stay. CONCLUSIONS: Variability in use of observation status with large overlap in costs and potential lower reimbursement compared with inpatient status calls into question the utility of segmenting patients according to billing status and highlights a financial risk for institutions with a high volume of pediatric patients in observation status.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9a8ef896c662ca9d4bd841e146a6229d",
  "timestamp": "2025-05-15T02:59:07.523032"
}