{
  "id": 3588,
  "title": "Sarcocystis spp. in llamas (Lama glama) in Southern Bolivia: A cross sectional study of the prevalence, risk factors and loss in income caused by carcass downgrades",
  "abstract": "Llamas (Lama glama) are intermediate hosts of the protozoan parasite Sarcocystis spp. This parasite is described as causing economic losses in the production of llama meat in South America. The aim of this study was to estimate prevalence, identify risk factors and explore spatial patterns of Sarcocystis in llamas in an area of the Bolivian High Plateau including estimating financial losses due to carcass downgrades as a result of the presence of Sarcocystis cysts. Information was collected from a local abattoir between 2006 and 2011 on 1196 llamas. Sarcocystis status was determined at meat inspection where any carcasses with one or more visible cysts were deemed Sarcocystis positive. A high prevalence was found, estimated to vary between 23.4% (95% CI 16.6-30.1) in 2007 and 50.3% (95% CI 44.4-56.3) in 2011. Period prevalence between 2006 and 2011 was estimated at 34.1% (95% Cl 31.4-36.8). Age, sex and type (analogous to breed) were identified as risk factors for Sarcocystis using a mixed-effects logistic regression model adjusting for clustering by community and owner. Llamas over 4.5 years of age had an increased odds of being Sarcocystis positive (OR 19.31,95% CI 9.10-40.98) as well as females (OR 1.75,95% CI 1.13-2.68) and long haired type llamas (OR 1.90,95% CI 1.26-2.87). An interaction between age and sex was detected indicating that the increased odds of disease from the youngest age group to the 2.5-4.5 years group was much more pronounced in females than in males. Spatial patterns of Sarcocystis were explored at district level by means of Standardised Morbidity Ratios and some spatial heterogeneity was revealed. Estimates of financial loss due to the disease were calculated using the difference in price paid for Sarcocystis positive and negative meat. Loss due to Sarcocystis varied per year but could be up to 20% of the annual income generated through the abattoir by sale of meat. Overall this study shows a high prevalence of Sarcocystis in the study area with some heterogeneity between districts. It also identifies some previously unknown risk factors for Sarcocystis and gives financial estimates of the cost of the disease as a result of carcass downgrades. We hoped these findings will add to the understanding of Sarcocystis in llamas in Southern Bolivia and will be useful when considering if controls are necessary, worthwhile and practical. (C) 2013 Elsevier B.V. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9aa21b1b241c9f01f541345e73e83c8c",
  "timestamp": "2025-05-15T02:27:54.067305"
}