{
  "id": 8486,
  "title": "Estimating the Within-Person Change in Dental Service Access Measures during the COVID-19 Pandemic in the United States",
  "abstract": "Background. American adults delay dental care more than any other healthcare service. Unfortunately, the COVID-19 pandemic may have stalled efforts to address dental service delays. Early evidence has suggested substantial declines in dental service visits in the early phase of the pandemic; however, our study is among the first to measure within-person changes from 2019 to 2020 and conduct subgroup analyses to examine if changing dental patterns were mediated by exposure to the pandemic, risk of adverse COVID-19 outcomes, or dental insurance. Methods. We analyzed a National Health Interview Survey panel of individuals initially surveyed in 2019, with subsequent follow-up in 2020. The outcomes included dental service access measures and the interval of a most recent dental visit. By constructing a probability-weighted linear regression model with fixed-effects, we estimated the average within-person change from 2019 to 2020. Robust standard errors were clustered within each respondent. Results. From 2019 to 2020, adults reported a 4.6%-point reduction in the probability of visiting the dentist (p < 0.001). Significantly higher declines were found in Northeast and West regions compared to Midwest and South regions. We find no evidence that declining dental services in 2020 were associated with more chronic diseases, older age, or lack of dental insurance coverage. Adults did not report more financial or nonfinancial access barriers to dental care in 2020 compared to 2019. Conclusions. The long-term effects of the COVID-19 pandemic on delayed dental care warrant continued monitoring as policymakers aim to mitigate the pandemic's negative consequences on oral health equity.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9aa3762f587c794997f23f78ff486842",
  "timestamp": "2025-05-15T03:19:21.329273"
}