{
  "id": 5841,
  "title": "Effect of socioeconomic status on cardio-respiratory fitness: data from a health screening program",
  "abstract": "AimLower socioeconomic status (SES) is associated with reduced cardio-respiratory fitness (CRF) and predicts adverse cardiovascular outcomes. We questioned whether this association remains significant among an apparently healthy population with a presumed higher SES.MethodsThis cross-sectional study enrolled attendees of a health screening program between September 2002 and November 2010. Linear regression models included the metabolic equivalents achieved during an exercise treadmill stress test as the dependent variable and adjusted for self-reported SES parameters (level of education, occupational status, financial strain and a combined variable), cardiovascular risk factors, as well as to multiple potential confounders.ResultsData on 8471 individuals (5463 men and 3008 women) with a mean (SD) age of 44 (11) years were collected. We found a statistically significant difference in mean exercise capacity between the categories of SES, especially for the level of education and occupation, when adjusted for age, sex, cardiovascular risk factors, SES variables and multiple confounders.ConclusionsMultiple factors affect CRF in apparently healthy screened individuals. When adjusted for those factors, SES correlates with CRF even within a more specific highly educated cohort.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9aa8133b95ae7d4d407701530a5c866b",
  "timestamp": "2025-05-15T02:51:58.601922"
}