{
  "id": 2593,
  "title": "Why consumers hesitate to pay online: Evidence from online transactions",
  "abstract": "Purchase intention and decision turn out to be the research hotspots in the field of consumer behavior, whereas the reasons for consumer hesitation before purchase have been scarcely investigated. In order to explore the factors that affect consumers' online purchase hesitation in the context of e-commerce retail, this study uses the theory of perceived risk to analyze how different dimensions of perceived risk dominated by consumer trust affect consumers' purchase hesitation at the checkout stage, examines the moderating effect of consumers' online shopping experience on the influencing process, and builds a test model with moderating variables. In this study, the factors for purchase hesitation are empirically analyzed using the methods of literature analysis and logistic regression based on the real transaction data from Taobao. The results show that seller credit rating, representing seller risk, exerts a significant adverse effect on purchase hesitation, whereas the order amount (i.e. financial risk, and price dispersion, representing product risk) positively affects purchase hesitation. The consumer experience plays a moderating role in the above process. In addition, this article further explores the heterogeneous role of buyer's device, seller's platform, and buyer's gender and excludes some of the interfering factors that lead to involuntary hesitation.JEL Classification: M31, M37",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ab94113f608338ad5280c2a2212022d",
  "timestamp": "2025-05-15T02:17:01.751484"
}