{
  "id": 3535,
  "title": "The turn-of-the-month effect in real estate investment trusts (REITs)",
  "abstract": "Purpose - This study seeks to examine the market returns of five domestic real estate investment trust (REIT) indices to determine whether they exhibit a turn-of-the-month (TOM) effect. Design/methodology/approach - A test is carried out for the TOM effect by employing a battery of parametric and non-parametric statistical tests that address the concerns of distributional assumption violations. An OLS regression model compares the TOM returns with the rest-of-the-month (ROM) returns and an ANOVA model examines the TOM period while controlling for monthly seasonalities. A non-parametric t-test examines whether the TOM returns are greater than the ROM returns and a Wilcoxon signed rank test examines the matched-pairs of TOM and ROM returns. Findings - A TOM effect in all five domestic REIT indices is found: real estate 50 REIT, all-REIT, equity REIT, hybrid REIT, and mortgage REIT. More specifically, the six-day TOM period, on average, accounts for over 100 per cent of the monthly return for the three non-mortgage REITs, while the ROM period generates a negative return. Additionally, the TOM returns are greater than the ROM returns in 75 per cent of the months. Research limitations/implications - The data are limited to five-years of daily returns and five different indices. Thus, the results could be biased on the selected time period. Practical implications - These results are important to REIT portfolio managers and investors. Domestic REIT markets experience a TOM effect from which investors and portfolio managers can benefit. Orginality/value - The daily returns of all five major domestic REIT indices are examined. Data are evaluated which include daily returns after the passage of the REIT Modernization Act of 1999 that resulted in numerous changes for REITs. Whether the TOM effect can be detected with both parametric and non-parametric tests is examined.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ac2f54ee245a6c50e27a8730fbb132d",
  "timestamp": "2025-05-15T01:17:54.233004"
}