{
  "id": 8438,
  "title": "Harm from other people′s drinking among college students in India",
  "abstract": "Introduction and Aims There is a paucity of studies on the harms experienced by college students from India due to others ' drinking, despite their increased risk. We studied the prevalence and correlates of harm from others ' drinking among college students in the state of Kerala, India. Design and Methods A total of 5784 students from 58 colleges completed a self-administered questionnaire, which included the World Health Organization-Thai Health Harm to Others from Drinking Master Protocol and other structured instruments to assess correlates. The frequencies of various harms were determined and a mixed effect multivariable negative binomial regression model was used to identify the factors responsible for harms. Results Of the 4487 valid responses, 68.3% were females. The mean age of the sample was 19.5 years. Harm from others ' drinking was reported by 68.7% of respondents. Among various harm domains, psychological harm was reported by 65.7%, physical by 15.2%, financial by 20.9%, and property harm by 5.0%. Strangers were the most common perpetrators. Being male and having a part-time job increased harms. Increasing age, urban residence, and staying in a hostel were correlated with psychological-but not physical-harm. Subjects who reported harm had higher odds of reporting alcohol use and psychological distress. 'Any harm' or psychological harm was associated with suicidal thoughts; only physical harm was correlated with suicidal attempts. Discussion and Conclusions The high prevalence of harms from others ' drinking and its negative correlates underscore the need for colleges to focus on second-hand effects in programs for tackling alcohol use.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9acdafdbdc915cd73f8ed21407303436",
  "timestamp": "2025-05-15T03:18:51.621798"
}