{
  "id": 4187,
  "title": "Linear and nonlinear interest rate exposure in Spain",
  "abstract": "Purpose - This paper aims to carry out a comprehensive analysis of the influence of interest rate risk on Spanish firms at the industry level. Design/methodology/approach - The methodology employed has its origin in the two-index linear regression model proposed by Stone. This traditional interest rate exposure model has been extended in this paper to allow for a nonlinear exposure component as well as the presence of asymmetric behaviour in the exposure pattern. Findings - Interest rate exposure is not homogeneous for all the Spanish industries. In line with other markets, highly leveraged industries (construction and real estate), regulated industries (electrical and utilities), and banking industry are the most interest rate sensitive. Nevertheless, the interest rate exposure of Spanish firms also shows some distinctive features due to the peculiar structure of the Spanish market. It is also documented that the classical linear exposure profile prevails over the nonlinear and asymmetric exposure patterns, and that the introduction of the euro seems to have weakened the degree of interest rate risk. Practical implications - The evidence presented in this paper can be used as input in decision making by corporate managers, investors, and regulators interested in assessing the impact of interest rate risk at the sector level for hedging, portfolio management, or risk assessment purposes. Originality/value - This is the first paper which tackles the analysis of the impact of interest rate risk on Spanish firms, taking into account not only the standard linear interest rate exposure profile but also the nonlinear one. The results found in the Spanish case reveal the existence of particularities which might also be present in countries immersed in a process of dramatic economic transformations similar to that experienced by Spain over the past two decades. This is the case of the Central and Eastern European countries which recently joined the European Union.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9acfe5458b9a44a468dd0cfd6b8a6332",
  "timestamp": "2025-05-15T01:24:25.488406"
}