{
  "id": 9148,
  "title": "Audit committee ownership and the cost of equity capital",
  "abstract": "Purpose - This paper aims to investigate whether audit committee ownership (consisting of both equity holdings and option holdings) is associated with the cost of equity capital. Design/methodology/approach - This paper uses regression analysis to examine the association between audit committee ownership and the cost of equity capital. The data set consists of 2,825 firm-year observations for companies listed on the ASX between 2001 and 2015. This paper also conducts tests to explore the mediating effects of financial reporting quality, firm performance and the risk of reporting problems, on the relation between audit committee ownership and cost of equity capital. Findings - The analyses reveal that audit committee ownership reduces the firm's cost of equity and, thereby, support the incentive alignment view. However, the association is driven primarily by audit committee equity ownership, with option holdings having an insignificant effect. This paper also finds that firm performance mediates the association between audit committee ownership and the cost of equity capital. Practical implications - Findings of the existing corporate governance research relating to the cost of equity capital and audit committee ownership remain sparse in the context of comply-or-explain types of regulatory environment, like that of Australia. The findings indicate that principle-based discretionary governance arrangements, e.g. compensating audit committee members with company equity, may bring benefits to firms in terms of cheaper financing. Regulators, scholars and practitioners are invited to consider further the comprehensive implications of the structure and transparency of audit committee incentives on the effective functioning of security markets. Originality/value - The effects of audit committee ownership on the cost of equity capital are an issue of direct economic consequence for equity investors. The main finding of this study, namely, that a firm with higher audit committee share ownership is likely to benefit from a lower cost of equity capital, therefore adds value to the limited extant literature.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ae3339689c41f82d97dcdb84f3cf724",
  "timestamp": "2025-05-15T03:25:54.660112"
}