{
  "id": 5901,
  "title": "Reflective Functioning and Financial Exploitation Vulnerability in Older Adults: The Importance of Significant Others",
  "abstract": "ObjectivesFinancial exploitation of older adults results in devastating economic, social, and psychological losses to older adults, their families, and society at large. This study examined the relationship between reflective functioning and financial exploitation vulnerability (FEV) and whether relationship status moderated the association.MethodsA community-based sample of 156 Israeli older adults age 60 and over responded to demographic questions and questionnaires assessing reflective functioning and FEV.ResultsA hierarchical linear regression analysis covarying for age, sex, education, income, and sum of illnesses, revealed that higher reflective functioning was associated with lower FEV (p = .011). A main effect of relationship status was not found, but a significant interaction of reflective functioning x relationship status was discovered (p = .008), adding 4.2% to the total variance of the model. Probing the interaction revealed that the reflective functioning-FEV association was significant only for older adults not in a relationship.ConclusionsFindings suggest that low reflective functioning may be associated with increased risk of financial exploitation, specifically in certain populations of older adults.Clinical ImplicationsCare providers of older adults may consider assessing for, and identifying older adults with low reflective functioning, in order to prevent or intervene in the event of a potentially exploitative situation.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ae4a1405f49d915bf8e671238e3d369",
  "timestamp": "2025-05-15T02:52:31.499441"
}