{
  "id": 1893,
  "title": "Study on commercial bank off-site regulation based on GSOM clustering method",
  "abstract": "Bank is an important part of financial system, which plays an important role in changing save to investment and in payment. So every country takes great supervision and regulation on bank both in developed country and developing country. There are two kinds of regulation ways: on-site regulation and off-site regulation. On-site regulation is a method that needs regulators go to the bank spot themselves. It is indispensably, but it is a way wasting cost and time. While off-site regulation use the data submitted to the regulator by bank for checking bank's risk. As the development of computer and network, off-site regulation is becoming a useful way for regulation. Compared with on-site regulation, off-site regulation is a continuous and forward regulation method. How to identifying the bad bank which has more risk from good bank and risk early-warning is the work of off-site regulation. Clustering is a way of recognition bad bank. SOM (Self-organizing Feature Map) is a useful tool for clustering. It is used widely in many fields for clustering objects into some class, such as management, finance, and etc. In real regulating process, some data may be a fuzz number or a grey number. For example, if the regulator wants to know the capital adequacy ratio of a bank between January and June, the ratio may be change from 7.5 to 8.2. Considered elements of input node and weight vector of SOM are interval grey numbers in SOM, in this paper, normalized these interval grey numbers, defined the interval grey number Euclidean distance, and proposed GSOM (Grey SOM) model which can solve uncertain problems efficiently. In the end, we studied intelligent clustering of commercial bank off-site regulation empirically using this model. The result showed that: compared with traditional SOM model, GSOM is easy for programming, has a strengthened ability of anti-interference and a higher precision of classification.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9aec49d71b3756fb5a1ecfdf7487ec90",
  "timestamp": "2025-05-15T02:08:39.059603"
}