{
  "id": 7308,
  "title": "Paternal depression during pregnancy and postpartum: An international Delphi study",
  "abstract": "Background: Fathers are at risk for depression during a mother's gestation and postpartum. Assessment, detection, and treatment are hampered by the lack of consensus on this issue. The purpose of this study was to reach expert consensus through the Delphi method on the defining factors of depression in peripartum fathers. Methods: Purposive sampling resulted in the surveying of 14 international expert panelists. The study used a modified Delphi approach in which experts participated in two rounds of open-ended and scale questionnaires, followed by two rounds of opportunities to adjust their responses and/or comment on evolving data until consensus was achieved. Results: Experts responded to 10 questions on terminology, diagnostics, symptomology, risk/protective factors, biological factors, assessment tools/protocol, cost implications, and key stakeholders. Of these 10 questions presented for discussion, the analysis resulted in 197 coded themes. Consensus was met for 119 of the 197 coded responses (60.41%). Limitations: Diversity of opinion within this Delphi Study was excluded for the sake of consensus. Regression to the mean may have occurred after continuous surveying and when evolving results were shared with panelists. Critics of Delphi methodologies have pointed to the issue of small expert samples typically used and the subjectivity of expert. Conclusion: Consensus identified diagnostic criteria and symptomology that differentiates the paternal experience of peripartum depression. Experts indicated the importance of a father's social context, biological risk factors, limitations of current assessment tools, key stakeholders, and potential financial costs. Stakeholders on this issue would benefit from translating consensus into assessment and treatment. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9aecd45298760cdaf6e343bfa826962a",
  "timestamp": "2025-05-15T03:07:02.710790"
}