{
  "id": 6603,
  "title": "Economic burden of maintenance hemodialysis patients' families in Nanchong and its influencing factors",
  "abstract": "Background: Maintenance hemodialysis is the main therapy for clinical treatment of end-stage renal disease (ESRD). The aim of this study was to analyze the current status of the economic burden levied on families with members who are maintenance hemodialysis patients in Nanchong, and the related influencing factors. Methods: A total of 111 patients with ESRD who were admitted to our hospital from April 2018 to April 2020 and treated with maintenance hemodialysis were selected as research subjects. A questionnaire survey was adopted as a data collection and interview method to observe the economic burden of families with a member who was a maintenance hemodialysis patient. Logistic regression analysis was used to analyze the independent risk factors that affect this economic burden. Results: The direct economic burden, indirect economic burden, and average annual total economic burden (the sum of the direct economic burden and indirect economic burden of hemodialysis patients) of patients in the resident medical insurance group were significantly higher than those in the employee medical insurance group, resident medical insurance + poverty relief group, and employee medical insurance + poverty relief group (P<0.05). The analysis of the unconditional multifactor logistic regression model showed that age, occupation, monthly family income, and medical insurance type were independent risk factors that affected the average annual total economic burden of patients with maintenance hemodialysis (P<0.01). Conclusions: Various medical insurance systems can effectively reduce the economic burden of hemodialysis patients, but patients must still bear significant financial hardship. It is necessary to further improve the medical insurance for patients with hemodialysis and increase management efforts to popularize the poverty relief policy.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9af1d98557a375bee910d5a8e3f3a03c",
  "timestamp": "2025-05-15T02:59:37.088802"
}