{
  "id": 650,
  "title": "Risk Assessment of Biological Asset Mortgage Loans of China's New Agricultural Business Entities",
  "abstract": "The large-scale proliferation of China's new type of agricultural entities has given rise to a higher demand for funds. Farmers have insufficient effective collateral, which makes it difficult for them to obtain sufficient loans. Chinese financial institutions have developed a biological asset mortgage loan business to cope with this situation. China has not considered biological mortgages but has been using real estate and asset mortgage models with strong realizability. This innovative financial business has achieved positive results since it was attempted, but it also faces many risks. It is very important to comprehensively and accurately consider the risk factors of biological asset mortgage loans. Based on 1249 production and operation data samples of new agricultural entities in Zhejiang, Henan, and Shandong provinces, this study constructs an XGBoost model for empirical analysis and compares it with logical regression, support vector machine, and random forest algorithms to obtain the optimal model and feature importance value. According to the characteristic importance value, a biological asset mortgage loan risk assessment system with 4 primary indicators and 20 secondary indicators is established, which can effectively identify the biological asset mortgage loan risk of new agricultural entities.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9af5eab75a3f67f910978f3e7c4dcc6f",
  "timestamp": "2025-05-15T01:53:24.931907"
}