{
  "id": 8224,
  "title": "The supply of dentists and access to care in rural Kansas",
  "abstract": "Context: Rural deficits in dental care and oral health are well documented and are typically attributed to the low number of dentists practicing in rural areas, but the relationships between rural residence, dental supply, and access to care have not been firmly established, impeding the development of effective public policy. Purpose: The purpose of this study is to develop a conceptual framework for observed variations in dental supply, oral health, and access to dental care in rural versus nonrural areas, and to test key empirical implications of this framework (eg, whether lower levels of utilization are associated with the lack of dentists and/or other aspects of residence in a rural area). Methods: This study employs descriptive statistics, bivariate analyses, and multiple logistic regression to describe the relationship between oral health, access to care, and the supply of dentists in rural versus nonrural populations. Data analyzed includes Kansas' dental licensure records and the 2002 Behavioral Risk Factor Surveillance System. Findings: Bivariate results confirm that dental supply, access to care, and oral health are lower for populations living in rural areas. Multivariate models indicate that dentist supply has a positive and independent association with utilization, but that rurality is not associated with utilization and oral health after controlling for demographics and dentist supply. Conclusions: Findings are consistent with a conceptual framework linking the geography of rural residence, individual preferences for services such as dental care, and the financial disincentives for dentists to locate in rural areas.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b07803efdc088dd91447c566a9bca11",
  "timestamp": "2025-05-15T03:16:48.866028"
}