{
  "id": 8144,
  "title": "Dynamic changes in medication burden leading to fall and hospital readmissions in older adults: Toward a strategy for improving risk and managing costs",
  "abstract": "The majority of a health plan's performance and designated Star Rating is related to medication-related behavior, eg, medication adherence, medication review, and reconciliation, that are intricately related to adverse drug events (ADEs). Altered pharmacodynamics and pharmacokinetics owing to aging make older adults more vulnerable to ADEs like falls, fractures, hospitalizations, and mortality. Prevention of avoidable risk factors such as medication burden can help maintain quality of life. Studies of multiple populations have established drug burden index (DBI), a dose-dependent measure of anticholinergic and sedative burden, to be strongly associated with worsening vertigo, dizziness, and balance, which all predicate falls. The mean difference in DBI greater than 0.1 provides greater predictive power for adverse events, such as falls and 30-day readmission rates. Inclusion of a DBI delta metric especially on an electronic medical record has the potential to reduce fall incidence and associated health outcomes such as hospitalizations and death; this presents an opportunity to improve Centers for Medicare & Medicaid Services Star Ratings by using meaningful tools to foster engagement among informed and active Medicare beneficiaries. We believe this information is extremely relevant in real-world decision-making for health care professionals, specifically when the changes are dynamic and happen very quickly. Moreover, managed care organizations are now dedicated to eliciting a deeper understanding and mitigation of social inequalities in medication use and consequences. Among the proposed solutions includes tailoring prescription utilization management tools with DBI to decrease avoidable incidences of complications and unintended costs. Understanding the dynamic relationship between medication exposures causing ADEs and associated health care utilization and costs to third-party payments remains vital because in the United States, approximately one-third of hospital admissions in older adults occur because of ADEs. This can be achieved by emphasizing equitable therapy and tailoring quality initiatives that minimize racial disparities and avoidable costs that affect the financial burden of these patients. Importantly, this approach becomes even more critical as health care systems increasingly emphasize star ratings, which reflect the quality of care delivered to patients. By prioritizing DBI metrics in these ratings, we can ensure that care is not only clinically effective but also equitable and focused on improving patients' overall well-being. Lastly, as the future directions, the timely application of advanced technologies like artificial intelligence and machine learning in analyzing DBI metrics could enhance our ability to predict the value of DBI adjustments and their correlation with falls and other unintended ADEs. These real-world technologies can process vast amounts of data quickly and accurately, identifying patterns and potential risks that might otherwise go unnoticed.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b0da4bd6966b63ebbb1a4698751ca95",
  "timestamp": "2025-05-15T03:15:38.430257"
}