{
  "id": 6443,
  "title": "Excess Google Searches for Child Abuse and Intimate Partner Violence During the COVID-19 Pandemic: Infoveillance Approach",
  "abstract": "Background: The COVID-19 pandemic has created environments with increased risk factors for household violence, such as unemployment and financial uncertainty. At the same time, it led to the introduction of policies to mitigate financial uncertainty. Further, it hindered traditional measurements of household violence. Objective: Using an infoveillance approach, our goal was to determine if there were excess Google searches related to exposure to child abuse, intimate partner violence (IPV), and child-witnessed IPV during the COVID-19 pandemic and if any excesses are temporally related to shelter-in-place and economic policies. Methods: Data on relative search volume for each violence measure was extracted using the Google Health Trends application programming interface for each week from 2017 to 2020 for the United States. Using linear regression with restricted cubic splines, we analyzed data from 2017 to 2019 to characterize the seasonal variation shared across prepandemic years. Parameters from prepandemic years were used to predict the expected number of Google searches and 95% prediction intervals (PI) for each week in 2020. Weeks with searches above the upper bound of the PI are in excess of the model's prediction. Results: Relative search volume for exposure to child abuse was greater than expected in 2020, with 19% (10/52) of the weeks falling above the upper bound of the PI. These excesses in searches began a month after the Pandemic Unemployment Compensation program ended. Relative search volume was also heightened in 2020 for child-witnessed IPV, with 33% (17/52) of the weeks falling above the upper bound of the PI. This increase occurred after the introduction of shelter-in-place policies. Conclusions: Social and financial disruptions, which are common consequences of major disasters such as the COVID-19 pandemic, may increase risks for child abuse and child-witnessed IPV.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b0f0f935e866d9d61798af37af338ac",
  "timestamp": "2025-05-15T02:58:05.731478"
}