{
  "id": 888,
  "title": "Utilizing Machine Learning Techniques to Reveal VAT Compliance Violations in Accounting Data",
  "abstract": "In recent years, compliance management has gained more and more interest from a practice and research point of view. The financial service industry, in general, is strongly regulated and has to follow specific laws, standards and guidelines. However, research has shown that little attention is being paid to Value Added Tax (VAT) issues, although there is a high cost and risk exposure, especially in large international companies which use large IT-Infrastructures for tax handling. In this paper, we examine a commonly applied approach for the verification of VAT regulations within Enterprise Resource Planning systems (ERP) and highlight weaknesses as well as error susceptibilities. Furthermore, we show that machine learning techniques can be utilized to minimize risks and increase VAT compliance. We use a supervised learning classifier to predict tax subjects and corresponding tax rates based on related voucher information of journal reports. By comparing the results of our model with the existing rule-based system of an ERP system, we reveal potential anomalies and compliance issues. Our approach was evaluated on a given real-world data set of a leading chemical industry company that was exported from its ERP system. The results were validated by VAT experts of the company.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b16e81d61c7c085c9463e25b8709d90",
  "timestamp": "2025-05-15T01:56:17.543847"
}