{
  "id": 3717,
  "title": "Flickering in Information Spreading Precedes Critical Transitions in Financial Markets",
  "abstract": "As many complex dynamical systems, financial markets exhibit sudden changes or tipping points that can turn into systemic risk. This paper aims at building and validating a new class of early warning signals of critical transitions. We base our analysis on information spreading patterns in dynamic temporal networks, where nodes are connected by short-term causality. Before a tipping point occurs, we observe flickering in information spreading, as measured by clustering coefficients. Nodes rapidly switch between being in and being out the information diffusion process. Concurrently, stock markets start to desynchronize. To capture these features, we build two early warning indicators based on the number of regime switches, and on the time between two switches. We divide our data into two sub-samples. Over the first one, using receiver operating curve, we show that we are able to detect a tipping point about one year before it occurs. For instance, our empirical model perfectly predicts the Global Financial Crisis. Over the second sub-sample, used as a robustness check, our two statistical metrics also capture, to a large extent, the 2016 financial turmoil. Our results suggest that our indicators have informational content about a future tipping point, and have therefore strong policy implications.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b17013dc2f459f32a667d28c53011db",
  "timestamp": "2025-05-15T02:29:27.938685"
}