{
  "id": 5994,
  "title": "Developing the narrative risk disclosure measurement",
  "abstract": "This study adopts the pre-modern view of risk as losses only and proposes a new definition of corporate risk disclosure. The new definition is used to formulate new risk-related keywords to develop the process of measuring the risk disclosure score. The theoretical part of this study reviews the different methods of measuring narrative disclosure in literature, discusses five arguments on why risk should be defined as losses only, and proposes a new definition of risk disclosure. The empirical part conducts two tests on a sample of 150 annual reports of UK firms during 2005-2015, formulates new keywords lists, measures RD score from different perspectives, and run correlation and regression analyses for 328 non-financial FTSE All-Share listed firms during 2005-2016, the effect of RD was examined on cost of debt and market firm value one year ahead. The first empirical test shows that about 94% of risk information in annual reports is talking about risk from a negative perspective and negative outcomes only. The second test shows that 87% of the risk-related sentences in the annual reports discussing risks using negative keywords. The descriptive statistics show that the risk disclosure level is increasing across years during 2005-2015 and the utilities industry reports the highest level. The study concludes that the pre-modern view of risk should be adopted. This study contributes to the ongoing debate on the risk definition and whether the positive outcomes of events should be included in the risk disclosure definition. Moreover, the study proposes a new definition of risk disclosure and provides theoretical and empirical evidence on why the pre-modern view of risk should be adopted. Moreover, new risk-related keywords are used for the first time in the risk disclosure literature.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b386d4defb0170a032a0bc2ddba5342",
  "timestamp": "2025-05-15T02:53:33.451174"
}