{
  "id": 5303,
  "title": "Audit fees under the COVID-19 pandemic: evidence from Oman",
  "abstract": "Purpose The worldwide spread of the coronavirus disease 2019 (COVID-19) has significant effects on financial markets and companies, causing an unprecedented level of uncertainty in reporting and auditing companies' financial statements. This study explores whether and how COVID-19 affects audit fees. Design/methodology/approach Using a sample of 268 firm-year observations from the Omani capital market between 2017 and 2020, the ordinary least squares (OLS) regression with a robust standard error is applied to answer the research question of this study. Findings The authors find that the pandemic has a significant and positive association with audit fees and abnormal audit fees. This finding suggests that the threat of risk, complexity and legal liability circumstances resulting from the pandemic can be compensated by charging higher audit fees. In addition, the authors provide evidence that Big4 audit firms are those most responding to COVID-19 by charging higher audit fees. Finally, the authors conclude that large companies are less sensitive to the pandemic. Practical implications Users of financial reports and audit firms should anticipate changes in the audit efforts resulting in increased audit fees during COVID-19. Thus, this paper may guide practitioners and businesses in determining the audit fees and associated costs of any potential pandemic. Originality/value The study results are among the earliest empirical insights into the effect of COVID-19 on audit fees in Oman.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b39e62294411ffe4ed5b574daa204f3",
  "timestamp": "2025-05-15T02:46:16.278141"
}