{
  "id": 7623,
  "title": "Analysis of the Relationship between Destocking Pressure and Economic Benefitsof Industrial Enterprises",
  "abstract": "Enterprise destocking is an important decision of the Party Central Committee since 2015. It forces enterprises to dock with the effective demand of the market. Whether the enterprises have achieved good economic benefits after going to destock is the focus of this paper. Taking Jiangsu Province as an example, the paper quantifies the destocking pressure index by literature focusing and investigation, collects 2011-2017 years economic data of Industrial Enterprises above the scale of Jiangsu Province, and uses regression analysis to carry outdemonstration analysis. The conclusion is as follows: In Jiangsu, the destocking of industrial enterprises has reduced the occupation of inventory fund, quickened the speed of inventory turnover and increased the economic benefits, which is 2.9 times that of reducing the occupancy of inventory fund. The external pressure index of industrial enterprises destocking has increased by 1%, and the economic benefit of the enterprise is reduced by 0.03%. This kind of painful behavior will turn to the motive force of the future development, but it is necessary to prevent the financial risk caused by the transition behavior such as low price dumping. The state should guide the healthy development of enterprises in accordance with the law of inventory cycle.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b41c966d0120f6e8956cad8736d46e7",
  "timestamp": "2025-05-15T03:10:32.985218"
}