{
  "id": 8808,
  "title": "Persistence with secondary prevention medications after acute myocardial infarction: Insights from the TRANSLATE-ACS study",
  "abstract": "Background Persistent use of secondary prevention therapies after acute myocardial infarction (MI) is critical to optimizing long-term outcomes. Methods Medication persistence was assessed among 7,955 MI patients in 216 hospitals participating in the Treatment with Adenosine Diphosphate Receptor Inhibitors: Longitudinal Assessment of Treatment Patterns and Events after Acute Coronary Syndrome study from 2010 to 2012. Persistence was defined as continuation of aspirin, adenosine diphosphate receptor inhibitors, beta-blockers, angiotensin-converting enzyme inhibitors/angiotensin receptor blockers, and statins from discharge to 6 months post-MI. Multivariable logistic regression modeling was used to determine factors associated with nonpersistence, defined as <80% persistence with all medication classes. Results Overall, 31% of MI patients stopped taking a least 1 medication by 6 months. The most common reasons cited for medications discontinuation were side effects and physician instruction (57%), whereas financial concerns were cited in 8% overall. After multivariable modeling, black race (odds ratio 1.36, 95% CI 1.15-1.62), older age (odds ratio 1.07, 95% CI 1.02-1.12), atrial fibrillation (odds ratio 1.67, 95% CI 1.33-2.09), dialysis (odds ratio 1.79, 95% CI 1.15-2.78), and depression (odds ratio 1.22, 95% CI 1.02-1.45) were associated with lower likelihood of persistence. Private insurance (odds ratio 0.85, 95% 0.76-0.95), prescription cost assistance (odds ratio 0.63, 95% CI 0.54-0.75), and outpatient follow-up arranged before discharge (odds ratio 0.89, 95% CI 0.80-0.99) were associated with higher persistence. Conclusions Nearly one-third of MI patients are no longer persistent with their prescribed medications by 6 months. Patients at high risk for nonpersistence may be identified by clinical and sociodemographic features. These observations underscore key opportunities to optimize longitudinal use of secondary prevention therapies.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b4b0eaaa1e790c796bbbcf759afd742",
  "timestamp": "2025-05-15T03:22:26.124086"
}