{
  "id": 908,
  "title": "Non-pharmacological interventions for primary hypertension: a systematic review and network meta-analysis protocol",
  "abstract": "Introduction Primary hypertension (PH) affects over one billion individuals globally, yet less than 30% achieve controlled blood pressure (BP) with medication. Many patients require a combination of multiple medications to reach targets, but adverse effects and financial burdens undermine adherence. Additionally, prehypertension affects 25%-50% of adults, increasing the risk of cardiovascular complications. Early detection and management of prehypertension are crucial for delaying the need for pharmacological interventions. In recent years, clinical guidelines have increasingly emphasised non-pharmacological interventions for PH management. However, the diversity of non-pharmacological therapies and the inconsistencies in efficacy challenge clinical decision-making. This study aims to use network meta-analysis (NMA) to synthesise existing evidence on non-pharmacological interventions for PH, offering updated clinical insights and evidence-based support to optimise treatment strategies. It will also provide recommendations for integrating these interventions into community-based chronic disease management.Methods and analysis To identify potentially relevant randomised controlled trials, a reverse search strategy will be employed to ascertain all non-pharmacological interventions for PH. A well-constructed search strategy will be applied across nine academic databases (Web of Science, Embase, PubMed, PsycINFO, CENTRAL, AMED, CNKI, WF and VIP database) and three clinical trial registries (WHO ICTRP, ClinicalTrials.gov and ChiCTR) for studies conducted between 1 January 2014 and 1 August 2024. Two investigators will independently extract information from eligible articles and document reasons for exclusions. The primary outcomes will encompass changes in systolic and diastolic BP. Pairwise and Bayesian NMA will be conducted using 'meta' and 'GeMTC' package (R 4.4.1). Risk of bias will be assessed using the Risk of Bias 2 tool, and the quality of evidence will be evaluated according to the Grading of Recommendations, Assessment, Development and Evaluation approach.Ethics and dissemination As this review involves secondary analysis of previously published data, ethical approval is not required. The results will be published in peer-reviewed journals.PROSPERO registration number CRD42023451073.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b51d2c7b5399b04e38d4c4c777715ed",
  "timestamp": "2025-05-15T01:43:54.717743"
}