{
  "id": 3630,
  "title": "Do corporate social responsibility reduce crash risk of stock price: evidence from China",
  "abstract": "Purpose The 2008 global financial crisis stimulated the research interest in stock price crash risk. However, the determinants of stock price crash risk remain unclear, especially in transitional economies. The purpose of this paper is to investigate the association between corporate social responsibility (CSR) and stock price crash risk, as well as the moderating effects under different contexts. Design/methodology/approach Using firm-level data of listed firms in China from 2010 to 2019, this paper estimates with correlation analysis and multiple regression analysis. Findings This paper's empirical results show that the constraint of CSR on bad news hoarding behavior can reduce stock price crash risk. Further research shows that internal CSR has a significant effect on crash risks, while external CSR has not. Additionally, CSR has a relatively weak impact on crash risk in state-owned enterprises, enterprises with higher internal control quality and enterprises with better regional financial development. Originality/value This paper contributes to the stock price crash risks literature by examining the CSR-stock price crash risk linkage in a Chinese context, revealing collective explanations under different contexts with important implications for the application of CSR in business practice.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b558a25ddc2897a09a3a1e9d5c8ce2b",
  "timestamp": "2025-05-15T02:28:29.308639"
}