{
  "id": 2371,
  "title": "A user-centric quantum benchmarking test suite and evaluation framework",
  "abstract": "This article proposes a benchmark testing set and evaluation system for quantum computers. Our tests do not focus on the topology of quantum computers or the specific implementation details of preparing quantum bits. Instead, we examine the overall performance of quantum computers from the perspective of users. Inspired by traditional computer benchmark tests such as SPECCPU2017, we integrate existing scalable quantum applications and algorithms to generate a testing set that covers algorithms such as search, machine learning, factorization, portfolio optimization, and entanglement state preparation, effectively simulating real workloads. By running the testing set, we can understand the performance of current quantum computers and generate a comprehensive score by combining our evaluation system, which consists of sub-scores of various backend features, including quantum gate error rate, entanglement between quantum bits, cross talk, and connectivity. These sub-scores are calculated based on the program features of the testing cases combined with their running results, where the program features are analyzed through the logical circuits of the testing cases. We incorporate Hellinger fidelity and polarization rescaling into each benchmark to calculate the fidelity of the running results. Through our evaluation system, researchers can be guided toward research directions and understand how far quantum computers are from solving practical problems.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b9147665c4989cad78e09c49c03414b",
  "timestamp": "2025-05-15T01:06:10.764158"
}