{
  "id": 3513,
  "title": "Micro- and Macro-Level Factors Determining Financial Performance of UAE Insurance Companies",
  "abstract": "The research aims to analyze the firm-specific and macroeconomic factors that affect insurance company's financial performance. The research explores the variables that influence the financial performance of the United Arab Emirates (UAE)' insurance companies. The analysis for determining financial performance considers the following variables: the firm's age, retention ratio, capital adequacy, underwriting risk/loss ratio, financial-leverage, reinsurance dependency, and macro-economic factors such as GDP per capita, inflation rate considered as independent factors. The return-on-asset (ROA) is the key measuring indicator; it is regarded as the dependent variable for financial performance measures. The research focuses on secondary information obtained from insurance companies' financial statements. The researcher targeted 18 insurance companies listed on the UAE stock exchanges for study purposes. The research examines the overall factors that influence the financial performance of an insurance company. For analysis of data, software package of social sciences (SPSS version 20) is used. The studies used correlation and multiple linear regression analysis to determine financial performance and their effects. The analysis suggests that there are important and constructive relationships between the size, capital adequacy, and reinsurance dependency, while loss ratio, retention ratio, and financial leverage indicate a major negative relationship. And there's no link between GDP per capita and inflation.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b97071ccef1f21e09ac141ae8d82c1e",
  "timestamp": "2025-05-15T02:27:19.035598"
}