{
  "id": 2669,
  "title": "The Effect of Lender's Protection on Online Peer-to-Peer Lending in Indonesia",
  "abstract": "This study aims to analyze how lender protection for default risk provided by peer to peer lending platform (P2P) effect to prospective lenders' lending intentions in Indonesia, and use platform trust as the mediating variable. We collected and summarized protection terms provided by P2P platform through examined 17 platforms websites and interview two platforms' management. We also survey 303 respondents accessed through online questionnaire. Analysis of this study used Path Analysis of Structural Equation Model (SEM) method run with LISREL software. Respondents are prospective lenders who familiar with P2P Lending concept and some of them are real lenders. We found that there are several policy perceived as protection for lenders, such as having SLIK checking, using machine learning technology to record and analyze loan, joining in international forums related to credit risk management and collaborate with financing company to overcome the risk of shortage fund. We also found that the peer to peer lending platform should be able to build lender trust by making lenders feel protected to invest on the platform despite the possibility of default risk. We suggest that Financial Services Authority (called OJK) may create protection policies to protect lenders in the market like Indonesian Securities Protection Fund (ISPF).",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b9e5b4f15dc483da4f4103f217ce57e",
  "timestamp": "2025-05-15T02:18:06.132795"
}