{
  "id": 6291,
  "title": "Risk factors for the use of prescription antibiotics on UK broiler farms",
  "abstract": "Objectives: Despite growing concerns about the emergence of antibiotic-resistant strains of bacteria, little work has been carried out to investigate reasons for prescription antibiotic use in UK farming systems. We carried out a nationwide survey of broiler farms to determine risk factors for the use of prescription antibiotics. Methods: A cross-sectional questionnaire-based survey of UK broiler farms was undertaken covering flock placement dates from July 2002 until July 2003 and was based on information concerning 54% of the national broiler population reared on 497 farms. Data were collected on all aspects of broiler production and multivariable logistic regression analyses were performed to determine risk factors for two dependent variables; therapeutic and preventive use of antibiotics. Results: The major indications for the use of antibiotics for therapeutic purposes were enteric and respiratory disease, the strongest association being with the occurrence of necrotic enteritis. No direct association was found between the use of antibiotics for preventive purposes and disease. Multivariable logistic regression analysis indicated that the main drivers for the use of antibiotics for disease prevention may be poultry company disease prevention policies and farm management practices. Conclusions: With increasing restrictions on the use of antibiotics in food-producing animals, research efforts need to be focused on the epidemiology of enteric and respiratory disease in poultry. The cost of disease to the broiler industry is great, resulting in the use of antibiotics for preventive purposes to safeguard against large financial losses. More research into alternative disease control measures is required.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9b9e0caf9e18a98cef66f0fb27bd7ed1",
  "timestamp": "2025-05-15T02:56:37.495972"
}