{
  "id": 6373,
  "title": "State Policies, Racial Disparities, and Income Support: A Way to Address Infant Outcomes and the Persistent Black-White Gap",
  "abstract": "Low birth weight and preterm births vary by state, and Black mothers typically face twice the risk that their white counterparts do. This gap reflects an accumulation of psychosocial and material exposures that include interpersonal racism, differential experience with area-level deprivation such as residential segregation, and other harmful exposures that the authors refer to as institutional or structural racism. The authors use logistic regression models and a dataset that includes all births from 1994 to 2017 as well as five state policies from this period-Aid to Families with Dependent Children/Temporary Aid for Needy Families, housing assistance, Medicaid, minimum wage, and the earned income tax credit (EITC)-to examine whether these state social policies, designed to provide a financial safety net, are associated with risk reduction of low birth weight and preterm birth to Black and white mothers, and whether variations in state generosity attenuate the racial inequalities in birth outcomes. The authors also examine whether the relationship between state policies and racial inequalities in birth outcomes is moderated by the education level of the mother. We find that the EITC reduces the risk of low birth weight and preterm birth for Black mothers. The impact is much less consistent for white mothers. For both Black and white mothers, the benefits to birth outcomes are larger for mothers with less education.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9bbf04e34a04755ae15f1eec87f47199",
  "timestamp": "2025-05-15T02:57:38.702188"
}