{
  "id": 2690,
  "title": "Monetary spillovers and real exchange rate misalignments in emerging markets",
  "abstract": "Purpose After the adoption of unconventional monetary policies (UMPs) in advanced economies (AEs) there were many studies of monetary spillovers to asset prices in emerging market economies (EMEs) but the extent of contribution of EMEs and AEs, respectively, in real exchange rate (RER) misalignments has not been addressed. This paper addresses the gap in a cross-country panel set-up with country specific controls. Design/methodology/approach Fixed effects, pooled mean group (Pesaranet al., 1999) and common correlated effects (Pesaran, 2006) estimations are used to examine the relationship. Multiway clustering is taken into account to ensure robust statistical inferences. Findings Robust evidence is found for significant monetary spillovers over 1998-2017 in the form of RER overvaluation of EMEs against AEs, especially through the portfolio rebalancing channel. EME RER against the US saw significantly more overvaluation in UMP years indicating greater role of the US in monetary spillovers. However, in the long-run monetary neutrality holds. EMEs did pursue mercantilist and precautionary policies that undervalued their RERs. Precautionary undervaluation is more evident with bilateral EME US RER. Research limitations/implications It may be useful for large EMEs to monitor the impact of foreign portfolio flows on short-run deviations in RER. Export diversification reduces EME mercantilist motives against the US. That AE monetary policy significantly appreciates EME RER has implications for future policy cooperation between EMEs and AEs. Originality/value To the best of the author's knowledge such a comparative analysis between AE and EME policy variables on RER misalignment has not been done previously.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9bc186e1e82fb740b99272e298726692",
  "timestamp": "2025-05-15T01:09:43.285739"
}