{
  "id": 8131,
  "title": "Revision total hip arthroplasty for periprosthetic fracture: epidemiology, outcomes, and factors associated with success",
  "abstract": "The aging population and the increasing number of patients with primary total hip arthroplasties (THA) has equated to an increased incidence of periprosthetic fractures (PPF) of the hip. These injuries are a significant source of patient morbidity and mortality, placing a financial burden on healthcare systems worldwide. As the volume of PPF is expected to along with the growing volume of primary and revision THA, it is important to understand the outcomes and factors associated with treatment success. The choice of procedure is in large part guided by the help of the Vancouver Classification system, which is a valid and reproducible system that classifies fractures based on several factors including site of fracture, implant stability and bone stock. PPFs account for approximately 18% of revision THA (rTHA) procedures. rTHA for PPFs is commonly indicated in Vancouver B2 and B3 fractures, to bypass a lack of metaphyseal support with diaphyseal fixation. Such revisions are technically challenging and typically require urgent treatment, with inherent difficulties in patient optimization, leading to a notable rate of post-operative complications, re-revision and mortality. This article reviews epidemiology, health economics and risk factors for PPFs. It additionally reviews outcomes associated with rTHA for PPFs including peri-operative complications, indications for re-operation, rates of re-operation and rates of mortality. Finally, it aims to identify evidencebased factors that have been associated with successful management including modifiable patient-related factors, uncemented vs. cemented stems, stem design ( porous coated stems vs. fluted tapered stems), modularity, dislocation and its impact on outcomes following rTHA and strategies for managing bone loss.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9bc515cfd89b0d39fa0cccabf5edfe09",
  "timestamp": "2025-05-15T03:15:38.384722"
}