{
  "id": 2834,
  "title": "Development of Human Target Validation Classification that Predicts Future Clinical Efficacy",
  "abstract": "Fewer new medicines have become available to patients during the last decades. Clinical efficacy failures in late-phase development have been identified as a common cause of this decline. Improved ways to ensure early selection of the right drug targets when it comes to efficacy is therefore a highly desirable goal. The aim of this work was to develop a strategy to facilitate selection of novel targets already in the discovery phase that later on in clinical development would demonstrate efficacy. A cross-functional team at AstraZeneca with extensive experience in drug discovery and development participated in several workshops to identify the critical elements that contribute to building human target validation [(HTV); the relevance of the target from a human perspective]. The elements were consolidated into a 10-point HTV classification system that was ranked from lowest to highest in terms of perceived impact on future clinical efficacy. Using 50 years of legacy research and development data, the ability of the 10-point HTV classification to predict future clinical efficacy was evaluated. Drug targets were classified as having low, medium, or high HTV at the time of candidate drug selection. Comparing this HTV classification with later clinical development efficacy data showed that HTV classification was highly predictive of future clinical efficacy success. This new strategy for HTV assessment provides a novel approach to early prediction of clinical efficacy and a better understanding of portfolio risk.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9bdc8ee1404d52a5d36f2aebcff4061f",
  "timestamp": "2025-05-15T01:10:49.620525"
}