{
  "id": 67,
  "title": "Operational Risk Prevention and Control Monitoring of Smart Financial System Based on Deep Learning",
  "abstract": "With the development of intelligent financial level, intelligent financial system has been gradually applied to most enterprises. Once there is operational risk in the financial system, it will seriously affect the security and reliability of enterprise finance. Therefore, once the operational risk of the smart finance system is prevented and controlled, it is very necessary. In order to ensure the accuracy and effectiveness of risk prevention and control monitoring of smart financial systems during operation, a deep learning-based operational risk prevention and control monitoring method for smart financial systems is designed. First, establish the corresponding relationship between the roles and operations of the smart financial system, establish an operational risk prevention and control model based on deep learning, design a risk assessment structure tree, and complete operational risk quantification. In order to verify the effectiveness of the design method, a performance comparison experiment was designed. The experimental results show that the accuracy of the test samples finally reached 74.6%, of which 21 risk samples were correctly monitored and prevented, indicating that the designed deep learning-based smart financial system operates Risk prevention and monitoring methods have certain effectiveness.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9bdcc7d7cf3da74dc065300f7fc3a16f",
  "timestamp": "2025-05-15T01:33:48.980206"
}