{
  "id": 2293,
  "title": "Value creation and sustainable business model: are ESG ratings a matter of class?",
  "abstract": "In recent years, sustainable finance has undergone a very consistent expansion boosted by regulatory and cultural changes due to the greater awareness of the positive role of sustainable finance in mitigating the negative externalities of economic activities. In this context, the incorporation of Environmental, Social, and Corporate Governance (ESG) factors into companies' business models represents an incentive to invest in innovation for growth, attract and cultivate young talents, and seek new strategies to reduce business risks. Hence, the adoption of good ESG practices can be the source of long-term competitive advantages. In the scientific literature, numerous studies try to assess whether the risk-return trade-off of sustainable financial products improves with increasing ESG ratings, but the absence of convergence in the empirical results leaves some open issues that need further investigation. The main goal of this work is to contribute to the debate on the assumption of an existing relationship between ESG compliance and the financial performance of companies. Accepting that ESG ratings are a reliable indicator of ESG practices, we aim to verify if ESG ratings do have informative content useful to predict a company's future financial performance in terms of: (i) Return on Equity, (ii) Return on Investments, and (iii) systematic risk. We test our hypothesis by using a machine-learning approach. By analyzing the set of EuroStoXX600 Index companies for the period 2016-2021 via Random Forest and Sliding Windows Random Forest Models, we verify whether the integration of ESG criteria into corporate businesses helps to explain the financial performance of listed companies over time and, thus, to identify a strategic tool for all investors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9be4fccf77bbaa61b91f4b0b49ea2dcf",
  "timestamp": "2025-05-15T02:13:31.858211"
}