{
  "id": 8091,
  "title": "Nine-Year Incidence and Risk Factors for Age-Related Macular Degeneration in a Defined Japanese Population The Hisayama Study",
  "abstract": "Purpose: To estimate the 9-year incidence and risk factors for age-related macular degeneration (AMD) in a general Japanese population. Design: Population-based, cohort study. Participants: In 1998, a total of 1775 Hisayama residents aged >= 40 years underwent a baseline eye examination. Of those, 1401 subjects (78.9%) took part in the follow-up eye examination in 2007 and were enrolled in the present study. Methods: At both time points, the characteristics of AMD were determined by grading color fundus photographs using the Wisconsin Age-Related Maculopathy Grading System. Main Outcome Measures: Incident early and late AMD. Results: The age-standardized, 9-year cumulative incidence of early AMD was 10.0%, and that of late AMD was 1.4%. Men were found to have a significantly higher incidence of late AMD than women (age-adjusted odds ratio [OR], 2.97; 95% confidence interval [CI], 1.25-7.09). The incidence of both early and late AMD increased significantly with age. Multiple logistic regression analysis showed that older age (per 1 year; OR, 1.10; 95% CI, 1.05-1.16), smoking habits (OR, 3.98; 95% CI, 1.07-14.7), and higher circulating white blood cell (WBC) count (per 1000 cells/mm(3)) (OR, 1.38; 95% CI, 1.07-1.79) were significantly associated with the development of late AMD. Conclusions: Our findings suggest that the 9-year incidences of late AMD are lower among the Japanese than among white people in Western countries, and it is higher than among black people. Smoking habits and higher circulating WBC count are significant risk factors for the development of late AMD in the Japanese. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2009; 116:2135-2140 (C) 2009 by the American Academy of Ophthalmology.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c0284a7d1570ad530b65ed42b89f8cf",
  "timestamp": "2025-05-15T03:15:09.383557"
}