{
  "id": 6269,
  "title": "Determinants of Dividend Payout Policy: More Evidence From Emerging Markets of G20 Bloc",
  "abstract": "The purpose of this article is to examine the key factors influencing dividend payout policy in emerging markets, using a quantitative approach with a sample of 938 firms and 19,698 firm-year observations. The study considers dividends, and share repurchases as elements of payout, analysing the effect of earnings, taxes, debt, size and free cash flow on payout decisions through an OLS Panel Data regression model and a GMM-AB model for robustness. Findings indicate that taxes, size and leverage positively influence payout, while free cash flow and earnings show negative associations. Notably, free cash flow exhibits the largest impact on payout variations, supporting asymmetric information theories like bird-in-hand, signalling and dividend life cycle theories, where payout responds to investor risk aversion. The paper's originality lies in its 21-year analysis of 11 emerging economies, identifying that, unlike developed markets where payout is shaped by agency conflicts, emerging markets emphasise reducing investor risk aversion. The findings also challenge existing financial theories by demonstrating a complementary relationship between investment and debt policies, with a negative correlation between cash flow and dividends and a positive one between leverage and dividends.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c0742ae9898dbc97a87e1969b394ccc",
  "timestamp": "2025-05-15T02:56:37.265828"
}