{
  "id": 3798,
  "title": "Are Muslim CEOs pursuing intangible value creation over profitability? International evidence",
  "abstract": "PurposeThis study aims to examine whether Muslim chief executive officers (CEOs) are more inclining toward intangible value creation rather than profit maximization.Design/methodology/approachThis study uses fixed-effect panel regression based on a sample of 25 markets from 2015 to 2019. Propensity score matching (PSM) is applied to reduce endogeneity, supplemented by other robustness tests.FindingsThis study finds a consistent positive relationship between Muslim CEOs and intangible value creation using various econometric approaches, in contrast to the less robust evidence found regarding tangible value creation. Further analysis shows that Muslim CEO duality is not significantly related to either performance outcome. However, adding ownership significantly enhances the effect of CEO duality on intangible value creation. This effect is further strengthened by an independent board of directors, resulting in a higher Tobin's Q.Research limitations/implicationsMuslim CEOs prioritize intangible value creation to benefit a broader range of stakeholders, aligning with Islamic leadership values. The stocks of such firms should be considered sustainable criteria for stock selection in portfolio investment.Originality/valueThis study elucidates the overarching preference of Muslim CEOs for intangible values, extending beyond their propensity for corporate social responsibility found in prior studies.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c0cd741b820562b60f6fabf181a8a5a",
  "timestamp": "2025-05-15T01:21:08.046801"
}