{
  "id": 1629,
  "title": "On the dynamics of credit history and social interaction features, and their impact on creditworthiness assessment performance",
  "abstract": "For more than a half-century, credit risk management has used credit scoring models at each of the well-defined stages of credit risk management. Application scoring is used to decide whether to grant a loan or not, while behavioral scoring is used mainly for portfolio management and to take preventive actions in case of default signals. In both cases, social network data has recently been shown to be valuable to increase the predictive power of these models, especially when the borrower's historical data is scarce or not available. This study aims to understand the dynamics of creditworthiness assessment performance and how it is influenced by credit history, repayment behavior, and social network features. To accomplish this, we build up a machine learning classification framework demonstrating its value analyzing 97,000 individuals and companies from the moment they obtained their first loan up to 12 months afterward. Our original and massive dataset allowed us to characterize each borrower according to its credit behavior, and socioeconomic relationships. Our study finds that credit scoring based on borrowers' history improves performance at a decreasing rate during the first six months and then stabilizes. The most notable effect on the performance of credit scoring based on social network features occurs in loan applications; for personal scoring, this effect prevails for approximately six months, while for business scoring, social network features add value throughout the entire study period. These findings are of great value to improve credit risk management and optimize the combined use of both the traditionally exploited information and new alternative data sources.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c1a887b7eb2112115fd9e4bb60cbddc",
  "timestamp": "2025-05-15T00:57:46.909553"
}