{
  "id": 5017,
  "title": "Contribution of veterans' initial post-separation vocational, financial, and social experiences to their suicidal ideation trajectories following military service",
  "abstract": "BackgroundVeterans' success with navigating the challenges of transition from military service may contribute to their risk for suicidal outcomes. The concept of well-being can help to conceptualize and assess successful navigation of reintegration challenges and may serve as an optimal target for public health-oriented suicide prevention. MethodsThe relationship between US veterans' psychosocial well-being and experiences of suicidal ideation (SI) during the first 3 years following military separation was evaluated using multinomial logistic regression predicting SI trajectories over time in a population-based, longitudinal, post-9/11 veteran cohort. At 3-months post-separation, veterans reported on their socio-material conditions, functioning, and satisfaction with respect to vocational, financial, and social domains. SI frequency was assessed at 3-, 9-, 15-, 21-, and 27-months post-separation using the Patient Health Questionnaire-9. ResultsVeterans' vocational, financial, and social well-being were associated with their SI trajectories, even after accounting for mental health. Socio-material conditions, functioning, and satisfaction all emerged as important predictors of SI trajectories, although results varied across domains. Effects were largest for social well-being. ConclusionsSuicide prevention efforts may benefit from a holistic approach that considers veterans' needs for support across their vocational, financial, and social well-being, inclusive of their socio-material conditions, functioning, and satisfaction within each domain.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c1c523391ae7791db41510e5772660f",
  "timestamp": "2025-05-15T02:43:40.092296"
}