{
  "id": 4216,
  "title": "Environmental Capital: A Classification of Environmental Intangibles from Intellectual Capital",
  "abstract": "Social pressures force firms to assume and face the environmental challenge through the development of new knowledge which can allow them to act following a sustainable development approach in the business environment. This new knowledge, related to environmental resources, practices and processes that firms put in motion is what we call Environmental Capital (EC). EC is often unknown both by the firm itself and by its stakeholders, because traditional environmental information dissemination methods fail to offer a faithful image of the firm. Thus, the need arises to look for alternative instruments that can complement them. A good alternative is represented by intellectual capital models, which offer a classification and, at times, the measurement of the intangible assets owned by the firm. The aim of this paper is to integrate EC into the overall intellectual capital approach. For this purpose, the Intellectus Model is taken as a reference in order to provide a framework from which it could be adaptable to the environmental context. EC would be the result of combining human EC, structural EC, and relational EC. The methodolodogy used is the multiple case study applied to eight Spanish firms belonging to different sectors. The results indicated that, from the point of view of human EC, the firms analysed publish their environmental policy to show the extent to which they are committed to the environment, organise environmental training, information and awareness sessions and often attend seminars, sessions and workshops in order to obtain new knowledge related to this field. For structural EC, all the firms continuously introduce innovations and improvements in their environmental technology portfolio, basically formed by preventive practices; the creation of an environmental department, the appointment of a management representative and the existence of an environmental manager are the options taken by the firms examined. The analysis of relational EC reveals that primary and secondary sectors tend to involve suppliers in the environmental management process, whereas in the service sector, the customer is the most directly involved agent.",
  "year": 2009,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c331ce7fcc07a2607745d460f66606a",
  "timestamp": "2025-05-15T01:24:51.483637"
}