{
  "id": 5216,
  "title": "Does Firm Growth Impede or Expedite Insolvency Risk? A Mediated Moderation Model of Leverage Maturity and Potential Fixed Collaterals",
  "abstract": "Business sustainability is compromised with an increase in insolvency risk. Firm growth is desirable, but it brings an associated bundle of high risks. We decomposed firm growth into internal and external growth and studied its impact on insolvency risk using a panel data set of 284 listed non-financial firms in Pakistan from 2013 to 2017. This study used the hierarchical multiple regression approach through panel corrected standard error (PCSE) and feasible generalized least squares estimators to test the proposed relationships. The results reveal that the leverage maturity ratio mediated the relationship between firm growth and insolvency risk. Moreover, we also collected fresh evidence on the moderating role of potential fixed collaterals that negatively moderated the relationship between leverage maturity and insolvency risk. It points toward the accumulation of non-productive fixed assets that create a burden for firms instead of helping them avail of favorable loan opportunities. The findings of this research suggests that fund managers should use more long term debt to tackle insolvency risk in highly volatile markets. Inclusion of assets that serve as better collaterals should be made part of the asset structure.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c344e79b6f70ff6dfdb0798038075e1",
  "timestamp": "2025-05-15T02:45:47.316301"
}