{
  "id": 963,
  "title": "Early Warning Research on Financial Risks of Listed Companies in Real Estate Industry Based on BP NeuralNetworks",
  "abstract": "In recent years, with the frequent outbreak of financial crisis of Chinese real estate enterprises, the financial risk of real estate industry has become more and more prominent, which has aroused extensive attention from all walks of life. In the face of the complex and changing market environment and potential financial risks, the establishment of an effective financial risk early warning model has become a key initiative for real estate enterprises to prevent and resolve risks. Taking listed real estate companies in 2018-2023 as the research object, this paper establishes a set of comprehensive and accurate financial risk early warning model by constructing an early warning indicator system containing financial and non-financial indicators, and applying BP (back propagation) neural network algorithm in the field of artificial intelligence. The model takes into full consideration of the financial status of real estate enterprises, operational performance, market environment and other factors, and can effectively capture the potential financial risk signals, providing an important basis for enterprise risk management and decision-making. Through empirical research, this paper verifies that the constructed BP neural network financial risk early warning model has good predictive ability and practical application value. The model can accurately identify all kinds of financial risks faced by real estate enterprises, including liquidity risk, debt service risk, profitability risk, etc., which provides scientific guidance for enterprises to adjust their business strategies and optimize resource allocation in time. The research results of this paper provide valuable theoretical references and practical guidance for the prevention and control of financial risks in the real estate industry, and are of great significance to the promotion of the healthy and sustainable development of the real estate industry.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c3c8b38244a712d7b12950efd586e65",
  "timestamp": "2025-05-15T01:57:29.800317"
}