{
  "id": 2597,
  "title": "Financial Strain and Cancer Risk Behaviors among African Americans",
  "abstract": "Background: African Americans suffer disproportionately from the adverse consequences of behavioral risk factors for cancer relative to other ethnic groups. Recent studies have assessed how financial strain might uniquely contribute to engagement in modifiable behavioral risk factors for cancer, but not among African Americans. The current study examined associations between financial strain and modifiable cancer risk factors (smoking, at-risk alcohol use, overweight/obesity, insufficient physical activity, inadequate fruit and vegetable intake, and multiple risk factors) among 1,278 African American adults (age, 46.5 +/- 12.6 years; 77% female) and explored potential mediators (stress and depressive symptoms) of those associations. Methods: Logistic regression models were used to examine associations between financial strain and cancer risk factors. Analyses were adjusted for age, sex, partner status, income, educational level, and employment status. Analyses involving overweight/obesity status additionally controlled for fruit and vegetable intake and physical activity. Nonparametric bootstrapping procedures were used to assess mediation. Results: Greater financial strain was associated with greater odds of insufficient physical activity (P < 0.003) and smoking (P = 0.005) and was positively associated with the total number of cancer risk factors (P < 0.0001). There was a significant indirect effect of both stress and depressive symptoms on the relations of financial strain with physical inactivity and multiple risk factors, respectively. Conclusions: Future interventions aimed at reducing cancer disparities should focus on African Americans experiencing higher financial strain while addressing their stress and depressive symptoms. Impact: Longitudinal studies are needed to assess the temporal and causal relations between financial strain and modifiable behavioral cancer risk factors among African Americans. (C) 2014 AACR.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c5a61473a49ea4353ff30188761541d",
  "timestamp": "2025-05-15T02:17:01.785984"
}