{
  "id": 2214,
  "title": "Analysis of the classification structure of Embrapa's project portfolios: an application of Ranganathan's faceted classification principles",
  "abstract": "This paper discusses the applicability of the principles of Ranganathan faceted classification for activities related to building models of fields of knowledge. We examine the research projects of the Brazilian Agricultural Research Corporation, which are organized in portfolios that comprise the corporation's main fields of operation and that are classified by themes according to strategic goals. We adopt a a qualitative approach and we apply the postulate of categories, proposed by S. R. Ranganathan, to a sample of eleven portfolios (out of 34), which we chose because they linked to the related research projects and because we were able to access and use additional institutional documents related to such projects in our analysis. After categorizing the portfolio into the fundamental categories proposed by Ranganathan, the PMEST categories (Personality, Matter, Energy, Space and Time), we noticted that there was no single guiding principle in the portfolio's classification basis and that different principles coexisted, although this was not explicit. The analysis showed that there were portfolios related to the Personality, Matter, and Energy categories. We argue that Ranganathan's faceted classification methods are useful and relevant in a variety of contexts, since they provide a logical basis to the definition of classes and subclasses in a concept system, and that those methods do not depend upon the materiality of the object that is to be categorized, as they deal with what is called the idea plane. These methods are deemed essential to the development of knowledge domain models.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c5caa3c090790794837df949ac5c5a2",
  "timestamp": "2025-05-15T01:04:27.440375"
}