{
  "id": 617,
  "title": "An Anti-Money Laundering Approach for the Brazilian Smart Contract/Digital Currency (DREX) Platform",
  "abstract": "Recent advancements in anti-money laundering (AML) strategies and the emergence of new government smart contract platforms underscore the need for more accurate and efficient detection systems. This paper proposes a robust approach to significantly reduce false positive alerts utilizing machine learning (ML) to enhance the AML framework within the Brazilian Smart Contract/Digital Currency (DREX) platform, which is built on the Hyperledger Besu technology and expected to be fully operational in 2025. By integrating data from 'Know Your Customer' (KYC) due diligence databases and comprehensive transactional datasets, our methodology identifies high-risk transactions while adhering to stringent regulatory standards and minimizing operational costs. A comparative analysis of various ML models, including Decision Trees, Random Forest, Logistic Regression, and Artificial Neural Networks (ANN), among others, revealed that the Decision Tree model notably decreased false positive rates to 6.1% while maintaining a high detection rate for potentially illicit transactions. This model surpasses traditional rule-based systems in performance, confirming its efficacy and suitability for broad implementation. By streamlining the smart contract AML process and reducing compliance-related expenditures, this study presents a scalable and efficient approach that enhances operational efficiency and cost-effectiveness for financial institutions in combating economic crimes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c5d1d520b85bdde41e50b24854ce534",
  "timestamp": "2025-05-15T01:53:24.742845"
}