{
  "id": 3556,
  "title": "Consumers' willingness to pay for renewable energy: A meta-regression analysis",
  "abstract": "Using renewable energy for domestic consumption has been identified as a key strategy by the Intergovernmental Panel on Climate Change to reduce greenhouse gas emissions. Critical to the success of this strategy is to know whether consumers are willing to pay to increase the proportion of electricity generated from renewable energy in their electricity portfolio. There are a number of studies in the literature that report a wide range of willingness to pay estimates. In this study, we used a meta-regression analysis to determine how much of the variation in willingness to pay reflects true differences across the population and how much is due to study design, such as survey design and administration, and model specification. The results showed that factors that influence willingness to pay, such as renewable energy type, consumers' socio-economic profile and consumers' energy consumption patterns, explain less variation in willingness to pay estimates than the characteristics of the study design itself. Because of this effect, we recommend that policy makers exercise caution when interpreting and using willingness to pay results from primary studies. Our meta-regression analysis further shows that consumers have significantly higher willingness to pay for electricity generated from solar, wind or generic renewable energy source (i.e. not a specific source) than hydro power or biomass. (C) 2015 Elsevier B.V. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9c667f9e60928685bff9574333dbf0fd",
  "timestamp": "2025-05-15T01:18:20.542220"
}