{
  "id": 7073,
  "title": "Developing an adaptive global exposure model to support the generation of country disaster risk profiles",
  "abstract": "Corresponding to increased realization of the impacts of natural hazards in recent years and the need for quantification of disaster risk, there has been increasing demand from the public sector for openly available disaster risk profiles. Probabilistic disaster risk profiles provide risk assessments and estimates of potential damage to property caused by severe natural hazards. These profiles outline a holistic view of financial risk due to natural hazards, assisting governments in long-term planning and preparedness. A Country Disaster Risk Profile (CDRP) presents a probabilistic estimate of risk aggregated at the national level. A critical component of a CDRP is the development of consistent and robust exposure model to complement existing hazard and vulnerability models. Exposure is an integral part of any risk assessment model, capturing the attributes of all exposed elements grouped by classes of vulnerability to different hazards, and analyzed in terms of value, location and relative importance (e.g. critical facilities and infrastructure). Using freely available (or available at minimum cost) datasets, we present a methodology for an exposure model to produce three independent geo-referenced databases to be used in national level disaster risk profiling for the public sector. These databases represent aggregated economic value at risk at 30 arc-second spatial resolution (approximately 1 x 1-km grid at the equator) using a top-down (or downscaling) approach. To produce these databases, the models used are: 1) a building inventory stock model which captures important attributes such as geographical location, urban/rural classification, type of occupancy (e.g. residential and non-residential), building typology (e.g. wood, concrete, masonry, etc.) and economic (replacement) value; 2) a non-building infrastructure density and value model that also corresponds to the fiscal infrastructure portion of the Gross Capital Stock (GCS) of a country; and 3) a spatially and sectorially disaggregated Gross Domestic Product (GDP) model that relates to the production (flow) of goods and services of a country. These models can be adapted to produce - independently or cohesively - a composite exposure database. Finally, we provide an example of the model's use in economic loss estimation for the reoccurrence of the 1882 Mw 7.8 Panama earthquake. (C) 2015 The International Bank for Reconstruction and Development/The World Bank. Published by Elsevier B.V. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9cf1fdeff1854c83baa44314c30c4982",
  "timestamp": "2025-05-15T03:05:03.376984"
}