{
  "id": 9367,
  "title": "Predictors and regional prevalence of food insecurity in Ethiopia during COVID-19: a multilevel analysis",
  "abstract": "IntroductionFood insecurity is one of the most serious issues, especially in developing countries, that harm many public health outcomes through increased under nutrition, mental health problem, and premature mortality. It is widespread socio-economic problem of Ethiopia, with unequal distribution among its regions, during COVID-19 and other shock event manifestations for the last three years. This study aimed to analyse country-wise and region-specific food insecurity prevalence; assess its variation among regions; and identify predictors that influenced households' food insecurity in Ethiopia during COVID-19.MethodsThis study used longitudinal data from the World Bank's Ethiopia-High Frequency Phone Survey, which looked at 3,300 households' experiences of food insecurity over five rounds, yielding 13,517 observations throughout time. The non-parametric model, Kruskal-Wallis Test, was used to asses food insecurity differences across regions; while the parametric, Generalized Multilevel Binomial Regression Model, was used to identify significant predictors of households' food insecurity experience.ResultsThere are significant variations in food insecurity among regions of Ethiopia during COVID-19. Sumali was the region with highest food insecurity prevalence followed by Tigray, SNNP, Oromia, and Amhara where these regions were also facing another shocks, in addition to COVID-19, such a displacement and drought. Female-headed household and income loss are directly associated with likelihood of being food insecure. Dwelling in urban (coefficient = -0.3707, p = 0.0003), being employed (coefficient = -0.1869, p = 0.0161), benefiting assistance (coefficient = -0.3504, p = 0.0029), and operating non-farm business during COVID-19 (coefficient = -0.4074, p = 0.0000) were significant and negatively associated predictors of households' food insecurity. Besides, household's worry and financial threat due to the outbreak of pandemic were the two COVID-19 related predictors that had significant effect on household's food insecurity. Income loss was the most determinant variable (coefficient = 0.8562, p = 0.0000) that had largest influence on household's likelihood of being food insecure. As time went, the decline in food insecurity was attributed to either decreased outbreak of the pandemic and/or improved households' resilience to shocks.ConclusionsEven while food insecurity is a major issue in Ethiopia, not all its regions are at equal status. Household's food insecurity is determined by his ability to handle the problem economically, and withstand shock events like COVID-19 that subtly disrupts social and economic networks. Intervention measures taken to insure food insecurity in the country should take in to account regions' food insecurity inequalities and their vulnerability to shock event manifestations. During shocks, boosting households' ability to cope up with unexpected risk event can save the exacerbation of food insecurity problem.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9cf3502f41591d7278eb8f3194d6ebb8",
  "timestamp": "2025-05-15T03:28:17.512483"
}