{
  "id": 8409,
  "title": "Implications of multimorbidity on healthcare utilisation and work productivity by socioeconomic groups: Cross-sectional analyses of Australia and Japan",
  "abstract": "Background Multimorbidity, the presence of 2 or more non-communicable diseases (NCDs), is a major contributor to inequalities of health in Australia and Japan. We use nationally representative data to examine (i) the relationships between multimorbidity with healthcare utilisation and productivity loss and (ii) whether these relationships differed by socioeconomic groups. Methods Cross-sectional analyses using the Household, Income, and Labour Dynamics in Australia (HILDA) and the Japanese Study of Aging and Retirement (JSTAR) surveys. We examined 6,382 (HILDA) and 3,503 (JSTAR) adults aged >= 50 years. We applied multivariable regression, logistic and negative binomial models. Results Prevalence of multimorbidity was overall 38.6% (46.0%, 36.1%, 28.9% amongst those in the lowest, middle and highest education group, respectively) in Australia, and 28.4% (33.9%, 24.6%, 16.6% amongst those in the lowest, middle and highest education group, respectively) in Japan. In Australia and Japan, more NCDs was associated with greater healthcare utilisation. In Australia and Japan, more NCDs was associated with higher mean number of sick leave days amongst the employed and lower odds of being employed despite being in the labour force. The association between multimorbidity and lower retirement age was found in Australia only. Conclusion Having more NCDs pose significant economic burden to the health system and wider society in Australia and Japan. Targeted policies are critical to improve financial protection, especially for lower income groups who are more likely to have multiple NCDs. These individuals incur both high direct and indirect costs, which lead to a greater risk of impoverishment.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9cfcba9dd6d1543fac3e3c7c80c88465",
  "timestamp": "2025-05-15T03:18:19.700965"
}