{
  "id": 2750,
  "title": "How loud is consumer voice in product deletion decisions? Retail analytic insights",
  "abstract": "This study examines the role of online consumer reviews in product deletion decisions. Building upon product portfolio management theory and the signaling theory, we integrate consumer voice, represented by online consumer review behavior into organizational voice-strategic product deletion decision-making. We empirically evaluated the relationship between online consumer reviews and organizational product deletion decisions using text mining and logistic regression models. The results indicate consumer online review characteristics are significant factors for product deletion decisions. Findings suggest that products with lower review attribute ratings, or those with textual review content less pertinent to the core performance attributes, are more likely to be deleted. The linguistic retail analytic characteristics of online reviews also provide insights for product deletion decisions. Products with reviews having higher subjectivity, shorter length, and lower readability are more likely to be deleted. Pre-purchase consumer voice-the perceived helpfulness or unhelpfulness of online reviews also impacts product deletion decisions. A general conclusion is that online reviews can provide important retail analytics for smarter retail operations planning at the strategic and tactical levels when it comes to product planning and portfolio management through product deletion.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d0065d6a90333a004e791d101ba092e",
  "timestamp": "2025-05-15T01:10:16.444723"
}