{
  "id": 8941,
  "title": "Socio-economic status and the utilisation of physicians' services: results from the Canadian National Population Health Survey",
  "abstract": "This paper assesses the extent to which Canada's universal health care system has eliminated socio-economic barriers in the use of physician services by examining he role of socio-economic status in the differential use of specific, publicly-insured, primary and specialist care services. Data from the 1994 National Population Health Survey, a nationally representative survey, were analysed using multiple logistic regression, In order to control for the association between primary and specialist utilisation, a two-staged least squares method was used for models explaining specialist utilisation, Health need, as measured by perceived health status and number of health problems, was found to be consistently associated with increased physician utilisation, for both primary and specialist visits. Whereas the likelihood of an individual making at least one visit to a primary care physician was found to be independent of income, those with lower incomes were more likely to be frequent users of primary care, that is, make at least six visits to a primary care physician. Even after adjusting for the greater utilisation of primary care services by those in lower socio-economic groups, and, therefore, their higher exposure to the risk of referral, the utilisation of specialist visits was greater for those in higher socio-economic groups. Canadians lacking a regular medical doctor were less likely to receive primary and specialist care, even after adjustments for socioeconomic variables such as income and education. Although financial barriers may not directly impede access to health care services in Canada, differential use of physician services with respect to socio-economic status persists. After adjusting for differences in health need, Canadians with lower incomes and fewer years of schooling visit specialists at a lower rate than those with moderate or high incomes and higher levels of education attained despite the existence of universal health care. (C) 2000 Elsevier Science Ltd All rights reserved.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d0cf13434ac2746d363ef21c0b5b00d",
  "timestamp": "2025-05-15T03:23:56.102617"
}