{
  "id": 1718,
  "title": "Fusion-Based Supply Chain Collaboration Using Machine Learning Techniques",
  "abstract": "Supply Chain Collaboration is the network of various entities that work cohesively to make up the entire process. The supply chain organizations' success is dependent on integration, teamwork, and the communication of information. Every day, supply chain and business players work in a dynamic setting. They must balance competing goals such as process robustness, risk reduction, vulnerability reduction, real financial risks, and resilience against just-in-time and cost-efficiency. Decision-making based on shared information in Supply Chain Collaboration constitutes the recital and competitiveness of the collective process. Supply Chain Collaboration has prompted companies to implement the perfect data analytics functions (e.g., data science, predictive analytics, and big data) to improve supply chain operations and, eventually, efficiency. Simulation and modeling are powerful methods for analyzing, investigating, examining, observing and evaluating real-world industrial and logistic processes in this sce-nario. Fusion-based Machine learning provides a platform that may address the issues/limitations of Supply Chain Collaboration. Compared to the Classical prob-able data fusion techniques, the fused Machine learning method may offer a strong computing ability and prediction. In this scenario, the machine learning-based Supply Chain Collaboration model has been proposed to evaluate the pro-pensity of the decision-making process to increase the efficiency of the Supply Chain Collaboration.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d140394425619918b96c9f3d8133638",
  "timestamp": "2025-05-15T02:06:52.659151"
}