{
  "id": 7731,
  "title": "Coexistent Pulmonary Tuberculosis and Lung Cancer: An Analysis of Incidence Trends, Financial Burdens and Influencing Factors",
  "abstract": "Background: Tuberculosis (TB) and lung cancer (LC) are both major global health threats. However, coexistent pulmonary TB and LC (TBLC) is a unique condition for which incidence trends and risk factors have not been fully defined. Methods: We retrospectively reviewed the medical records of patients with TBLC and LC alone between 2010 and 2022 at Beijing Chest Hospital, the standard authority for the diagnosis and treatment of TB and LC in China. The cumulative incidence rate (CIR) of TBLC was calculated as the number of new TBLC cases/number of LC cases at risk per 100,000 annually. The comparative incidence rate ratio (IRR) was estimated to be the TB incidence in LC patients/TB incidence in the general population. Logistic regression was used to explore risk factors for TBLC. Results: The CIR of TBLC has rapidly increased each year since 2014 and reached 7027 per 100,000 LC patients in 2022. Patients with LC had a higher risk of developing active TB than the general population (IRR = 25.21, 95% confidence interval [CI]: 21.54-29.89). Medical expenditure per patient was 100.60 thousand yuan for those with TBLC and 105.60 thousand yuan for patients with LC (p = 0.687). Patients with TBLC were older (63.61 +/- 10.46 vs. 61.08 +/- 10.77, p < 0.001) and had a higher male-to-female ratio (2.82 vs. 1.59, p = 0.044) than those with LC alone. A tendency of earlier disease onset was observed in patients with LC rather than TBLC. A majority (44.92%) of TBLC lesions were located in the upper lobes of the lung and had a higher proportion of squamous cell carcinomas than LC alone (32.24% vs. 27.49%, p = 0.002). TBLC also presented more aggressively, with more lymph node involvement and distant metastases. Multivariate analysis revealed that older age, the male sex, mediastinal lymph node invasion, lung/bone metastases, anemia, hypoalbuminemia, malnutrition, pulmonary fibrosis, and chronic obstructive pulmonary disease were risk factors for active TBLC. Conclusions: There has been a rise in the incidence of coexistent TBLC and a concomitant increase in its financial burden in China that deserves more awareness and attention.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d277967bc9ff6c28c09c5defd200438",
  "timestamp": "2025-05-15T03:11:38.491899"
}