{
  "id": 4166,
  "title": "Impact of COVID-19 on mutual fund performance in Saudi Arabia",
  "abstract": "This study aims to measure the performance of actively-managed Saudi Arabia mutual funds during the COVID-19 outbreak and examines the potential impact of COVID-19 growth on the measured performance. The authors apply the Fama and French five-factor model to measure the risk-adjusted performance of a selected sample of 79 mutual funds. Mutual funds in Saudi Arabia outperformed the market with a significant positive alpha of 0.15%. The panel data regression technique identified the impact of growth in new confirmed cases and fatalities with fund-specific variables on mutual fund performance. The findings suggest that new confirmed cases had a significant and negative impact on mutual fund unadjusted returns and risk-adjusted returns. The significant positive impact of growth in COVID-19 fatalities on fund performance may have been interpreted as positive news by the market participants as the actual mortality rate was lower than previous forecast. Moreover, the study found that even individually, most mutual fund managers were not able to minimise the impact of the COVID-19 outbreak on mutual fund returns compared to the market portfolio. This study examines the potential impact of growth in COVID-19 cases as a new factor affecting mutual fund performance which helps investors to understand the behaviour of mutual fund performance during the COVID-19 crisis. It also provides evidence on how mutual fund performance reacted to the COVID-19 outbreak when compared to the overall market performance reaction. Moreover, this is the first study that applied the Fama and French five-factor model to estimate the mutual funds' risk-adjusted performance.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d2f43b9ec003edfa5094a6c7fbf7cf2",
  "timestamp": "2025-05-15T01:24:25.386344"
}