{
  "id": 4151,
  "title": "Association of co-morbidities with financial hardship in survivors of adult cancer",
  "abstract": "Purpose To evaluate the impact of co-morbidities on financial hardship in adult cancer survivors and the role of health insurance and a usual source of care (i.e., a particular doctor's office/health center/other place that the person usually goes if he/she is sick or needs advice) in relieving this impact. Methods Using the Medical Expenditure Panel Survey, we estimated prevalence of two financial hardships, out-of-pocket (OOP) burden and financial worry, among 1196 adult cancer survivors. A modified Charlson co-morbidity index (CCI) assessed co-morbidities, which represent a medical event (e.g., a doctor's appointment) associated with co-morbid conditions within the past 1 year. Multivariable logistic regression tested the influence of health insurance and a usual source of care on associations of co-morbidities with financial hardship by middle/high vs. low-income families and by working vs. retirement-age individuals. Results Years since cancer diagnosis ranged from 0 to 76 years (mean: 10.3, SD: 9.8), 10 and 25% of survivors experienced OOP burden and financial worry. For OOP burden, increased CCI was a risk factor among survivors of low-income families, ORs: 1.91 (95% CI: 1.06, 3.46) for a CCI 1-2 and 3.37 (95% CI: 1.72, 6.61) for a CCI >= 3 vs. CCI of 0. For financial worry, increased CCI was a risk factor among working-age survivors, ORs: 1.58 (95% CI: 1.02, 2.47) for a CCI 1-2 and 2.15 (95% CI: 1.19, 3.87) for a CCI >= 3 vs. CCI of 0. However, having health insurance and a usual source of care did not mitigate impact of co-morbidities on financial hardship (P values > 0.05). Conclusions Impact of co-morbidities on OOP and financial worry burden was greatest in survivors of low-income families and working-age, respectively. Health insurance and a usual source of care did not relieve the impact of co-morbidities on financial hardship. Implications Effective strategies are warranted to mitigate financial hardship for survivors.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d3fd22c7d1e02494481a8b999393f16",
  "timestamp": "2025-05-15T02:33:42.103256"
}