{
  "id": 9317,
  "title": "Dynamic capabilities and FDI in conflict zones: the role of diversification and stock management capabilities",
  "abstract": "Purpose Despite the increased level of national conflict around the world, outward foreign direct investment (FDI) targeting these areas has increased. This study aims to adopt a dynamic capability lens to examine the relationship between firm capabilities and the level of conflict in their FDI portfolio. The paper argues that conflict zones may be an attractive destination for a subset of firms, given their capability profile. Design/methodology/approach The authors draw from a sample of US Fortune 500 firms (2019) to examine their FDI destinations; specifically, they collected data on the locations of their foreign subsidiaries, which resulted into a final sample of 118 diversified US firms. The model was analyzed using ordinary least squares multiple regression to predict the extent to which their FDI portfolios have ongoing domestic and international conflict and the impact of expansion in such conflict-stricken markets on firm financial performance (ROA). Findings The authors find that firms with greater international geographical diversification capabilities, as depicted by their geographic spread, and those with greater local stock management capability, as depicted by their initial public offering maturity, are more likely to launch subsidiaries in high ongoing conflict zones. Furthermore, the authors find that while it may be unprofitable for firms to seek FDI in high-conflict zones, firms that operate in strategic industries (manufacturing, infrastructure, natural resource extraction) experienced positive performance. This can be attributed to the fact that firms operating in these sectors are more likely to directly profit in the reconstruction/rebuilding of such conflict-stricken markets. Originality/value While previous literature focused on macro-level factors, this study sought to highlight firm-level factors that determine FDI decision in conflict zones. The authors capture different dimensions/sources of firms' dynamic capability, one resulting from foreign experience (i.e. geographic diversification) and the other from local experience (i.e. domestic stock management) to assess how each correlate with multinational corporations' level of conflict in their FDI portfolio. Furthermore, the authors contribute to the understanding of the relationship between expansion in conflict zones and firm performance and highlight that industry does matter. Implications from this study highlight the importance of building risk management capabilities to handle not just expansion in conflict zones but also during challenging times like those brought about by pandemics.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d45350bbbfe93f482c202db79cf8890",
  "timestamp": "2025-05-15T03:27:53.296098"
}