{
  "id": 823,
  "title": "DEVELOPING A TOOL FOR PROJECT CONTINGENCY ESTIMATION IN A LARGE PORTFOLIO OF CONSTRUCTION PROJECTS",
  "abstract": "To enable the management of project-related risk on a portfolio level in an owner organisation, project contingency estimation should be performed consistently and objectively. This article discusses the development of a contingency estimation tool for a large portfolio that contains similar construction projects. The purpose of developing this tool is to decrease the influence of subjectivity on contingency estimation methods throughout the project life cycle, thereby enabling consistent reflection on project risk at the portfolio level. Our research contribution is the delivery of a hybrid tool that incorporates both neural network modelling of systemic risks and expected value analysis of project-specific risks. The neural network is trained using historical project data, supported by data obtained from interviews with project managers. Expected value analysis is achieved in a risk register format employing a binomial distribution to estimate the number of risks expected. By following this approach, the contingency estimation tool can be used without expert knowledge of project risk management. In addition, this approach can provide contingency cost and duration output on a project level, and it contains both systemic and project-specific risks in a single tool.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d5265b00d2f90623a2fa8c903a7de96",
  "timestamp": "2025-05-15T00:48:22.457069"
}