{
  "id": 6249,
  "title": "Predictors of suicide attempts in 3.322 patients with affective disorders and schizophrenia spectrum disorders",
  "abstract": "This study explores risk factors for suicide attempts using the electronic health records of 3322 patients with either schizophrenia spectrum disorders or affective disorders who underwent a comprehensive psychiatric evaluation at the Emergency Department at the Long Island Jewish Medical Center or the Hillside Evaluation Center at The Zucker Hillside Hospital from August 3rd 2011 to July 5th 2012. Multivariate regression analyses showed, after adjusting for sex, that previous suicidal attempts and financial or relationship losses were significantly associated with a current suicidal attempt. Additionally, higher odds of having a suicidal attempt were also found in those subjects with a diagnosis of an affective disorder, compared to a schizophrenia spectrum diagnosis, and those patients in the children/adolescent group compared to those in the adult/elderly group. Our study results confirm and expand results from prior studies. Therefore, physicians should be alert for the presence of any or all of these factors upon evaluation of psychiatric patients, and if present, either psychiatric hospitalization or a close psychiatric follow up in collaboration with family and a therapist would be key in reducing the risk of potential suicidal behavior. (C) 2015 Elsevier Ireland Ltd. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d592729715b35b288318bdb58c2bbff",
  "timestamp": "2025-05-15T02:56:11.011716"
}