{
  "id": 107,
  "title": "Evaluating the Effectiveness of Data Mining Techniques in Credit Scoring of Bank Customers Using Mathematical Models: A Case Study of Individual Borrowers of Refah Kargaran Bank in Zanjan Province, Iran",
  "abstract": "Loan deferment is a negative consequence of the activities of financial institutions. Increase in the amount of deferred loans can diminish productivity in the banking sector. The purpose of the present research is to cluster bank customers in order to prevent loan deferment and identify and classify customers with varying levels of loan repayment risk. In the proposed method, k-means, two-step, and Kohonen techniques are used for clustering and determining the behavior of each cluster. The results indicate that the k-means model with five clusters has the highest clustering accuracy. Clustering is also used to determine underlying feauture. loan term, loan value, and collateral value are respectively identified as the most influential feauture. Customers are clustered after removing non-significant feautures. Eight different machine learning techniques are used for clustering. These techniques are ranked in terms of efficiency based on certain evaluation criteria and using data envelopment analysis. The results indicated that support vector machine (SVM) and artificial neural networks (ANN) are the most efficient of the examined techniques.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d667df8486661c87bbea5752ba5d6a4",
  "timestamp": "2025-05-15T01:46:39.620488"
}