{
  "id": 8746,
  "title": "Predictors of ICU Surrogates' States of Concurrent Prolonged Grief, Posttraumatic Stress, and Depression Symptoms",
  "abstract": "OBJECTIVES: Scarce research explores factors of concurrent psychologic distress (prolonged grief disorder [PGD], posttraumatic stress disorder [PTSD], and depression). This study models surrogates' longitudinal, heterogenous grief-related reactions and multidimensional risk factors drawing from the integrative framework of predictors for bereavement outcomes (intrapersonal, interpersonal, bereavement-related, and death-circumstance factors), emphasizing clinical modifiability. DESIGN: Prospective cohort study. SETTING: Medical ICUs of two Taiwanese medical centers. SUBJECTS: Two hundred eighty-eight family surrogates. INTERVENTIONS: None. MEASUREMENTS AND MAIN RESULTS: Factors associated with four previously identified PGD-PTSD-depressive-symptom states (resilient, subthreshold depression-dominant, PGD-dominant, and PGD-PTSD-depression concurrent) were examined by multinomial logistic regression modeling (resilient state as reference). Intrapersonal: Prior use of mood medications correlated with the subthreshold depression-dominant state. Financial hardship and emergency department visits correlated with the PGD-PTSD-depression concurrent state. Higher anxiety symptoms correlated with the three more profound psychologic-distress states (adjusted odds ratio [95% CI] = 1.781 [1.562-2.031] to 2.768 [2.288-3.347]). Interpersonal: Better perceived social support was associated with the subthreshold depression-dominant state. Bereavement-related: Spousal loss correlated with the PGD-dominant state. Death circumstances: Provision of palliative care (8.750 [1.603-47.768]) was associated with the PGD-PTSD-depression concurrent state. Surrogate-perceived quality of patient dying and death as poor-to-uncertain (4.063 [1.531-10.784]) correlated with the subthreshold depression-dominant state, poor-to-uncertain (12.833 [1.231-133.775]), and worst (12.820 [1.806-91.013]) correlated with the PGD-PTSD-depression concurrent state. Modifiable social-worker involvement (0.004 [0.001-0.097]) and a do-not-resuscitate order issued before death (0.177 [0.032-0.978]) were negatively associated with the PGD-PTSD-depression concurrent and the subthreshold depression-dominant state, respectively. Apparent unmodifiable buffering factors included surrogates' higher educational attainment, married status, and longer time since loss. CONCLUSIONS: Surrogates' concurrent bereavement distress was positively associated with clinically modifiable factors: poor quality dying and death, higher surrogate anxiety, and palliative care-commonly provided late in the terminal-illness trajectory worldwide. Social-worker involvement and a do-not-resuscitate order appeared to mitigate risk.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d7011f18498336624b46e905b74a6fd",
  "timestamp": "2025-05-15T03:21:56.654276"
}