{
  "id": 8591,
  "title": "The Association between Oral Nutritional Supplements and 30-Day Hospital Readmissions of Malnourished Patients at a US Academic Medical Center",
  "abstract": "Background Malnutrition affects up to 50% of hospitalized patients and contributes to adverse health and economic outcomes, but often remains unrecognized or undertreated. Objective This study assessed the utilization of oral nutritional supplements (ONS) and its association with the number of 30-day unplanned hospital readmissions of adult malnourished patients in comparison with the readmissions rates of their malnourished counterparts who did not receive ONS. Design This was a retrospective cohort study. Participants/setting Of 153,161 inpatient encounters analyzed, a total of 8,713 (5.7%) malnourished adults admitted to an academic medical center hospital in the United States between October 1, 2016, and September 30, 2017 were included in the analyses. The study utilized records of patients at risk of malnutrition on admission and subsequently diagnosed as malnourished by a registered dietitian following established criteria. Main outcomes measures ONS utilization rate, hospital length of stay (LOS), and 30-day unplanned hospital readmissions data were obtained from electronic medical records. Statistical analyses performed The associations between the number of 30-day unplanned hospital readmissions and ONS use were analyzed using mixed-effects negative binomial regression models, with coefficients and 95% CIs reported. Important covariates such as age, sex, and the severity of illness index were included in the regression models. Results Only 3.1% of malnourished patients received ONS. ONS users had 38.8% fewer readmissions compared with non-ONS counterparts (P=0.017). The reduction in hospital readmissions by ONS was even greater for oncology patients (46.1%, P<0.001). A 50% reduction in time from hospital admission to ONS provision was associated with a 10.2% (P<0.01), 10.2% (P=0.014), and 16.6% (P<0.01) decrease in LOS for overall, oncology, and intensive care unit encounters, respectively. Conclusions In a large cohort of malnourished adult inpatient encounters, ONS provision rate was low, but when used, ONS intervention was associated with 38.8% fewer 30-day readmissions. This association was more pronounced for oncology encounters. Shorter LOS was observed when the interval between admission and ONS initiation was shorter. Reduced LOS and readmissions rates could result in financial benefits for health care systems prioritizing hospital nutrition care, in addition to informing significant medical benefits for their patients.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d78dd7eda5937dd84ac290e476494e2",
  "timestamp": "2025-05-15T03:20:22.267703"
}