{
  "id": 7755,
  "title": "A Comprehensive Review of the Benefits of and the Barriers to the Switch to a Plant-Based Diet",
  "abstract": "In recent decades, the food industry has been faced with new challenges, and it has had to develop new types of diets and produce new types of foods that can slow down the spread of chronic diseases. The aim of our research was to identify the characteristics of plant-based nutrition, based on international and Hungarian literature. The comprehensive analysis was performed based on the theoretical model called Theory of Planned Behavior, in the course of which the perceived and objective benefits of and barriers to the conversion to a plant-based diet were examined. According to our results, the main benefits of plant-based nutrition are its many factors associated with a reduction in risk of developing numerous chronic diseases. This is followed by benefits of well-being and satisfaction, followed by ethical and environmental benefits. The most commonly reported inhibitory factor of a vegetarian diet is the enjoyment of eating meat and the difficulty in giving up meat consumption. This is followed by health considerations, e.g., lack of various ingredients in foods. Convenience and taste factors are also important disincentives, as well as the irrelevant nature of some plant-based nutrition information sources. Besides, social barriers, negative discrimination, and negative effect on mental health associated with them can also be a hindrance, as can financial barriers. The classification developed during our analysis can serve as a relevant guideline for decision-makers, and also as a basis for further primary qualitative and quantitative research.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9d8becce23b4cff902b0cd54d99f237d",
  "timestamp": "2025-05-15T03:11:38.583040"
}