{
  "id": 7718,
  "title": "Relationship of Smoking and Cardiovascular Risk Factors with Polypoidal Choroidal Vasculopathy and Age-related Macular Degeneration in Chinese Persons",
  "abstract": "Purpose: Polypoidal choroidal vasculopathy (PCV) has been described as a distinct clinical entity from choroidal neovascularization (CNV) secondary to age-related macular degeneration (AMD). The present study aimed to determine risk factors for PCV and to compare associations with those for CNV secondary to AMD. Design: Case-control study. Participants: Patients of Chinese ethnicity with clinically and angiographically diagnosed PCV (n = 123) or CNV secondary to AMD (n = 128) were recruited from a tertiary eye hospital in Singapore. Controls without signs of PCV, CNV secondary to AMD, or other retinal pathologic features (n = 1489) were selected from a population-based study. Methods: Patients underwent an ophthalmologic examination including digital color fundus photography, stereoscopic fluorescein angiography (FA), and indocyanine green angiography (ICGA). Classification into PCV or CNV secondary to AMD was based on FA and ICGA findings. Risk factors were determined from a standardized interview, with blood pressure recorded using a digital automatic blood pressure monitor. Main Outcome Measures: Polypoidal choroidal vasculopathy or CNV secondary to AMD. Results: Persons who smoked were more likely to have PCV (39.9% vs. 13.4%) or CNV secondary to AMD (45.0% vs. 12.3%) than those who did not smoke. After controlling for age, gender, diabetes, hypercholesterolemia, and hypertension, persons who smoked were 4 times more likely to have PCV (odds ratio [OR], 4.4; 95% confidence interval [CI], 2.5-7.7; P < 0.001) and CNV secondary to AMD (OR, 4.9; 95% CI, 2.7-8.8; P < 0.001). A significant, negative association also was found between diastolic blood pressure and CNV secondary to AMD (OR, 0.7; 95% CI, 0.5-0.9; P = 0.017, adjusted for age, gender, smoking, diabetes, and hypercholesterolemia), but diastolic blood pressure was not associated with PCV. Conclusions: Smoking but not other vascular risk factors is significantly associated with both PCV and CNV secondary to AMD in Chinese persons. The similarity of associations suggests that there may be common risk factors and pathological mechanisms. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 846-852 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9da235ff9bd203525febf494862f44e7",
  "timestamp": "2025-05-15T03:11:38.430840"
}