{
  "id": 644,
  "title": "Optimizing over coherent risk measures and non-convexities: a robust mixed integer optimization approach",
  "abstract": "Recently, coherent risk measure minimization was formulated as robust optimization and the correspondence between coherent risk measures and uncertainty sets of robust optimization was investigated. We study minimizing coherent risk measures under a norm equality constraint with the use of robust optimization formulation. Not only existing coherent risk measures but also a new coherent risk measure is investigated by setting a new uncertainty set. The norm equality constraint itself has a practical meaning or plays a role to prevent a meaningless solution, the zero vector, in the context of portfolio optimization or binary classification in machine learning, respectively. For such advantages, the convexity is sacrificed in the formulation. However, we show a condition for an input of our problem which guarantees that the nonconvex constraint is convexified without changing the optimality of the problem. If the input does not satisfy the condition, we propose to solve a mixed integer optimization problem by using the or -norm. The numerical experiments show that our approach has good performance for portfolio optimization and binary classification and also imply its flexibility of modelling that makes it possible to deal with various coherent risk measures.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9da5f88e28c2e77d7508a9b3c60d24dc",
  "timestamp": "2025-05-15T00:46:24.369744"
}