{
  "id": 3012,
  "title": "Exploring the interplay of foreign direct investment, digitalization, and green finance in renewable energy: Advanced analytical methods and machine learning insights",
  "abstract": "As the world grapples with energy security and climate change, accelerating the transition to renewable energy has become imperative. While previous studies have individually explored the roles of digitalization and green finance in promoting renewable energy, there is a lack of research examining their combined effects. This study fills this gap by investigating the synergy between digitalization and green finance to optimize renewable energy deployment. By integrating foreign direct investment (FDI) flows with digitalization indicators, including the Telecommunication Infrastructure Index (TII), Online Service Index (OSI), and Human Capital Index (HCI), a novel framework for enhancing renewable energy systems is offered. Focusing on 25 countries, including major G20 nations responsible for approximately 75% of global greenhouse gas emissions and committed to ambitious climate actions under the Paris Climate Agreement, advanced analytical methods and machine learning (ML) insights are employed to analyze how digital technologies amplify renewable energy investments and financial transparency. The study underscores how digital infrastructure facilitates financial risk management and energy system optimization, paving the way for a carbon-neutral society. The study contributes original insights to the field by offering practical policy suggestions and showcasing the use of cutting-edge technologies for scalable renewable energy solutions. Ultimately, the goal is to show how the synergy between digitalization and green finance can accelerate renewable energy adoption, leading toward a low-carbon future.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9db7992f53c29031f614866f4403526f",
  "timestamp": "2025-05-15T02:21:19.314775"
}