{
  "id": 447,
  "title": "An ensemble learning-based framework for assessing the energy flexibility of residential buildings with multicomponent energy systems",
  "abstract": "A key issue in energy flexibility assessment is the lack of a scalable practicable approach to quantify and characterise the flexibility of individual residential buildings from an integrated energy system perspective without the need to use complex simulation models. In this study, this problem is addressed by explicitly quantifying the flexibility of multicomponent thermal and electrical systems commonly found in residential buildings based on an ensemble learning framework that consists of four algorithms, namely, random forests, multilayer perceptron neural network, support vector machine, and extreme gradient boosting. The day-ahead and hour-ahead prediction models developed are periodically updated considering dynamic feature selection based on residential occupancy patterns. The proposed methodology utilises synthetic data obtained from a calibrated while-box model of an all-electric residential building for two indicative occupancy profiles. The energy systems evaluated include a heat pump, a photovoltaic system, and a battery unit. The daily flexibility mappings are acquired by applying hourly independent, and consecutive demand response actions for each energy system considered, using suitable energy flexibility indicators. The results show that the ensemble models developed for each target variable outperform each of the constituent machine learning algorithms. Moreover, the storage capacity resulting from harnessing the heat pump downward flexibility demonstrates accurate accuracy with a coefficient of determination equal to 0.979 and 0.968 for day-ahead predictions and 0.998 and 0.978 for day ahead predictions for the two occupancy profiles considered, respectively. This framework can be used by electricity aggregators to evaluate a building portfolio in an end-user-tailored manner or optimally exploit its energy flexibility considering multi-step predictions to shift electricity usage to off-peak times or times of excess onsite renewable energy generation.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9db9e6f61751c27ea3e53e5a368a92a7",
  "timestamp": "2025-05-15T00:43:47.290861"
}