{
  "id": 7039,
  "title": "The effect of the 2008 recession on well-being and employment status of people with and without mental health problems",
  "abstract": "Background: The world was hit hard by the 2008 recession which led to increased unemployment and financial strain. However, how the recession affected people with pre-existing mental health problems has been understudied. This study investigates the effect of the 2008 recession in Iceland on stress, well-being and employment status of people with regard to whether they are suffering from mental health problems. Methods: The study cohort included participants (18-69 years old) of the 'Health and Wellbeing of Icelanders', a 3-wave survey conducted before (in 2007) and after (in 2009 and 2012) the recession in 2008. Self-assessed well-being was measured with the Short Warwick-Edinburgh Mental Well-being Scale and the 4-item Perceived Stress Scale. Logistic regression was used to assess the effect of the 2008 recession on self-assessed well-being and employment status in 2009 and 2012, using 2007 as a reference year. Results: Participants with no pre-recession mental health problems were at increased risk of both poor well-being, (with adjusted odds ratio at 1.66, in 2009 and 1.64 in 2012) and higher perceived stress, (with adjusted odds ratio at 1.48 in 2009 and 1.53 in 2012), after the recession. Interestingly, no significant change in well-being and perceived stress was observed among participants suffering from pre-recession mental health problems. Both groups had increased risk of unemployment after the recession. Conclusion: Results indicate that after recessions, the risk of stress and poor well-being increases only among those who do not suffer from pre-recession mental health problems.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9dc9aa1cc68822e1bc60a78697afe93b",
  "timestamp": "2025-05-15T03:04:23.021401"
}