{
  "id": 5120,
  "title": "Persistent Opioid Use After Open Aortic Surgery: Risk Factors, Costs, and Consequences",
  "abstract": "Background. The incidence and financial impact of persistent opioid use (POU) after open aortic surgery is undefined. Methods. Insurance claim data from opioid-naive patients who underwent aortic root replacement, ascending aortic replacement, or transverse arch replacement from 2011 to 2017 were evaluated. POU was defined as filling an opioid prescription in the perioperative period and between 90 and 180 days postoperatively. Postoperative opioid prescriptions, emergency department visits, read-missions, and health care costs were quantified. Multi-variable logistic regression identified risk factors for POU, and quantile regression quantified the impact of POU on postoperative health care costs. Results. Among 3240 opioid-naive patients undergoing open aortic surgery, 169 patients (5.2%) had POU. In the univariate analysis, patients with POU were prescribed more perioperative opioids (375 vs 225 morphine milligram equivalents, P < .001), had more emergency department visits (45.6% vs 25.4%, P < .001), and had significantly higher health care payments in the 6 months postoperatively ($10,947 vs $7223, P < .001). Independent risk factors for POU in the multivariable logistic regression included preoperative nicotine use and more opioids in the first perioperative prescription (all P < .05). After risk adjustment, POU was associated with a $2439 in-crease in total health care costs in the 6 months postoperatively. Conclusions. POU is a challenge after open aortic operations and can have longer-term impacts on health care payments and emergency department visits in the 6 months after surgery. Strategies to reduce outpatient opioid use after aortic surgery should be encouraged when feasible. (C) 2021 by The Society of Thoracic Surgeons",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9dde32cd7f8b3596a6df15d1934fb3d5",
  "timestamp": "2025-05-15T02:44:43.812139"
}