{
  "id": 2424,
  "title": "RETRACTED: The Application of the Data Mining Method Based on Ensemble Learning to the Research on Early Warning of Financial Crisis in Small- and Medium-Sized Enterprises (Retracted Article)",
  "abstract": "In the big data environment, the factors affecting the operation of small- and medium-sized enterprises are becoming more and more complex. In order to more accurately measure the financial crisis of small- and medium-sized enterprises, from the perspective of multisource information fusion, based on the traditional financial data reflecting the private information of enterprises, the public information data for measuring the macroeconomic and market environment are integrated and analyzed. Considering the multidimensional heterogeneity of multisource information data, BPNN, SVM, KNN, LOG, and MDA are introduced to build models, and ensemble learning is used to integrate the results of different early warning models to reduce the risk of inconsistent results from different models. The empirical results show that the early warning model integrating multisource information can improve the early warning accuracy. The research results show that the financial crisis early warning of small- and medium-sized enterprises should not only pay attention to financial indicators but also pay attention to the impact of corporate governance, industry, and the overall economic environment of the country; the accuracy of the model in this paper is significantly higher than that of the other models in terms of the accuracy of financial crisis early warning. It shows that the model in this paper can better predict the real financial status of small- and medium-sized enterprises.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9de8e42391f4f10c1a066ff70fcf9ffe",
  "timestamp": "2025-05-15T02:15:26.962347"
}