{
  "id": 5366,
  "title": "Suicide behaviour among adolescents in a high HIV prevalence region of western Kenya: A mixed-methods study",
  "abstract": "The study purpose was to determine the prevalence and determinants of suicidal thoughts and behaviours in a rural community sample of 15-19-year-old Kenyan adolescents in a region with high HIV burden. Data were from an observational study examining ethical issues in adolescent HIV research (N=4084). Participants reporting suicidal ideation were assessed for suicide risk. Directed content analyses were conducted using assessment reports. Logistic regression was used to identify factors associated with suicide outcomes. Prevalence of suicidal ideation was 16%. Of these, 38% were low risk and 12% were moderate/high-risk. Females and sexually active adolescents had higher odds of suicidal ideation and being categorised as moderate/high-risk. Adolescents with higher depression scores had higher odds of reporting ideation. Pregnancy was protective for females while impregnating a partner was a risk factor for males. Abuse from a family member, financial stress and health concerns were the most frequently mentioned precipitants of ideation. However, only abuse increased odds of suicide behaviour. Effective programmes to identify and support sexually active, pregnant, and distressed adolescents at risk for suicide are needed. Approaches involving families, schools, health facilities, and community gatekeepers may have the most promise in sub-Saharan African rural areas with limited mental health services.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9df9d0bdacce969235614f9c6b8ccad4",
  "timestamp": "2025-05-15T02:47:13.875039"
}