{
  "id": 2881,
  "title": "Improving Sharpe Ratios and Stability of Portfolios by Using a Clustering Technique",
  "abstract": "This paper proposes a method which combines a clustering technique with asset allocation methods, to improve portfolio Sharpe ratios and weights stability. The portfolio weights are computed based on cluster members and cluster portfolios, which are decided by an optimal cluster pattern. The optimized cluster pattern tells the belonging of assets to particular clusters, which is identified by using a population-based method, i.e. the Differential Evolution, subject to maximizing the Sharpe ratio of terminal portfolios. We employ two different asset allocation methodologies, i.e. the mean-variance Markowitz allocation and the parameter-free equal weights allocation, with the Financial Times and Stock Exchange market and Dow Jones Industrial Average market data, to study the clustering impact on Sharpe ratio and weights instability of the terminal portfolios. As experimental results suggest that, the terminal portfolios from the clustered markets have higher Sharpe ratios than that without clustering. Furthermore, as a side effect of the clustering, the terminal portfolio weights become more stable than that in the non-clustered markets. Portfolio managers may cluster their assets with the Sharpe ratio criterion before distributing asset weights to improve portfolio weights stability and risk-adjusted returns.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9df931947a529ed723f8060c240a50ed",
  "timestamp": "2025-05-15T02:20:16.869276"
}