{
  "id": 9426,
  "title": "Post-traumatic stress disorder: A review (part one)",
  "abstract": "Since early history, human beings have been closely exposed to several types of traumatic events. Although modern societies have developed a more acceptable kind of convivence these traumatic events have become increasingly present in the everyday life of any individual in underdeveloped societies. This is due to extended problems, like a lower income pet, capita, which gives rise to such conducts as violent robbery, kidnapping, or murder. Similarly, family desintegration is a likely factor leading to the development of interfamily violence, and illegal substances traffic and abuse; even weather phenomena (e.g., El Nino) may trigger a higher incidence of PTSD given the suffering brought about by hurricanes or tornados. At the Fourth Consensus Group International Meeting on Depression and Anxiety, held in Montecatini, Italy, in April 1999, PTSD was regarded as the main issue, because of its high prevalence, social impact, and financial burden on society. For these reasons, it represents an enormous public health problem in both underdeveloped and developed countries, During the last three decades, biological guidelines for PTSD have been studied and proposed, together with the development of new effective treatments. Epidemiological studies allow us to calculate the rates of specific disorders and their impact on the community and health system. The prevalence of the exposure to traumatic events themselves is an important part of PTSD study. Recent epidemiological studies have shown that about 40 to 90% individuals from adult community samples have been exposed to a traumatic event. Prevalence life rates of PTSD vary from 5 to 15% in developed countries. Nowadays, 4 to 6% of the population presents PTSD symptoms, considering only the worst traumatic event (8, 9, 13, 20, 29, 32, 39). In the last two decades, PTSD is an anxiety disorder which has Called the attention in research and clinical areas due to several reasons. One Of these is that the rates of violence have had a dramatic increase all over the world; another one is the identification of their subdiagnosis in several places. However, not everyone who has been exposed to a traumatic event develops PTSD. Several risk factors increase the possibility of its expression and chronicity - for instance, to experience the event at early life stages, multiple traumatic events, their severity, gender experiencing the event, personal stress - and behavior, or psychological problems history, comorbid psychopathology, parents' PTSD history,, or subsequent exposure to reactivant environmental events. Likewise, risk factors can be classified according to the person involved and the traumatic event experienced (19, 22). In this sense, different studies have shown women have a higher risk than men to develop PTSD, in spite of men having an increased exposure to traumatic events (13, 20, 37). The psycho-biological development level is important when a traumatic event appears, since it has been demonstrated that age is a significative factor to develop PTSD: traumatic events in childhood have been associated with a higher risk of PTSD and more severe symptoms (10). The clinical course of PTSD is often chronic, with only 50% of the patients recovering within two years after the incident. Most of those unable tu recover will still show symptoms 15 years later (32). The situation in underdeveloped countries is particularly interesting, since traumatic events frequently associated with long wars, hunger, politic opression, and sectary violence seem to make PTSD more chronic and the profile of its symptoms more complex and disabling than in developed countries (21, 23, 38, 45, 46). PTSD has a relevant impact on different areas of life, as is revealed fur instance in its enormous social costs. Generally, individuals who suffer PTSD earn a lower income, present high scholar failure rates, and more interpersonal problems compared tu the overall population. In addition, the age of onset of the mental disorders has a predictive value over educational, birth, marriage, and economic accomplishments (8, 23, 24, 27, 28, 30, 32). A research conducted among the overall American population estimated that 38% of the individuals with PTSD received some form of treatment during a given year. The reason more commonly reported by the remaining 62% to refuse getting medical attention was that they did not think they had any problem at all (3 1). Often, the traumatic reaction adapts over several years and becomes part of the individual's coping style. People at risk of PTSD commonly ask for medical help early, but do not do so in the psychiatric area. Finally, PTSD brings about less stigmatization compared to another psychiatric disorders, because their symptoms are considered as natural consequences of a severe traumatic event (32). Apparently, the presence of psychiatric disorders other than PTSD is the rule rather than the exception. According to clinical and general populations studies, between 50-90% of PTSD patients show comorbid psychiatric disorders (14-18, 33, 42, 43). PTSD is frequently associated with comorbid psychiatric disorders, such as High Depressive Disorder (HDD), Anguish Disorder (AD), Social Phobia (SP), Generalized Anxiety Disorder, Substance Use Disorder -mostly alcohol- (SUD), Personality, Disorders (PD) (e.g., borderline, avoidance, antisocial), and Dissociative Disorders (4, 5, 9, 29, 32, 48). In brief, the relevance of PTSD study becomes clear due to several aspects, Apparently, PTSD is more common than it is thought so. The life prevalence of PTSD among the general population is about 8 to 9%, and women have a higher risk to develop PTSD (22). Also, PTSD is more frequent after certain kinds of traumatic events (e.g., rape), not considering in this case the survivor's gender (29). This discussion is divided in two parts. In this first article we will analyze some general aspects like the introduction of this disorder in the American classification, together with its definition, epidemiology, clinic course, effect on the individual's general functioning, and comorbidity, with different psychiatric disorders.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9dfdb32d60ff1c82bb1acbf709ce774d",
  "timestamp": "2025-05-15T03:28:46.274389"
}