{
  "id": 3732,
  "title": "On the Gender Gap in Financial Knowledge: Decomposing the Effects of Don't Know and Incorrect Responses",
  "abstract": "Objectives Past studies have consistently shown that women have lower levels of financial knowledge than men, and hence there is a noticeable gender gap in financial knowledge. We reconsider the conventional measures of financial knowledge by disentangling don't know (DK) responses and incorrect answers and comparing the effect of these two disparate responses' on the gender gap in financial knowledge. Methods Using data from the 2012 National Financial Capability Studies data set, we estimate a series of ordinary least squares regression and multinomial logit models of the gender gap in DK and incorrect responses. Results We find a strong gender gap in financial knowledge, but with a twist: (1) men are more likely to offer correct answers; (2) women are slightly more likely to offer incorrect answers; but (3) women are considerably more likely to provide DK responses. Hence women may exhibit lower levels of financial knowledge because they lose the opportunity to hazard a guess and arrive at a correct answer based either on partial knowledge or on random chance. We consider the possibility that there are psychological processes at work involving risk acceptance and confidence in financial knowledge that prompt women to give DK responses at a rate higher than men. Conclusion We suggest that future research should consider the relative roles of DK and incorrect responses in measuring financial knowledge.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9dfd2447c5e2d0170055e5011c87f9c8",
  "timestamp": "2025-05-15T02:29:28.014113"
}