{
  "id": 3500,
  "title": "Macroeconomic Determinants of Credit Risk: Evidence on the Impact on Consumer Credit in Central and Eastern European Countries",
  "abstract": "Although empirical studies show that different types of loans have different risks (moreover, consumer credit risk is higher compared to other types of loans), it is common to study the credit risk of the banking sector as a whole, or of an individual bank's whole loan portfolio, and the macro-economic factors affecting it (without grouping them by type of loan). Thus, an analysis of the credit risk of the whole loan portfolio (measured by all non-performing loans) is insufficient. Therefore, the aim of this research is to identify the macroeconomic determinants of the consumer loan credit risk and quantitatively assess their impact in Central and Eastern European countries. After the analysis of scientific literature in the field of credit risk determinants, a detailed classification of factors influencing banking credit risk is proposed. The distinguishing feature of the classification is that the factors influencing credit risk are classified at five different levels; twelve groups of general macroeconomic conditions variables were selected as the potential factors of NPLs. This classification can be useful to better understand and investigate the factors influencing banking credit risk for the whole loan portfolio (in the same way as the factors that affect the credit risk of different types of loans, e.g., consumer loans). Using the methods of constant, fixed and random-effects panel analysis, simple OLS, least squares with breakpoints regression analysis and Markov regime-switching models, the impact of the macroeconomic variables from twelve separate groups is evaluated. The data from 11 CEE countries are used, and the period from 2008 to 2020 is covered. The results of this assessment reveal that in the group of CEE countries, such variables as GDP and labour market variables appeared to have contributed to the increase in the share of non-performing consumer loans, while inflation and real estate market variables were related to the decrease in consumer NPLs; at the same time, the impact of variables form other groups appeared to be mixed-nature or insignificant. The results of this research are useful in that they allow the identification of the most important determinants of consumer loan credit risk and thus allow making assumptions about NPL changes due to the changing macroeconomic situation. In the case of Lithuania, this kind of study (assessment of macroeconomic determinants of consumer loan credit risk) was conducted for the first time. Consumer loan credit risk assessment is especially relevant in an increasing interest rate environment, and deeper analysis can help banks and other financial institutions to manage credit risk. On the other hand, a better understanding of the main influencing factors of the macroeconomic environment can help central banks and other official institutions take appropriate monetary and fiscal policy decisions to ensure a good credit transmission channel for sustainable economic growth.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e05597c5ddc325f6c068a2b398f8d98",
  "timestamp": "2025-05-15T02:26:48.583121"
}