{
  "id": 5907,
  "title": "Prevalence and Correlates of Elder Mistreatment in South Carolina: The South Carolina Elder Mistreatment Study",
  "abstract": "The purposes of this study were to (a) derive prevalence estimates for elder mistreatment (emotional, physical, sexual, neglectful, and financial mistreatment of older adults [age 60 +]) in a randomly selected sample of South Carolinians; (b) examine correlates (i.e., potential risk factors) of mistreatment; and (c) examine incident characteristics of mistreatment events. Random Digit Dialing (RDD) was used to derive a representative sample in terms of age and gender; computer-assisted telephone interviewing was used to standardize collection of demographic, correlate, and mistreatment data. Prevalence estimates and mistreatment correlates were obtained and subjected to logistic regression. A total of 902 participants provided data. Prevalence for mistreatment types (since age 60) were 12.9% emotional, 2.1% physical, 0.3% sexual, 5.4% potential neglect, and 6.6% financial exploitation by family member. The most consistent correlates of mistreatment across abuse types were low social support and needing assistance with daily living activities. One in 10 participants reported either emotional, physical, sexual, or neglectful mistreatment within the past year, and 2 in 10 reported mistreatment since age 60. Across categories, the most consistent correlate of mistreatment was low social support, representing an area toward which preventive intervention may be directed with significant public health implications.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e0ca40290e18ceb2b830b753ca7d700",
  "timestamp": "2025-05-15T02:52:31.507486"
}