{
  "id": 3863,
  "title": "Evolution of research on climate risk insurance: A bibliometric analysis from 1975 to 2022",
  "abstract": "Insurance against climate risk is essential for mitigating the adverse effects of climate change. However, theoretical consensus regarding climate risk insurance remains elusive, and the implementation of climate insurance policies varies markedly between countries owing to various challenges. This study conducted bibliometric analysis of 1082 relevant publications (1975-2022) to determine the theoretical basis, evolution of research hotspots, and methodologies associated with climate risk insurance. Climate insurance publications are growing at an average annual rate of 8.9%, with more than 2333 authors from 1103 organizations in 78 countries publishing on the subject. On the basis of milestones of global climate change assessment, i.e., the publication of the Fourth and Fifth Assessment Reports of the Intergovernmental Panel on Climate Change, climate insurance research can be divided into three major phases. In the start-up phase (1975-2007), research schemes examined the feasibilities and potentials of the National Flood Insurance Program in the United States, and the socioeconomic implications of transferring climate risk through reinsurance. The methodologies used in these studies were relatively simple owing to lack of comprehensive data. Research on flood insurance increased rapidly during the development phase (2008-2014), with increasing emphasis on the possibility of developing a flood insurance market in the Netherlands. Studies utilized catastrophe modeling and probabilistic approaches to estimate natural disaster losses and financial impacts. The boom phase (2015-2022) involved more research on the affordability of climate risk insurance given income inequality. The topic of climate insurance and the scope of its impact have developed global and interdisciplinary characteristics in terms of journal, sector, and disciplinary base. In the future, a trend might develop whereby big data will be combined with artificial intelligence and machine learning to design and implement index insurance.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e14e1996edd8b00c88684c9053271c4",
  "timestamp": "2025-05-15T02:30:58.141368"
}