{
  "id": 4083,
  "title": "A Library of Aspergillus niger Chassis Strains for Morphology Engineering Connects Strain Fitness and Filamentous Growth With Submerged Macromorphology",
  "abstract": "Submerged fermentation using filamentous fungal cell factories is used to produce a diverse portfolio of useful molecules, including food, medicines, enzymes, and platform chemicals. Depending on strain background and abiotic culture conditions, different macromorphologies are formed during fermentation, ranging from dispersed hyphal fragments to approximately spherical pellets several millimetres in diameter. These macromorphologies are known to have a critical impact on product titres and rheological performance of the bioreactor. Pilot productivity screens in different macromorphological contexts is technically challenging, time consuming, and thus a significant limitation to achieving maximum product titres. To address this bottleneck, we developed a library of conditional expression mutants in the organic, protein, and secondary metabolite cell factory Aspergillus niger. Thirteen morphology-associated genes transcribed during fermentation were placed via CRISPR-Cas9 under control of a synthetic Tet-on gene switch. Quantitative analysis of submerged growth reveals that these strains have distinct and titratable macromorphologies for use as chassis during strain engineering programs. We also used this library as a tool to quantify how pellet formation is connected with strain fitness and filamentous growth. Using multiple linear regression modelling, we predict that pellet formation is dependent largely on strain fitness, whereas pellet Euclidian parameters depend on fitness and hyphal branching. Finally, we have shown that conditional expression of the putative kinase encoding gene pkh2 can decouple fitness, dry weight, pellet macromorphology, and culture heterogeneity. We hypothesize that further analysis of this gene product and the cell wall integrity pathway in which it is embedded will enable more precise engineering of A. niger macromorphology in future.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e211ae6a96befb47b967622beb8c451",
  "timestamp": "2025-05-15T01:23:27.435494"
}