{
  "id": 8414,
  "title": "Soviet legacies in post-Soviet Russia: insights from crisis management",
  "abstract": "This paper singles out elements of continuity in the Russian path to development and growth after transformation to market under the assumption that Soviet legacies have a bearing on current policies and provide some insights as to how the Russian market system may develop in the future. Drawing from the development and the specifics of the financial crisis in Russia, the paper focuses on the frame of mind, behaviour, goals and means of Russian policy-makers that are reminiscent of Soviet formal and informal institutions and may have an impact on post-crisis developments and structures. A sui generis corporate state is emerging, the basic features of which range from the complex of the great power and belief in the state as a driver of growth to secrecy, mutual distrust, lack of transparency and accountability, and efforts to increase command on resources. The seeds of a Russian-style corporate state that emerged in the early 2000s with the creation of goskorporatsii are reinforced by economic slow-down and Russia-specific market failures. Competition for power - the President versus the Premier may help strengthen the demand from below for a stronger state and limited property rights. Retrenchment from competition, openness to Foreign Direct Investment and commitment to entry into the WTO expose the country to the risk of prolonged technological backwardness and possible regression to a society where private elite organisations are closely tied to the state and institutions are subservient to the leadership: a framework highly unsuitable for modernisation and growth.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e22d89c73a222918ceff6063abeb177",
  "timestamp": "2025-05-15T03:18:51.516557"
}