{
  "id": 8521,
  "title": "Efficacy and safety of corticosteroids and ACTH in epileptic syndromes beyond Infantile Epileptic Spasms Syndrome (IESS): A systematic review and meta-analysis",
  "abstract": "We conducted a systematic review investigating the efficacy and tolerability of adrenocorticotropic hormone (ACTH) and corticosteroids in children with epilepsies other than infantile epileptic spasm syndrome (IESS) that are resistant to anti-seizure medication (ASM). We included retrospective and prospective studies reporting on more than five patients and with clear case definitions and descriptions of treatment and outcome measures. We searched multiple databases and registries, and we assessed the risk of bias in the selected studies using a questionnaire based on published templates. Results were summarized with meta-analyses that pooled logit-transformed proportions or rates. Subgroup analyses and univariable and multivariable meta-regressions were performed to examine the influence of covariates. We included 38 studies (2 controlled and 5 uncontrolled prospective; 31 retrospective) involving 1152 patients. Meta-analysis of aggregate data for the primary outcomes of seizure response and reduction of electroencephalography (EEG) spikes at the end of treatment yielded pooled proportions (PPs) of 0.60 (95% confidence interval [CI] 0.52-0.67) and 0.56 (95% CI 0.43-0.68). The relapse rate was high (PP 0.33, 95% CI 0.27-0.40). Group analyses and meta-regression showed a small benefit of ACTH and no difference between all other corticosteroids, a slightly better effect in electric status epilepticus in slow sleep (ESES) and a weaker effect in patients with cognitive impairment and symptomatic etiology. Obesity and Cushing's syndrome were the most common adverse effects, occurring more frequently in trials addressing continuous ACTH (PP 0.73, 95% CI 0.48-0.89) or corticosteroids (PP 0.72, 95% CI 0.54-0.85) than intermittent intravenous or oral corticosteroid administration (PP 0.05, 95% CI 0.02-0.10). The validity of these results is limited by the high risk of bias in most included studies and large heterogeneity among study results. This report was registered under International Prospective Register of Systematic Reviews (PROSPERO) number CRD42022313846. We received no financial support.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e3094e7f6725f7b1738744243b69abc",
  "timestamp": "2025-05-15T03:19:52.000941"
}