{
  "id": 6420,
  "title": "A Recommender System and Risk Mitigation Strategy for Supply Chain Management Using the Counterfactual Explanation Algorithm",
  "abstract": "Supply chain management (SCM) and its disruptions and risks have been the focus of many researchers in recent times. It is important how to identify these disruptions and risks to avoid them, therefore many risk mitigation strategies have been developed. Artificial intelligence (AI) is a powerful tool to identify and predict the occurrence of risks, it is also important that the solutions to avoiding risks must be explainable for risk managers. Recently, making transparent and explainable AI models has been the focus of a large number of research studies and many posthoc algorithms such as counter-factual explanation (CE) algorithms have been developed. In this paper, first we propose an optimization problem to design a transportation schedule for the supply chain network (SCN), then to increase the resiliency and transparency of the designed schedule, the CE model is integrated into the model as a set of constraints. To design the CE, a logistic regression model is developed. The CE helps to plan the transportation schedule to avoid any transportation delay risk. The integrated CE and SCM model is used as a recommender system for risk managers to mitigate risk to the system. Finally, to validate the recommender system, a real case study is analyzed and the solutions of the model with and without the CE are compared and it is shown that the CE-added constraints increase the resiliency of the system significantly while the increase in financial cost is less than 1%. Therefore, the model is validated for use for different risks and disruptions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e30348034910ffd2dd531c363d8dfe1",
  "timestamp": "2025-05-15T02:58:05.584573"
}