{
  "id": 3423,
  "title": "Methodological Approach to Assessing the Impact of External Factors on Financial Risks of Retailers Considering Regional Aspects",
  "abstract": "Financial risk management in retail companies requires considering both internal and external risk factors. Contemporary researchers primarily focus on macroeconomic indicators disregarding regional aspects that might exacerbate key financial risks for multi-regional enterprises. The study aims to develop a methodological approach to assess and predict the impact of mesoeconomic factors on financial risks of retailers. Particular attention is paid to downside (profit and profitability) and structural risks. The presented approach implements the authors' concept based on the application of correlation-regression analysis of relationship between retail trade turnover of these companies and external factors. The study employs mathematical statistics and econometric analysis. Publicly accessible official data from the Federal State Statistics Service, the Central Bank of the Russian Federation and the United Nations for 2005-2021 were analysed. The research investigates changes in profit, profitability and combined leverage (which combines financial and operating leverage) affected by external factors. The proposed methodology for assessing the impact of external factors on financial indicators revealed their heterogeneous effect on retail trade turnover depending on the region. The study introduced a novel integrated leverage metric and its analytical estimates, which quantify the impact of external factor variations on profit and profitability of retail companies. The proposed methodology and resulting estimates can be used by financial, investment and managerial decision-makers to identify external factors affecting financial risks of companies at the meso level. The study contributes theoretically by developing a methodological approach to assessing and predicting financial risks considering regional aspects.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e5b163ffbd9db05157e6b36e8488321",
  "timestamp": "2025-05-15T02:26:09.128479"
}