{
  "id": 3244,
  "title": "It was the best of times, it was the worst of times: A tale of two years in not-for-profit hospital financial investments",
  "abstract": "Background: Not-for-profit (NFP) hospitals' accumulations of financial assets have been growing steadily over the past 10 years. Surprilsingly, little is known about how much investment reserves represent and how they are handled among NFR hospitals. Purpose: The purpose of this study is to evaluate investment strategies in financial assets among NFP hospitals. Specifically, this article seeks,to explore how NFP hospitals allocate and manage financial assets, how much risk hospitals, employ in their investment strategies, and the risk. and return trade-off under contrasting market conditions. Methodology/Approach: Using two years of survey data from the Commonfund Benchmarks Study for Health Care Institution's for fiscal-years, 2002 and 2003, we analyze NFP hospitals' investment strategies by comparing asset size,- investment management characteristics, board characteristics, asset allocation, levels of risk, and annual returns., Univariate regression analysis is used to evaluate the relationship between risk and return. Findings: NFP hospitals have sizeable long-term financial as over $558 million in 2002 and sets, averaging $634 million in 2003. Two thirds of these funds are invested in long-term operating funds followed by defined benefit pension funds and insurance reserves; management of these funds is primarily outsourced. NFP hospitals allocate, on average, 50% of their operating fund assets to equities. During the stock market downturn in 2002, each, 1% investment in equities was significantly associated with a -0.18% decrease in annual returns. In contrast, the relationship is almost exactly opposite-consistent with the relationship typically associated with risk and return-in 2003. Practice Implications: NFP hospitals with heavy reliance on investment income to boost total profit margins may have difficulty adjusting to periods of low performance. Evaluation of the performance and financial condition of the hospital must account for the size and composition,of financial assets.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e5f47ac127f3f3f36c200f38dc7646b",
  "timestamp": "2025-05-15T02:24:05.209287"
}