{
  "id": 3183,
  "title": "Network analysis on energy transition cooperation between countries",
  "abstract": "Energy transition is leading to a fundamental shift in interstate energy relationships as renewables, hydrogen, critical minerals and other technologies are being increasingly deployed worldwide, intertwined with climate change concern. Evolving bilateral and multilateral cooperation agreements on energy transition signals that the interstate energy relationship is forming differently compared to the fossil fuel-based energy relationships of the previous century. To understand the current landscape of international energy transition cooperation, the paper applied social network analysis to identify the clustering of cooperation between 176 countries and political bodies in energy transition, including renewables, hydrogen and critical minerals, nuclear energy, carbon capture, utilization and storage, and natural gas, by analysing 293 bilateral and multilateral energy cooperation arrangements. Overall, the countries having initiated bilateral cooperation programme, such as China, Japan, and Germany, have an expanded network with other countries under their respective bilateral scheme. It is also observed that both traditional energy exporters and importers are actively forming networks since both explore emerging opportunities driven by energy transition while their motivation may not be identical. Traditional energy exporters attempt to diversify their energy products' portfolio in consideration of the international pressure on decarbonization, whereas traditional energy importers seek opportunities to become an exporter or to secure a supply chain as consumers. For renewables, while China has the highest centrality regarding overall and renewable-specific cooperation, the European Union and United States consistently form clusters in each area of cooperation. With regard to hydrogen and critical minerals, the expected consumer countries are proactively connecting with other countries to secure a sustainable supply chain. It is also found that the European Union and the United States plus Japan tend to create not only bilateral but also multilateral cooperation through alliances and partnerships, making their clustering more solid.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e7dde6694531163aa1d36195cd570cb",
  "timestamp": "2025-05-15T01:14:16.297704"
}