{
  "id": 5709,
  "title": "Leveraging Bayesian Quadrature for Accurate and Fast Credit Valuation Adjustment Calculations",
  "abstract": "Counterparty risk, which combines market and credit risks, gained prominence after the 2008 financial crisis due to its complexity and systemic implications. Traditional management methods, such as netting and collateralization, have become computationally demanding under frameworks like the Fundamental Review of the Trading Book (FRTB). This paper explores the combined application of Gaussian process regression (GPR) and Bayesian quadrature (BQ) to enhance the efficiency and accuracy of counterparty risk metrics, particularly credit valuation adjustment (CVA). This approach balances excellent precision with significant computational performance gains. Focusing on fixed-income derivatives portfolios, such as interest rate swaps and swaptions, within the One-Factor Linear Gaussian Markov (LGM-1F) model framework, we highlight three key contributions. First, we approximate swaption prices using Bachelier's formula, showing that forward-starting swap rates can be modeled as Gaussian dynamics, enabling efficient CVA computations. Second, we demonstrate the practical relevance of an analytical approximation for the CVA of an interest rate swap portfolio. Finally, the combined use of Gaussian processes and Bayesian quadrature underscores a powerful synergy between precision and computational efficiency, making it a valuable tool for credit risk management.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e8886660d0c3831f5e22d2128478d69",
  "timestamp": "2025-05-15T02:50:21.395083"
}