{
  "id": 6128,
  "title": "Multivariate LSTM for Stock Market Volatility Prediction",
  "abstract": "Volatility is a measure of fluctuation in financial asset returns, practical measurement of risk, and a key variable for calculating options prices. Accurate prediction of volatility is crucial to maintaining profitable investments and trading strategies. Statistical models such as GARCH are used today to predict volatility and time series, though new methods are actively being researched to improve the prediction accuracy to cope with the rapidly increasing trading volumes and stock market influencing factors. The aim of this paper is to investigate a new method to improve market volatility forecasting accuracy by innovatively introducing a new setup of the Recurrent Neural Network (RNN) algorithm. In particular, the proposed model is a stacked Long Short-Term Memory (LSTM) with multivariate input composed of multiple asset daily prices of different lag time-steps. The proposed model is used to predict volatility under different market conditions and is compared to the predictions obtained with GARCH as well as to the actual volatility of the same forecasting period. The results show that the prediction of the future realized volatility using a single feature LSTM has comparable accuracy to GARCH. They also indicate that a stacked LSTM can significantly improve the volatility prediction accuracy when configured with multivariate input of more than one asset and a lagging period of more than a day. A stacked multivariate LSTM setup enables the prediction model to capture complex patterns in the time series data of assets prices and provides a superior alternative to statistical models in volatility modelling and prediction. The proposed multivariate LSTM architecture clearly shows faster and more accurate modelling of daily volatility and therefore can be used for intra-day modelling specifically for high frequency trading environments.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e88c5062fae7102ee79cf17d54678e4",
  "timestamp": "2025-05-15T02:55:12.863511"
}