{
  "id": 8835,
  "title": "Is there Informational Value in Corporate Giving?",
  "abstract": "In this article, we propose that giving in cash and non-cash (in-kind) differ in their relation with the giving firm's future corporate financial performance (CFP) and only cash giving is associated with future CFP. Using a novel dataset from ASSET4 that differentiates corporate giving over a sample period of 2002-2012, we examine three competing hypotheses: (1) agency cost hypothesis that cash giving reflects agency cost and destroys value for shareholders, (2) investment hypothesis that cash giving is an investment by management that aims for better future return, and (3) information hypothesis that cash giving has informational value to shareholders as cash is a critical resource at a firm and giving is a decision by managers who are insiders. We find that indeed, only cash giving is positively associated with future CFP and firm value, measured by Fama-French five-factor abnormal risk-adjusted stock returns, future return on assets, and Tobin's Q. In addition, we find that the positive association exists only between excess, i.e., unexpected, but not expected cash giving and future CFP. Our empirical findings support the information hypothesis, but neither the agency hypothesis nor the investment hypothesis, and are robust to a number of endogeneity tests, including orthogonalized cash giving, instrumental variable regression using geography-based instruments, and propensity score matching. Furthermore, we show that the positive association between future CFP and unexpected cash giving is only pronounced at firms with good governance and relatively higher sales growth where agency problems are less likely, and at firms with no alternative mechanisms to demonstrate the strength of cash flow. Additionally, we do not find evidence that suggests in-kind giving to possess any informational value.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e8c1df860d6093a3a2adcc74feccc91",
  "timestamp": "2025-05-15T03:22:57.906366"
}