{
  "id": 2932,
  "title": "Classification Framework for Free Space Optical Communication Links and Systems",
  "abstract": "Free space optical (FSO) communication technology, also known as optical wireless communications, has regained a great interest over the last few years. In some cases, FSO is seen as an alternative to existing technologies, such as radio frequency. In other cases, FSO is considered as a strong candidate to complement and integrate with next-generation technologies, such as SG wireless networks. Accordingly, FSO technology is being widely deployed in various indoor (e.g., data centers), terrestrial (e.g., mobile networks), space (e.g., inter-satellite and deep space communication), and underwater systems (e.g., underwater sensin g). As the application portfolio of FSO technology grows, so does the need for a clear classification for FSO link configurations. Most existing surveys and classifications are single-level classifications, and thus not inclusive enough to accommodate recent and emerging changes and developments of different FSO link configurations and systems. In this paper, we propose a multi-level classification framework to classify existing and future indoor, terrestrial, space, underwater, and heterogenous FSO links and systems using common and simple unified notation. We use the proposed classification to review and summarize major experimental work and systems in the area until 2017. Using the proposed classification and survey, we aim to give researchers a jump-start to tap into the growing and expanding realm of the FSO technology in different environments. The proposed classification can also help organize and systematically present the progress in the research on FSO technology. This makes the identification of the market needs for standards an easier task. Moreover, different entities involved in the standardization process including academic, industry, and regulatory organizations can use the proposed classification as a unified language to communicate during the early stages of standard development which require ambiguity-free discussions and exchange of ideas between different standardization entities. We use the proposed classification to review existing standards and recommendations in the field of FSO. It is also envisioned that the proposed classification can he used as a unified framework to define different FSO channel models for simulation tools.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9e92042559f246e4e46924376f1c9a21",
  "timestamp": "2025-05-15T01:11:48.482732"
}