{
  "id": 3054,
  "title": "Coal mining in Central-East Europe in perspective of industrial risk",
  "abstract": "Research background: Due to increasing economic and sector risk coal mining in Europe is treated as a declining industry. In post-transition economies such approach is a threat for energy security and local and regional economic development. Nowadays, coal mining survival in Central-East Europe is additionally threatened by accumulative global risk factors, especially by price differentiation and shale gas revolution in United States of America. Revealed circumstances require deepen research and diagnosis in the area of risk and corporate management in mining enterprises in Central- East Europe. Purpose of the article: The main aim of the article is to assess industrial risk in coal mining in Central-East Europe. The research is divided into three parts. In the first one the situation of coal mining in Central-East Europe is characterized. It is the basis for selection of the countries for the detailed analysis. In the second part the industrial risk factors are assessed and described. Finally, in the third part their influence on financial results in the examined mining enterprises is evaluated. In the summary the international comparison is made and general assumptions for risk and corporate management are formulated. Methods: In the article a risk checklist is used to identify the economic and industrial risk factors. To determine their influence on financial results on the first stage of research Pearson's coefficients are used. Than regression functions are developed. The data are collected on the basis of public statistics and financial statements of the examined mining enterprises. Findings & Value added: On the basis of research results it may be stated that there are only a few countries in Europe in which mining enterprises still operate as separate economic units and all of them have experienced serious financial troubles in the last years. Risk intensification contributed mostly to revenues reduction and negative financial results.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ea54286eb047de99d52f5787cd523c6",
  "timestamp": "2025-05-15T02:21:52.296363"
}