{
  "id": 7489,
  "title": "Risk-based licensing of alcohol venues and emergency department injury presentations in two Australian states",
  "abstract": "Background: Risk-based licensing (RBL) is among the more recent policy interventions to reduce alcohol-related harm in and around licensed venues. RBL sets licence fees to reflect the venue's propensity to cause harm as a means of encouraging operators to improve their practices. We assessed whether the introduction of RBL in the Australian states of Queensland and Victoria was associated with a reduction in the incidence of emergency department (ED) injury presentations. Methods: We employed an interrupted time series design using Prais-Winsten and Cochrane-Orcutt regression modelling to estimate step and slope parameters in injury incidence rates in each state. We defined the population as residents of the state, aged 15-54 years, the age group we considered most likely to be exposed to the night-time economy. To reduce noise, we confined cases to presentations during times previously identified as correlated with a high probability of alcohol involvement, namely 'high alcohol hours' (HAH). We adjusted our models for the alcopops tax, implemented shortly before RBL, and for assaults during low alcohol hours (LAH) as a proxy for other risk factors for assault. Results: RBL was not associated with an overall reduction in the incidence of ED injury presentations during HAH in Queensland (beta = 0.003; 95% CI: - 0.010, 0.003, p = 0.318) or Victoria (beta= - 0.010; 95% CI: -0.021, 0.001, p = 0.087). Post-hoc subgroup analyses showed a reduction in ED injury presentations among men aged 20-39 years in Victoria (beta = - 0.026; 95% CI:-0.012, - 0.040, p-0.0003) but this was not replicated in Queensland. Conclusion: There was little evidence that RBL affected the incidence of ED presentations for injury. This may be due to weak financial penalties being applied to venues assessed as high-risk.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ea60b517eb8def51eeacd3f83aca846",
  "timestamp": "2025-05-15T03:09:07.305410"
}