{
  "id": 6582,
  "title": "Clinical usefulness of risk-stratified outcome analysis in cardiac surgery in New Jersey",
  "abstract": "Background. The results of aortocoronary bypass grafting are under increasing scrutiny by the Health Care Financing Agency, health maintenance organizations, and the news media. Surgeons and hospital administrators are concerned that erroneous conclusions may be drawn from raw outcome data, which do not reflect the patient's preoperative condition. It is our contention that any realistic comparison of results among surgeons or institutions must take that condition into account through a process of risk management. Methods. We have developed a statistical model for risk stratification based on data compiled systematically at the Newark Beth Israel Medical Center since 1980. Univariate analysis and stepwise logistic regression are used to identify the most significant risk factors and determine the appropriate weight for each. Our original risk stratification system has now been updated by eliminating the optional fields and reweighting the variables. This has reduced the subjective input and improved the accuracy. Results. Use of the modified system shows good correlation between expected and observed outcomes at our institution and in other cases reported to the New Jersey Department of Health. It has improved the results especially in high-risk cases: in total, a group of 5,336 patients have been assessed by the modified system: the expected mortality overall was 7.2% and the observed mortality was 5.4%. In 1,280 high-risk patients, ie, those with an expected mortality of greater than 11%, the expected mortality was 16.2% and the observed mortality was 12.3%. Conclusions. Our results suggest a decline in length of hospital stay and beneficial changes in operative procedures. They also indicate that exclusion of high-risk cases will result in only minimal financial savings, perhaps less than 2%.",
  "year": 1996,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ea99bb341b4209bf9752140077450ed",
  "timestamp": "2025-05-15T02:59:36.977577"
}