{
  "id": 4180,
  "title": "Twenty Years After the EMS Research Agenda: Trends in Emergency Medical Services Publications and Research Funding",
  "abstract": "Study objective: Since its publication in 2001, the National EMS Research Agenda has brought attention to a relative paucity of emergency medical services (EMS)-specific research and has called for an increase in funding and infrastructure to support EMS research. We investigated the trends in EMS-specific publications and National Institutes of Health (NIH)-funded research grants in the 20 years since this landmark publication. Methods: We performed a structured PubMed search of English-language citations from 2001 to 2020 to identify publications with populations, settings, or topics related to EMS care, education, or operations. Publications in trade journals and studies not involving humans were excluded. We also queried NIH Research Portfolio Online Reporting Tools Expenditures and Results (RePORTER) using a similar structured search. Titles, keywords, and abstracts were reviewed. Descriptive statistics were calculated, and nonlinear trends were described using segmented regression models. Results: A total of 183,307 references met the search criteria in PubMed, and 4,281 grants were identified in NIH RePORTER. After removing duplicates, 152,408 titles were screened, with 17,314 (11.5%) included. EMS-related publications increased from 419 in 2001 to 1,788 in 2020, a 327% increase, compared with a 197% increase in total PubMed publications. There was a statistically significant nonlinear (J-shaped) increase in EMS publications after 2007. There were 1,166 funded EMS-related NIH grants, with a 469% increase from 2001 to 2020 compared with an 18% increase in overall NIH awards. Conclusion: Although total publications have doubled in the United States over the past 20 years, EMS-specific research has more than tripled and the number of funded EMS research grants has increased nearly 5-fold. Future evaluation should examine the quality of this research and its application to clinical practice. [Ann Emerg Med. 2023;82:94-100.]",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ebfdf5b73961598d22692d53dc732ce",
  "timestamp": "2025-05-15T01:24:25.460014"
}