{
  "id": 3212,
  "title": "Time-Varying Correlations of REITs and Implications for Portfolio Management",
  "abstract": "This study uses bivariate dynamic conditional correlations (DCC) to analyze REITs' relation with stock and bond markets from 1999 to 2018. The results show that the daily DCCs of both Equity REIT and Mortgage REIT returns experienced several structural changes attributed to the state of the economy, levels of leverage, inclusion or exclusion of REITs from the major S&P indices, and REITs getting their own Global Industry Classification Standard (GICS) category. To account for the structural changes, we allow the impact of the macroeconomic driving forces of the DCCs to vary over time. First, we formulate an OLS model using dummy variables regression (DV) to indicate regime membership, using endogenous break-dates. Then, we estimate a Markov regime-switching model (MRS) that allows the impacts of macroeconomic variables to differ during high and low variance regimes. Both complementary regime-sensitive models (DV and MRG) exhibit significant improvement relative to a traditional OLS model. The findings have significant implications for portfolio and risk management. For example, we find that with the new GICS sector, Equity REIT returns decoupled from the Financial Sector and the overall market as measured by the SP 500. These types of correlation shifts can significantly alter optimal portfolio weights whether trying to maximize returns, minimize risk, or achieving the highest risk-adjusted returns.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ec07db45940b5cc7046f6406a156476",
  "timestamp": "2025-05-15T02:23:33.630329"
}