{
  "id": 7325,
  "title": "Effects of socioeconomic status on clinical outcomes with ventricular assist devices",
  "abstract": "Background Lower socioeconomic status (SES) is a known risk factor for worse outcomes after major cardiovascular interventions. Furthermore, individuals with lower SES face barriers to evaluation for advanced heart failure therapies, including ventricular assist device (VAD) implantation. Hypothesis Examination of the effects of individual determinants of SES on VAD outcomes will show similar survival benefit in patients with lower compared with higher SES. Methods All VAD implants at the University of Florida from January 2008 to December 2015 were reviewed. Patient-level determinants of SES included place of residence, education level, marital status, insurance status, and financial resources stratified by percent federal poverty level. Survival or transplantation at 1 year, 30-day readmission, implant length of stay (LOS), and an aggregate of VAD-related complications were assessed in univariate fashion and multivariable regression modeling. Results A total of 111 patients were included (mean age at the time of implant 57.6 years, 82.8% men). More than half received destination therapy. At 1 year, 78.3% were alive on device support or had undergone successful transplantation. There were no differences in survival, 30-day readmission, or aggregate VAD complications by the SES category. Although patients with lower levels of education had longer LOS in univariate analysis, on multivariable ordinal regression modeling, this relationship was no longer seen. Conclusions Patients with lower SES receive the same survival benefit from VAD implantation and are not more likely to have 30-day readmissions, complications of device support, or prolonged implant LOS. Therefore, VAD implantation should not be withheld based on these parameters alone.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ec46ffe0bf3344effc2cf5c41a2cf2a",
  "timestamp": "2025-05-15T03:07:31.869651"
}