{
  "id": 342,
  "title": "CONSTRUCTION OF ELECTRONIC PROFESSIONAL PORTFOLIO AS INSTRUCTIONAL TECHNO-PEDAGOGICAL DESIGN: AN EXPERIENCE",
  "abstract": "The electronic portfolio is agreed with the educative proposal in knowledge society because it shows evidences about process and product of deep learning. Construction of an electronic portfolio promotes reflective though and authentic evaluation of student performance. From a constructivist vision in education, this experience exposes a way to build an electronic professional portfolio with pedagogical and psychology postgraduate students where they put together different concepts and resources about portfolios as educational and technological diffusion tool. The process of electronic portfolios construction was in two steps: a) reading and analyzing of educative literature on the subject of models and conception about portfolios, b) collaborative learning and deliberation in order to define electronic professional portfolio, there were different dimensions as professional identity, educational work lines with portfolio, prospective vision of professional work and personal reflective space. In each dimension, guide questions were in order to support student's reflection process. In addition, students' evidences were selected from their knowledge, teacher work and examples of problems solve in their professional performance. At the same time, students had preparation and help in technology usage of Google Sites. Also student group made a rubric to asses an electronic portfolio. This rubric consists with different dimensions of an electronic professional portfolio. The portfolios construction was co-evaluated through a blog. This paper analyzes collaborative work of some participants in an electronic professional construction process. These analyze show examples of different dimensions and student's co-evaluation expressions. Electronic professional portfolio is a good strategy for helping students to watch their professional work in a critical and significance way.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9eca684ea1233cb99a1acce5035a1278",
  "timestamp": "2025-05-15T00:34:44.424837"
}