{
  "id": 4747,
  "title": "HIV infection risk among women in South Africa: assessing the roles of women's financial autonomy, sexual autonomy and intimate partner violence",
  "abstract": "AimTo assess the inter-relationships between women's sexual autonomy (SA), financial autonomy (FA), and experience of intimate partner violence (IPV); and determine how these factors influence HIV infection risk.Subject and methodsThis is a secondary analysis of the 2016 South-Africa Demographic and Health Survey. The study included all ever-partnered women aged 18-49 who were randomly selected for the domestic violence and HIV test modules. SA was measured from questions about women's ability to refuse sex or request condom use. FA was measured from questions about women's employment status, personal earnings, etc. IPV was measured from questions about women's experience of emotional, physical and/or sexual violence. Bivariate analyses were used to assess the inter-relationships between SA, FA and IPV, and their individual relationships with HIV. Lastly, a multiple logistic regression model assessed their mutually adjusted associations with HIV infection risk.ResultsThere was no apparent relationship between sexual and financial autonomy, but they were weakly inversely associated with IPV. In the bivariate analyses, all three variables were associated with HIV risk. However, in the mutually adjusted model, only SA and IPV remained associated with HIV risk. Low SA (AOR = 2.01, 95% CI 1.30 to 3.10, p = 0.006) and exposure to sexual violence (AOR = 2.91, 95% CI 1.14 to 7.43, p = 0.03) were associated with higher odds of HIV seropositivity.ConclusionThis study highlighted the important roles of SA and IPV on women's HIV risk, as well as the need for further research to clarify the role of FA.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ecb4efaaf2fca01e1ebed4590904e20",
  "timestamp": "2025-05-15T02:40:27.969815"
}