{
  "id": 4111,
  "title": "Subjective Social Status and Financial Hardship: Associations of Alternative Indicators of Socioeconomic Status with Problem Drinking in Asian Americans and Latinos",
  "abstract": "Background: Prior research shows inconsistent associations between socioeconomic status (SES) and alcohol outcomes, particularly for immigrant populations. Conventional markers of SES may not fully capture how social position affects health in these groups. Objective: We examine: (1) the associations of two alternative indicators, subjective social status (SSS) and financial hardship, with problem drinking outcomes, heavy episodic drinking (HED) and alcohol use disorder (AUD), for Asian Americans and Latinos; and (2) moderation of these relationships by educational level and nativity status. Methods: Multiple logistic regression modeling was performed using nationally-representative Asian American (n = 2,095) and Latino samples (n = 2,554) from the National Latino and Asian American Study. Age, gender, nativity, individual-level SES (income and education), unfair treatment, racial discrimination, and social support were adjusted. Results: Financial hardship was independently associated with AUD in both Asians and Latinos. Lower SSS was associated with increased AUD risk among individuals with college degrees or with US nativity in both populations. The association between financial hardship and HED was positive for US-born Latinos and foreign-born Asians, and negative for foreign-born Latinos. Conclusions: SSS and financial hardship are indicators of SES that may have particular relevance for immigrant health, independently of education and income, with SSS particularly meaningful for AUD in the more conventionally advantaged subgroups. There may be underlying processes affecting Asian and other Latino subgroups with similar socioeconomic and nativity profiles and exposing them to common risk/protective factors of AUD.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ed295ddc886137e8cbe73c9019b53f2",
  "timestamp": "2025-05-15T02:33:03.575628"
}