{
  "id": 348,
  "title": "Enterprise credit risk prediction using supply chain information: A decision tree ensemble model based on the differential sampling rate, Synthetic Minority Oversampling Technique and AdaBoost",
  "abstract": "The spread of enterprise credit risk in the supply chain may lead to large-scale bankruptcy and credit crises, which are related to national economic and social stability and financial system security. Therefore, enterprise credit risk in the supply chain context is not only a concern for banking financial institutions, credit rating agencies and enterprise managers but also the focus of governments. This article develops a DTE-DSA (decision tree [DT] ensemble model using the differential sampling rate, Synthetic Minority Oversampling Technique [SMOTE] and AdaBoost) prediction framework integrating supply chain information to predict enterprise credit risk. The empirical test shows that using supply chain information can significantly improve the prediction score. The DTE-DSA model has the best prediction effect in dealing with class imbalance problems. Compared with single classifier models-such as logistic regression, k-nearest neighbours, support vector machine, DT and DT using the SMOTE-as well as ensemble models-such as extremely randomized trees, random forest, rotation forest, extreme gradient boosting, gradient boosting DT and DT ensemble model using AdaBoost-the DTE-DSA model not only has the best prediction score but also has a more stable performance. The comprehensive use of supply chain information and the DTE-DSA model can result in the highest prediction score, with an area under the curve of 0.9016 and a Kolmogorov-Smirnov statistic of 0.7369. Further analysis of the variables of importance enhances the interpretability of the model and obtains relevant management insights.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ed3e4608302e5c074315e327b4e9595",
  "timestamp": "2025-05-15T01:49:41.085178"
}