{
  "id": 7266,
  "title": "INFLUENCE OF COVID-19 RELATED MEDIA AND NEWS ON THE STOCK AND CRYPTO MARKETS",
  "abstract": "The entire world was significantly impacted by the COVID-19 pandem- ic, leading to confusion and turbulence in healthcare systems, as well as to extreme uncertainty in the financial realm. There was a profound distress in stock markets due to the enormously elevated levels of risk instigated by the pandemic, which additionally inflated investors' losses. The contagion was supplemented by a surge of false stories that appear to be news (fake news) that circulated throughout all media channels, thus additionally am- plifying uncertainty. This paper expands the previous literature by investi- gating media impact on prominent indices of the stock and cryptocurrency markets. RavenPack Panic and Fake News indices were utilized to exam- ine their influence on S&P 500 and crypto (Royalton CRIX) indices' daily movements by employing OLS and quantile regression. The results exhibit that there are noteworthy dependencies over the conditional distribution, but they present only a small influence on observed indices. Fake news influ- ences the cryptocurrencies' daily movements in a bearish market, however the effect is very weak. Furthermore, media -induced panic is significant in both exceptionally bearish and bullish conditions considering S&P 500 daily returns, but is also exhibiting low impact.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9edc956bc651ad768f637b9eed7ecee2",
  "timestamp": "2025-05-15T03:07:02.529293"
}