{
  "id": 8244,
  "title": "The dual nature of cooperation and its influence on SME's innovativeness",
  "abstract": "In this paper, the external and internal cooperation determinants of the four types of innovation - product, process, organisational and marketing - are studied from the perspective of small and medium-sized enterprises (SMEs). From a theoretical standpoint, taking into account the dual nature of cooperation, cooperation determinants can be divided into two groups: external comprising triple helix entities: universities, governments and industry, and internal - comprising employee personality traits: decision-making autonomy, creativity, willingness to cooperate, openness to changes, risk-taking and social empathy. Additionally, three control variables were considered: age, size and sector of economic activity. The data examined comes from an empirical study of a randomly selected representative sample of 1286 SMEs in the Kuyavian-Pomeranian voivodeship, a region in central-northern Poland. The empirical research was carried out between June and September 2019 using the CAPI method. The multivariate probit regression model was used to analyse the obtained data. The results indicate that only two factors directly connected with the triple helix are common and significant determinants explaining all SME innovations. These are cooperation with public administration in the field of financial support, and cooperation with clients. In turn, significant variation was observed in terms of personality traits being an essential element of internal cooperation that may influence SME innovations. A positive impact on the probability of implementing three of the four types of innovation was observed for two personality traits, namely creativity and social empathy.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9edd8ff7cdcdb99bbc347e86073c64e1",
  "timestamp": "2025-05-15T03:16:48.991116"
}