{
  "id": 7613,
  "title": "A preliminary evaluation of Kids Matter: A community-based parenting intervention",
  "abstract": "Parents living in deprived communities are more likely to report lower parental self-efficacy and wellbeing. Poor parental wellbeing and self-efficacy are known risk factors in the development of a range of health and behavioural problems in childhood, adolescence and adulthood. Parenting interventions are key to prevent adverse outcomes in children, however, the mechanisms by which parents learn to understand and support their children are still not well understood. This study evaluated the acceptability of Kids Matter, a parenting intervention targeting parents who are struggling with financial adversity. Secondarily, the relationship between parental wellbeing and and self-efficacy was examined. The present is a retrospective, consecutive case series design study, comparing routinely collected data at pre-intervention, post-intervention, and at 3-month follow-up. Descriptive frequencies were drawn to explore parents' impressions of the programme. Multivariate analysis of variance and regression modelling were used to evaluate associations between parental wellbeing and self-efficacy at different time points. Parents found the programme enjoyable and useful. The intervention led to significant improvements in parental wellbeing and self-efficacy. Improvements in parental wellbeing were significantly associated with improvements in self-efficacy. This study provides evidence of the acceptability and effectiveness of Kids Matter.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9eed4b3a11d675485e7ccd520d241823",
  "timestamp": "2025-05-15T03:10:32.970962"
}