{
  "id": 8016,
  "title": "The association between social risks and days at home for older veterans",
  "abstract": "BackgroundMany health systems are trying to support the ability of older adults to remain in their homes for as long as possible. Little is known about the relationship between patient-reported social risks and length of time spent at home. We assessed how social risks were associated with days at home for a cohort of older Veterans at high risk for hospitalization and mortality.MethodsA prospective cross-sectional study using a 2018 survey of 3479 high-risk Veterans aged >= 65 linked to Veterans Health Administration data. Social risks included measures of social resources (i.e., no partner present, low social support), material resources (i.e., not employed, financial strain, medication insecurity, food insecurity, and transportation barriers), and personal resources (i.e., low medical literacy and less than high school education). We estimated how social risks were associated with days at home, defined as the number of days spent outside inpatient, long-term care, observation, or emergency department settings over a 12-month period, using a negative binomial regression model.ResultsNot having a partner, not being employed, experiencing transportation barriers, and low medical literacy were respectively associated with 2.57, 3.18, 3.39, and 6.14 fewer days at home (i.e., 27% more facility days, 95% confidence interval [CI] 8%-50%; 42% more facility days, 95% CI 7%-89%; 34% more facility days, 95% CI 7%-68%; and 63% more facility days, 95% CI 27%-109%). Experiencing food insecurity was associated with 2.62 more days at home (i.e., 24% fewer facility days, 95% CI 3%-59%).ConclusionsFindings suggest that screening older Veterans at high risk of community exit for social risks (i.e., social support, material resources, and medical literacy) may help identify patients likely to benefit from home- and community-based health and social services that facilitate remaining in home settings. Future research should focus on understanding the mechanisms by which these associations occur.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ef07b526eda6152221576cfd23f5393",
  "timestamp": "2025-05-15T03:14:37.258139"
}