{
  "id": 6072,
  "title": "Preoperative Biopsychosocial Assessment and Length of Stay in Orthopaedic Surgery Admissions of Youth with Cerebral Palsy",
  "abstract": "Caregivers of children with cerebral palsy (CP) experience stress surrounding orthopaedic surgery related to their child's pain and recovery needs. Social determinants of health can affect the severity of this stress and hinder health care delivery. A preoperative biopsychosocial assessment (BPSA) can identify risk factors and assist in alleviating psychosocial risk. This study examined the relationship between the completion of a BPSA, hospital length of stay (LOS), and 30-day readmission rates for children with CP who underwent hip reconstruction (HR) or posterior spinal fusion (PSF). Outcomes were compared with a matched group who did not have a preoperative BPSA. The BPSA involved meeting with a social worker to discuss support systems, financial needs, transportation, equipment, housing, and other services. A total of 92 children (28 HR pairs, 18 PSF pairs) were identified. Wilcoxon analysis was statistically significant (p = 0.000228) for shorter LOS in children who underwent PSF with preoperative BPSA (median = 7.0 days) vs. without (median = 12.5 days). Multivariate analysis showed that a BPSA, a lower Gross Motor Function Classification System level, and fewer comorbidities were associated with a shorter LOS after both PSF and HR (p < 0.05). Identifying and addressing the psychosocial needs of patients and caregivers prior to surgery can lead to more timely discharge postoperatively.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9efb387cc91a8aa8635e084e445dc04d",
  "timestamp": "2025-05-15T02:54:38.740878"
}