{
  "id": 2176,
  "title": "Constructing an e-portfolio-based integrated learning environment supported by library resource",
  "abstract": "Purpose - The purpose of this study was to present a pilot electronic portfolio (e-portfolio)- integrated learning environment by integrating library resources into an e-portfolio system for its application, and to explore reader's satisfaction of the integrated system. Design/methodology/approach - This study develops a research model by modifying the information success model to explore reader satisfaction to the understanding of the adoption of integrated system. The sample consisted of 289 graduate and undergraduate students. In total, 189 were considered useful and used for analysis. A regression analysis was then conducted to identify key causal relationships. Findings - The findings show that reader-perceived benefits, information quality and system quality are critical factors for the reader's satisfaction. Overall, the model explained 84 per cent of the variance in reader satisfaction. Thus, the results show that the proposed model does satisfactorily explain the reader's satisfaction of the integrated system. Originality/value - There is scant research available in the literature on user satisfaction of pilot e-portfolio-integrated learning environment from a reader perspective. The findings of this research provide some useful insights into a reader's satisfaction toward adoption of the integrated system. In addition, it will be valuable for better understanding of factors affecting the determinants of reader's satisfaction, which improve the reader's satisfaction of the integrated system and thereby boost realization of collaborative learning environment.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f063603f7850ad535b3d06841e66763",
  "timestamp": "2025-05-15T01:03:36.730564"
}