{
  "id": 5767,
  "title": "A simple-to-use nomogram for predicting prolonged mechanical ventilation for children after Ebstein anomaly corrective surgery: a retrospective cohort study",
  "abstract": "BackgroundProlonged mechanical ventilation (PMV) after pediatric cardiac surgery imposes a great burden on patients in terms of morbidity, mortality as well as financial costs. Ebstein anomaly (EA) is a rare congenital heart disease, and few studies have been conducted about PMV in this condition. This study aimed to establish a simple-to-use nomogram to predict the risk of PMV for EA children.MethodsThe retrospective study included patients under 18 years who underwent corrective surgeries for EA from January 2009 to November 2021. PMV was defined as postoperative mechanical ventilation time longer than 24 hours. Through multivariable logistic regression, we identified and integrated the risk factors to develop a simple-to-use nomogram of PMV for EA children and internally validated it by bootstrapping. The calibration and discriminative ability of the nomogram were determined by calibration curve, Hosmer-Lemeshow goodness-of-fit test and receiver operating characteristic (ROC) curve.ResultsTwo hundred seventeen children were included in our study of which 44 (20.3%) were in the PMV group. After multivariable regression, we obtained five risk factors of PMV. The odds ratios and 95% confidence intervals (CI) were as follows: preoperative blood oxygen saturation, 0.876(0.805,0.953); cardiothoracic ratio, 3.007(1.107,8.169); Carpentier type, 4.644(2.065,10.445); cardiopulmonary bypass time, 1.014(1.005,1.023) and postoperative central venous pressure, 1.166(1.016,1.339). We integrated the five risk factors into a nomogram to predict the risk of PMV. The area under ROC curve of nomogram was 0.805 (95% CI, 0.725,0.885) and it also provided a good discriminative information with the corresponding Hosmer-Lemeshow p values > 0.05.ConclusionsWe developed a nomogram by integrating five independent risk factors. The nomogram is a practical tool to early identify children at high-risk for PMV after EA corrective surgery.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f08073df0eb5cd697bf4ca9bc71b9b7",
  "timestamp": "2025-05-15T02:51:29.968425"
}