{
  "id": 8877,
  "title": "Patient factors affecting successful linkage to treatment in a cervical cancer prevention program in Kenya: A prospective cohort study",
  "abstract": "Objective To identify patient factors associated with whether women who screened positive for high-risk human papillomavirus (hrHPV) successfully accessed treatment in a cervical cancer prevention program in Kenya. Methods A prospective cohort study was conducted as part of a trial of implementation strategies for hrHPV-based cervical cancer screening in western Kenya from January 2018 to February 2019. In this larger trial, women underwent hrHPV testing during community health campaigns (CHCs), and hrHPV+ women were referred to government facilities for cryotherapy. For this analysis, we looked at rates of and predictors of presenting for treatment and presenting within 30 days of receiving positive hrHPV results (timely presentation). Data came from questionnaires completed at the time of screening and treatment. Multivariable logistic regression was used to identify factors associated with each outcome. Results Of the 505 hrHPV+ women, 266 (53%) presented for treatment. Cryotherapy was performed in 236 (89%) of the women who presented, while 30 (11%) were not treated: 15 (6%) due to gas outage, six (2%) due to pregnancy, five (2%) due to concern for cervical cancer, and four (2%) due to an unknown or other reason. After adjusting for other factors in the multi-variable analysis, higher education level and missing work to come to the CHC were associated with presenting for treatment. Variables that were associated with increased likelihood of timely presentation were missing work to come to the CHC, absence of depressive symptoms, told by someone important to come to the CHC, and shorter distance to the treatment site. Conclusion The majority of hrHPV+ women who did not get treated were lost at the stage of decision-making or accessing treatment, with a small number encountering barriers at the treatment sites. Patient education and financial support are potential areas for intervention to increase rates of hrHPV+ women seeking treatment.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f261303c403abcb76c1ba0fa646c66f",
  "timestamp": "2025-05-15T03:23:27.775448"
}