{
  "id": 8185,
  "title": "Stock Market Integration and Trade: A Study on India and its Major Trading Partners",
  "abstract": "Indian stock market is increasingly integrated with other markets of the world after economic liberalization. This linkage of Indian stock market reduces the scope of risk minimization of portfolio by diversifying between stock markets of India and its integrated partners. Researchers indicate that economic variables influence the integration of stock markets. Trade is one of the major parameters. In this study effort has been made to find how Indian stock market integration varies with amount of trade with its trading partners. Hence 21 years' weekly data from 1 January 1999 to 31 December 2019 have been collected for 15 countries, which belong to the list of top 25 trading partners of India since 1999. Total sample of 15 countries have been divided into two groups-Asia Pacific and European group along with United States, to check whether integration increase with trade. Johansen Cointegration test has been used between stock markets of India and two groups of countries. To confirm the result of Johansen cointegration test, the same test was ran on joint index for each group and Sensex of India. It also helped to check the effect of geographical proximity on this integration. Conditional correlation was found using asymmetric generalized dynamic conditional correlation (AGDCC) GARCH model, between Sensex and each of the 15 countries, to observe the time varying nature of correlation. Twenty one year's data has helped to find the impact of global financial crisis (GFC) of 2008 on these interlinkages. Lending rate differential and inflation rate differential can cover many economic parameters, hence used as control variable. Time series regression has been used to find the impact of trade, interest rate and inflation differential on correlation between Indian stock market index and index of any other countries. Pooled panel regression has been used to check the same relationship on all countries in every group. Nine Asian countries together contribute higher amount of trade with India since 2004 than jointly five European countries and the United States. Trade difference is very low, hence this study analysed both the groups. Asia Pacific group of countries is more integrated with India than European group and the United States. None of the joint index is integrated with Indian stock market index. Conditional correlation between Indian index and each of the country has changed over time. Time series regression implies that except very few cases, trade and other economic factors cannot influence the integration. As expected, the interest rate differential and inflation differential have negative and positive impacts on the correlation respectively but these impacts are not significant in many cases. Pooled panel regression shows that trade and GFC have positive and significant impact on correlation between India and Asia Pacific countries but not with the same between India and European countries and United States. International investors will not be able to reduce their portfolio risk by diversifying between India and any other of the 15 countries in the sample because all of them are integrated with Indian stock market. Trade of India with Asian countries has increased in recent years and integration has also increased. Although time series and pooled panel regression do not prove it's significant impact on conditional correlation between India and the sampled countries. But trade between two countries definitely bear a role in integration.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f3491f2ea27286881de7243586fd214",
  "timestamp": "2025-05-15T03:16:17.390770"
}