{
  "id": 3497,
  "title": "Coastal urban flood risk management: Challenges and opportunities - A systematic review",
  "abstract": "Generational mechanisms and spatio-temporal evolution patterns of coastal urban flood risk involve complex interactions between climate change, sea level rise and human-induced factors, necessitating integrated adaptive flood management strategies to mitigate evolving vulnerabilities. This systematic review offers a thorough assessment of the challenges and strategic opportunities for sustainable adaptation in managing flood risk in coastal urban areas. It integrates emerging innovative technologies and financial solutions to identify promising approaches to implement mitigation strategies and improve coastal urban flood resilience. Enhancing governance and policy frameworks is crucial for the successful implementation of coastal urban flood risk management (CUFRM) plans. An innovative participatory planning framework is developed to promote flood management practices which are socially inclusive and equitable. Funding for green infrastructure and nature-based solutions and the strategic use of public-private partnerships are effective methods for advancing sustainable flood risk management (FRM). The advancements in emerging technologies, such as artificial intelligence (AI), machine learning (ML), deep learning (DL), social media and digital twin technologies, provide dynamic and collaborative platforms for simulating flood scenarios and have potential to significantly improve CUFRM practices. In the end, a cross-country comparison of current practices in Australia, China, the Netherlands, the UK and the USA reveals a diverse range of approaches and valuable insights derived from regional experiences. The review provides a comprehensive analysis for researchers, policymakers and practitioners aiming to improve flood resilience in coastal metropolitan regions by learning from effective UFRM approaches that enhance governance structures, infrastructure resilience and funding mechanisms.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f40c129b15ecabe271fa4e2cf202b68",
  "timestamp": "2025-05-15T02:26:48.578233"
}