{
  "id": 1909,
  "title": "Guiding incumbent companies in navigating digital transformations: A qualitative study on structural ambidexterity and strategic leadership",
  "abstract": "PURPOSE: Despite digital transformation being a focus topic for incumbent companies, organizational structures are a significant barrier to their success. Referring to the positive correlation between ambidexterity and digital innovation, our research provides guidance on structural ambidexterity for incumbent companies. Previous research has barely differentiated between exploration and exploitation in digital transformation. In the present paper, we fill part of this research gap by focusing on structural ambidexterity in digital transformations and providing guidance on how incumbent companies can overcome organizational challenges. METHODOLOGY: Our research is based on an explorative research design with 33 semi-structured interviews that allow in-depth information. The interview partners were selected using purposive sampling and represented different industry and hierarchy levels. All of them have been in a position related to digital transformation in an incumbent company for the last two years. We ensure scholarly rigor using thematic analysis to analyze our data. FINDINGS: Our decision tree guides separation or integration based on the closeness of digital activities to the core business and the association of the activities to exploration or exploitation. Additionally, we recommend considering the digital maturity grade in the decisionmaking. Developing a cross-functional digital transformation strategy and pursuing a balanced portfolio fosters ambidexterity in digital transformation. Clear responsibilities, collaborative decision-making, candidate selection, and collaboration with IT are essential leadership activities. IMPLICATIONS for theory and practice: Our research expands the existing research on digital transformations of incumbent companies. We specifically contribute to the limited details on how to separate digital activities considering an exploration/exploitation perspective. Our study guides practitioners to address one of their major challenges in digital transformations with the help of our decision tree. ORIGINALITY AND VALUE: Based on the positive correlation between ambidexterity and digital innovation, our study contributes to the existing research by providing in-depth knowledge of structural ambidexterity in digital transformations. This detailed information is essential to provide knowledge on enabling the positive correlation between ambidexterity and innovation in the context of structural ambidexterity.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f580e97e34b66b4877fe820a060b16f",
  "timestamp": "2025-05-15T01:01:06.101327"
}