{
  "id": 6427,
  "title": "Trends and projections of universal health coverage indicators in Iraq, 2000-2030: A national and subnational study",
  "abstract": "Introduction: Iraq has had limited access to healthcare services due to successive conflicts and political turmoil. Since 2018, Iraq has embarked on a new reconstruction process which includes a goal of 100% immunisation against certain diseases in 2030. We aimed to undertake a comprehensive assessment of Iraq's progress towards universal health coverage (UHC) targets that could contribute to Iraq's policy and strategies. Methods: We estimated the coverage of UHC indicators from six nationally representative population-based household surveys in Iraq during 2000-2018. We employed 14 health service indicators and two financial risk protection indicators in our UHC progress assessment. We used a Bayesian hierarchical regression model to estimate the trend and projection of health service indicators. Results: Improved water sources, adequate sanitation, institutional delivery, skilled birth attendants, and BCG reached the 80% targets in 2018, and are projected to maintain their status in 2030 at national and subnational levels. Family planning needs satisfied, acute respiratory infection treatment for pneumonia, and oral rehydration therapy will be much less than 80% in 2030. 12% of Iraqi households incurred catastrophic health expenditures in 2012, which was a fourfold increase from 2007. Some governorates faced ten- to twentyfold increases in catastrophic health expenditures, for example, from 0.8% to 15.9% in Diala. Approximately 3% of non-poor households became poor due to out-of-pocket (OOP) payments in 2012. Conclusion: Without proactive strengthening of the healthcare systems, achieving UHC in Iraq by 2030 would be a challenge. Worsened trends were observed in both conflict-affected and underdeveloped areas in health service coverage and financial risk protection. Recovery of GDP spending on health and pre-pooled financing mechanisms should be introduced for OOP payment reduction. Prioritising nationwide primary healthcare services and regulating public-private role-allotment in the health sector are crucial in improving low coverage indicators and decreasing disparities among governorates.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f5a35f3e3217c87ffae5967af1e5ead",
  "timestamp": "2025-05-15T02:58:05.614666"
}