{
  "id": 2605,
  "title": "Economic policy uncertainty and Indian equity sectors: a quantile regression approach",
  "abstract": "Purpose - This paper aims to investigate the effect of economic policy uncertainty (EPU) shocks on Indian equity market sectors. The effect of domestic (Indian) and foreign (USA) EPU shocks is examined on ten major Bombay Stock Exchange sectors. Design/methodology/approach - The study uses data covering the period from September 2005 to July 2023 and uses the methodology of quantile regression to investigate the heterogenous response of stock market sectors under diverse market conditions explained through the analysis of conditional quantiles distribution. Findings - The results demonstrate that domestic and foreign EPU shocks negatively affect most of the sectors in bearish market conditions. Industrials, commodities, utilities, consumer discretionary and financial services are the most affected sectors by domestic EPU. However, the information technology sector is found to be immune to domestic EPU shocks but negatively affected by foreign EPU shocks. On the other hand, energy, financial services and fast-moving consumer goods sectors are found to be immune to foreign EPU shocks but are negatively affected by domestic EPU shocks. Practical implications - Understanding the heterogeneous response of different sectors to EPU shocks could help investors and portfolio managers identify portfolio diversification opportunities. Originality/value - This study makes an inaugural attempt to examine the responses of Indian stock market sectors to domestic and foreign EPU shocks using the approach of quantile regression and unveils the previously unexamined diverse reactions of Indian stock market sectors to EPU shocks originating from both India and USA.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f6db0f67405c91b7190bfcbb2bf8c0c",
  "timestamp": "2025-05-15T01:08:41.874913"
}