{
  "id": 4615,
  "title": "Threshold nonlinear relationship between renewable energy consumption and agriculture productivity: the role of foreign direct investment and financial inclusion",
  "abstract": "Global warming is a life-threatening risk to mankind and its survival; to combat this risk, the considerable contribution of renewable energy cannot be overlooked for sustainable growth globally. The aim of this paper is to scrutinize the threshold level and asymmetric connection among renewable energy consumption, foreign direct investment, financial inclusion, and agricultural productivity in dissimilar regimes of the different income levels of 123 countries from 1995 to 2019 by applying an advance technique PSTR (panel smooth transition regression) model. The PSTR model results imply that the connection between renewable energy consumption and agricultural productivity at all the estimates is non-linear. Moreover, in all countries, there is a positive and significant connection among renewable energy consumption, foreign direct investment, financial inclusion, and agricultural productivity in both low and high regimes, except the carbon emission, which has a negative and significant impact on agricultural productivity. Based on the results of this study, the recommendations are as follows: (i) to increase renewable energy consumption, efficient-energy resources should be used by farmers for the agricultural process; (ii) the dependence on non-renewable energy resources should be minimized and shifted towards natural and renewable resources.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f739547ace6b4ce411a61579b28ec9b",
  "timestamp": "2025-05-15T02:39:26.901455"
}