{
  "id": 3953,
  "title": "A multi-perspective cost-effectiveness analysis comparing rivaroxaban with enoxaparin sodium for thromboprophylaxis after total hip and knee replacement in the German healthcare setting",
  "abstract": "Background: Patients undergoing major orthopaedic surgery (MOS), such as total hip (THR) or total knee replacement (TKR), are at high risk of developing venous thromboembolism (VTE). For thromboembolism prophylaxis, the oral anticoagulant rivaroxaban has recently been included in the German diagnosis related group (DRG) system. However, the cost-effectiveness of rivaroxaban is still unclear from both the German statutory health insurance (SHI) and the German hospital perspective. Objectives: To assess the cost-effectiveness of rivaroxaban from the German statutory health insurance (SHI) perspective and to analyse financial incentives from the German hospital perspective. Methods: Based on data from the RECORD trials and German cost data, a decision tree was built. The model was run for two settings (THR and TKR) and two perspectives (SHI and hospital) per setting. Results: Prophylaxis with rivaroxaban reduces VTE events (0.02 events per person treated after TKR; 0.007 after THR) compared with enoxaparin. From the SHI perspective, prophylaxis with rivaroxaban after TKR is cost saving ((sic)27.3 saving per patient treated). However, the cost- effectiveness after THR ((sic)17.8 cost per person) remains unclear because of stochastic uncertainty. From the hospital perspective, for given DRGs, the hospital profit will decrease through the use of rivaroxaban by (sic)20.6 (TKR) and (sic)31.8 (THR) per case respectively. Conclusions: Based on our findings, including rivaroxaban for reimbursement in the German DRG system seems reasonable. Yet, adequate incentives for German hospitals to use rivaroxaban are still lacking.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f82056ffaade6bb2d4ac1d200efabc1",
  "timestamp": "2025-05-15T02:31:28.491878"
}