{
  "id": 4053,
  "title": "Predictive view of the value relevance of earnings in India",
  "abstract": "Purpose This study aims to examine the value relevance of earnings in terms of predicting the value variables such as cash flow, capital investment (CI), dividend and stock return under the Indian institutional settings. Design/methodology/approach The study used panel Granger causality tests to examine causality relationships among variables and panel data regression models to check the statistical associations between earnings and value variables. Findings Based on a data set of 7,280 Bombay Stock Exchange-listed firm-years spanning over ten years from March 2009 to March 2018, the results show higher sensitivity of earnings toward cash flows, CI, divided and stock return and vice-versa. Further, the findings deduced from the empirical results demonstrate that earnings are positively related to value variables. Overall, the results established that earnings are value-relevant and have predictive ability to forecast the value variables that facilitate investors in portfolio valuation. The results are consistent with the predictive view of the value relevance of earnings. Several robustness checks confirm these results. Originality/value This study brings new empirical evidence from a distinct capital market, India, and provides a new facet to the value relevance debate in terms of its prediction view. The study is among earlier attempts that jointly measure the ability of earnings in forecasting different value variables by taking a uniform sample of firms at the same period. Hence, the study provides a comprehensive view of the predictive ability of reported earnings.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f850d102cf560d430c0d5f5238e75e1",
  "timestamp": "2025-05-15T01:23:27.299926"
}