{
  "id": 5870,
  "title": "Depression Treatment Status of Economically Disadvantaged African American Older Adults",
  "abstract": "Background: It is known that depression remains largely untreated in underserved communities. Hence, it is desirable to gain more knowledge on the prevalence and correlates of untreated depression among African-American (AA) older adults in economically disadvantaged areas. This knowledge may have the public health benefit of improving detection of AA older adults with depression who are at high risk of not receiving treatment, thereby reducing this health disparity. Objective: To study health and social correlates of untreated depression among AA older adults in economically disadvantaged areas. Methods: Between 2015 and 2018, this cross-sectional survey was conducted in South Los Angeles. Overall, 740 AA older adults who were 55+ years old entered this study. Independent variables were age, gender, living arrangement, insurance type, educational attainment, financial strain, chronic medical conditions, and pain intensity. Untreated depression was the dependent variable. Logistic and polynomial regression models were used to analyze these data. Results: According to the polynomial regression model, factors such as number of chronic medical conditions and pain intensity were higher in individuals with depression, regardless of treatment status. As our binary logistic regression showed, age, education, and number of providers were predictive of receiving treatment for depression. Conclusion: Age, educational attainment, number of providers (as a proxy of access to and use of care) may be useful to detect AA older adults with depression who are at high risk of not receiving treatment. Future research may focus on decomposition of the role of individual-level characteristics and health system-level characteristics that operate as barriers and facilitators to AA older adults receiving treatment for depression.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f899beffc27ee67a0741f323e4485bf",
  "timestamp": "2025-05-15T02:52:31.367743"
}