{
  "id": 4152,
  "title": "The role of uncertainty in return spillovers among digital, green, and traditional financial assets: New insights from the shock of unprecedented events",
  "abstract": "By combining the time-varying parameter vector autoregression (TVP-VAR) model and the marginal spillover analysis, we investigate the dynamic return spillovers among digital, green, and traditional financial assets while considering the uncertainty exemplified by unprecedented events, including technical security threats, trade policy turbulences, public health emergencies, and geopolitical upheavals. Further, we disclose the impact of underlying macroeconomic and financial uncertainty factors under different market conditions using the quantile regression approach. Our empirical results illustrate that (i) the digital and green assets gradually incorporate into a risk-sharing community together with traditional assets; (ii) the direction and magnitude of spillovers are highly sensitive to uncertainty shocks, and the green assets provoke dramatic risk spreading during the COVID-19 pandemic, while the digital ones show enhancing directional spillovers during the cryptocurrency hacking, the Sino-US trade friction, and the Russia-Ukraine conflict; and (iii) investor sentiment, geopolitical risks, and trade and monetary policy uncertainties significantly drive the spillovers in turbulent periods, and the importance of cryptocurrency policy uncertainty is highlighted under all market conditions. Overall, our research provides insightful implications for risk management and policy formulation in times of uncertainty.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9f9397b16194a7109553aaa1423b3446",
  "timestamp": "2025-05-15T02:33:42.108384"
}