{
  "id": 3801,
  "title": "Risk assessment tools for osteoporosis and fractures in 2022",
  "abstract": "Osteoporosis is one of the frequently encountered non -communicable diseases in the world today. Several hundred million people have osteoporosis, with many more at risk. The clinical feature is a fragility fracture (FF), which results in major reductions in the quality and quantity of life, coupled with a huge financial burden. In recognition of the growing importance, the World Health Organisation established a working group 30 years ago tasked with providing a comprehensive report to understand and assess the risk of osteoporosis in postmenopausal women. Dual-energy X-ray absorptiometry (DXA) is the most widely endorsed technology for assessing the risk of fracture or diag-nosing osteoporosis before a fracture occurs, but others are avail-able. In clinical practice, important distinctions are essential to optimise the use of risk assessments. Traditional tools lack speci-ficity and were designed for populations to identify groups at higher risk using a 'one-size -fits-all' approach. Much has changed, though the purpose of risk assessment tools remains the same. In 2022, many tools are available to aid the identification of those most at risk, either likely to have osteoporosis or suffer the clinical consequence. Modern technology, enhanced imaging, proteomics, machine learning, artificial intelligence, and big data science will greatly advance a more personalised risk assessment into the future. Clinicians today need to understand not only which tool is most effective and efficient for use in their practice, but also which tool to use for which patient and for what purpose. A greater understanding of the process of risk assessment, deciding who should be screened, and how to assess fracture risk and prognosis in older men and women more comprehensively will greatly reduce the burden of osteoporosis for patients, society, and healthcare systems worldwide. In this paper, we review the cur-rent status of risk assessment, screening and best practice for osteoporosis, summarise areas of uncertainty, and make some suggestions for future developments, including a more personal-ised approach for individuals.(c) 2022 Elsevier Ltd. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fa2d9cb65c033f13cf274143959d433",
  "timestamp": "2025-05-15T02:29:59.222102"
}