{
  "id": 4916,
  "title": "Using Natural Language Processing With Explainable AI Approach to Construct a Human-Centric Consumer Application for Financial Climate Disclosures",
  "abstract": "Climate change is becoming an increasingly urgent issue. To encourage firms to include climate-related risk information in regular financial reports, the Task Force on Climate-related Financial Disclosures (TCFD) has developed a report format that provides detailed description of the risks and opportunities that enterprises will face due to climate change. Such information is of great concern for consumers, investors and regulators. However, manually accessing this information through individual financial reports is time-consuming. This research uses pre-trained models such as BERT, RoBERTa, and ClimateBERT to automate the detection and analysis of TCFD-related texts. The generative adversarial network (GAN) model is used to generate data with fewer labels, thereby improving classification performance as measured by accuracy, recall, precision, and F1-score. The detected texts are analyzed using explainable AI (XAI) to confirm which the text variables that will affect whether the paragraphs reflect internal support for climate change remediation efforts or lack of such support. In addition, the relationship between these variables and the final prediction results can be understood through the intensity value provided by XAI which reflects the degree of influence of each feature on the model detection results. The results show that the ClimateBERT model achieves a prediction accuracy rate of 90%, thus potentially helping consumers and investors better access important information to their consumption and investment decisions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9faaa87d8bf10d21673b6a55524b7970",
  "timestamp": "2025-05-15T02:42:36.115228"
}