{
  "id": 951,
  "title": "FORMATION OF PARTNERSHIP STAKEHOLDER RELATIONS AT CONSTRUCTION ENTERPRISES: ORGANIZATIONAL AND ECONOMIC ASPECTS",
  "abstract": "The urgency of forming partner stakeholder relations at construction enterprises (BP) in the conditions of slow growth or decrease of the main indicators of the state functioning, negative influence of external and internal factors, unstable socio-economic and political situation in the state is determined. It is proved that in the construction sector there are processes of slowing down the index of construction products with increasing total area of residential and non-residential buildings. Based on the study of theoretical and methodological provisions, formed approaches to the definition of stakeholders: functional; structural; process; an approach based on identifying threats affecting stakeholders; strategic; social; retrospective; complex; resource. Sound approaches allowed to propose the definition of stakeholders of construction companies, which are characterized as individuals and (or) legal entities or groups of persons interacting in the construction sector on the basis of strategic contours and social directions and determined by functional, resultant, structural, process, strategic, complex features. the relationship of which has a certain level of risk and threat, which allows to form a contractual relationship in capital construction, to carry out architectural control, appropriate calculations, provided by the project documentation, material and labor resources. The types of stakeholders of construction companies are identified based on the characteristics of internal and external stakeholders interacting with construction companies, which allowed to form economic and organizational support for the formation and implementation of stakeholder relations and build a quantitative basis for sound management decisions to strengthen their financial condition. A quantitative basis for the creation and development of stakeholder partnerships has been formed.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fb26d0c3f3768d8ceb31bb360ac153f",
  "timestamp": "2025-05-15T01:44:35.520963"
}