{
  "id": 7841,
  "title": "Mental Health Status of University Students and Working Professionals during the Early Stage of COVID-19 in Bangladesh",
  "abstract": "A novel coronavirus disease known as COVID-19 has spread globally and brought a public health emergency to all nations. To respond to the pandemic, the Bangladesh Government imposed a nationwide lockdown that may have degraded mental health among residents, in particular, university students and working professionals. We examined clinically significant anxiety levels with the Generalized Anxiety Disorder (GAD-7) scale and perceived stress levels with the Perceived Stress Scale (PSS-4) in an online cross-sectional study with 744 adults. Approximately 70% of respondents were afflicted with clinically significant anxiety levels, and more than 43.82% were afflicted with moderate or high perceived stress levels. Multivariate logistic regression models showed that postgraduates (OR = 2.78, 95% confidence interval [CI] = 1.03-8.75, p < 0.05) were more likely to experience anxiety than their student counterparts. No such differences emerged for working professionals, however. Living with family members compared to living alone was a risk factor for perceived stress among working professionals (OR = 4.05, 95% CI = 1.45-11.32, p < 0.05). COVID-19 stressors such as financial hardship (OR = 1.84, 95% CI = 1.11-3.05, p < 0.05) and worries of family members' health (OR = 1.84, 95% CI = 1.12-2.99) were risk factors for anxiety among students. Questionable social media news exposure (OR = 2.99, 95% CI = 1.13-7.92, p < 0.05) contributed to the development of mental stress among working professionals. These findings confirm that effective initiatives and proactive efforts from concerned authorities are necessary to cope with the mental health correlates of the COVID-19 pandemic, including in developing contexts such as Bangladesh.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fba0b03cdcc5cec0e3bfd4138b42643",
  "timestamp": "2025-05-15T03:12:36.511739"
}