{
  "id": 6601,
  "title": "Does pre-event lack of emotional support increase the risk of post-event PTSD, anxiety, depression symptoms and lack of support? A comparative population-based study among victims of threat and violence",
  "abstract": "Our knowledge about the effects of perceived emotional support on PTSD, anxiety and depressive symptoms after serious threat and violence is primarily based on post-event studies. Very little is known about the extent to which (1) victims lacking pre-event emotional support are more at risk of post-event symptoms and lack of postevent support than victims with pre-event emotional support, and (2) victims with pre-event emotional support and victims lacking emotional support are more at risk of post-event anxiety and depressive symptoms than nonvictims with similar pre-event support levels. For this purpose, we conducted a 2-wave prospective study (VICTIMS) using the Dutch population-based longitudinal LISS panel. Multivariate logistic regression analyses were conducted, controlling for pre-event demographics, symptoms, and physical, work-related and financial problems. As hypothesized, victims (N-victims total = 187) lacking pre-event support more often had high post- event PTSD, anxiety and depressive symptoms than victims with pre-event support. No significant differences were found between victims and nonvictims with pre-event emotional support (N-nonvictims total = 2,828, not exposed to any event). Since victims and nonvictims with pre-event support did not differ in post-event symptoms and support, the findings offer strong evidence for the buffering hypothesis of emotional support.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fbcfc0774089e507e027e485e581061",
  "timestamp": "2025-05-15T02:59:37.086775"
}