{
  "id": 381,
  "title": "Moment matching machine learning methods for risk management of large variable annuity portfolios",
  "abstract": "Variable annuity (VA) with embedded guarantees have rapidly grown in popularity around the world in recent years. Valuation of VAs has been studied extensively in past decades. However, most of the studies focus on a single contract. These methods can be extended neither to valuate nor to manage the risk of a large variable annuity portfolio due to the computational complexity. In this paper, we propose an efficient moment matching machine learning method to solve this problem. This method is proved to be a good candidate for risk management in terms of the speed of and the complexity of computing the annual dollar deltas, VaRs and CVaRs for a large variable annuity portfolio whose contracts are over a period of 25 years. There are two stages for our method. First, we select a small number of contracts and propose a moment matching Monte Carlo method based on the Johnson curve, rather than the well known nested simulations, to compute the annual dollar deltas, VaRs and CVaRs for each selected contract. Then, these computed results are used as a training set for well known machine learning methods, such as regression tree, neural network and so on. Afterwards, the annual dollar deltas, VaRs and CVaRs for the entire portfolio are predicted through the trained machine learning method. Compared to other existing methods Bauer et al. (2008); Gan (2013); Gan and Lin (2015), our method is very efficient and accurate. Finally, our test results support our claims. (C) 2017 Elsevier B.V. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fc36746914e5667dd278ed22595422f",
  "timestamp": "2025-05-15T00:42:32.587297"
}