{
  "id": 9349,
  "title": "Mental Health Symptoms of University Students 15 Months After the Onset of the COVID-19 Pandemic in France",
  "abstract": "Importance The Consequences de la pandemie de COVID-19 sur la sante mentale des etudiants (COSAMe) survey was conducted among university students in France during the COVID-19 pandemic and found that although there was a slight decrease in anxiety, depression, and stress between the first lockdown (T1) and 1 month after it ended (T2), the prevalence of suicidal ideation had increased between these periods and 1 in 5 students had probable posttraumatic stress disorder (PTSD) at T2. These results emphasize the need to explore the long-term consequences of the COVID-19 pandemic. Objectives To measure the prevalence of mental health symptoms among university students in France 15 months after the first lockdown (T3) and to identify factors associated with outcomes. Design, Setting, and Participants This cross-sectional study reports data from the third measurement time of the repeated COSAMe survey, which took place from July 21 to August 31, 2021, through an online questionnaire sent to all French university students. Main Outcomes and Measures The prevalence of suicidal thoughts, PTSD (PTSD Checklist for the Diagnostic and Statistical Manual of Mental Disorders [Fifth Edition] [PCL-5]), stress (Perceived Stress Scale), anxiety (State-Trait Anxiety Inventory), and depression (Beck Depression Inventory) at T3 were gender- and degree-standardized and compared with prevalence rates at T1 and T2. Multivariable logistic regression analyses identified risk factors. Results A total of 44898 students completed the questionnaires. They were mainly women (31728 [70.7%]), and the median (IQR) age was 19 (18-21) years. Standardized prevalence rates of stress, anxiety, depression, suicidal thoughts, and PTSD were 20.6% (95% CI, 20.2%-21.0%), 23.7% (95% CI, 23.3%-24.1%), 15.4% (95% CI, 15.1%-15.8%), 13.8% (95% CI, 13.5%-14.2%), and 29.8% (95% CI, 29.4%-30.2%), respectively. Compared with the decreased prevalence rates at T2, there was an increase at T3 for stress (2.5% increase), anxiety (13.9% increase), and depression (22.2% increase). The prevalence of suicidal ideation continued to increase from T1 (10.6%) to T3 (13.8%), and the prevalence of probable PTSD increased from 1 in 5 students to 1 in 3 students between T2 and T3. Female and nonbinary participants; participants without children and living in an urban area; and those with financial difficulties, a chronic condition, psychiatric history, COVID-19 history, social isolation, and low perceived quality of information received were at risk of all poor outcomes at T3 (eg, stress among women: adjusted OR, 2.18; 95% CI, 2.05-2.31; suicidal thoughts among nonbinary respondents: adjusted OR, 5.09; 95% CI, 4.32-5.99; anxiety among students with children: adjusted OR, 0.68; 95% CI, 0.56-0.81; depression among students living in a rural area: adjusted OR, 0.80; 95% CI, 0.75-0.85). Conclusions and Relevance These results suggest severe long-lasting consequences associated with the pandemic on the mental health of students. Prevention and care access should be a priority.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fcc15900a7c359ae77b1bfcd0ecd4df",
  "timestamp": "2025-05-15T03:27:53.390143"
}