{
  "id": 5430,
  "title": "Cost of Major Surgery in the Sarcopenic Patient",
  "abstract": "BACKGROUND: Sarcopenia is associated with poor outcomes after major surgery. There are currently no data regarding the financial implications of providing care for these high-risk patients. STUDY DESIGN: We identified 1,593 patients within the Michigan Surgical Quality Collaborative (MSQC) who underwent elective major general or vascular surgery at a single institution between 2006 and 2011. Patient sarcopenia, determined by lean psoas area (LPA), was derived from preoperative CT scans using validated analytic morphomic methods. Financial data including hospital revenue and direct costs were acquired for each patient through the hospital's finance department. Financial data were adjusted for patient and procedural factors using multiple linear regression methods, and Mann-Whitney U test was used for significance testing. RESULTS: After controlling for patient and procedural factors, decreasing LPA was independently associated with increasing payer costs ($ 6,989.17 per 1,000 mm2 LPA, p < 0.001). The influence of LPA on payer costs increased to $ 26,988.41 per 1,000 mm 2 decrease in LPA (p < 0.001) in patients who experienced a postoperative complication. Further, the covariate-adjusted hospital margin decreased by $ 2,620 per 1,000 mm 2 decrease in LPA (p < 0.001) such that average negative margins were observed in the third of patients with the smallest LPA. CONCLUSIONS: Sarcopenia is associated with high payer costs and negative margins after major surgery. Although postoperative complications are universally expensive to payers and providers, sarcopenic patients represent a uniquely costly patient demographic. Given that sarcopenia may be remediable, efforts to attenuate costs associated with major surgery should focus on targeted preoperative interventions to optimize these high risk patients for surgery. ((C) 2013 by the American College of Surgeons)",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fcd231ef1c4f8432f7099190b5ff219",
  "timestamp": "2025-05-15T02:47:42.971383"
}