{
  "id": 9221,
  "title": "Marital dissolution and associated factors in Hosanna, Southwest Ethiopia: a community-based cross-sectional study",
  "abstract": "BackgroundMarriage dissolution, divorce, or separation from a spouse or common-law partner is a serious public health concern due to its increasing prevalence and devastating health and socio-economic consequences. Evidence suggests an increased risk of marital instability in Ethiopia. In addition, the extent of marital dissolution and other related factors have increased in the study area. Despite these, the prevalence of marital dissolution and the influence of associated factors (main reason for marriage, and parental history of marital dissolution) on marital dissolution has not been assessed in the study area. Therefore, the aim of this study was to investigate the prevalence of marital dissolution and its associated factors among residents of Hosanna town in southwestern Ethiopia in 2022.MethodsWe conducted a community-based cross-sectional study among 459 randomly selected Hosanna Township residents. We used structured questionnaires to collect data. Descriptive statistics and logistic regression were performed to describe the data and test-associated factors, respectively. A p-value less than 0.05 was used to define statistical significance. We used STATA 14 and IBM SPSS 25.0 computer packages to process data.ResultsOut of the 459 potentially eligible individuals, 450 participants properly responded to the questionnaires yielding a response rate of 98.04%. Of these, 218 (52.9%) were female. The commonly reported reason for marriage was to have children 150 (36.9%). The prevalence rate of marital dissolution was 26.0% (95% CI: (21.7%, 30.3%)). The participant's level of education and the primary reasons (motives) why they get married were statistically significantly associated with marital dissolution. The odds of marital dissolution was higher among participants who completed secondary education (AOR = 3.2, 95% CI = 1.26-8.17) compared to those having no formal education. The participants who married for companionship reasons (AOR = 0.31, 95% CI = 0.11-0.83) had significantly lower odds of marriage dissolution compared with those who married for financial security.ConclusionsIn this study, the prevalence of marital dissolution was high. The participant's level of education and the primary reasons (motives) why they getting married were significantly associated with marital dissolution. Therefore, an integrated, community-based approach should be developed to prevent marital dissolution.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fd31d0417a26a2ead5be687146ea356",
  "timestamp": "2025-05-15T03:26:54.507507"
}