{
  "id": 2182,
  "title": "Social Innovation and the Financial Risk of EMNCs - The Contingent Role of Institutional Legitimacy",
  "abstract": "This paper examines the influence of social innovation on financial risk of emerging economy multinational corporations (EMNCs). Traditionally, research has focussed on Western MNCs' and their financial performance implications. However, the growing involvement of EMNCs in social innovation-albeit in environments characterized by institutional voids-and its effects on financial risk necessitate an in-depth examination. Drawing on stakeholder theory, we explored how EMNCs balance their social innovation initiatives with financial risks. To this end, we first examine how social innovation reduces the financial risk of EMNCs. Second, we examine the association between excessive social innovation and EMNCs' financial risk. In addition, borrowing insights from institutional theory, we assess the role played by institutional legitimacy in this process, acknowledging institutional legitimacy's potential to mitigate the financial risks associated with social innovation in emerging economies. We test our hypotheses based on data drawn from 90 EMNCs in 14 emerging economies, applying a panel regression model with robust standard errors and a rigorous robustness propensity score matching test. Our findings show that social innovation reduces EMNC financial risk, and challenge the assertions made regarding the potential negative implications of excessive social innovation on financial risk. Our results also demonstrate the intricate moderating effects of institutional legitimacy in balancing social innovation, excessive social innovation, and EMNC financial risk. Finally, we proffer critical implications for managers and policymakers in emerging economies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fdb44a1d5ce37654555cd6841bce47c",
  "timestamp": "2025-05-15T02:12:17.386332"
}