{
  "id": 6393,
  "title": "Later-Life Disability in Environmental Context: Why Living Arrangements Matter",
  "abstract": "Background and Objectives: Household social and environmental context are key elements of the disablement process, yet few studies explicitly examine the relationship between household composition, housing type, and disability progression. This study investigates the risk of older adults' disability progression by type of living arrangement (e.g., household composition, housing type) and whether the relationship varies by socioeconomic status. Research Design and Methods: We used Health and Retirement Study data (waves 1998-2012; n = 41,467 total observations) and fit time-series logistic regression models to estimate increases in activities of daily living (ADLs) and instrumental activities of daily living (IADLs) limitations. Because living arrangements are influenced by financial resources, we also stratified analyses by wealth. Results: Disability rates were highest among those living alone or with nonfamily others and in self-described fair/poor quality housing. Overall, disability risk was more strongly associated with wealth than living arrangements. For more affluent older adults, living alone was associated with a decreased risk of IADL disability; for the least affluent older adults, living alone had the opposite association-increased risk of both ADL and IADL disability. Discussion and Implications: Later-life disability progression should be understood in the context of both household environment and wealth. Household composition and housing characteristics were associated with disability progression and the risk of increasing disability was consistently higher for those in the lowest wealth quintile. These findings identify where older adults with disabilities live and that comprehensive interventions to reduce disability progression should consider household social and environmental context, as well as wealth.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fe4fbcd914bdb988af6aac29f886c77",
  "timestamp": "2025-05-15T02:57:38.776604"
}