{
  "id": 7920,
  "title": "Latent profile analysis of depression in elderly patients with cardio- and cerebrovascular diseases in China- based on CLHLS data",
  "abstract": "Background This study explored the depressive status of elderly patients with cardio- and cerebrovascular disease, using latent profile analysis to explore different profiles of depression. It also explored the factors influencing different profile of depression in patients with cardio- and cerebrovascular diseases to provide reference to healthcare workers to identify the high-risk group of anxiety and depression symptoms at an early stage.Methods Data came from the Chinese Longitudinal Healthy Longevity Survey (CLHLS). In this study, we used latent profile analysis (LPA) to develop a latent profile model of elderly patients with cardio- and cerebrovascular disease combined with depression and to explore its influencing factors.Results The 1890 study participants were divided into a low-level group (11%), a medium-level group (52%), and a high-level group (37%). The results of the univariate analysis showed statistically significant differences in the distribution of gender, age, co-residence, self-reported health, main source of financial support, marital status, diabetes, smoke, drank, exercise, level of anxiety, and IADL in the three profiles. Multiple logistic regression showed that good or fair self-reported health and exercise were associated with the low-level of depression; no spouse, and anxiety level were associated with moderately severe depressive conditions; and retirement wages, and local government or community predicted the appearance of low-level of depression compared to medium-level of depression.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9fed741ce681d33b6c75858fb37b4303",
  "timestamp": "2025-05-15T03:13:30.650813"
}