{
  "id": 7820,
  "title": "Clinical outcomes and profitability following rural hospital mergers and acquisitions",
  "abstract": "Purpose: As US hospital markets become increasingly consolidated, empirical evidence is needed on the clinical and financial impacts of mergers on care provided by rural hospitals. We identified characteristics of rural hospitals that underwent mergers or acquisitions and examined changes in profitability, clinical outcomes, and patient experience at acquired versus non-acquired rural hospitals. Methods: We identified 145 rural US hospitals that underwent merger or acquisition between 2009 and 2014 and 906 rural non-acquired control hospitals. For each acquisition year, we used a difference-in-differences design to compare that year's acquired hospitals to a randomly chosen set of non-acquired controls. Adjusted linear regression models were used to assess the relationship between acquisition and changes in profitability, patient experience, and clinical outcomes. Findings: Compared to non-acquired hospitals, acquired hospitals were more likely to be for-profit (18.6% vs. 4.6%, p<0.001) and tended to have lower total margins (-1.1% vs. 1.2%; p<0.05) despite higher average clinical volumes. Changes in acquired hospitals' total margins, patient satisfaction, and risk-adjusted 30-day mortality rates were not different than changes among control hospitals. However, acquisition was associated with lower improvement in 30-day risk-adjusted readmission rates (-0.58 percentage point [p.p.] difference-in-differences, 95% confidence interval -0.88 to -0.28 p.p., p<0.001). Conclusions: Overall, mergers or acquisitions of rural hospitals were not associated with significant improvements in profitability, clinical outcomes, or patient experience. Policymakers may need to closely monitor rural hospital mergers in order to balance preserving access for rural patients with the consequences of health care consolidation.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "9ff2fc665b60316238d35dec20d0a590",
  "timestamp": "2025-05-15T03:12:36.399747"
}