{
  "id": 8778,
  "title": "The financial burden of out of pocket payments on medicines among households in Ethiopia: analysis of trends and contributing factors",
  "abstract": "BackgroundIn Ethiopia, out-of-pocket (OOP) payment is the key means of healthcare financing, and expenses on medicines are a crucial component of such payment. This study aims to investigate the financial implications of OOP payments on medicines for Ethiopian households.MethodsThe study involved a secondary data analysis of the national household consumption and expenditure surveys of 2010/11 and 2015/16. The capacity-to-pay method was used to calculate catastrophic OOP medicine expenditures. The extent of economic status related to catastrophic medicine payment inequity was calculated using concentration index estimation. The impoverishment consequences of OOP payment on medicine were estimated using poverty headcount and poverty gap analysis methods. Logistic regression models were used to identify the variables that predict catastrophic medicine payments.ResultsMedicines accounted for the majority of healthcare spending (> 65%) across the surveys. From 2010 to 2016, the total percentage of households facing catastrophic medicine payments decreased from 1% to 0.73%. However, the actual number of people expected to have experienced catastrophic medicine payments increased from 399,174 to 401,519 people. Payment for medicines pushed 11,132 households into poverty in 2015/16. The majority of disparities were explained by economic status, place of residence, and type of health services.ConclusionOOP payment on medicine accounted for the majority of total health expenses in Ethiopia. A high medicine OOP payment continued to push households into catastrophic payments and impoverishment. Household seeking inpatient care, those with lower economic status and urban residents were among the most affected. Hence, innovative approaches to improve the supply of medicines in public facilities especially those in urban settings and risk protection mechanisms for medicine expenditures particularly for inpatient care are recommended.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a00a7ee4aaa018f9f259cd653fb4835e",
  "timestamp": "2025-05-15T03:22:26.014809"
}