{
  "id": 10,
  "title": "Credit Risk Simulation of Enterprise Financial Management Based on Machine Learning Algorithm",
  "abstract": "In the context of the rapid development of the Internet +, the e-commerce industry has developed very rapidly and is playing an increasingly important role in the market. More and more investors are also paying attention to the financial risks of the e-commerce industry. Therefore, how effectively identifying and controlling the credit risks of e-commerce enterprises corporate financial management is particularly important. Its financial-related business will be affected by various factors such as financing, credit, and the environment. The particle swarm optimization in the machine learning algorithm optimizes the support vector machine model; using its nonoverlapping clustering properties, it can fully display the density relationship between each data and the density relationship between its subclasses in a graphical way. It is hoped that the research on the financial risk of this enterprise can provide some insights into the identification, management, and related governance of the financial risk of e-commerce enterprises. In this context, this paper studies the credit risk simulation of corporate financial management based on machine learning algorithms, aiming to provide a new research direction for the current subject of corporate financial management credit risk. This paper optimizes the support vector machine model in the machine learning algorithm, integrates it into the financial risk of the enterprise, and analyzes the convergence of the algorithm. The experimental sample selected a bad e-commerce platform owned by a company, and the data were collected from the financial statements released by the company from 2018 to 2021. The experimental results show that in 2018, the two platforms lost -151.80 and -223.45, respectively, and the B platform lost more. By 2021, both platforms have achieved profits, which are 244.76 and 241.71, respectively. However, in the past few years, platform B has achieved positive profit growth every year, and the growth rate is average, and the overall growth rate is higher than that of platform A. This shows the limitations of managers' decision-making and also shows the importance of enterprises to adjust their strategies in a timely manner through market feedback. The study was well completed.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a010ca5b33220b54bc0d6d1f4daba7e3",
  "timestamp": "2025-05-15T01:45:16.459758"
}