{
  "id": 9288,
  "title": "Terrorist Attacks, Corporate Social Responsibility, and Firm Value",
  "abstract": "SynopsisResearch problemAccording to the World Economic Forum, terrorism is one of the main managerial concerns for companies worldwide. However, there is surprisingly scant research on how terrorist attacks impact managerial decision-making. To fill this gap, we investigate how terrorist attacks influence firms' socially oriented activities, as measured by their investments in corporate social responsibility (CSR).Motivation or theoretical reasoningIn light of the crucial role of CSR in financial markets and the growing apprehension regarding terrorism risk, this study explores whether and to what extent firms' CSR investments contribute to the resilience to terrorism risk. The motivation for our research question is grounded in the idea that terrorist attacks create a unique set of circumstances that prompt firms to reconsider their socially oriented initiatives. We argue that firms impacted by such events tend to recognize the importance of demonstrating commitment to social responsibility in the aftermath of a crisis. Overall, the theoretical underpinnings of this study revolve around the notion that CSR becomes a strategic response for firms affected by terrorism, through which they address various stakeholder concerns, maintain legitimacy, and strategically manage their public image in the aftermath of a crisis.The test hypothesesWe empirically examine two key research questions in this study. First, we examine the effect of terrorist attacks on the CSR investments of publicly traded firms. Second, we examine whether and how the increase in CSR investments of publicly traded firms after terrorist attacks affects firm value.Target populationOur study extends the limited research on the impact of terrorism on capital markets, which is an area of great concern to various stakeholders, including shareholders and corporate managers. The findings will also help researchers understand the determinants of CSR and the potential channels through which CSR creates value for shareholders.Adopted methodologyUsing a multivariate regression model and controlling for all other determinants of corporate CSR investment documented by prior studies, we test the effect of terrorist events on firms' CSR investment. To reduce the concern that a growing awareness of the importance of CSR may explain the changes in firms' investment in CSR over time, we use a difference-in-differences research design.AnalysesUsing a sample of 53 major terrorist attacks occurring in the U.S. between 1994 and 2015, this study examines the causal effect of terrorist attacks on firms' CSR activities.FindingsOur findings indicate that public firms located in close proximity to terrorist attacks (i.e., the impact firms) substantially increase their investment in CSR following those terrorist events, and that the increase in CSR investment is positively associated with firm value. We further observe a strengthened association between increased CSR and firm value when the CSR efforts of the impact firms attract greater media attention. In conclusion, our findings substantiate the hypothesis that firms exposed to higher levels of terrorism risk are more inclined to enhance their CSR investments. This inclination is driven by the dual impact of CSR efforts: not only do they contribute to bolstering stakeholders' confidence in firms' future performance, but they are also linked to increased returns in the aftermath of a terrorist attack.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a011a067da5ac7e8111ee0baf7b5fd36",
  "timestamp": "2025-05-15T03:27:24.992008"
}