{
  "id": 3553,
  "title": "Employment Quality and Self-Rated General Health in the United States: A 3-Year Observational Follow-Up Study",
  "abstract": "Background: The typological approach of the employment quality (EQ) framework offers a comprehensive lens for assessing the heterogeneity of employment experiences while concurrently acknowledging associated health risk factors. EQ incorporates multiple employment characteristics-such as working hours, wages and benefits, and union representation, among others-where standard employment relationship (SER)-like (or high EQ) features are distinguished from nonstandard features (low EQ). Low EQ features are known to relate negatively to health outcomes. Addressing limitations from previous cross-sectional studies, we contribute to longitudinal research on the link between EQ and self-rated general health in the United States. Our objectives are: (1) to investigate the association between baseline EQ and poor self-rated general health 3 years later; and (2) to examine the relation between poor self-rated health and: (a) transitioning from low EQ to SER-like employment (the scarring hypothesis); (b) transitioning from SER-like employment to low EQ (the initial-impact hypothesis); and (c) consistent low EQ status (for example, the dose-response hypothesis). Methods: Using the American Working Conditions Survey (AWCS), baseline and follow-up data on employees' self-rated health was collected (N=1109). An EQ typology with five categories was created via latent class cluster analysis: SER-like, Instrumental, Precarious Unsustainable, Portfolio; and Precarious Intensive employment. Each EQ segment represents a unique combination of EQ features, with SER-like and Portfolio employment reflecting overall high EQ, while Instrumental, Precarious Unsustainable, and Precarious Intensive reflect varieties of low EQ constellations. We used lagged Poisson regression to link baseline EQ to follow-up self-rated health and Poisson regression to analyze multiple EQ paths between baseline and follow-up and their association with health. Results: Precarious Unsustainable and Instrumental employment at baseline associated significantly with poor self-rated general health at follow-up. Transitioning from SER-like employment to a low-EQ segment was linked to an increased risk of poor self-rated general health, confirming the initial-impact hypothesis. No evidence was found for the scarring hypothesis. Consistent Instrumental and Precarious Unsustainable employment were both associated with poorer health, underlining the importance of the dose-response effect. Conclusions: Enhancing EQ is crucial for public health, particularly in the context of limited welfare provisions in the United States. Policy and legislative measures to improve EQ can promote better health outcomes and reduce health disparities within the working population.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0418ef26dedbcfc80c6327a3f2f11fa",
  "timestamp": "2025-05-15T01:18:20.535822"
}