{
  "id": 6735,
  "title": "Construction and validation of a risk prediction model for delayed discharge in elderly patients with hip fracture",
  "abstract": "Background Because of their poor physical state, elderly hip fracture patients commonly require prolonged hospitalization, resulting in a drop in bed circulation rate and an increased financial burden. There are currently few predictive models for delayed hospital discharge for hip fractures. This research aimed to develop the optimal model for delayed hospital discharge for hip fractures in order to support clinical decision-making. Methods This case-control research consisted of 1259 patients who were continuously hospitalized in the orthopedic unit of an acute hospital in Tianjin due to a fragility hip fracture between January and December 2021. Delayed discharge was defined as a hospital stay of more than 11 days. The prediction model was constructed through the use of a Cox proportional hazards regression model. Furthermore, the constructed prediction model was transformed into a nomogram. The model's performance was assessed using the area under the receiver operating characteristic curve (AUC), calibration curves and decision curve analysis (DCA). the STROBE checklist was used as the reporting guideline. Results The risk prediction model developed contained the Charlson Comorbidity Index (CCI), preoperative waiting time, anemia, hypoalbuminemia, and lower limbs arteriosclerosis. The AUC for the risk of delayed discharge was in the training set was 0.820 (95% CI,0.79 similar to 0.85) and 0.817 in the testing sets. The calibration revealed that the forecasted cumulative risk and observed probability of delayed discharge were quite similar. Using the risk prediction model, a higher net benefit was observed than when considered all patients were at high risk, demonstrating good clinical usefulness. Conclusion Our prediction models could support policymakers in developing strategies for the optimal management of hip fracture patients, with a particular emphasis on individuals at high risk of prolonged LOS.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a04bf85d501edc70774aba07c26f3198",
  "timestamp": "2025-05-15T03:01:03.592189"
}