{
  "id": 3773,
  "title": "Revenue composition and financial health of nonprofit humanitarian and emergency health services",
  "abstract": "Purpose - Emergency health and humanitarian nonprofits work under volatile circumstances that strain nonprofits' financial resources. This study investigates the impact of revenue composition on the financial health of these nonprofits and the impact of financial health on the likelihood of financial distress. Design/methodology/approach - A sample of 11,335 emergency nonprofits from 2003 to 2020 was obtained through form 990 data and studied through a difference generalized method of moments (GMM) approach for the impact of revenue composition on financial health. The impact of financial health on financial distress was studied through panel logistics regression. Findings - Revenue diversification adversely affects the financial health of nonprofit emergency health and humanitarian organizations contrary to the implications of modern portfolio theory. The financial health of nonprofit emergency health and humanitarian organizations is persistent through the significant positive effect of lags in most cases. Originality/value - The emergency health subsector of nonprofits was studied separately due to the unique nature of the sectors' operations and operating environment. The impact of revenue composition was investigated on key dimensions of financial health. Omitted variable bias, simultaneity and dynamic endogeneity were handled through difference GMM.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a053ed82d39b0a3b6aac3d1845df7ae1",
  "timestamp": "2025-05-15T01:20:36.104654"
}