{
  "id": 5030,
  "title": "Health, work, social trust, and financial situation in persons with Usher syndrome type 1",
  "abstract": "BACKGROUND: Research has demonstrated that persons with Usher syndrome type 1 (USH1) have significantly poorer physical and psychological health compared to a reference group. PURPOSE: To explore the relation between work, health, social trust, and financial situation in USH1 compared to a reference group. MATERIAL: Sixty-six persons (18-65 y) from the Swedish Usher database received a questionnaire and 47 were included, 23 working and 24 non-working. The reference group comprised 3,049 working and 198 non-working persons. METHODS: The Swedish Health on Equal Terms questionnaire was used and statistical analysis with multiple logistic regression was conducted. RESULTS: The USH1 non-work group had a higher Odds ratio (95% CI) in poor psychological and physical health, social trust, and financial situation compared to the USH1 work group and reference groups. Age, gender, hearing, and vision impairment did not explain the differences. The relation between the USH1 work and non-work groups showed the same pattern as the reference groups, but the magnitude of problems was significantly higher. CONCLUSIONS: Both disability and unemployment increased the risk of poor health, social trust and financial situation in persons with USH1, but having an employment seemed to counteract the risks related to disability.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a063d156d86560ae1e352d341d129d35",
  "timestamp": "2025-05-15T02:43:40.133932"
}