{
  "id": 6221,
  "title": "Mild Cognitive Decline Is a Risk Factor for Scam Vulnerability in Older Adults",
  "abstract": "Research on elderly financial exploitation has mostly focused on financial abuse that occurs in families and other types of trusted relationships. As such, little is known about financial frauds and scams perpetrated by strangers. Financial fraud and scam prevention activities for older adults must be promoted, for which the correlation between the psychological, social, and cognitive characteristics of their vulnerability needs to be determined. The present study aimed to determine whether cognitive decline is a risk factor for scam vulnerability in older adults. Thus, we created a scam vulnerability scale for older adults with cognitive decline and analyzed the data to reveal the correlation between them, including inhibition and executive function. We conducted an interview survey with 50 older adults with cognitive decline (average age: 79.42 years, SD: 5.44) and 51 older adults without cognitive decline (average age: 76.12 years, SD: 5.82). The interview survey included the scam vulnerability scale, psychosocial questionnaires, and neuropsychological tests. The scale included six items with a four-point Likert scale based on a previous study. Hierarchical multiple regression analysis revealed that lower scores on the Japanese version of the Alzheimer's Disease Assessment Scale-Cognitive Subscale (ADAS-Jcog; indicating higher general cognitive function) correlated with higher scam vulnerability in the cognitive decline group (beta = -0.46, p < 0.001). In addition, men were found to be more vulnerable in both groups (cognitive decline group: beta = -0.29, p = 0.015, cognitive non-decline group; beta = -0.32, p = 0.018). Inhibition and executive function were found not to correlate significantly with scam vulnerability. These results suggest that mild cognitive decline correlates with higher scam vulnerability, whereas moderate to severe cognitive decline correlates with lower vulnerability, possibly because it makes understanding the scam attempt itself difficult. Older adults with mild cognitive decline and their families, particularly those visiting elderly care or outpatient facilities, should be notified of the scam vulnerability of older clients using the ADAS-Jcog score as an index to help them avoid victimization.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0768116bde0e0942606d8f8fde7d8ee",
  "timestamp": "2025-05-15T02:56:10.583503"
}