{
  "id": 4083,
  "title": "Financial credit risk assessment of online supply chain in construction industry with a hybrid model chain",
  "abstract": "Under the influence of COVID-19, although upstream small- and medium-sized enterprises (SMEs) in construction industry chain suffer from high operating costs and tight cash flow problems, their financing demands are even stronger. As an electronic and platform-based comprehensive service, online supply chain finance can ease the financing problems of SMEs in the construction industry. However, it has become an important issue for financial institutions to effectively assess the credit risk in the process of online supply chain financing. In this paper, an online supply chain risk assessment method, which is based on a hybrid model chain, including eXtreme Gradient Boosting (XGBoost), Synthetic Minority Oversampling TEchnique for Nominal and Continuous (SMOTENC), and Random Forest (RF), is proposed to identify and control the credit risk of financial institutions. Specifically, we establish the financial credit risk assessment system with respect to the characteristics of financing enterprises in the construction industry supply chain, including the status of financing enterprises, the status of core enterprises, the operating status of the supply chain, and the status of assets under financing. On the basis of the system, the best index number of the assessment system and the minority samples are obtained by the XGBoost algorithm and the SMOTENC algorithm, respectively. The classification method based on RF is applied to judge the credit risk of financing enterprises in the supply chain of construction industry. In the simulation stage, we take upstream SMEs in the supply chain of construction industry in China as an example for empirical analysis to validate the effectiveness of our proposed method. The credit risk assessment method proposed in this paper has better performance than the commonly used ones in the academic field with an average improvement on assessment accuracy for 6.39% and an average increase of Area Under Curve for 6.95%. Our study provides meaningful exploration on the fund monitoring system of the financing service platform to improve financing efficiency and risk management level.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0804481ccca7959cc53d576b4df6856",
  "timestamp": "2025-05-15T02:33:03.407959"
}