{
  "id": 8780,
  "title": "Does Hospital Teaching Status Matter? Impact of Hospital Teaching Status on Pattern and Incidence of 90-day Readmissions After Primary Total Hip Arthroplasty",
  "abstract": "Background: Given financial and clinical implications of readmissions after total hip arthroplasty (THA) and the potential for varied expenditures related to a hospital's teaching status, this study sought to characterize 90-day hospital readmission patterns and assess likelihood of readmission based on teaching designation of a Medicare beneficiaries' (MB's) index THA hospital. Methods: Retrospective analysis of 2016-2018 Centers for Medicare and Medicaid Services-linked data identified primary THA hospitalizations and readmissions within 90 days. Hospitals were categorized as teaching or nonteaching (Council of Teaching Hospitals and Health Systems). Chi-squared analysis and Fisher exact test assessed differences between readmission hospitals and the index hospital teaching status. Multivariate logistic regression models estimated risk-adjusted probability of experiencing at least one 90-day readmission. Results: Analysis identified 433,959 index THA admissions with an all-cause 90-day readmission rate of 9.12%. Most readmissions were to the same hospital regardless of index THA hospital teaching status (67.5% index teaching; 68.2% index nonteaching). Crossover in hospital teaching status from the index procedure to readmission location was more common for those with index THA at a teaching hospital (18.9%) than for MBs with index THA performed at a nonteaching hospital (6.2%). Controlling for patient characteristics, no significant relationship was found between 90-day readmission and index hospital teaching status (odds ratio 0.98, confidence interval 0.947-1.011). Conclusions: Overall, while certain patterns of readmission after the index THA were observed, after controlling for patient characters and comorbidities, there was no significant association between 90-day all-cause readmission and index hospital teaching status. (c) 2021 The Authors. Published by Elsevier Inc. on behalf of The American Association of Hip and Knee Surgeons. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a084e12e078825a33674addfcd834161",
  "timestamp": "2025-05-15T03:22:26.024360"
}