{
  "id": 4844,
  "title": "Catastrophic health expenditure and 12-month mortality associated with cancer in Southeast Asia: results from a longitudinal study in eight countries",
  "abstract": "Background: One of the biggest obstacles to developing policies in cancer care in Southeast Asia is lack of reliable data on disease burden and economic consequences. In 2012, we instigated a study of new cancer patients in the Association of Southeast Asian Nations (ASEAN) region - the Asean CosTs In ONcology (ACTION) study - to assess the economic impact of cancer. Methods: The ACTION study is a prospective longitudinal study of 9,513 consecutively recruited adult patients with an initial diagnosis of cancer. Twelve months after diagnosis, we recorded death and household financial catastrophe (out-of-pocket medical costs exceeding 30 % of annual household income). We assessed the effect on these two outcomes of a range of socio-demographic, clinical, and economic predictors using a multinomial regression model. Results: The mean age of participants was 52 years; 64 % were women. A year after diagnosis, 29 % had died, 48 % experienced financial catastrophe, and just 23 % were alive with no financial catastrophe. The risk of dying from cancer and facing catastrophic payments was associated with clinical variables, such as a more advanced disease stage at diagnosis, and socioeconomic status pre-diagnosis. Participants in the low income category within each country had significantly higher odds of financial catastrophe (odds ratio, 5.86; 95 % confidence interval, 4.76-7.23) and death (5.52; 4.34-7.02) than participants with high income. Those without insurance were also more likely to experience financial catastrophe (1.27; 1.05-1.52) and die (1.51; 1.21-1.88) than participants with insurance. Conclusions: A cancer diagnosis in Southeast Asia is potentially disastrous, with over 75 % of patients experiencing death or financial catastrophe within one year. This study adds compelling evidence to the argument for policies that improve access to care and provide adequate financial protection from the costs of illness.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a08c29f2bd05178dbb2dc75f8d16496a",
  "timestamp": "2025-05-15T02:41:32.772103"
}