{
  "id": 3386,
  "title": "Comprehensive biomarker profiles and chemometric filtering of urinary metabolomics for effective discrimination of prostate carcinoma from benign hyperplasia",
  "abstract": "Prostate cancer (PCa) is the most commonly diagnosed cancer in male individuals, principally affecting men over 50 years old, and is the leading cause of cancer-related deaths. Actually, the measurement of prostate-specific antigen level in blood is affected by limited sensitivity and specificity and cannot discriminate PCa from benign prostatic hyperplasia patients (BPH). In the present paper, 20 urine samples from BPH patients and 20 from PCa patients were investigated to develop a metabolomics strategy useful to distinguish malignancy from benign hyperplasia. A UHPLC-HRMS untargeted approach was carried out to generate two large sets of candidate biomarkers. After mass spectrometric analysis, an innovative chemometric data treatment was employed involving PLS-DA classification with repeated double cross-validation and permutation test to provide a rigorously validated PLS-DA model. Simultaneously, this chemometric approach filtered out the most effective biomarkers and optimized their relative weights to yield the highest classification efficiency. An unprecedented portfolio of prostate carcinoma biomarkers was tentatively identified including 22 and 47 alleged candidates from positive and negative ion electrospray (ESI+ and ESI-) datasets. The PLS-DA model based on the 22 ESI+ biomarkers provided a sensitivity of 95 +/- 1% and a specificity of 83 +/- 3%, while that from the 47 ESI- biomarkers yielded an 88 +/- 3% sensitivity and a 91 +/- 2% specificity. Many alleged biomarkers were annotated, belonging to the classes of carnitine and glutamine metabolites, C21 steroids, amino acids, acetylcholine, carboxyethyl-hydroxychroman, and dihydro(iso)ferulic acid.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0984e8848f803600a49900cc30d1de7",
  "timestamp": "2025-05-15T01:16:22.225728"
}