{
  "id": 483,
  "title": "The application of cloud accounting in enterprise financial decision making in the era of big data",
  "abstract": "In order to be able to better understand the financial situation of enterprises and ensure the maximum economic benefits, the analysis of enterprise financial decisions based on the background of big data cloud accounting is proposed. Establish an enterprise cloud accounting financial decision support module that relies on big data to optimize data collection and meet the data requirements for management decision making and operation of cloud accounting financial decision support system. We provide objective and rigorous financial analysis and implement the financial decisions proposed by the management based on the most satisfying results plan in line with the development strategy of the company. The optimal classification hyperplane is constructed in the vector space using support vector machines, and the Lagrange function is introduced to solve the constraint maximization, which changes the original space mapping to seek the optimal classification surface in the vector space of higher dimensions. The SVM classifier is trained by introducing relaxation variables that solve linearly indistinguishable problems and building labeled training samples to ensure that the risk analysis requirements are met. Combined with the decision tree algorithm to predict the number of information bits, calculate the information entropy to obtain the information gain value to compare one by one, and finally complete the financial decision analysis. The analysis results show that the financial decision model is constructed in the context of big data cloud accounting, and the algorithm of this paper is used to select the best enterprise decision solution, which has an economic growth value of 22,000,000 RMB and ensures the maximum economic benefits for the enterprise.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0ac7faf3cbbbbb78e507dc3dc9ad3e7",
  "timestamp": "2025-05-15T01:51:31.261373"
}