{
  "id": 7365,
  "title": "Risk Factors and Reasons for Treatment Abandonment for Patients With Esophageal Atresia: A Study From a Tertiary Care Hospital in Beijing, China",
  "abstract": "Background: This study aims to identify the risk factors and reasons for treatment abandonment for patients with esophageal atresia (EA) in a tertiary care hospital in China. Methods: A retrospective study was conducted on 360 patients with EA admitted to Beijing Children's Hospital between January 1, 2007 and June 1, 2020. Medical records for treatment abandonment and non-treatment abandonment patients were compared. Univariate and multivariate logistic regression analyses were conducted to identify potential risk factors for treatment abandonment. Results: After the diagnosis of EA, parents of 107 patients refused surgical repair and discharged against medical advice, and 253 patients underwent surgical repair. Among these 253 patients, parents of 59 patients abandoned treatment after surgery; 52 patients were discharged in an unstable condition, and parents of seven patients abandoned resuscitation leading to death in the hospital. By comparing clinical characteristics between treatment abandonment before surgery (n = 107) and non-treatment abandonment (n = 253) groups, we found that mother's parity >1, unplanned admission to intensive care unit before surgery, associated anomalies, and Gross type A/B were significant independent risk factors for treatment abandonment before surgery. Furthermore, birth weight <2,545 g, being discharged from neonatal center/intensive care unit and other departments, unplanned admission to intensive care unit after surgery, operative time >133 min, admission before 2016, pneumothorax, and anastomotic leakage were significant independent risk factors for treatment abandonment after surgery. The reasons for treatment abandonment included financial difficulties, multiple malformations with poor prognosis, belief of incurability and concerns about the prognosis of the diseases, postoperative complications, and extensive length of intensive care unit stay. Conclusions: Treatment abandonment of children with EA/TEF is still a common and serious problem in China. This study showed that EA/TEF patients in critical conditions, with associated anomalies, Gross type A/B, and who had occurrence of complications had high-risk for treatment abandonment.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0bbc59178a30ab744cce22cced36f27",
  "timestamp": "2025-05-15T03:08:00.738734"
}