{
  "id": 4112,
  "title": "Dependencies and systemic risk in the European insurance sector: New evidence based on Copula-DCC-GARCH model and selected clustering methods",
  "abstract": "Objective: The objective of this article is to study the correlations between the most important European insurers and their participation in systemic risk in the insurance sector. We compare systemic risk in different market regimes. Research Design & Methods: We use statistical clustering methods for time units (weeks) to which we assign conditional variances obtained from the estimated Copula-Dynamic Conditional Correlations-Generalised Auto-Regressive Conditional Heteroske-dasticity model (C-DCC-GARCH). In each of the identified market regimes we determine the Conditional Value at Risk CoVaR systemic risk measure. Findings: In this article we show a positive correlation of all the insurance companies under consideration. During global market crises the correlation appears stronger than in 'normal times.' This confirms that the insurance sector generates systemic risk in the presence of turbulences on financial markets, since the value level of the compared index CoVar is much higher in these conditions. Implications & Recommendations: Our research confirms the insurance sector's contribution to Systemic Risk. Thus, it is important to develop an analysis of systemic risk with a particular attention to the evolution of risk in time and the institutions' interconnectedness in the context of contagion using also some new modelling tools. Contribution & Value Added: A novel approach of this article is the analysis of dependencies in the insurance sector using the C-DCC-GARCH model with taxonomic methods.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0ce68b765efa453b9731f8349f3aa05",
  "timestamp": "2025-05-15T02:33:03.584161"
}