{
  "id": 8162,
  "title": "Depressive symptoms Predict Major Depressive Disorder after 15 Years among Whites but not Blacks",
  "abstract": "Background: Black-White differences are shown in psychosocial and medical correlates of depressive symptoms and major depressive disorder (MDD). The current longitudinal study compared Blacks and Whites for the association between baseline depressive symptoms and subsequent risk of MDD after 15 years. Methods: Data were obtained from the Americans' Changing Lives (ACL) Study that included 3,361 individuals (2,205 Whites and 1,156 Blacks) from 1986 to 2001. Baseline depressive symptoms measured using an 11-item Center for Epidemiological Studies-Depression (CES-D) in 1986 were predictors. The outcome of 12-month MDD was measured using the Composite International Diagnostic Interview (CIDI) in 2001. Covariates such as baseline socio-demographics (SES), financial difficulty, chronic medical conditions (CMC), and self-rated health (SRH) were measured in 1986. Logistic regression models were used to evaluate the association between baseline CES-D score and CIDI-based MDD after 15 years net of demographics, SES, CMC, and SRH. The models were applied in the pooled sample, as well as in Blacks and Whites. Data on reliability and factor structure of CES-D based on ethnicity were also reported. Results: In the pooled sample, we found an interaction between race and baseline depressive symptoms, suggesting a stronger effect of baseline depressive symptoms on the subsequent risk of MDD for Whites compared with that of Blacks. Such an interaction was significant net of socioeconomic and health status. Based on our ethnic-specific models, among Whites but not Blacks, baseline CES-D score was predictive of the subsequent risk of MDD after 15 years, net of SES and health at baseline. Black-White differences in the predictive role of CES-D scores on MDD could not be attributed to the ethnic differences in the reliability of the CES-D, which was even higher for Blacks compared with those of Whites. Loadings of the CES-D positive affect items were reverse among Blacks compared to Whites. Conclusion: Black-White differences exist in the association between baseline depressive symptoms and subsequent risk of MDD >15 years. Ethnic differences in the longitudinal link between baseline CES-D and subsequent risk of MDD may explain some of the Black-White differences in social, psychological, and medical correlates of depressive symptoms and depression. Future research is still needed to compare Blacks and Whites for factor structure of the CES-D.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0e6776ef0d7ccb2dcc7134d05c50d91",
  "timestamp": "2025-05-15T03:15:38.501669"
}