{
  "id": 5073,
  "title": "CAPITAL STRUCTURE, SOLVENCY AND LIQUIDITY MANAGEMENT OF THE FEDERATION OF BOSNIA AND HERZEGOVINA COMPANIES DURING AND AFTER THE GLOBAL FINANCIAL CRISIS",
  "abstract": "Ever-changing business environment creates constant pressure for companies to continuously improve their performance. In particular, the global financial crisis had huge influence on just about every company, forcing adjustment of their business operations. The crisis created a serious of simultaneous effects among financial institutions, especially banks, such as reduction in the general availability of loans and tightening of the credit approval process due to risk exposure. This was coupled with reduced demand for credit by both corporate and households. These conditions have resulted in either proactive or reactive business operations adjustment for many impacted business, and companies in Bosnia and Herzegovina are no exception. This paper analyses companies' capital structure, solvency, and liquidity management during and after the global financial crisis. The research covers a comprehensive dataset related to companies in the Federation of Bosnia and Herzegovina and their financial performance. The dynamic panel regression model was used to check the significance of the capital structure and indebtedness impacts on firms' liquidity during five consecutive years (2009-2013). The research findings are focused on the overall production and processing industry as well as nine sectors that deserve special consideration. The findings and recommendations resulting from this study are designed to help various decision makers develop better understanding of the relationship between the economic crisis and companies capital structure management. The paper covers a review of relevant literature, a brief theoretical framework, and research methods as well as findings, descriptions, and explanations of the analysis results. The resulting recommendations can be useful to corporate officials, financial markets participants as well as economic policy decision makers. Moreover, it may serve as motivation for other researchers to undertake further study in the area of financial management.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0efc3fb959a4e9d3da216156ecebee5",
  "timestamp": "2025-05-15T02:44:10.983258"
}