{
  "id": 1074,
  "title": "Discriminating the default risk of small enterprises: Stacking model with different optimal feature combinations",
  "abstract": "Small enterprise default discrimination establishes a risk discriminant model based on financial data, nonfinancial data, and external macro conditions of small enterprises to obtain their default discriminant. This study constructs the final default discriminant model, taking the predicted default probability vectors from the first modelling as independent variables. From the 2e feature combinations composed of e features, it maximises the default discriminant precision of the same training sample. Accordingly, the study inversely infers three optimal feature combinations corresponding to three models, including logistic regression, support vector machine, and linear discriminant analysis, ensuring the discrimination accuracy of the first modelling by the stacking method. Moreover, five features-industry prosperity index, EBITDA margin, current assets turnover ratio, net profit, and per capita disposable income of urban residents-account for 11% of the features in the optimal feature combination, but their importance accounts for 63%; thus, they are critical to the default risk of small enterprises. Further, the macro features significantly influence the default risk of small enterprises. For example, the importance of four macro features-industry prosperity index, consumer price index, per capita disposable income of urban residents, and Engel coefficient-accounts for 26.26% of the features in the optimal feature combination. Notably, the importance of the 'industry prosperity index', which is the greatest influencing factor in the feature combination, accounts for 17.63%. Ultimately, the discrimination accuracy of the proposed model is better than that of the seven classical default discriminant models.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0f50037d6c30f7807ca69252b0f2c71",
  "timestamp": "2025-05-15T01:58:43.354398"
}