{
  "id": 4038,
  "title": "OPTIMIZATION APPLIED ON REGULATORY AND ECO-FINANCE NETWORKS - SURVEY AND NEW DEVELOPMENTS -",
  "abstract": "In this paper we survey recent advances and mathematical foundations of regulatory networks. We explain their interdisciplinary implications with special regard to Operational Research and financial sciences and introduce the so-called eco-finance networks. These networks, originally developed in the context of modeling and prediction of gene-expression patterns, have proved to provide a conceptual framework for the modeling of dynamical systems with respect to errors and uncertainty as well as the influence of certain environmental items. Given the noise-prone measurement data we extract nonlinear differential equations to describe and investigate the interactions and regulating effects between the data items of interest and the environmental items. In particular, these equations reflect data uncertainty by the use of interval arithmetics and comprise unknown parameters resulting in a wide variety of the model. For an identification of these parameters Chebychev approximation and generalized semi-infinite optimization are applied. In addition, the time-discrete counterparts of the nonlinear equations are introduced and their parametrical stability is investigated by a combinatorial algorithm which detects the region of parameter stability. We analyze the structural stability of the regulatory networks, we discuss a modeling by stochastic differential equations and explain how spline regression applied in an additive model could be integrated into our analysis. We conclude with two examples for eco-finance networks in the fields of CO2-emissions-control and portfolio Optimization for natural gas transportation systems.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0f6faafd687530501cdbcc6cf9e6fb6",
  "timestamp": "2025-05-15T01:23:07.441150"
}