{
  "id": 8822,
  "title": "Social and Economic Importance of Forest Companies in Asian Russia: Evidence from Corporate Financial Reporting",
  "abstract": "In contrast with many other sectors of the Russian economy, there is low market concentration in the forest industry and, consequently, a large number of relatively small enterprises scattered throughout the world's largest country. In many cases, logging or woodworking companies are the only or key employers in sparsely populated areas, making them important sources of the social and economic stability of small towns and rural settlements. In 2022, Russian forest companies faced dramatic barriers to international trade, which led to the suspension of production with the risk of further layoffs. Thus, the issue of social and economic importance of the forest business in Russia has gained additional sounding. This paper aims to estimate the decline in revenues and the number of employees in forestry companies in Asian Russia because of sanctions. Based on corporate accounting reports, we have generated a dataset covering 4675 forest industry companies in Asian Russia. We use quantile regression to estimate the impact of the number of employees on revenue. All companies were divided into quartiles by revenue and into 6 groups by type of economic activity. A significant differentiation of the return on the number of employees depending on the type of activity and the volume of firms' revenues was found. Estimates of potential losses of companies during labor force reduction were obtained, which would be 1.2%-3.6% of revenue for a company from Q1, 2.2%-6.6% of revenue for Q2 and 2.7%-8.1% of revenue for Q3. The results clearly demonstrate that forest companies might be very interested in retaining a workforce, even if an opportunistic drop in product demand creates a financial shortfall. Policy makers should take this into account when shaping instruments to support the industry.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a0f9b6be4694c7238ccb3a5e33937693",
  "timestamp": "2025-05-15T03:22:57.875381"
}