{
  "id": 6896,
  "title": "Collaborative Ocular Oncology Group Report Number 1: Prospective Validation of a Multi-Gene Prognostic Assay in Uveal Melanoma",
  "abstract": "Purpose: This study evaluates the prognostic performance of a 15 gene expression profiling (GEP) assay that assigns primary posterior uveal melanomas to prognostic subgroups: class 1 (low metastatic risk) and class 2 (high metastatic risk). Design: Prospective, multicenter study. Participants: A total of 459 patients with posterior uveal melanoma were enrolled from 12 independent centers. Testing: Tumors were classified by GEP as class 1 or class 2. The first 260 samples were also analyzed for chromosome 3 status using a single nucleotide polymorphism assay. Net reclassification improvement analysis was performed to compare the prognostic accuracy of GEP with the 7th edition clinical Tumor-Node-Metastasis (TNM) classification and chromosome 3 status. Main Outcome Measures: Patients were managed for their primary tumor and monitored for metastasis. Results: The GEP assay successfully classified 446 of 459 cases (97.2%). The GEP was class 1 in 276 cases (61.9%) and class 2 in 170 cases (38.1%). Median follow-up was 17.4 months (mean, 18.0 months). Metastasis was detected in 3 class 1 cases (1.1%) and 44 class 2 cases (25.9%) (log-rank test, P<10(-14)). Although there was an association between GEP class 2 and monosomy 3 (Fisher exact test, P<0.0001), 54 of 260 tumors (20.8%) were discordant for GEP and chromosome 3 status, among which GEP demonstrated superior prognostic accuracy (log-rank test, P = 0.0001). By using multivariate Cox modeling, GEP class had a stronger independent association with metastasis than any other prognostic factor (P<0.0001). Chromosome 3 status did not contribute additional prognostic information that was independent of GEP (P = 0.2). At 3 years follow-up, the net reclassification improvement of GEP over TNM classification was 0.43 (P = 0.001) and 0.38 (P = 0.004) over chromosome 3 status. Conclusions: The GEP assay had a high technical success rate and was the most accurate prognostic marker among all of the factors analyzed. The GEP provided a highly significant improvement in prognostic accuracy over clinical TNM classification and chromosome 3 status. Chromosome 3 status did not provide prognostic information that was independent of GEP. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2012;119:1596-1603 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a10ae8ecf4c7a65e5b19b04b642ee115",
  "timestamp": "2025-05-15T03:02:41.286785"
}