{
  "id": 7148,
  "title": "Barriers to prenatal care in Europe",
  "abstract": "Background: In Europe, it is sometimes assumed that few barriers to prenatal care exist because extensive programs of health insurance and initiatives to promote participation in prenatal care have been established for many decades. Methods: A case-control study was performed in ten European countries (Austria, Denmark, Germany, Greece, Hungary, Ireland, Italy, Portugal, Spain, and Sweden). Postpartum interviews were conducted between 1995 and 1996. A total of 1283 women with inadequate prenatal care (i.e., with 0, 1, or 2 prenatal care visits or a first prenatal care visit after 15 completed weeks of pregnancy) and 1280 controls with adequate prenatal care were included in the analysis combining data from the ten countries. Results: Based on combined data of the tell countries, lack of health insurance was found to be an important risk factor for inadequate prenatal care (crude odds ratio [OR] at 95% confidence interval [CI]: 30.1 [20.1-47.1]). Women with inadequate prenatal care were more likely to be aged < 20 years (16.4% vs 4.8%) and with higher parity (number of children previously borne) than controls. They were more likely to be foreign nationals, unmarried, and with an unplanned pregnancy. Women with inadequate care were also more likely to have less education and no regular income. They had more difficulties dealing with health services organization and child care. Cultural and financial barriers were present, but after adjusting for confounders by logistic regression, perceived financial difficulty was not a significant factor for inadequate prenatal care (adjusted OR [95% CI]: 0.7 [0.4-1.3]). Conclusions: Personal, socioeconomic, organizational, and cultural barriers to prenatal care exist in Europe.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a11e5df427472648e5dd3e411bdc23f8",
  "timestamp": "2025-05-15T03:05:32.082132"
}