{
  "id": 3411,
  "title": "Self-reported socio-economic status, social, physical and leisure activities and risk for malnutrition in late life: A cross-sectional population-based study",
  "abstract": "Our goal was to evaluate the proportion of community-dwelling elderly people at risk for malnutrition and the effect of different socioeconomic status (SES) indicators as well as social, physical and leisure activities in late life on the risk for malnutrition. A cross-sectional population-based study. A sub-urban area in Northern Italy. 698 community-dwelling older persons. The nutritional status of participants was assessed through the Mini Nutritional Assessment-Short Form (MNA-SF). SES was defined by means of early-life education, longest occupation, and late-life financial conditions. The following indicators were also evaluated: social contacts, and performing mental, physical and leisure activities during late-life. Chronic diseases, functional, cognitive and affective status were considered as potential confounders when examining the risk for malnutrition by logistic regression models. 8% of the participants (average age 75.6 years, 408 women) were at risk for malnutrition (MNA-SF a parts per thousand currency sign 11). Low education, poor financial condition, and lack of physical and leisure activities showed a crude association with risk for malnutrition. Multi-adjusted logistic regression models showed that only low education (OR=2.9; 95% CI=1.2-6.8) and lack of physical activity (OR=4.4;95%CI=2.0-9.7) were independently associated with the risk for malnutrition. Low education and lack of physical activity in late-life may affect the risk for malnutrition in the elderly. Further studies are needed to clarify the cause-effect relationship between lack of physical activity and malnutrition.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a1270feda3563fb74643b3760e85b4e9",
  "timestamp": "2025-05-15T02:25:40.247331"
}