{
  "id": 8785,
  "title": "Energy poverty and self-rated health among Roma population and general population in Spain",
  "abstract": "Objective: To quantify energy poverty in Roma population and in general population in Spain, in 2016, as well as to observe the association of this phenomenon with self-rated health, adjusted according to the main socio-economic determinants.Method: Energy poverty has been defined as the financial inability to keep a home warm, the presence of dampness in the dwelling and falling into arrears in utility bills, using data from two European surveys from Spain in 2016: the Survey on Income and Living Conditions (EU-SILC) and the Second Survey on Minorities and Discrimination (EU-MIDIS II). Hierarchical logistic regression models were estimated with self-rated health as the outcome variable, progressively adjusted according to demographic (gender and age), environmental (household temperature, humidity and arrears in utility bills) and socio-economic (level of education, marital status and employment status) variables.Results: Our results show that 45% of the Roma population had moderate or high levels of energy poverty. The odds ratio (OR) of poor self-rated health was higher in the Roma population (OR: 3.11; 95% confidence interval [95% CI]: 2.59-3.74). The inability to maintain an adequate indoor temperature significantly increased the risk of poor health (OR: 2.10; 95% CI: 1.90-2.32). After adjusting according to demographic, environmental and socio-economic variables, no association was observed between the population of ascription and self-rated health. Conclusions: Taking into account the main social determinants, including energy poverty indicators, being Roma is not associated with reporting poor health. This result points to the importance of tackling socio-economic factors, including energy poverty, to reduce health inequalities.(c) 2023 SESPAS. Published by Elsevier Espana, S.L.U. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a12a228a2b7cea9eac7e335be1a3afb1",
  "timestamp": "2025-05-15T03:22:26.049392"
}