{
  "id": 8320,
  "title": "Formula for the prediction of apnea / hypopnea index in children with obstructive sleep apnea without polysomnography according to the clinical parameters: Is it reliable?",
  "abstract": "Purpose of the study: The aim of the study was to propose the risk formula for obstructive sleep apnea in children according to the general and local clinical parameters and findings relevant for obstructive sleep apnea (OSA) severity. The unmet need for this formula arises from the economic burden of polysomnography (device, staff, training, special sleep centers, etc) as the golden standard for the diagnostics. Materials and methods used: The study was performed from January 2013 until January 2016 in the Sleep Center, Department for Neuroscience, School of Medicine of the University of Split, Department of Pediatrics, University Hospital Split, Croatia and ENT Dept. University Hospital in Split, Croatia. Inclusion criteria were: age > two years, AHI >1 diagnosed by polysomnography. Exclusion criteria were: chronic lung disease, active tonsillitis/pharyngitis at the time of the physical exam and syndromes that affect breathing. All polysomnograms were scored by a qualified sleep technologist and interpreted by two board certified sleep physicians independently. Age, sex, BMI, Mallampati score, tonsillar size and adenoids size were recorded. All statistical calculations were performed using SPSS 20. Results: In total 60 children were included in the study. The median of age was 5 years (range 2-9). There were 19 (32%) girls and 41 (68%) boys. Of all evaluated predictors, there were statistically significant differences in the values of AHI among children with different modified Mallampati score (x(2) = 28.2; p < 0.001), different size of tonsils (x(2) = 25.3; p < 0.001) and different size of adenoids (z = 2.7; p = 0,006) in univariate regression analysis. Strong positive association of AHI with modified Mallampati score (standardized B = 0.51; partial correlation = 0.542, r = 0.631) was found, as well as positive correlation of AHI with tonsillar size (standardized B = 0.246; partial correlation = 0.295,R = 0.489) in the multivariate forward stepwise regression analysis. Conclusion: Even though we are aware that PSG is the gold standard for diagnostics of SDB there is a significant financial burden for this diagnostic procedure. That is why there is a necessity for establishing good clinical standards and possible formula for OSA severity evaluation. We propose formula which includes Mallampati score and tonsillar size for OSA-risk calculation in order to perform early therapeutic intervention thereby reducing the risk of long-term negative consequences. We recommend this formula as the screening formula in circumstances where PSG is not available, in cases when the waiting list is too long or when a child can not cooperate to perform it. In developing countries like Croatia on time intervention with reduced procedure associated costs is of the utmost importance. (C) 2017 Elsevier B.V. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a13cb16ece51b5e26b96c259d0a45029",
  "timestamp": "2025-05-15T03:17:49.073523"
}