{
  "id": 4297,
  "title": "How do external auditor attributes impact corporate social responsibility disclosures: empirical evidence from ADX-listed companies",
  "abstract": "Purpose This paper aims to highlight the relationship between the attributes of external auditor companies and voluntary corporate social responsibility (CSR) disclosures of audited firms using a sample of Abu Dhabi Securities Exchange (ADX)-listed companies. Design/methodology/approach Based on a sample of 410 firm-year observations for the period 2010-2016, this study first computes an eight-item CSR disclosure index, then ran a multivariate regression analysis between CSR disclosure scores and external auditor attributes, along with client firm characteristics and additional control variables. Finally, this paper performs various additional robustness checks. Findings The results reveal that external auditor attributes have a significant impact on shaping the CSR disclosures of ADX-listed firms. Overall, auditor age, size, industry specialisation and portfolio diversification positively affect the level of customers' CSR disclosures. By contrast, the magnitude of audit fees and auditor experience in the UAE has no impact on the CSR disclosures of ADX-listed firms. This study controls for client firm size, financial leverage, ownership concentration and the proportion of independent directors on companies' board of directors. The results remain robust to additional sensitivity checks such as audit company CSR practices, extreme quartiles of CSR disclosures and the panel data estimation method. Research limitations/implications The research exhibits some limitations. First, this paper uses a simple index to measure CSR disclosures based on previous empirical studies, especially those related to emergent markets, which are not free from bias due to the lack of voluntary disclosure transparency for some companies listed on ADX. Second, although this study uses a seven-year observation period, the total number of observations remains limited due to ADX size. Third, other context-specific disclosures should be included such as cultural and governance variables (royal families ownership). Practical implications The study highlights the role of external attributes that can affect companies' CSR disclosure policy, rather than firm-specific factors. The study also reshapes the concept of auditor quality beyond the dichotomy (Big Four/non-Big Four) used in the current literature. Originality/value The research adds to the current literature on CSR by revealing the impact of external auditor attributes on client firm CSR disclosure policy in an emerging market, the ADX.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a13d7a4005fd488e3d0ead9a5b4dcb17",
  "timestamp": "2025-05-15T01:25:50.479002"
}