{
  "id": 937,
  "title": "A Deep Convolutional Neural Network Based Risk Identification Method for E-Commerce Supply Chain Finance",
  "abstract": "With the popularity of the Internet, the rise of e-commerce platforms has led to the rapid development of supply chain (SC) financial services in China, and the competitiveness of commercial banks and core enterprises in the supply chain is now gradually increasing, rapidly expanding into an important area of competition between the two. As an emerging force rebounding from the economic downturn, e-commerce platform transactions, with their unique characteristics of informatization, diversification, and convenience, have provided a broad space for Internet SC finance. The article mainly analyzes the risk identification method of e-commerce SC finance, analyzes its risk from the financing process, gives corresponding data support for the matters or processes that may cause financing risk based on DCNN model, and takes Jingdong SC finance as an example and analyzes its main financing methods and risk identification process; based on different experimental comparisons, a multigroup experimental study shows that the accuracy of supply chain finance risk identification using deep convolutional neural network models can reach 95.36%, which demonstrates the effectiveness of the proposed method by providing better performance compared to traditional BP and SVM networks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a16f92ce736f83641a99898d7e60c030",
  "timestamp": "2025-05-15T01:56:49.617548"
}