{
  "id": 4344,
  "title": "Do free-floated shares and board characteristics influence corporate risk disclosure? An empirical analysis on conventional banks in a developing country",
  "abstract": "PurposeThis study aims to explore the status and drivers (including free-floated shares, board size, rule duality and board independence) of corporate risk disclosure (CRD) for the conventional listed banks in the Egyptian stock market from 2010 to 2021, which include the country's major political upheavals and the COVID-19 pandemic. Design/methodology/approachThis study based on a sample of 117 annual reports of sampled banks from 2010 to 2021. RD index of Al-Maghzom (2016) was developed and adopted to quantify CRD using an unweighted scoring system. The multiple linear regression model was used to validate the hypotheses. FindingsThe analysis shows that the COVID-19 pandemic increased insignificantly disclosure of all risks except for segment risks. In addition, findings reveal that all sampled banks adhere highly to the requirements of mandatory RD, with a low level of adherence to voluntary RD. Moreover, the analysis concluded that the board size and free-floating shares positively affect the disclosure of financial, operational, general information. Research limitations/implicationsThe study's limitations include the content analysis methodology, reliance on annual reports, emphasis on financial and non-financial risks, focus on listed conventional banks in Egypt. Practical implicationsCurrent study's findings are more likely to be useful for many parties. It informs investors about the characteristics of the boards' directors of Egyptian listed banks that disclosed risk information. Banks should disclose more comprehensive risk information. For academics, the current study's limitations can be considered in their future research. Originality/valueThis work fills a new research area in which there is relatively little research in emerging financial markets that adds new evidence to the relationship between RD and both free-floating shares and board characteristics, particularly in Egypt.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a17a9452c5dda80b896c7e7d0aed828f",
  "timestamp": "2025-05-15T02:36:05.221502"
}