{
  "id": 6595,
  "title": "Race, Ethnicity, and Socioeconomic Factors as Determinants of Cachexia Incidence and Outcomes in a Retrospective Cohort of Patients With Gastrointestinal Tract Cancer",
  "abstract": "PURPOSECachexia is a paraneoplastic syndrome of unintentional adipose and muscle tissue wasting with severe impacts to functionality and quality of life. Although health inequities across minority and socioeconomically disadvantaged groups are known, the role of these factors in cachexia progression is poorly characterized. This study aims to evaluate the relationship between these determinants and cachexia incidence and survival in patients with gastrointestinal tract cancer.METHODSThrough retrospective chart review from a prospective tumor registry, we established a cohort of 882 patients with gastroesophageal or colorectal cancer diagnosed between 2006 and 2013. Patient race, ethnicity, private insurance coverage, and baseline characteristics were evaluated through multivariate, Kaplan-Meier, and Cox regression analyses to determine associations with cachexia incidence and survival outcomes.RESULTSWhen controlling for potentially confounding covariates (age, sex, alcohol and tobacco history, comorbidity score, tumor site, histology, and stage), Black (odds ratio [OR], 2.447; P < .0001) and Hispanic (OR, 3.039; P < .0001) patients are at an approximately 150% and 200%, respectively, greater risk of presenting with cachexia than non-Hispanic White patients. Absence of private insurance coverage was associated with elevated cachexia risk (OR, 1.439; P = .0427) compared to privately insured patients. Cox regression analyses with previously described covariates and treatment factors found Black race (hazard ratio [HR], 1.304; P = .0354) to predict survival detriments, while cachexia status did not reach significance (P = .6996).CONCLUSIONOur findings suggest that race, ethnicity, and insurance play significant roles in cachexia progression and related outcomes that are not accounted for by conventional predictors of health. Disproportionate financial burdens, chronic stress, and limitations of transportation and health literacy represent targetable factors for mitigating these health inequities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a183ccf860e9ac1acd36c9f6ade6eacb",
  "timestamp": "2025-05-15T02:59:37.078290"
}