{
  "id": 769,
  "title": "Performance improvement of bankruptcy prediction using credit card sales information of small & micro business",
  "abstract": "Due to the poor financial statements which represent credit risk of small and micro business, it's been difficult to develop the credit evaluation model that reflects both consumer credit risk and business credit risk of small and micro business. The purpose of this study is to develop the credit evaluation model for small and micro businesses using credit card sales information in lieu of poor financial information. In order to develop the model, we derive some variables and analyze the relationship between good and bad credits. We find out that twelve variables are significant in predicting good or bad risk for small and micro business, which are categorized into the business period, scale for sale, a fluctuation in sales, sales pattern and business category's bankruptcy ratio, etc. We employ the new statistical learning technique, support vector machines (SVM) as a classifier. We use grid search technique to find out better parameter for SVM. The experimental result shows that credit card sales information could be a good substitute for the financial data on business credit risk in predicting the bankruptcy for small-micro businesses. In addition, we also find out that SVM performs best, when compared with other classifiers such as neural networks, CART, C5.0, multivariate discriminant analysis (MDA), and logistic regression analysis(LRA).",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a18496309ff01191711c4abbee6316e8",
  "timestamp": "2025-05-15T01:55:07.983901"
}