{
  "id": 3874,
  "title": "Determinants Of Factors Affecting the Amount of Fees for Audit Services",
  "abstract": "Banking companies that are registered and trade their shares on the Indonesia Stock Exchange (IDX) have an obligation to publish audited financial statements. The financial statements are audited to provide assurance on the fairness of their presentation so that they do not contain information bias. The auditor will receive an audit fee after auditing the financial statements. This study tries to examine the effect of company size, institutional ownership, managerial ownership, internal audit activities and risk management on the determination of the amount of fees for the audit services. The uniqueness of this study is that it includes risk management as one of the factors that are thought to have an influence on the amount of the audit fee. Risk management output can make it easier for auditors to identify areas that contain significant risks to the company. The purpose of this study is to provide empirical evidence of what factors can determine the amount of fees for audit services. This type of research is quantitative with multiple linear regression analysis technique. The research data is carried out by observing the audited annual reports of banking companies. The observation period of this research is from 2014-2020. Statistical test results obtained company size, institutional ownership and profitability have a significant positive effect on the amount of fees for audit services. Meanwhile, the activities of internal audit, risk management and managerial ownership have no significant positive effect.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a1936a6c60720f08aa0bc43bb1b520ec",
  "timestamp": "2025-05-15T02:30:58.221611"
}