{
  "id": 5287,
  "title": "Strike Insurance: The Labor Question and the Limits of Insurance",
  "abstract": "Turn-of-the-century America witnessed many forgotten risk-making experiments that probed the limits of insurability by stepping beyond the familiar fields of life, fire, and marine insurance. One attempted to underwrite firms' lost profits during strikes. The ensuing debates on strike insurance's practicability revealed scientistic expectations of never-ending actuarial progress that united an otherwise-divided business community. Yet attempting to realize strike insurance quickly meant grappling with the limits of insurability. Labor strife's fuzzy causality involving human agency forestalled the homogenous classification that underlay actuaries' averaging. Thus, strike underwriters sidestepped actuarial ratemaking to offer uniform premiums to those deemed acceptable risks. This solution not only left them susceptible to adverse selection and moral hazard but also highlighted the limits of insurers' ability to transform uncertainty into commoditized risk, more broadly. Recognizing these limits has important historiographical implications. Based largely on studies of life insurance-the gold standard of insurability-the rise of financial risk management has claimed a central place in the history of American capitalism. This literature thus threatens to obscure the ongoing significance of unclassifiable, unquantifiable uncertainty. Uncovering forgotten risk-making projects like attempts to establish strike insurance, where Americans grappled with the limits of insurability, is thus a crucial corrective.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a1946b6c72b9d349de93b6a9412b411d",
  "timestamp": "2025-05-15T02:46:16.229707"
}