{
  "id": 7397,
  "title": "A Health Insurance Company-Initiated Multifaceted Intervention for Optimizing Acid-Suppressing Drug Prescriptions in Primary Care A Randomized Controlled Trial",
  "abstract": "Objective: To evaluate the effectiveness of a health insurance company-initiated intervention strategy aimed at optimizing acid-suppressing drug (ASD) prescriptions in primary care. Methods: In a cluster randomized controlled trial design, 112 primary care physician (PCP) peer review groups (993 PCPs) in the central region of the Netherlands were randomized. The PCPs in the intervention group received an ASD prescription optimization protocol, a list of their patients taking ASDs frequently on a long-term basis, and financial compensation for additional consultations with these patients. The PCPs in the control group did not receive any of these interventions. Prescription data on 23 433 patients were extracted from the database of the regional health insurance company. The main outcome measures were the proportion of patients who reduced ASD consumption by more than 50% and changes in annual volume and costs of ASD prescriptions. Differences in ASD reduction and in volume were analyzed applying multilevel regression analyses. Results: At baseline, 2.4% of the patients (n=967 506) of the participating practices used ASDs frequently on a long-term basis (>180 daily defined doses [DDDs] annually). During the 6-month intervention, 14.1% of the patients in the intervention group reduced ASD consumption compared with 13.7% in the control group (adjusted relative risk, 1.04; 95% confidence interval [CI], 0.97-1.11). Changes in intervention and control group in mean volume of ASD prescription per patient were similar (beta=0.33 for DDD; 95% CI -3.00 to 3.60). Conclusions: A health insurance company-initiated multifaceted intervention, including practical tools and financial incentives, did not alter ASD prescription practice in primary care. More tailored interventions, including patient-targeted initiatives, are required to optimize ASD prescription.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a1983d629fcde09b2c0d91e8ac747ae6",
  "timestamp": "2025-05-15T03:08:00.854758"
}