{
  "id": 5569,
  "title": "Synergy or too big to fail: Empirical analysis of mergers and acquisitions in SAARC and ASEAN regions",
  "abstract": "The purpose of the study is to examine the impact of agency issues such as free cash flow, empire-building, managerial risk aversion, and private benefit of control on post-merger financial performance in the context of emerging markets of SAARC and ASEAN regions. The sampling period for the study is from 2000 to 2017, limited to M&A deals where at least three years of pre- and post-merger data is available. A total of 184 M&A deals were analyzed from SAARC and ASEAN regions. Financial performance is measured through operating profit returns and cash returns, while the explanatory variables are free cash flow, firms' size, industry relatedness, and block holding. Two-sample t-test is used for univariate analysis, and OLS regression is used for multivariate analysis. Results reveal that post-mergers and acquisition (M&A) financial performance declined as compared to pre-M&A financial performance over three (-3, +3) years window. Opposite to the free cash flow hypothesis, this study found that free cash flows are beneficial for acquirers in the context of emerging markets. Furthermore, acquirers' size has either no impact or a significantly positive impact in robustness check on post-M&A performance, which rejects the empire-building motive. Unrelated mergers cause a decline in post-M&A performance, and large block holding enhances post-M&A performance. The findings of the study are helpful for managers, shareholders, and the board's members to ensure that the free cash flow before the M&A transaction is positive and consistent also conscious of the nature of the target and avoid unrelated M&A deals.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a19d04b9db40066e156d2370c53974dd",
  "timestamp": "2025-05-15T02:49:21.601122"
}