{
  "id": 6851,
  "title": "Risk Adjustment for Medicare Total Knee Arthroplasty Bundled Payments",
  "abstract": "The use of bundled payments is growing because of their potential to align providers and hospitals on the goal of cost reduction. However, such gain sharing could incentivize providers to cherry-pick more profitable patients. Risk adjustment can prevent this unintended consequence, yet most bundling programs include minimal adjustment techniques. This study was conducted to determine how bundled payments for total knee arthroplasty (TKA) should be adjusted for risk. The authors collected financial data for all Medicare patients (age >= 65 years) undergoing primary unilateral TKA at an academic center over a period of 2 years (n=941). Multivariate regression was performed to assess the effect of patient factors on the costs of acute inpatient care, including unplanned 30-day readmissions. This analysis mirrors a bundling model used in the Medicare Bundled Payments for Care Improvement initiative. Increased age, American Society of Anesthesiologists (ASA) class, and the presence of a Medicare Major Complications/Comorbid Conditions (MCC) modifier (typically representing major complications) were associated with increased costs (regression coefficients, $57 per year; $729 per ASA class beyond I; and $3122 for patients meeting MCC criteria; P=.003, P=.001, and P<.001, respectively). Differences in costs were not associated with body mass index, sex, or race. If the results are generalizable, Medicare bundled payments for TKA encompassing acute inpatient care should be adjusted upward by the stated amounts for older patients, those with elevated ASA class, and patients meeting MCC criteria. This is likely an underestimate for many bundling models, including the Comprehensive Care for Joint Replacement program, incorporating varying degrees of postacute care. Failure to adjust for factors that affect costs may create adverse incentives, creating barriers to care for certain patient populations.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a1ac0c459076ff00e661f0a610bd21eb",
  "timestamp": "2025-05-15T03:02:07.547752"
}