{
  "id": 9055,
  "title": "FACTORS DRIVING THE GROWTH OF ISLAMIC BANK FINANCING: EVIDENCE FROM MALAYSIA",
  "abstract": "Purpose - This research aims to examine the determinants of growth in Islamic bank financing in Malaysia for the period 2007 to 2023. Design/Methodology/Approach - The research employed Descriptive Statistics, Correlation Analysis, and Panel Data Regression to examine the impact of internal and external variables on growth in Islamic bank financing in Malaysia. STATA version 17 was used to compute the results. Findings - The empirical findings show four significant variables among the internal factors, namely, Impaired Financing (IF), Profitability (ROA), Liquidity (LQR), and Deposit Growth (DG), whereas two external factors, Gross Domestic Product (GDP) and Dummy Government Policy (DUMGP), are significant determinants of growth in Islamic bank financing. The research also reveals that Capital (CAP), Inflation (INF), Overnight Policy Rate (OPR), and Foreign Direct Investment (FDI) do not impact growth in Islamic bank financing. Originality/Value - This research contributes to the existing literature by identifying key factors that drive or hinder growth in Islamic bank financing, thereby enhancing their performance and reinforcing their role in Malaysia's economy. Unlike most prior studies, which predominantly focus on external macroeconomic variables such as GDP, inflation, unemployment, and OPR, this study addresses a critical gap by examining the influence of foreign direct investment (FDI), a largely overlooked determinant in Islamic banking research. By uncovering the impact of FDI on growth of Islamic bank financing, this study provides new empirical insights that can shape strategic decision-making for Islamic bankers and inform policymakers in crafting policies that foster a more robust Islamic financial system. Ultimately, this research advances the broader objective of positioning Islamic finance as a competitive and sustainable alternative to conventional banking. Research Limitations/Implications - This research was only conducted for a limited period from 2007 to 2023. Next, the number of Islamic banks considered in this research is relatively small as it focuses solely on Islamic banks operating in Malaysia. Lastly, there is a limitation regarding the selection of variables as the research includes only a restricted number of variables, namely, IF, CAP, ROA, LQR, DG, GDP, INF, OPR, FDI, and DUMGP. Hence, this research omits many other determinant factors of growth in Islamic bank financing, such as corporate governance practices. Practical Implications - This research offers practical guidance for Islamic bankers and policymakers. It is suggested that Islamic banks strengthen their credit risk management by enhancing due diligence and monitoring credit portfolios to reduce impaired financing and its impact on growth in Islamic bank financing. Implementing Early-Warning Systems (EWS) could be useful in identifying potential defaults so that Islamic banks can take prompt action. They should boost deposit growth through innovative products and maintain a strong liquidity level for efficient financing. Additionally, policymakers should calibrate macroprudential policies to balance financial stability with financing growth, allowing Islamic banks to extend financing effectively without restrictions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a1b10014116c8e7efebea9da128883cf",
  "timestamp": "2025-05-15T03:24:55.002199"
}