{
  "id": 8181,
  "title": "Cost burden of cirrhosis and liver disease progression in metabolic dysfunction- associated steatohepatitis: A US cohort study",
  "abstract": "BACKGROUND: Metabolic dysfunction-associated steatohepatitis (MASH), formerly nonalcoholic steatohepatitis, is characterized by fat accumulation and inflammation of the liver and may result in progres- sion to cirrhosis and liver-related events. OBJECTIVE: To characterize the impact of cirrhosis and progression to liver-related events on costs and health care resource use (HCRU) among MASH patients in the United States. METHODS: The study cohort included patients with diagnosed nonal- coholic steatohepatitis ( International Classification of Diseases, Tenth Revision, Clinical Modification code K75.81) in Optum's deidentified Clinformatics Data Mart Database (October 2015 to December 2022) and were stratified by baseline cirrhosis status. Among those with- out cirrhosis at baseline, patients were further stratified by status of progression to cirrhosis during follow-up. Total HCRU and costs per- person per-year (PPPY) were estimated and compared descriptively between the cohorts. In addition, gamma generalized linear models were used to compare costs PPPY between those with vs without cirrhosis at baseline, as well as with vs without progression during follow-up, while adjusting for baseline patient and disease character- istics. Annual costs per person were also longitudinally modeled using gamma generalized linear mixed models to understand longitudinal changes in costs PPPY while accounting for time correlations within individual patients. Lastly, a series of sensitivity analyses were con- ducted to assess the impact of study design features and clinical variations of total costs PPPY. RESULTS: A total of 28,576 adults were included, and 9,157 (32.0%) had baseline cirrhosis; of the 19,419 without baseline cirrhosis, a total of 4,235 (21.8%) progressed over follow-up. Mean (SD) HCRU and costs PPPY were higher among patients with cirrhosis ($110,403 [$226,037]) than without ($28,340 [$61,472]; P < 0.01) and among those with pro- gression ($58,128 [$102,626]) than without ($20,031 [$39,740]; P < 0.01). Costs remained significantly greater when adjusted for covariates, with a risk ratio (95% CI) of 1.99 (1.89-2.09) when comparing with vs without baseline cirrhosis and 2.28 (2.15-2.42) when comparing with vs without progression over follow-up. Costs increased with each subsequent year, to 21% by year 6 among those with cirrhosis at baseline and 49% among those without baseline cirrhosis who progressed. CONCLUSIONS: The financial burden of MASH is substantial and sig- nificantly greater among those with cirrhosis or disease progression. Although patients without cirrhosis incur lower burden, the increase over time is greater and associated with progression. Therapies that slow progression may help alleviate the financial burden, and strate- gies are needed to identify patients with MASH at risk of progressing to cirrhosis.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a1d7bc0876ed0df5eb8b55e3fd48647a",
  "timestamp": "2025-05-15T03:16:17.380728"
}