{
  "id": 2773,
  "title": "Extending the Merton Model: A hybrid approach to assessing credit quality",
  "abstract": "In this paper we have combined fundamental analysis and contingent claim analysis into a hybrid model of credit risk measurement. We have extended the standard Merton approach to estimate a new risk neutral distance to default metric, assuming a more complex capital structure, adjusting for dividend payments, introducing randomness to the default point and allowing a fractional recovery when default occurs. Then, using financial ratios, other accounting based measures and the risk neutral distance to default metric from our structural model as explanatory variables we estimate the hybrid model with an ordered probit regression method. Using the same econometric method, we estimate a model using financial ratios and accounting variables as explanatory variables and a model using our risk neutral distance to default metric as unique explanatory variable. We have found that by enriching the risk neutral distance to default metric with financial ratios and accounting variables into the hybrid model, we can improve both in-sample fit of credit ratings and out-of-sample predictability of defaults. Our main conclusion is that financial ratios and accounting variables contain significant and incremental information; thus the risk neutral distance to default metric does not reflect all available information regarding the credit quality of a firm. (c) 2007 Elsevier Ltd. All rights reserved.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a1db6cbcde33ad81187db2821b2a1746",
  "timestamp": "2025-05-15T02:19:08.391687"
}