{
  "id": 2676,
  "title": "Practices of psychological and pedagogical support of future teachers' personal and professional development in the conditions of distance learning",
  "abstract": "The article highlights the intermediate results of the research Psychological and pedagogical support of future teachers' personal and professional development in the conditions of new educational standards' implementation in Ukraine. Various theoretical aspects as well as adapted and original practices are characterized. The experience of the authors regarding the implementation of the components - value-worldview, process-activity, emotional-resource during the motivational-cognitive, constructive-active, reflective-prognostic, value-identification stages is highlighted. Effective author's practices are presented - adaptation trainings, portfolio of personal and professional growth in the context of performance of work functions; formation of end-to-end skills of future teachers by means of digital technologies and tools (GDocs, GMeet, Zoom, Canva, MindMeister, Mentimeter, digital boards); adaptation of active learning technologies in the distance learning format (case-technologies, game, project technologies, SWOT analysis). A complex of technologies (role-playing games, training technologies, art-therapy) is presented, which contribute to the development of the emotional intelligence of future teachers in the context of the formation of professional competencies - psychological, emotional-ethical, reflective, psycho-emotional. The research was carried out in an interdisciplinary scientific field, which requires next stages of the scientific search for correction, generalization of the results of psychological and pedagogical support of future teachers' personal and professional development.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a1e7d6be2c93fb8c789794bc04727fed",
  "timestamp": "2025-05-15T01:09:14.949904"
}