{
  "id": 8026,
  "title": "Air pollution exposure and risk of spontaneous abortion in the Nurses' Health Study II",
  "abstract": "STUDY QUESTION: Is there an association between air pollution exposures and the risk of spontaneous abortion (SAB)? SUMMARY ANSWER: Higher exposure to particulate matter (PM) air pollution above and beyond a woman's average exposure may be associated with greater risk of SAB, particularly among women experiencing at least one SAB during follow-up. WHAT IS KNOWN ALREADY: There is sufficient biologic plausibility to suggest that air pollution adversely affects early pregnancy outcomes, particularly pregnancy loss; however, the evidence is limited. STUDY DESIGN, SIZE, DURATION: Our prospective cohort study included 19309 women in the Nurses' Health Study II who contributed a total of 35 025 pregnancies between 1990 and 2008. We also conducted a case-crossover analysis among 3585 women (11 212 pregnancies) with at least one SAB and one live birth during follow-up. PARTICIPANTS/MATERIALS, SETTING, METHODS: Proximity to major roadways and exposure to PM <10 microns (PM10), 2.5-10 microns (PM2.5-10) and <2.5 microns (PM2.5) were determined for residential addresses between 1989 and 2007. Pregnancy outcomes were self-reported biannually throughout follow-up and comprehensively in 2009. Multivariable log-binomial regression models with generalized estimating equations were used to estimate the risk ratios and 95% CIs of SAB. Conditional logistic regression was used for the case-crossover analysis. MAIN RESULTS AND THE ROLE OF CHANCE: During the 19 years of follow-up, 6599 SABs (18.8% of pregnancies) were reported. In the main analysis, living closer to a major roadway and average exposure to PM10, PM10-2.5 or PM2.5 in the 1 or 2 years prior to pregnancy were not associated with an increased risk of SAB. However, small positive associations between PM exposures and SAB were observed when restricting the analysis to women experiencing at least one SAB during follow-up. In the case-crossover analysis, an increase in PM10 (per 3.9 mu g/m(3)), PM2.5-10 (per 2.3 mu g/m(3)) and PM2.5 (per 2.0 mu g/m(3)) in the year prior to pregnancy was associated with 1.12 (95% CI 1.06, 1.19), 1.09 (95% CI 1.03, 1.14) and 1.10 (95% CI 1.04, 1.17) higher odds of SAB, respectively. LIMITATIONS, REASONS FOR CAUTION: We did not have information on the month or day of SAB, which precluded our ability to examine specific windows of susceptibility or acute exposures. We also used ambient air pollution exposures as a proxy for personal exposure, potentially leading to exposure misclassification. WIDER IMPLICATIONS OF THE FINDINGS: In our case-crossover analysis (but not in the entire cohort) we observed positive associations between exposure to all size fractions of PM exposure and risk of SAB. This may suggest that changes in PM exposure confer greater risk of SAB or that women with a history of SAB are a particularly vulnerable subgroup. STUDY FUNDING/COMPETING INTEREST(S): The authors are supported by the following NIH grants UM1CA176726, R00ES026648 and P30ES000002. The authors have no actual or potential competing financial interests to disclose.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a203dee00f6b6909f5629c4dd2af6982",
  "timestamp": "2025-05-15T03:14:37.291732"
}