{
  "id": 6208,
  "title": "The Impact of Individual Mandate and Income on Private Health Insurance Enrollment: A State-Level Analysis on Individual Behavior Change",
  "abstract": "Introduction: Health insurance, vital for improved health outcomes and reduced financial burdens, faced challenges within the market system due to adverse selection and the risk of a death spiral. This led to the Affordable Care Act (ACA) introducing the Individual Mandate in 2014. After the penalty under the Individual Mandate had been repealed, several states have kept regulative measures to encourage individuals to keep health insurance. Methods: This study analyzed the impact of individual mandates in four states and D.C. on private health insurance enrollment using pooled cross-sectional data from the Integrated Public Use Microdata Series (IPUMS) USA. The dataset included 4,524,753 nonelderly individuals (ages 19 to 64) from 2019 to 2021. A logistic regression model was employed to estimate the likelihood of having private health insurance, with the individual mandate as a state-level binary variable and income as a continuous predictor. Interaction effects between income and the mandate were examined. To further interpret the results, marginal effects were calculated to quantify the impact of the individual mandate and income on the probability of private health insurance enrollment. Results: The study revealed a positive association between the individual mandate regulation and increased private health insurance enrollment. Additionally, income exhibited a positive influence on enrollment in private health insurance coverage. Notably, when considering the moderating effect of income, the mandate had a more pronounced impact on lower-income individuals, resulting in a 0.885% decrease in the probability of having private health insurance for every 10k increase in individual income. Conclusion: The findings highlight that individuals in the mandated states are more likely to have private health insurance, addressing adverse selection issues and stabilizing the health insurance market. However, the mandate disproportionately affects lower-income individuals, suggesting the need for additional financial assistance to sustain enrollment. Policymakers should consider complementary support programs, such as subsidies and cost-sharing reductions, to mitigate financial burdens and ensure broader coverage. Maintaining an individual mandate alongside targeted financial policies can contribute to a more equitable and sustainable healthcare system.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a21a781429e4e5127caf801153e8823a",
  "timestamp": "2025-05-15T02:55:44.665828"
}