{
  "id": 8644,
  "title": "The association between poverty and longitudinal patterns of adverse childhood experiences across childhood and adolescence: Findings from a prospective population-based cohort study in the UK",
  "abstract": "Background: Adverse childhood experiences (ACEs) affect up to half the general population, they are known to co-occur, and are particularly common among those experiencing poverty. Yet, there are limited studies examining specific patterns of ACE co-occurrence considering their developmental timing. Objective: To examine the longitudinal co-occurrence patterns of ACEs across childhood and adolescence, and to examine the role of poverty in predicting these. Participants and setting: The sample was 8859 children from the Avon Longitudinal Study of Parents and Children, a longitudinal prospective population-based UK birth cohort. Methods: Repeated measures of ten ACEs were available, occurring in early childhood (birth-5 years), mid-childhood (6-10 years), and adolescence (11-16 years). Latent class analysis was used to identify groups of children with similar developmental patterns of ACEs. Multinomial regression was used to examine the association between poverty during pregnancy and ACE classes. Results: Sixteen percent of parents experienced poverty. A five-class latent model was selected: Low ACEs (72.0 %), Early and mid-childhood household disharmony (10.6 %), Persistent parental mental health problems (9.7 %), Early childhood abuse and parental mental health problems (5.0 %), and Mid-childhood and adolescence ACEs (2.6 %). Poverty was associated with a higher likelihood of being in each of the ACE classes compared to the low ACEs reference class. The largest effect size was seen for the Early and mid-childhood household disharmony class (OR 4.70, 95 % CI 3.68-6.00). Conclusions: A multifactorial approach to preventing ACEs is needed - including support for parents facing financial and material hardship, at-risk families, and timely interventions for those experiencing ACEs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a21b80a0d0ad4350430916ee83f31531",
  "timestamp": "2025-05-15T03:20:55.974152"
}