{
  "id": 8907,
  "title": "The improved and the unimproved: Factors influencing sanitation and diarrhoea in a peri-urban settlement of Lusaka, Zambia",
  "abstract": "Accounting for peri-urban sanitation poses a unique challenge due to its high density, unplanned stature, with limited space and funding for conventional sanitation instalment. To better understand users, needs and inform peri-urban sanitation policy, our study used multivariate stepwise logistic regression to assess the factors associated with use of improved (toilet) and unimproved (chamber) sanitation facilities among peri-urban residents. We analysed data from 205 household heads in 1 peri-urban settlement of Lusaka, Zambia on socio-demographics (economic status, education level, marital status, etc.), household sanitation characteristics (toilet facility, ownership and management) and household diarrhoea prevalence. Household water, sanitation and hygiene (WASH) facilities were assessed based on WHO-UNICEF criteria. Of particular interest was the simultaneous use of toilet facilities and chambers, an alternative form of unimproved sanitation with focus towards all-in-one suitable alternatives. Findings revealed that having a regular income, private toilet facility, improved drinking water and handwashing facility were all positively correlated to having an improved toilet facility. Interestingly, both improved toilets and chambers indicated increased odds for diarrhoea prevalence. Odds of chamber usage were also higher for females and users of unimproved toilet facilities. Moreover, when toilets were owned by residents, and hygiene was managed externally, use of chambers was more likely. Findings finally revealed higher diarrhoea prevalence for toilets with more users. Results highlight the need for a holistic, simultaneous approach to WASH for overall success in sanitation. To better access and increase peri-urban sanitation, this study recommends a separate sanitation ladder for high density areas which considers improved private and shared facilities, toilet management and all-inclusive usage (cancelling unimproved alternatives). It further calls for financial plans supporting urban poor access to basic sanitation and increased education on toilet facility models, hygiene, management and risk to help with choice and proper facility use to maximize toilet use benefit.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a21d627c6c20a77ba5d209e74a3c8f1f",
  "timestamp": "2025-05-15T03:23:27.885377"
}