{
  "id": 8203,
  "title": "Determining the acceptance of e-mental health interventions in elite athletes using the unified theory of acceptance and use of technology",
  "abstract": "Background Elite athletes are exposed to many different sport-specific stressors that may put them at particular risk for mental health symptoms and disorders. E-mental health interventions could be a feasible option to support elite athletes in need. The aim of the present study was to assess the acceptance of e-mental health interventions among elite athletes and explore its underlying drivers and barriers.Materials and methods A cross-sectional study was conducted with N = 382 elite athletes. Of these, N = 275 (71.99%, 167 females) were included in the statistical analyses. The impact of various sociodemographic, sport-related and medical characteristics on acceptance was assessed. EHealth-related data and acceptance of e-mental health interventions were examined using a modified assessment based on the Unified Theory of Acceptance and Use of Technology (UTAUT).Results Overall, the acceptance of e-mental health interventions in elite athletes can be classified as high (M = 3.69 SD = 0.97). In the UTAUT regression model sex, financial situation, depression symptoms, digital confidence, digital overload as well as the UTAUT predictors performance expectancy, effort expectancy, and social influence predicted acceptance significantly.Conclusions The UTAUT model has proven to be a valuable instrument in predicting of acceptance of e-mental health interventions in elite athletes. Given the strong association between acceptance and future use, new interventions should focus on the explored factors to establish effective e-mental health interventions for elite athletes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a227090887dd69266dacf2988cb47a23",
  "timestamp": "2025-05-15T03:16:17.449607"
}