{
  "id": 4411,
  "title": "Auditors and early signals of financial distress in local governments",
  "abstract": "Purpose - This study aims to analyze whether and how a set of financial ratios calculated on the basis of financial statement information would allow auditors of Italian local governments (LGs) to get an indication of LGs ' financial distress risk and, hence, to support politicians and managers in promptly detecting financial distress. Design/methodology/approach - A model comprising a set of financial indicators that would distinguish distressed from not distressed LGs through a logistic regression approach has been estimated and applied to Italian LGs. The model is built on the basis of information pertaining to 44 distressed and 53 not distressed LGs for up to five years prior to bankruptcy and covers the period 2003-2012. Findings - The model reveals that the percentage of personnel expenses over revenues, the turnover ratio of short-term liabilities over current revenues and the reliance on subsidies (calculated as subsidies per capita) are factors discriminating non-distressed LGs from the distressed ones. Practical implications - The model could have political and practical implications. The possible use of this model as a complementary tool in auditing activities might be helpful for auditors in detecting financial distress promptly, thus potentially enabling politicians and managers to search for different ways to manage public resources to avoid the detrimental consequences related to the declaration of distress. Originality/value - This model, contrary to existing models that use accrual accounting data, is applicable to LGs that adopt a modified cash accounting basis.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a23634ef9053065215727589264b76d6",
  "timestamp": "2025-05-15T02:36:38.575632"
}