{
  "id": 9065,
  "title": "Associations of state-level and county-level hate crimes with individual-level cardiovascular risk factors in a prospective cohort study of middle-aged Americans: the National Longitudinal Survey of Youths 1979",
  "abstract": "Background There have been long-standing debates about the potential health consequences of hate crimes over and above other types of crimes. Besides the direct consequences for victims, less is known about whether hate crimes have spillover effects onto the health of local residents. Methods We drew data on cardiovascular disease risk factors from middle-aged Americans in the National Longitudinal Survey of Youths 1979 and on hate crimes from the FBI's Uniform Crime Reports. Employing multivariable logistic regression, we estimated the associations between changes in state/county-level all and group-specific hate crime rates from 2000 to 2006 and incident individual-level diabetes, hypertension, obesity and depressive symptoms from 2008 to 2016. All models controlled for individual-level sociodemographic factors and financial strain, county-level and state-level changes in the total crime rate, the percentage of non-Hispanic Black and Hispanic/Latino residents, and median household income, as well as state-level changes in the percentage of residents aged 65 years or older and the unemployment rate. Results 1-SD increases in state-level all and race/ethnicity-based hate crime rates were associated with 20% (OR 1.20, 95% CI 1.05 to 1.35) and 15% higher odds (OR 1.15, 95% CI 1.01 to 1.31) of incident diabetes, respectively. At the county level, a 1-SD increase in the all hate crime rate was linked to 8% higher odds (OR 1.08, 95% CI 1.00 to 1.16) of obesity, while a 1-SD increase in the race/ethnicity-based hate crime rate was associated with 8% higher odds (OR 1.08, 95% CI 1.01 to 1.15) of obesity and 9% higher odds (OR 1.09, 95% CI 1.02 to 1.17) of hypertension. We found no significant associations for depressive symptoms, and no interactions between race/ethnicity-based hate crime rates and individual-level race/ethnicity. Conclusion Living in areas with higher hate crime rates may confer higher odds of hypertension, diabetes and obesity.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a2380f1320a9d740cc83a1c41961fa52",
  "timestamp": "2025-05-15T03:25:27.627693"
}