{
  "id": 3290,
  "title": "Enterprise Financial Data Sharing Based on Information Fusion Cloud Computing Environment",
  "abstract": "At present, many companies have many problems such as high financial costs, low financial management capabilities, and redundant frameworks; at the same time, the SASAC requires that the enterprise's financial strategy transfer from profit-driven to value-driven, finance separate from accounting to improve the operational efficiency of the company. Under this background, more and more enterprise respond to the call of the SASAC; in order to achieve the goals of corporate financial cost savings and financial management efficiency improved, we began to provide services through financial sharing. The research of information fusion theory involves many basic theories, which can be roughly divided into two large categories from the algorithmic point of view: probabilistic statistical method and artificial intelligence method. The main task of artificial intelligence is to realize the computer for some learning, thinking process, and wisdom formation of simulation, and an important goal of information integration is the human brain comprehensive processing ability simulation, so artificial intelligence method will have broad application prospects in the field of information fusion; the common methods have D-S evidence reasoning, fuzzy theory, neural network, genetic algorithm, rough set, and other information fusion methods. The purpose of this paper is to proceed from the internal financial situation of the enterprise, analyze data security issues in the operation of financial shared services, and find a breakthrough in solving problems. But, with constantly expanding of enterprise group financial sharing service scale, the urgent problem to be solved is how to ensure the financial sharing services provided by enterprises in the cloud computing environment. This paper combines financial sharing service theory and information security theory and provides reference for building financial sharing information security for similar enterprises. For some enterprise that have not established a financial shared service center yet, they can learn from the establishment of the financial sharing information security system in this paper and provide a reference for enterprise to avoid the same types of risks and problems. For enterprise that has established and has begun to practice a financial shared information security system, appropriate risk aversion measures combined with actual situation of the enterprise with four dimensions related to information security system optimization was formulated and described in this paper. In summary, in the background of cloud computing, financial sharing services have highly simplified operational applications, and data storage capabilities and computational analysis capabilities have been improved greatly. Not only can it improve the quality of accounting information but also provide technical support for the financial sharing service center of the enterprise group, perform financial functions better, and enhance decision support and strategic driving force, with dual practical significance and theoretical significance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a23808fd27d54c65d195536afc1ca467",
  "timestamp": "2025-05-15T02:24:39.692987"
}