{
  "id": 9052,
  "title": "Garnering effective telehealth to help optimize multidisciplinary team engagement (GET2HOME) for children with medical complexity: Protocol for a pragmatic randomized control trial",
  "abstract": "BackgroundChildren and young adults with medical complexity (CMC) experience high rates of healthcare reutilization following hospital discharge. Prior studies have identified common hospital-to-home transition failures that may increase the risk for reutilization, including medication, technology and equipment issues, financial concerns, and confusion about which providers can help with posthospitalization needs. Few interventions have been developed and evaluated for CMC during this transition period. ObjectiveWe will compare the effectiveness of the garnering effective telehealth 2 help optimize multidisciplinary team engagement (GET2HOME) transition bundle intervention to the standard hospital-based care coordination discharge process by assessing healthcare reutilization and patient- and family-centered outcomes. Designs, Settings, and ParticipantsWe will conduct a pragmatic 2-arm randomized controlled trial (RCT) comparing the GET2HOME bundle intervention to the standard hospital-based care discharge process on CMC hospitalized and discharged from hospital medicine at two sites of our pediatric medical center between November 2022 and February 2025. CMC of any age will be identified as having complex chronic disease using the Pediatric Medical Complexity Algorithm tool. We will exclude CMC who live independently, live in skilled nursing facilities, are in custody of the county, or are hospitalized for suicidal ideation or end-of-life care. InterventionWe will randomize participants to the bundle intervention or standard hospital-based care coordination discharge process. The bundle intervention includes (1) predischarge telehealth huddle with inpatient providers, outpatient providers, patients, and their families; (2) care management discharge task tracker; and (3) postdischarge telehealth huddle with similar participants within 7 days of discharge. As part of the pragmatic design, families will choose if they want to complete the postdischarge huddle. The standard hospital-based discharge process includes a pharmacist, social worker, and care management support when consulted by the inpatient team but does not include huddles between providers and families. Main Outcome and MeasuresPrimary outcome will be 30-day urgent healthcare reutilization (unplanned readmission, emergency department, and urgent care visits). Secondary outcomes include 7-day urgent healthcare reutilization, patient- and family-reported transition quality, quality of life, and time to return to baseline using electronic health record and surveys at 7, 30, 60, and 90 days following discharge. We will also evaluate heterogeneity of treatment effect for the intervention across levels of financial strain and for CMC with high-intensity neurologic impairment. The primary analysis will follow the intention-to-treat principle with logistic regression used to study reutilization outcomes and generalized linear mixed modeling to study repeated measures of patient- and family-reported outcomes over time. ResultsThis pragmatic RCT is designed to evaluate the effectiveness of enhanced discharge transition support, including telehealth huddles and a care management discharge tool, for CMC and their families. Enrollment began in November 2022 and is projected to complete in February 2025. Primary analysis completion is anticipated in July 2025 with reporting of results following.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a24b69fd963a4dd63a11ea6ead4c97de",
  "timestamp": "2025-05-15T03:24:54.975310"
}