{
  "id": 9226,
  "title": "Prevalence and associated factors of breast cancer screening among nuns in the Catholic Archdiocese of Nairobi",
  "abstract": "Introduction: breast cancer is a significant global challenge. The risk of breast cancer among nuns is high mainly due to the basis of nulliparity. Among the effective approaches to addressing breast cancer is early screening. However, there are concerns over the uptake of screening across all populations, including nuns. The objective of the study is to determine the prevalence and the associated factors of breast cancer screening among nuns in the Catholic Archdiocese of Nairobi. Methods: this research used the analytical cross-sectional design. A total of 384 nuns in the Catholic Archdiocese of Nairobi were recruited using astratified sampling. Structured questionnaires were used to collect data. Chi-square and binary logistic regression were used to determine association between social-demographic factors and breast cancer screening. Statistical package for social sciences (SPSS version 26) was used for analysis. The level of significance was investigated at p<0.05. Results: our findings revealed that the prevalence of breast cancer screening among nuns was 30.7%. The findings established that those who had knowledge on breast cancer screening (AOR=25.52, 95%CI: 8.87 -73.45, p<0.001) and those who had congregational financial support (AOR=1.97, 95%CI: 1.68 -5.74, p=0.021) were more likely to undergo breast cancer screening. Those who had hospital check-up for in more than six months prior to the study (AOR=0.001, 95%CI: 0.000 -0.008, p<0.001) and those who never had a hospital check-up, (AOR=0.001, 95%CI: 0.000 -0.006, p<0.001) were less likely to undergo breast cancer screening. Conclusion: the findings have shown low uptake of breast cancer screening amongst nuns in the Catholic Archdiocese in Nairobi. Knowledge on breast cancer screening access to congregational support and hospital check-up have been identified as key factors associated with breast cancer screening. Therefore, there is a need to create adequate awareness be created and the Catholic reverend sisters educated through aggressive education campaign programs so as to eliminate misconceptions relating to the topic. Also, to integrate free access to screening services in the government health institutions for nuns.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a24c979f5fb61a7ad810009eab36d11a",
  "timestamp": "2025-05-15T03:26:54.518702"
}