{
  "id": 132,
  "title": "Learning and processing framework using Fuzzy Deep Neural Network for trading and portfolio rebalancing",
  "abstract": "Trading strategies are an interesting topic of financial research. Moving Average Convergence Divergence (MACD) indicator is susceptible to performing worse than expected in unstable financial markets. This paper first presents a data-driven Interpretable Fuzzy Deep Neural Network (IFDNN) that provides insight into neural network inferences using fuzzy logic. Fuzzy rules are induced from the inference process of Neural Networks. Next, a learning and processing framework is proposed using IFDNN to detect trend reversals by forecasting look-ahead prices. IFDNN not only learns the drifts and shifts in market patterns, but also provides traders an option to dive into the reasoning behind why Neural Networks predict certain values. Genetic Algorithms are used to optimise trading parameters of the proposed framework. The proposed framework can perform portfolio rebalancing. The effectiveness of the framework is evaluated on three financial market indexes. The whipsaw effects cause frequent entrances and exits from the market. In this paper, a custom percentage oscillator is implemented to avoid this issue. The performances of the proposed framework using f-MACD are compared with those of the vanilla MACD. Two types of Reinforcement Learning models, Advantage Actor Critic and Deep Deterministic Policy Gradient are incorporated into the proposed framework with results compared.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a264aad0f890eb567d1696bbfd883317",
  "timestamp": "2025-05-15T00:39:32.654641"
}