{
  "id": 9107,
  "title": "Determining factors of key audit matter disclosure in Thailand",
  "abstract": "Purpose In Southeast Asia, auditors play a crucial role in the quality of financial reports. With the introduction of a new format of auditors' report that requires disclosure of key audit matters (KAM), the disclosure practice of auditors is, thus, of great interest. Specifically, this study aims to investigate the factors that auditors take into consideration when issuing KAMs. Design/methodology/approach The research design is quantitative, with a focus on the number of KAM disclosures issued by auditors. As existing studies rely on the number of KAM disclosures in the analysis, this current research, thus, uses the quantity of KAM disclosures for comparison purposes. The analysis relies on secondary data and multiple regression analysis is used to establish the association between the number of KAM disclosures and three groups of determining factors, namely, auditor characteristics, corporate governance mechanisms and firm characteristics. Findings The significant determining factors of KAM disclosure include auditor's litigation risk, firm complexity, profitability and industry type. Firms using a Big 4 audit firm, firms with many subsidiaries and firms in the technology, property and construction and finance industries have higher numbers of KAMs, while highly profitable firms issue lower numbers of KAMs. As for corporate governance mechanisms, the number of KAMs is significantly positively correlated with the number of independent directors (p < 0.10). Originality/value This research includes key corporate governance parties in the examination, including external auditors, independent directors and audit committees. The finding affirms the influence of Big 4 on KAM disclosure in Southeast Asia, while their roles are not significant in Western samples. The result also unearths the monitoring role of independent directors in KAM disclosure. The role of the audit committee in KAM disclosure is insignificant in Thai samples, while the committee role is statistically significant in the Western samples. Variations in the findings between this study and previous research could be attributed to differences in institutional settings between both regions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a265e3372e433010219cb3baecf60a6f",
  "timestamp": "2025-05-15T03:25:27.797355"
}