{
  "id": 7758,
  "title": "Factors Associated With Missed Appointments at an Academic Pain Treatment Center: A Prospective Year-Long Longitudinal Study",
  "abstract": "BACKGROUND: Interventional pain treatment centers represent an integral part of interdisciplinary care. Barriers to effective treatment include access to care and financial issues related to pain clinic operations. To address these challenges, specialty clinics have taken steps to identify and remedy missed clinic appointments. However, no prospective study has sought to identify factors associated with pain clinic no-shows. METHODS: We performed a prospective, longitudinal year-long study in an inner-city, academic pain clinic in which patients scheduled for office visits and procedures were categorized as to whether they showed up or did not show up for their scheduled appointment without cancelling the day before. Twenty demographic (age, employment status), clinical (eg, diagnosis, duration of pain), and environmental (season, time and day of appointment) variables were assessed for their association with missing an appointment. The logistic regression model predicting no-shows was internally validated with crossvalidation and bootstrapping methods. A predictive nomogram was developed to display effect size of predictors for no-shows. RESULTS: No-show data were collected on 5134 patients out of 5209 total appointments for a capture rate of 98.6%. The overall no-show rate was 24.6% and was higher in individuals who were young (<65 years), single, of ethnic minority background, received Medicare/Medicaid, had a primary diagnosis of low back pain or headaches, were seen on a day with rain or snow or for an initial consult, and had at least 1 previous pain provider. Model discrimination (area under curve) was 0.738 (99% confidence interval, 0.70-0.85). A minimum threshold of 350 points on the nomogram predicted greater than 55% risk of no-shows. CONCLUSIONS: We found a high no-show rate, which was associated with predictable and unpredictable (eg, snow) factors. Steps to reduce the no-show rate are discussed. To maximize access to care, operation managers should consider a regression model that accounts for patient-level risk of predictable no-shows. Knowing the patient level, no-show rate can potentially help to optimize the schedule programming by staggering low-versus high-probability no-shows.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a2698a8aa0f5d2196e5fb541cd4909e6",
  "timestamp": "2025-05-15T03:11:38.588168"
}