{
  "id": 7517,
  "title": "Educational outcomes for homeless young adults with and without a history in foster care",
  "abstract": "Homeless young adults (HYA) with and without a history in foster care in the United States experience lower high school graduation rates than young adults in the general population. Few studies examine the risk and resilience factors that promote positive educational outcomes for these subpopulations. This study explores the factors that are associated with positive educational outcomes for HYA with and without a foster care history. This study uses data from a 3-city cross-sectional study of HYA, which included quantitative interviews of HYA between the ages of 18 and 24 (N = 601) in Austin, TX (n = 200), Los Angeles, CA (n = 200), and Denver, CO (n = 201). Positive educational outcomes consisted of HYAs being currently enrolled in or previously attaining a degree from a secondary, postsecondary or technical education program. This study uses two logistic regression models to identify the risk and resilience factors associated with positive educational outcomes for HYA with and without a history in foster care. For HYA with a history in foster care, city was a significant predictor of positive educational outcomes as well as being an older age, formal employment, not having an arrest record, having a lower score of emotional neglect, and having a higher score of physical abuse. For HYA without a history in foster care, significant predictors included not having an arrest record and having a higher score of emotional abuse. Findings highlight the need for an expansion of federal and state postsecondary education financial aid programs for HYA with and without a history in foster care.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a274cfa6083908b74918c4bd9af83f1b",
  "timestamp": "2025-05-15T03:09:36.816330"
}