{
  "id": 9277,
  "title": "Drusen Ultrastructure Imaging with Spectral Domain Optical Coherence Tomography in Age-related Macular Degeneration",
  "abstract": "Purpose: To categorize drusen ultrastructure in age-related macular degeneration (AMD) using spectral domain optical coherence tomography (SDOCT) and correlate the tomographic and photographic drusen appearances. Design: Prospective case series. Participants: Thirty-one eyes of 31 patients with non-neovascular AMD. Methods: Subjects with drusen and a clinical diagnosis of AMD were enrolled in an SDOCT imaging study from August of 2005 to May of 2007. Foveal linear scans were acquired, and the image data were processed for analysis. Drusen were scored by 4 morphologic categories: shape, predominant internal reflectivity, homogeneity, and presence of overlying hyper-reflective foci. The prevalences of each morphologic pattern and combinations of morphologic patterns observed were calculated. The photographic appearance of each druse was compared with the tomographic classification. Interobserver and intraobserver agreement analysis was performed. Main Outcome Measures: Prevalence of morphologic parameters using SDOCT. Results: Twenty-one eyes of 21 patients had SDOCT B-scans of adequate quality for analysis. On the basis of the above morphologic categories, 17 different drusen patterns were found in 120 total drusen. The most common was convex, homogeneous, with medium internal reflectivity, and without overlying hyper-reflective foci, present in 17 of 21 eyes (81%). Of the 16 eyes (76%) with nonhomogeneous drusen, 5 had a distinct hyper-reflective core. Hyper-reflective foci overlying drusen were in 7 eyes (33%). Although half of the photographically soft-indistinct drusen were convex with medium internal reflectivity and homogeneous without overlying hyper-reflective foci, the other half had significant variability in their tomographic appearance. Both interobserver and intraobserver agreement in drusen grading were high. Readers agreed the most when grading drusen shape and reflectivity, whereas the least agreement was for drusen homogeneity. Conclusions: Drusen ultrastructure can be imaged with SDOCT and characterized with a simple grading system. Photographic appearance may predict some but not all tomographic appearances. Trained observers have a high level of agreement with this grading system. These in vivo morphologic characteristics imaged with SDOCT may be distinct subclasses of drusen types, may relate closely to ultrastructural drusen elements identified in cadaveric eyes, and may be useful imaging biomarkers for disease severity or risk of progression. This will require validation from further studies. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2008; 115:1883-1890 (C) 2008 by the American Academy of Ophthalmology.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a27485b5a1098817ab7ccc38bd26f675",
  "timestamp": "2025-05-15T03:27:24.957306"
}