{
  "id": 8236,
  "title": "Income Elasticity of Out-of-Pocket Healthcare Expenditure for Different Provider Types in Bangladesh",
  "abstract": "The impact of income on health expenditure has been studied extensively using national-level data; however, studies estimating the household-level income elasticity of health expenditure, particularly by provider types, remain limited. Analysing nationally representative household survey data, we examine outpatient and inpatient out-of-pocket (OOP) expenses across healthcare providers and by various income levels. We employed the Heckman two-step model and OLS regression to estimate income elasticity separately for outpatient and inpatient services. Our findings indicate that income elasticity varies significantly by service type, provider, and income level. Outpatient care at private facilities is a luxury good for the lower-income households, while outpatient expenses for public and informal outpatient care providers remain inelastic across income levels. Private inpatient care is also income inelastic, whereas public inpatient care shows non-uniform elasticity. Overall, lower-income households showed greater elasticity than wealthier ones. The results imply, during income shocks, poorer households switch to cheaper public and informal care. Inpatient care is prioritised over other expenses, increasing the risk of poverty among low-income households. The study suggests the dire need for financial protection measures, particularly for low-income groups, as OOP health expenditure often becomes catastrophic for those households. In addition, higher income resulting from economic growth will increase the demand for private outpatient services, suggesting quality improvement for public health facilities as well as the importance of adapting healthcare policies to evolving income dynamics.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a283a5d98b250b0022ae1e4bfd7f0bef",
  "timestamp": "2025-05-15T03:16:48.947285"
}