{
  "id": 4051,
  "title": "Effect of IFRS on foreign shareholdings and corporate investments in Saudi Arabia",
  "abstract": "PurposePrior research has shown that implementing International Financial Reporting Standards (IFRS) increases foreign direct investments at the macroeconomic (country) level. This study aims to demonstrate that the implementation of mandatory adoption of IFRS positively influences foreign shareholdings at the company level in Saudi Arabia.Design/methodology/approachThe fixed effects regression model is used to estimate the impact of the adoption of IFRS on foreign ownership in a panel data set for Saudi Arabia over the period 2010 through 2021.FindingsThis study finds that IFRS adoption reduces information asymmetry and increases comparability, which attracts foreign investors. It also finds that firms with high foreign ownership have greater capital expenditures post-IFRS adoption, suggesting that foreign investors encourage firms to align their interests with those of shareholders and make more long-term investments. This paper demonstrates that firms increased their long-term investments and garnered greater free cash flows after adopting IFRS. Finally, this paper observes a positive association between IFRS employment and market liquidity.Originality/valueTo the best of the authors' knowledge, this is the first research to reveal that, following the compulsory adoption of IFRS, foreign shareholdings have a favorable effect on corporate investments (capital expenditures and property, plant and equipment) at the micro (firm) level. It has been motivated by the assertion that a lack of portfolio investments results primarily from an asymmetry of information, which can be mitigated by providing high quality comparable financial information based on IFRS.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a291461446dd6d8a09e6bdd380ff4357",
  "timestamp": "2025-05-15T01:23:27.290404"
}