{
  "id": 2119,
  "title": "Economic state classification and portfolio optimisation with application to stagflationary environments",
  "abstract": "Motivated by the current fears of a potentially stagflationary global economic environment, this paper uses new and recently introduced mathematical techniques to study multivariate time series pertaining to country inflation (CPI), economic growth (GDP) and equity index behaviours. We begin by assessing the temporal evolution among various economic phenomena, and complement this analysis with 'economic driver analysis,' where we decouple country economic trajectories and determine what is most important in their association. Next, we study the temporal self-similarity of global inflation, growth and equity index returns to identify the most anomalous historic periods, and windows in the past that are most similar to current market dynamics. We then introduce a new algorithm to construct economic state classifications and compute an economic state integral, where countries are determined to belong in one of four candidate states based on their inflation and growth behaviours. Finally, we implement a decade-by-decade portfolio optimisation to determine which equity indices and portfolio assets have been most beneficial in maximising portfolio risk-adjusted returns in various market conditions. This could be of great interest to those looking for asset allocation guidance in the current period of high economic uncertainty.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a2930bb3c4d0466da045ad2cfe5aefb8",
  "timestamp": "2025-05-15T01:03:03.761166"
}