{
  "id": 188,
  "title": "The drivers of systemic risk in financial networks: a data-driven machine learning analysis",
  "abstract": "The purpose of this paper is to assess the role of financial variables and network topology as determinants of systemic risk (SR). The SR, for different levels of the initial shock, is computed for institutions in the Brazilian interbank market by applying the differential DebtRank methodology. The financial institution(FI)-specific determinants of SR are evaluated through two machine learning techniques: XGBoost and random forest. Shapley values analysis provided a better interpretability for our results. Furthermore, we performed this analysis separately for banks and credit unions. We have found the importance of a given feature in driving SR varies with i) the level of the initial shock, ii) the type of FI, and iii) the dimension of the risk which is being assessed - i.e., potential loss caused by (systemic impact) or imputed to (systemic vulnerability) the FI. Systemic impact is mainly driven by topological features for both types of FIs. However, while the importance of topological features to the prediction of systemic impact of banks increases with the level of the initial shock, it decreases for credit unions. Concerning systemic vulnerability, this is mainly determined by financial features, whose importance increases with the initial shock level for both types of FIs. (c) 2021 Elsevier Ltd. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a298d4029969a59d7102596502cb3792",
  "timestamp": "2025-05-15T01:47:53.011128"
}