{
  "id": 1023,
  "title": "Volatility Forecasting Using Support Vector Regression and a Hybrid Genetic Algorithm",
  "abstract": "Volatility forecasting is an important process required to measure variability in equity prices, risk management, and several other financial activities. Generalized autoregressive conditional heteroscedastic methods have been used to forecast volatility with reasonable success due unreal assumptions about volatility underlying process. Recently, a supervised learning machine called support vector regression has been employed to forecast financial volatility. Nevertheless, the quality and stability of the model obtained through training process depend strongly on the selection of parameters. Typically, these are tuned by a grid search method ; however, this tuning procedure is prone to get trapped on local optima, requires a priori information, and it does not concurrently tune the kernels and its parameters. This paper presents a new method called for the financial volatility forecasting problem which selects simultaneously the proper kernel and its parameter values. is a hybrid genetic algorithm which uses several genetic operators to enhance the exploration of solutions space: it introduces a new genetic operator called Boltzmann selection, and the use of several random number generators. Experimental data correspond to two ASEAN and two latinoamerican market indexes. results are compared against method. It uses the mean absolute percentage error and directional accuracy functions for measuring quality results. Experimentation shows that, in general, overcomes quality of SV R-GS.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a29be5ae289788c1a348f8ecb0dab977",
  "timestamp": "2025-05-15T01:58:08.448023"
}