{
  "id": 4101,
  "title": "Impact of government policy responses of COVID-19 pandemic on stock market liquidity for Australian companies",
  "abstract": "This study investigates the impact of government policy responses of COVID-19 pandemic on stock market liquidity for listed Australian companies and for 11 different industries separately. A quantitative deductive approach is used for a sample of 1,452 companies with a total of 292,164 firm-day observations over a period from January 25, 2020 to December 31, 2020 during the outbreak of COVID-19. Univariate and multivariate (two-way cluster-robust panel regression) analysis were conducted. Data were collected from the Oxford COVID-19 Government Response Tracker, Worldmeter, Refinitiv Workspace and Datastream. Our findings indicate that the influences of the six out of seven stringency policy responses reduced Australian equity market liquidity. However, public information campaigns enhanced market liquidity and hence trading activity. Among the 11 industries, our analysis shows that the non-pharmaceutical interventions by the Australian government have significant and positive effects on four industries: Consumer non-cyclicals, healthcare, financial and technology. However, the worse effects were depicted in the industrial (transportation) and energy industries. This study is important for investors, policymakers and regulators to understand the diverse effects of government policy responses of COVID-19 on stock market liquidity to enhance financial stability. Moreover, understanding this effect is particularly important to decision-makers such as portfolio and fund managers to manage their portfolios and trading activities during extreme turbulence times, such as COVID-19. Unlike previous studies that focus on country analysis, this study examines on firm basis the impact of government interventions on stock market liquidity in a well developed Australian stock market.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a29b02877ea031c29870d6c87d42cf85",
  "timestamp": "2025-05-15T01:23:58.028685"
}