{
  "id": 8432,
  "title": "DETERMINANTS OF NON-PERFORMING LOANS IN WESTERN EUROPEAN COUNTRIES",
  "abstract": "The paper highlights the necessity for identifying and analysing the determinants of the non-performing bank loans in the context of the existence of strong interdependencies between the banking systems' functioning and the performance of the economy, since the accumulation of such loans can lead to malfunctions on macroeconomic level. Thus, there are identified several determinants of NPLs, both internal, such bank size, capital adequacy, cost efficiency and bank risk taking behaviour, but also external, such GDP growth, inflation and unemployment and there is considered also the impact of the financial and economic crisis. The analysis is developed by processing the data of 13 Western European countries for the period 2000-2011, using econometric methods. Empirical results showed expected significant positive linkages of NPLs ratio with determinants like bank size, cost efficiency, unemployment and crisis, but also significant negative linkages NPLs ratio with GDP growth and capital adequacy. Deepening the analysis by building an testing a regression model for NPLs ratio determination it resulted that the main determinants of NPLs ratio rising are unemployment, crisis, bank size and cost efficiency management, while the GDP growth, capital adequacy and bank credit to private sector as percentage to GDP are acting against the formation of NPLs. The results leaded to the conclusion that banks need to improve their cost efficiency management and invest in departments for following and recovering the granted loans. Also, the governments should focus on encouraging employment as base for improving the borrowers' repayment capacity and of generating GDP growth.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a29f41a3b12fa597e2e28b95b0c82511",
  "timestamp": "2025-05-15T03:18:51.587272"
}