{
  "id": 2702,
  "title": "The role of cognitive and demographic profile of future managers on product elimination decisions",
  "abstract": "Purpose The purpose of this research is to determine how managers' decisions to discontinue products may be affected by their cognitive and demographic characteristics. Research in product management and entrepreneurship has primarily focused on the introduction of innovations and the marketing of emerging and existing products in the marketplace. Considerably less research has focused on product elimination and how marketing managers decide to remove poorly performing products from a given product portfolio. Nevertheless, product elimination decisions are critical to maintaining business health and protecting firm profits, and are a commonly encountered decision for entrepreneurs and managers of existing products. This study empirically explores the role of factors that may affect a manager's decisiveness in eliminating poorly performing products from a product portfolio. Design/methodology/approach Using a simulated business environment, this study empirically explores the role of factors that may affect a manager's decisiveness in eliminating poorly performing products from a product portfolio. Product portfolio decisions are presented to a sample of emerging managers using a computer simulation, and the impact of manager characteristics, namely, cognitive style, gender, academic profile and entrepreneurial intentions on product elimination decisiveness is examined using regression analysis. Findings The findings indicate dominant effects for cognitive style and academic profile in driving the decisiveness of product elimination decisions. Research limitations/implications The findings highlight the importance of the academic profile and cognitive style of those entrusted with managing product portfolios, especially as is related to product elimination decisions. Practical implications The findings imply a need for determining the optimal fit of candidates for product portfolio management roles, based on factors such as cognitive style, academic performance and academic area of specialization. Social implications Given the role of entrepreneurial enterprises in enabling social equity, this research highlights the need for entrepreneurial education focusing not only on product introduction but also product omission. Originality/value This research expands prior research findings on innovation, promotion and elimination of products by asking what happens at the end of a product's life when the prospects for a product are no longer strong. The research shows that some managers are less decisive and therefore may be challenged when handling product portfolios with sub-performing products. The findings indicate cognitive and academic influences on product elimination indecisiveness and open new avenues for further examining similar influences in managerial decision-making. This line of work therefore encourages inquiry into the drivers of the important decision of product elimination.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a2b3c01dcbbc63be89e4ac649c80922e",
  "timestamp": "2025-05-15T01:09:43.323519"
}