{
  "id": 7076,
  "title": "Predictors of gamete donation: a cross sectional survey study",
  "abstract": "Purpose In 2015, assisted reproductive technology (ART) accounted for 1.7% of all U.S. births, donor eggs accounted for over 17,000 started cycles in 2015, and donor sperm accounting for 6.2% of all cycles started in 2014. With increasing utilization of donor gametes as a method of assisting patients with infertility, the number of babies born each year utilizing gamete donation will also continue to increase. This study aimed to elucidate factors impacting decision to donate, amongst a representative national population. Methods A survey was distributed via the internet utilizing SurveyMonkey Enterprise with HIPAA compliance. Univariate regressions and frequencies were conducted between each demographic and personal characteristic and the willingness to donate. Log Binomial and linear regression was used categorical and continuous variables, and Risk ratios were calculated. Results In this large survey study, 64% of men and 50% of women reported they would be willing to donate gametes, with the majority desiring monetary compensation. Men with a high Consumer Financial Protection Bureau score were less likely to report that they would consider donating sperm compared to a medium high CFPB score. No other financial indicators were associated with considering donating sperm. There were no associations between CFPB score and egg donation outcomes. Black or African American women were less likely to consider donating their eggs compared to other groups, and more likely to desire > $5000 in compensation. Conclusions In this large survey study, a small minority of participants reported they would be willing to donate to an unknown infertility patient for reproductive purposes. High and very high CFPB scores were associated with willingness to donate games, but not with desire for monetary compensation or amount.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a2b9aee885bc831a4f2f02c2443e3fb1",
  "timestamp": "2025-05-15T03:05:03.384490"
}