{
  "id": 8435,
  "title": "Factors associated with unmet pediatric health care needs during the coronavirus pandemic",
  "abstract": "Purpose: To examine risk factors for unmet pediatric health care needs during the coronavirus pandemic in a national sample of US children under 17 years of age. Design and methods: In this cross-sectional study, we used data from the 2021 National Survey of Children's Health (n = 50,892). Unmet pediatric health care needs were assessed as follows: during the past 12 months, was there any time when this child needed health care but it was not received?. Logistic regression with multiple imputations was used to evaluate bivariate and multivariable associations between predisposing, enabling, and need factors of health care services use and unmet pediatric health care needs. Results: Approximately 3.6% of children had unmet health care needs, with significant differences by sample characteristics. Unmet health care needs were notably prevalent among select groups, including children with difficulty covering basic needs (10.6%) and those with >= 2 health conditions (8.9%). In multivariable analyses, factors associated with unmet pediatric health care needs included predisposing factors such as older age, >= 2 children with special health care needs in the household, primary language other than English or Spanish, and poor caregiver health; enabling factors such as difficulty covering basic needs, no insurance, and no personal doctor or nurse; and need factors such as poor perceived or evaluated child health. Reasons for unmet needs included financial, nonfinancial, and accessibility barriers. Conclusions: Several factors were associated with unmet health care needs. Practice implications: We identified children who would benefit from targeted interventions aimed at promoting health care services use.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a2dfdfd033d9460de0e8de009afc37a5",
  "timestamp": "2025-05-15T03:18:51.611414"
}