{
  "id": 1028,
  "title": "The Changing Landscape of Financial Credit Risk Models",
  "abstract": "The landscape of financial credit risk models is changing rapidly. This study takes a brief look into the future of predictive modelling by considering some factors that influence financial credit risk modelling. The first factor is machine learning. As machine learning expands, it becomes necessary to understand how these techniques work and how they can be applied. The second factor is financial crises. Where predictive models view the future as a reflection of the past, financial crises can violate this assumption. This creates a new field of research on how to adjust predictive models to incorporate forward-looking conditions, which include future expected financial crises. The third factor considers the impact of financial technology (Fintech) on the future of predictive modelling. Fintech creates new applications for predictive modelling and therefore broadens the possibilities in the financial predictive modelling field. This changing landscape causes some challenges but also creates a wealth of opportunities. One way of exploiting these opportunities and managing the associated risks is via industry collaboration. Academics should join hands with industry to create industry-focused training and industry-focused research. In summary, this study made three novel contributions to the field of financial credit risk models. Firstly, it conducts an investigation and provides a comprehensive discussion on three factors that contribute to rapid changes in the credit risk predictive models' landscape. Secondly, it presents a unique discussion of the challenges and opportunities arising from these factors. Lastly, it proposes an innovative solution, specifically collaboration between academic and industry partners, to effectively manage the challenges and take advantage of the opportunities for mutual benefits.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a2e33a8fc0f60a9e5d100b742140f243",
  "timestamp": "2025-05-15T01:58:08.471100"
}