{
  "id": 8283,
  "title": "Alcohol intake and its correlates in a transitional predominantly Muslim population in southeastern Europe",
  "abstract": "Objective: Our aim was to assess alcohol consumption and its correlates in Albania, a predominantly Muslim though largely secular Southeast European republic in transition from rigidly structured socialism to a market-oriented system. Methods: A population-based sample of Tirana residents aged 35-74 years was interviewed and examined in 2003-2006 (450 men and 235 women with data on alcohol intake. 65.5% response). Multivariable-adjusted logistic regression was used to assess the association of drinking frequency, quantity and type of drink with socioeconomic, psychosocial and coronary risk characteristics. Results: 30.6% (95%CI = 26.3%-34.9%) of men, age-standardized to the 2005 census, and 5.6% (95%CI = 2.6%-8.6%) of women reported almost daily intake of alcohol, whereas 17.0% (95%CI = 13.4%-20.5%) of men and 46.6% (95%CI = 40.2%-53.1%) of women abstained. In men, frequent drinking was positively associated with age and not receiving financial support from close family emigrants, and was strongly inversely related to religious observance in both Muslims and Christians. In women it was associated with smoking and upward social mobility. Alcohol intake was not associated with religious affiliation in either sex. In men, intake of spirits (predominantly raki) and beer were associated with lower socioeconomic indices, smoking and obesity (beer only), whereas wine intake was associated with financial security, being secular, and not smoking. Among men, 11.3% (95%CI = 8.3%-14.3%) reported high intakes (>= 210 g of pure alcohol/week) and 6.0% (95%CI=3.8%-8.3%) very high intakes (>= 420 g/week). High intakes were associated with frequent, rather than episodic, drinking. Conclusions: Our study may be the first to provide information on alcohol intake and its characteristics in an Albanian population sample, one of the few predominantly Muslim countries in Europe. Alcohol consumption in women was extremely low. However, consistent very heavy intake of alcohol appears to be more frequent among Albanian men than in many former communist countries in Europe, and is cause for concern. (C) 2010 Elsevier Ltd. All rights reserved.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a2f03ecc19c9d293846e909f2edd13c9",
  "timestamp": "2025-05-15T03:17:21.531326"
}