{
  "id": 4290,
  "title": "Prediction of Survival After Implantation of a Fully Magnetically Levitated Left Ventricular Assist Device",
  "abstract": "BACKGROUND Clinical trials inform on average efficacy, but individualized risk assessments for outcome prediction are important in guiding treatment implementation.OBJECTIVES The authors developed and validated a patient-specific risk score to predict survival at 1 and 2 years after HeartMate 3 (HM3) left ventricular assist device (LVAD) implantation.METHODS The MOMENTUM 3 (Multicenter Study of MagLev Technology in Patients Undergoing Mechanical Circulatory Support Therapy with HeartMate 3) trial includes 2,200 HM3 LVAD patients in the pivotal trial and Continued Access Protocol study (2014-2018). The authors randomly assigned all patients to a derivation cohort (n =1,540) or validation cohort (n = 660). Univariate mortality predictors were screened for potential model inclusion, stepwise selection was used to build the multivariable Cox proportional hazards regression model, and performance (discrimination and cali-bration) was evaluated.RESULTS Age, prior cardiac surgery (coronary artery bypass grafting [CABG] or valve procedure), lower serum sodium, higher blood urea nitrogen (BUN), small left ventricular size, and right atrial pressure-to-pulmonary capillary wedge pressure (RAP/PCWP) ratio >0.6 were significant risk factors for mortality. Receiver-operating characteristic (ROC) analysis in the validation cohort demonstrated an area under the curve (AUC) of 0.76 (95% CI: 0.70-0.81) at 1 year and 0.71 (95% CI: 0.66-0.77) at 2 years. Calibration between predicted and observed survival of the risk quintiles was high, with Pearson correlation coefficients of 0.986 and 0.994 at 1 and 2 years, respectively. Patients were successfully stratified into tertiles with higher-than-average, average, and lower-than-average survival, and observed mortality risk increased by 2-fold from one tertile to the next.CONCLUSIONS A practical, easy-to-use HM3 Survival Risk Score with 6 components was developed to accurately predict 1-and 2-year survival after HM3 LVAD implantation. The survival risk score can be used to provide individual survival estimates to facilitate shared decision making when considering HM3 LVAD therapy. (MOMENTUM 3 Trial Portfolio; NCT02224755, NCT02892955) (J Am Coll Cardiol HF 2022;10:948-959) (c) 2022 The Authors. Published by Elsevier on behalf of the American College of Cardiology Foundation. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a312d0011004ffc123089ede7cbd7393",
  "timestamp": "2025-05-15T01:25:50.468223"
}