{
  "id": 9089,
  "title": "Predictors of Vaccine Acceptance, Confidence, and Hesitancy in General, and COVID-19 Vaccination Refusal in the Province of Quebec, Canada",
  "abstract": "Introduction: A surge of COVID-19 variants is a major concern, and literatures that support developing an optimum level of herd immunity are meaningful. This study aimed to examine the factors associated with vaccine acceptance, confidence, and hesitancy in general, and COVID-19 vaccination refusal in the general population of Quebec, Canada.Methods: A web-based cross-sectional survey was conducted in October and November 2020 among French-speaking participants above 18 years of age employing quota sampling technique. The questionnaire included socio-demographic and attitudinal variables towards vaccination. Logistic regression analyses were conducted to examine the association between independent and outcome variables.Results: Of total 1599 participants, 88.9%, 87.5%, 78.5%, and 18.2%, respectively, indicated vaccine acceptance, high level of vaccine confidence, low level of vaccine hesitancy, and COVID-19 vaccination refusals. Participants having higher education, income, and fear of COVID-19 (FCV-19S) were more likely to get vaccinated, while smokers were less likely to get vaccinated. Similarly, age groups (40-59, and >= 60 years), higher education, income, permanent resident in Canada, country of parents from Canada, ever faced acute disease in the family, higher sense of coherence, and FCV-19S scores were predictors of high levels of vaccine confidence. Higher education, income, sense of coherence and FCV-19S scores, and higher health-related quality of life (CORE-6D) produced lower levels of vaccine hesitancy. Conversely, those acting as caretaker, other essential worker, smoker, and those with financial losses were more likely to have higher vaccine hesitancy. Additionally, >= 60 years of age, higher education and income, country of parents from Canada, higher scores of willingness to take risk and FCV-19S were less likely to have high level of COVID-19 vaccination refusal.Conclusion: Over three quarters of the participants indicated positive attitudes toward vaccination. Some socio-demographic and health-related quality of life factors were associated with the outcome variables, and these should be sought while designing interventions to improve COVID-19 vaccination rates.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a31d936645bdb78af119c90019460d01",
  "timestamp": "2025-05-15T03:25:27.743017"
}