{
  "id": 7618,
  "title": "The Determinants of Blockholder Presence: Evidence from Korea",
  "abstract": "The purpose of this study is to investigate the determinants of blockholder presence in the Korean stock market. This study examines previous theories and studies, points that previous studies did not examine, and proposes two hypotheses. To verify two hypotheses, fundamental data were collected from firms listed on Korea Exchange from 2005 to 2017. As explanatory variables, we use the factors and characteristics of the firms used in the previous studies. Logistic regression analysis was conducted to test the determinants of blockholder presence. We find that firm size is the most distinctive factor determining the presence of blockholder, and firm idiosyncratic risk is the most similar factor determining the existence of each blockholder. Tobin Q shows significant value in family and government, and R&D intensity appears to be a negative related to the presence of blockholder in financial institutions. We also find that the determinant of blockholder presence differs from the mechanisms that govern each individual blockholder type when all blockholders grouped together. This suggests that there is blockholder heterogeneity within Korea listing firms. Our findings contribute to investors and policy makers who interested in the determinants of the presence of blockholder and blockhoder heterogeneity in Korea stock market.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a31dbc49d4dd7502972a88f98c91c9fa",
  "timestamp": "2025-05-15T03:10:32.978727"
}