{
  "id": 4942,
  "title": "Impact of Social Determinants of Health on Medical Conditions Among Transgender Veterans",
  "abstract": "Introduction: Transgender individuals experience pronounced disparities in health (e.g., mood disorders, suicide risk) and in the prevalence of social determinants of housing instability, financial strain, and violence. The objectives of this study were to understand the prevalence of social determinants among transgender veterans and assess their associations with medical conditions. Methods: This project was a records review using administrative data from the U.S. Department of Veterans Affairs databases for 1997-2014. Transgender veterans (N = 6,308) were defined as patients with any of four ICD-9 diagnosis codes associated with transgender status. Social determinants were operationalized using ICD-9 codes and Department of Veterans Affairs clinical screens indicating violence, housing instability, or financial strain. Multiple logistic regression was used to assess the associations of social determinants with medical conditions: mood disorder, post-traumatic stress disorder, alcohol abuse disorder, illicit drug abuse disorder, tobacco use disorder, suicidal risk, HIV, and hepatitis C. Results: After adjusting for sociodemographic variables, housing instability and financial strain were significantly associated with all medical conditions except for HIV, and violence was significantly associated with all medical conditions except for tobacco use disorder and HIV. There was a dose response-like relationship between the increasing number of forms of social determinants being associated with increasing odds for medical conditions. Conclusions: Social determinants are prevalent factors in transgender patients' lives, exhibiting strong associations with medical conditions. Documenting social determinants in electronic health records can help providers to identify and address these factors in treatment goals. Published by Elsevier Inc. on behalf of American Journal of Preventive Medicine",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a327796c87bfcc4b5b5814e83a3c0ef2",
  "timestamp": "2025-05-15T02:42:36.183478"
}