{
  "id": 9458,
  "title": "Impact of routine hormone treatments for the reproductive management of dairy herds on reproductive efficiency and methane emissions",
  "abstract": "The world population of humans isforecastto exceed 9 billion by 2050 (Nations U 2012). Most growth is expected in developing countries alongside a trend for increased wealth and urbanisation, leading to unprecedented consumer demand for foods of animal origin (Nations U 2012). However, livestock are responsible for around 18% of anthropogenic greenhouse gas emissions worldwide (FAO 2006), and increased agricultural production must be sustainable against a background of climate change and limitations on land availability (Foresight 2011). Without complete reliance on potentially human-edible food, dairy production can be energetically efficient compared to farming non-ruminants (Wilkinson 2011). However microbial ruminal fermentation of cellulosic feeds releases methane, a greenhouse gas with at least 25 times the global warming potential of carbon dioxide (Herrero and others 2011). Methane has been identified as an important target for short term climate change mitigation strategies, and thus dairy producers will be required to reduce emissions (Knapp and others 2014). However this must occur alongside an increase in productivity and economic efficiency. Oestrus detection efficacy is a common limiting factor in dairy herd reproductive management, and synchronisation programmes allowing pre-set (fixed time) artificial insemination have become popular, particularly for large herds with limited labour (Caraviello and others 2006). However routine use of hormonal therapy has been highlighted as an ethical dilemma, and some veterinarians may be reluctant to recommend this approach (Higgins and others 2013). As demand for dairy products on the world market increases, milk prices tend to become more volatile (Lips and Relder 2005). To remain profitable and competitive, farmers may need to both adopt new technologies, and make optimal use of existing ones to reduce the cost of producing milk. Importantly, this should also be achieved with minimal adverse environmental impact. As farming develops in the face of future demands, it is important that common practices can be justified to all interested parties. Despite potentially adverse public perception, hormonal interventions for dairy herds could have benefits to society through reduction in methane emissions in addition to financial benefit for the farmer, and this has not previously been considered. This study predicts the magnitude and between herd variation in changes of methane emissions and production efficiency associated with interventions to improve reproductive efficiency in dairy cows. Data for 10,000 herds of 200 cows were simulated. Probability of conception was predicted daily from the start of the study (parturition) for each cow up to day 300 of lactation. Four scenarios of differing first insemination management were simulated for each herd using the same theoretical cows: A baseline scenario based on breeding from observed oestrus only, synchronisation of oestrus for pre-set first insemination using Ovsynch, both with and without progesterone supplementation, and a regime using prostaglandin treatments followed by first insemination to observed oestrus. Cows that did not conceive to first insemination were re-inseminated following detection of oestrus. For cows that conceived, gestation length was 280 days with cessation of milking 60 days before calving. Those cows not pregnant after 300 days of lactation were culled and replaced by a heifer after a 60 day lag period. Daily milk yield was calculated for 730 days from the start of the study for each cow. Change in mean reproductive and economic outputs were summarised for each herd following the 3 interventions. For each scenario, methane emissions were determined by daily forage dry matter intake, forage quality, and cow replacement risk. Linear regression was used to summarise relationships. In some circumstances improvement in reproductive efficiency using the programmes investigated was associated with reduced cost and methane emissions compared to reliance on detection of oestrus. Efficiency of oestrus detection and the time to commencement of breeding after calving influenced variability in changes in cost and methane emissions. For an average UK herd (DairyCo 2014) this was a saving of at least 50 per cow and a 3.6% reduction in methane emissions per L of milk when timing of first insemination was pre-set using Ovsynch. The global warming potential of this change is equivalent to that from 2 cars, a family home, or 21 barrels of oil. Work is in progress to adapt the simulation model described as an excel based tool for field use. This will enable decision making based on the likely cost effectiveness of these intervention for specific herds.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a33556a3a2335b3ee61af6ee2aa6ea03",
  "timestamp": "2025-05-15T03:28:46.417185"
}