{
  "id": 5756,
  "title": "Association of socioeconomic status with financial burden of disease among elderly patients with cardiovascular disease: evidence from the China Health and Retirement Longitudinal Survey",
  "abstract": "Objectives The prevalence of cardiovascular diseases (CVD) within low-income and middle-income countries has reached epidemic proportions. However, the association between out-of-pocket (OOP) payment and socioeconomic status (SES) of patients with CUD is not well studied. We aimed to understand the financial burden among Chinese middle-aged and older patients with CUD, and whether there was an association with SES. Settings A nationally representative survey The China Health and Retirement Longitudinal Survey (CHARLS) was conducted in 28 provinces of mainland China in 2011 and 2013. Participants Of the over 18 000 CHARLS respondents, eligible participants were those aged 45 years and over who had been previously diagnosed with CUD. Outcome measures Financial burden was measured by individual OOP payment and household catastrophic health expenditure (CHE) occurrence (ie, the annual household health expenditure was 40% or more of the total non-food household expenditure). Multilevel regression models were used to explore the association between financial burden and SES. Results Among CHARLS respondents, CUD prevalence increased from 14.7% in 2011 to 16.6% in 2013. Average annual CUD OOP payment increased from 5000 RMB (770 USD) to 6120 RMB (970 USD). Furthermore, CHE occurrence increased from 44.2% to 48.1 %. Patients spent almost twice on outpatient as on inpatient services. Two of the three SES indicators (total household expenditure, occupation type) were found to be associated with CVD OOP payment amount, and the likelihood of CHE Unemployed patients had a higher likelihood of CHE compared with agricultural workers. Rural-urban difference was associated with the likelihood of CHE in 2011 alone. Conclusion The Chinese health system should use this health expenditure pattern among patients with CVD to create more equitable health insurance schemes that financially balance between outpatient and inpatient care, and provide better financial risk protection to patients with low SES.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a34a57582f918daa0958fbc6e97c2a93",
  "timestamp": "2025-05-15T02:50:54.021221"
}