{
  "id": 5031,
  "title": "The Role of Revenues in Reducing Local Government Fiscal Distress: An Empirical Study in Indonesia",
  "abstract": "This study aims to examine the role of revenues in reducing the fiscal distress of local governments in Indonesia. A problem that is being widely tested is the potential for financial imbalances to determine the right pattern between fiscal capacity and service provision to the public. Local governments that experience fiscal distress are at risk of experiencing a collapse of the overall system, so it requires effective prevention. This study uses balance panel data obtained from local government financial reports with 3,024 observations, from 504 local governments in Indonesia during the 2014-2019 period. Hypothesis testing is carried out using logistic regression by employing the Wald Test partially and the Overall Test simultaneously. The data is collected from the local government financial statements which have been audited by supreme audit institutions. The results reveal that local government's own revenue and transfer revenue and other legal revenue are proven to be able to reduce local government fiscal distress. It provides empirical support for the executive and legislature to make the right policies in increasing their own revenues at the central and regional levels. The findings include crucial information for preventing, detecting, and mitigating fiscal distress in all Indonesian local governments.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a372001f64e70c82efb5c0fc1e96e6cd",
  "timestamp": "2025-05-15T02:43:40.136404"
}