{
  "id": 7158,
  "title": "Clinical Implications of Old and New Genes for Open-Angle Glaucoma",
  "abstract": "Objective: Genome-wide association studies have revealed new insights into the genetic determinants of open-angle glaucoma (OAG). This study was performed to determine to what extent variants within established genes (MYOC, OPTN, and WDR36) and newly identified common genetic variants (ATOH7, CDKN2B, and SIX1) contribute to the risk of OAG. Design: Population-based setting, family-based setting, and a case-control study. Participants: The Rotterdam Study I cohort (N = 5312; mean age +/- standard deviation [SD], 68.0 +/- 8.4 years). Findings were replicated in the Genetic Research in Isolated Populations combined with the Erasmus Rucphen Family study (N = 1750; mean age +/- SD, 48.3 +/- 15.2 years), and a cohort from Southampton (N = 702; mean age +/- SD, 72.5 +/- 10.7 years). Methods: After identifying common variants associated with OAG within the established genes, the risk of OAG was analyzed using logistic regression. Discriminative accuracy was assessed by comparing the area under the receiver operator characteristic curve (AUC) for models, including the number of risk alleles, intraocular pressure, age, and gender, with the AUC for the same model but without the risk alleles. Main Outcome Measures: Odds ratios and AUCs of individual and combined risk alleles. Results: No consistent significant associations for the established genes (MYOC, OPTN, and WDR36) with OAG were found. However, when comparing the load of risk variants between cases and controls, 2 of 3 studies showed a significant increased risk of OAG for participants carrying more risk alleles of the 3 established genes. When combining all 6 genes, participants carrying a high number of risk alleles (highest tertile) had a 2.29-fold to 3.19-fold increase in risk of OAG compared with those carrying only a few risk alleles. The addition of the newly identified genes to IOP, age, and gender resulted in a higher AUC compared with the AUC without the newly identified genes (P = 0.027). Conclusions: A significant contribution to the risk of OAG was found for the new common variants identified by recent genome-wide association studies, but not for variants within the established genes. Participants carrying a high number of risk alleles had an approximately 3-fold increase in the risk of OAG compared with those with a low number of risk alleles. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 2389-2397 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a37b61282fb5ea6fdae6911654f6b1a7",
  "timestamp": "2025-05-15T03:05:32.119651"
}