{
  "id": 3301,
  "title": "Investing in our planet: Examining retail investors' preference for green bond investment",
  "abstract": "The green bond has emerged as an important financial instrument to advance environmentally friendly projects. While institutional investors have shown ample interest in green bonds, retail investors have lagged in their adoption. This study intends to examine the determinants of retail investors' attitude and intention toward green bond investment, utilizing the theory of planned behavior as the fundamental model and incorporating several context-specific factors. Data from 506 Indian retail investors, representing the majority of Indian states and union territories (UTs), were collected through multi-stage stratified random sampling. The PLS-SEM method, coupled with artificial neural network (ANN) analysis and fuzzy set qualitative comparative analysis (fsQCA), was employed to test the hypothesized relationships, ensure the robustness of outcomes, and derive important practical insights. The findings suggest that intrinsic factors (perceived behavioral control and attitude) are superior predictors of investors' behavioral intentions relative to external factors (government policy support and social influence). Further, for green bonds to receive favorable evaluations from investors, they should display adequate financial cum environmental performance. Investors' attitude is significantly influenced by issuers' ratings and their willingness to pay premiums. Environmental concerns and perceived risk also influence investors' attitude toward green bonds, albeit with relatively lower strength. This study holds significance as it offers crucial implications for researchers, market participants, policymakers, and regulators involved in the development of the green bond market.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a39c2c46ad3422ea6edcd982a3b5b892",
  "timestamp": "2025-05-15T02:24:39.737451"
}