{
  "id": 989,
  "title": "Using statistical and neural network methods to explore the relationship between systematic risk and firm's long term investment activities",
  "abstract": "This paper presents a neural network method to explore the relationship between the systematic risk and the long term investing activities for Taiwan's companies in the fiber industry and in the electronics industry. In general, diversification from long-term investment may reduce firm's systematic risk, but the empirical results in some literatures are controversial. For years regression methods have been used to analyze the possible impact of long-term investment activities on systematic risk. Since their relationship may not be linear we thus propose a neural network based sensitivity analysis for the possible non-linear relationships. We adapt 5 years data (1994-1998) from the TEJ financial database to conduct the proposed analysis. The results show that the systematic risk is reduced with investment activities for the fiber industry. But for the electronics industry, the systematic risk is higher as firms increase the long-term investment ratio. The difference is even more significant when we only consider the companies with higher portion of long term investment in assets. This diverse effect between industries may be one of the reasons why the empirical results are inconsistent. Our study can clarify the controversial between the systematic risk and the long-term investment activities, and offer some possible explanations.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a3a71b5508db6f9d4adb4f3fcda6c53c",
  "timestamp": "2025-05-15T01:57:29.898860"
}