{
  "id": 8077,
  "title": "Preferences for improved early warning services among coastal communities at risk in cyclone prone south-west region of Bangladesh",
  "abstract": "Cyclone early warning systems are the primary sources of information that enable people to develop a preparedness strategy to mitigate the hazards of cyclones to lives and livelihoods. In Bangladesh, cyclone early warnings have significantly decreased the number of cyclone related fatalities over the last two decades. Nevertheless, several challenges remain for existing early warning services (EWS), urging for both technical and non-technical improvements in the said services. Given limited financial resources, the economic efficiency assessment of the improvement is highly important. Therefore, this study aims to estimate the willingness to pay (WTP) for improved warning services by considering the at-risk households' trade-off between proposed improved EWS and existing EWS in coastal Bangladesh. Applying systematic random sampling, 490 respondent households were selected from Khulna, Satkhira, and Barguna districts, with whom a choice experiment (CE) was performed. The CE was designed by incorporating impact-based scenarios for improved EWS. As analytical tools, Conditional and Mixed-Logistic regression models were used that derived the WTP for improved EWS attributes. Empirical results show that the WTP of an at-risk household for improved EWS was estimated at Bangladeshi Taka BDT 468 (similar to US$ 5.57) per year, implying respondents were ready to pay for the improvement of the warning attributes, including precise information of the cyclones landfall time with possible impacts, more frequent radio forecasts, and voice messages in the local dialects over mobile phones. A revenue stream for improved EWS was developed, implying investments in EWS would be a no-regrets approach. This study concludes with four policy recommendations on mitigating the existing challenges for improving EWS in Bangladesh. (C) 2020 The Author(s). Published by Elsevier Ltd.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a3bf700b3dd4ec21fc13f3a4b5084e48",
  "timestamp": "2025-05-15T03:15:09.327561"
}