{
  "id": 7514,
  "title": "Investigation of the factors driving engineering insurance consumption in China's construction industry: a hybrid approach",
  "abstract": "PurposeGiven the increasing importance of engineering insurance, it is still unclear which specific factors can enhance the role of engineering insurance as a risk transfer tool. This study aims to propose a hybrid approach to identify and analyze the key determinants influencing the consumption of engineering insurance in mainland China.Design/methodology/approachThe empirical analysis utilizes provincial data from mainland China from 2008 to 2019. The research framework is a novel amalgamation of the generalized method of moments (GMM) model, the quantile regression (QR) technique and the random forest (RF) algorithm. This innovative hybrid approach provides a comprehensive exploration of the driving factors while also allowing for an examination across different quantiles of insurance consumption.FindingsThe study identifies several driving factors that significantly impact engineering insurance consumption. Income, financial development, inflation, price, risk aversion, market structure and the social security system have a positive and significant influence on engineering insurance consumption. However, urbanization exhibits a negative and significant effect on the consumption of engineering insurance. QR techniques reveal variations in the effects of these driving factors across different levels of engineering insurance consumption.Originality/valueThis study extends the research on insurance consumption to the domain of the engineering business, making theoretical and practical contributions. The findings enrich the knowledge of insurance consumption by identifying the driving factors specific to engineering insurance for the first time. The research framework provides a novel and useful tool for examining the determinants of insurance consumption. Furthermore, the study offers insights into the engineering insurance market and its implications for policymakers and market participants.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a3d3533fd1efdb95018287111ef1ec88",
  "timestamp": "2025-05-15T03:09:36.812323"
}