{
  "id": 7298,
  "title": "Geographical Associations of HIV Prevalence in Female Sex Workers From Nairobi, Kenya (2014-2017)",
  "abstract": "Background:Kenya's HIV epidemic is heterogeneously distributed. Although HIV incidence in Kenya has shown signs of recent decline, focused interventions are still needed for female sex workers (FSWs). Geospatially informed approaches have been advocated for targeted HIV prevention. We quantified heterogeneity in HIV burden in Nairobi-based FSWs by place of origin within Kenya and hotspots and residence within Nairobi.Methods:Data were collected as part of enrolment in the Sex Workers Outreach Program in Nairobi between 2014 and 2017. Prevalence ratios were used to quantify the risk of HIV by high-prevalence counties using modified Poisson regression analyses. Crude and fully adjusted models were fitted to the data. In heterogeneity analyses, hotspots and residences were aggregated to the Nairobi constituency level (n = 17). Inequality in the geographic distribution of HIV prevalence was measured using the Gini coefficient.Results:A total of 11,899 FSWs were included. Overall HIV prevalence was 16%. FSWs originating from a high-prevalence country were at 2-fold increased risk of living with HIV in adjusted analysis (prevalence ratio 1.95; 95% CI: 1.76 to 2.17). HIV prevalence was also highly heterogeneous by hotspot, ranging from 7% to 52% by hotspot (Gini coefficient: 0.37; 95% CI: 0.23 to 0.50). By contrast, the constituency of residence had a Gini coefficient of 0.08 (95% CI: 0.06 to 0.10), suggesting minimal heterogeneity by residence.Conclusion:HIV prevalence in FSWs is heterogeneous by place of work within Nairobi and by county of birth within Kenya. As HIV incidence declines and financial commitments flatline, tailoring interventions to FSWs at highest HIV risk becomes increasingly important.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a3e2555b43749f30b1d8d59703323840",
  "timestamp": "2025-05-15T03:07:02.677500"
}