{
  "id": 7950,
  "title": "Attitudes and experiences regarding induced abortion among female sex workers, Savannakhet Province, Laos",
  "abstract": "Objective: Female sex workers (FSWs) are at risk of unintended pregnancies and induced abortions (IAs). This study aimed to describe attitudes towards and experiences of IA among FSWs in Laos. Methods: 258 FSWs were interviewed in Kaysone Phomvihan, Laos. Descriptive statistics and logistic regression were used to analyse the data. Results: Overall, 24% of the respondents reported experience of IA. Fifteen percent reported experience of unintended pregnancy after entering sex work, whereof all had ended in IA. Thirty-six percent had self-induced the last IA and 64% were carried out in private clinics. The main reasons for having IAs were paternity denial and lack of financial and social support. A majority agreed or strongly agreed that IA should not be legal in Laos and that women who undergo IA are immoral, but also that IA is the only option a FSW has when experiencing an unintended pregnancy. A positive attitude towards IA was associated with longer duration of sex work and being unmarried. Conclusion: IAs were common. Respondents' attitudes and practices reflected limited options when experiencing an unintended pregnancy, and were influenced by negative social perceptions. Interventions targeting FSWs should raise awareness of IA and post-abortion care, and promote dual contraceptive use with highly effective contraceptives. (C) 2014 Elsevier B.V. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a3e58142f2953ee6862bbb20f8b5a78e",
  "timestamp": "2025-05-15T03:13:30.709043"
}