{
  "id": 8231,
  "title": "The Factors Associated with the Quality of Life of the Spouse Caregivers of Patients with Cancer: A Cross-Sectional Study",
  "abstract": "Background: It is well known that cancer greatly affects not only patients but also their families. However, few studies on caregivers' quality of life have been conducted within the Asian population. Methods: We carried out a survey using well-constructed, self-administered questionnaires that were answered by pairs of patients with cancer and their spouse-caregivers (n = 100 pairs) who were visiting the cancer daycare center at Seoul National University Hospital. The caregiver's quality of life (QOL) was assessed by the Korean version of the Caregiver Quality Of Life Index-Cancer (CQOLC), which contains four domains along with other items. Possible determinants of caregiver QOL were categorized according to sociodemographic factors, caregiver burden, health risk factors, spirituality, and family function. Multiple linear regression analysis was used to identify the factors associated with spouse-caregivers' QOL. Results: Having a reason or purpose for living was associated with the total CQOLC score (beta = 3.408, p = 0.025) and positive adaptation (beta = 1.035, p = 0.009). Family function was associated with total CQOLC and all the domains except burden, and caregivers' religion was associated with total CQOLC. Monthly household income and cigarette smoking status were associated with financial concern. Conclusions: Having a reason and purpose for living, which is an aspect of spirituality, was a relevant factor in the spousal caregivers' QOL. Future research is needed to confirm the association between spirituality and caregivers' QOL and whether interventions supporting spirituality could improve their QOL.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a405440d9137b4ab4f4872649617d7fa",
  "timestamp": "2025-05-15T03:16:48.933089"
}