{
  "id": 6913,
  "title": "Formal and informal social participation and elder mistreatment in a national sample of older adults",
  "abstract": "Background/Objectives Older adults' susceptibility to mistreatment may be affected by their participation in social activities, but little is known about relationships between social participation and elder mistreatment. Design Cross-sectional analysis. Setting/Participants National probability sample of older community-dwelling U.S. adults interviewed in 2015-2016, including 1268 women and 973 men (mean age 75 years and 76 years, respectively; 82% non-Hispanic white). Measurements Frequency of participation in formal activities (organized meetings, religious services, and volunteering) and informal social activities (visiting friends and family) was assessed by questionnaire. Elder mistreatment included emotional (four items), physical (two items), and financial mistreatment (two items) since age 60. Multivariable logistic regression examined associations between each type of social participation and elder mistreatment among men and women, adjusting for age, race/ethnicity, education, and comorbidity. Results Forty percent of women and 22% of men reported at least one form of mistreatment (emotional, physical, or financial). Women reporting at least monthly engagement in formal social activities were more likely to report emotional mistreatment (adjusted odds ratio (AOR) 1.59, 95% confidence interval (CI) 1.09-2.33). Among men, monthly organized meeting attendance was associated with increased odds of emotional mistreatment (AOR 1.34, 95% CI 1.01-1.93). Weekly informal socializing was inversely associated with emotional mistreatment (AOR 0.59, 95% CI 0.44-0.78) and financial mistreatment (AOR 0.59, 95% CI 0.42-0.85) among women. Conclusion In this national cohort, older adults who were frequently engaged in formal social activities reported similar or higher levels of mistreatment than those with less frequent organized social participation. Older women with regular informal contact with family or friends were less likely to report some kinds of mistreatment. Strategies for detecting and mitigating elder mistreatment should consider differences in patterns of formal and informal social participation and their potential contribution to mistreatment risk.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a40a0eba3c50154bbdf990a0c92fee77",
  "timestamp": "2025-05-15T03:03:13.385153"
}