{
  "id": 2241,
  "title": "Liquidity management by mutual funds",
  "abstract": "PurposeThe paper examines how equity mutual funds manage their liquidity. Specifically, the authors investigate what strategies fund managers use to meet investor redemption demand, whether these strategies vary over time, whether different type of funds employ different liquidation practices in response to fund outflows, and whether liquidity strategies impact fund performance.Design/methodology/approachThis study uses a sample of U.S. actively managed equity funds over the period 1990-2019. The authors use three different measures to capture funds' liquidity management practices. The authors examine the relationship between fund liquidity measures and net flow by estimating panel regressions over the entire sample period, on 2 sub-sample periods of different market conditions measured by the magnitude of implied market volatility (VIX), and on 2 sub-samples of funds with different liquidity profiles. The authors also examine the relationship between funds liquidity status and near-term performance through both a portfolio approach and regression analysis.FindingsThe authors find that on average, mutual funds reduce their cash position and the most liquid asset holdings to meet investor redemption demand. Furthermore, the authors find that fund managers choose different liquidity strategies under different market conditions. During highly volatile markets, mutual funds use cash and their most liquid assets to meet redemption demand while maintaining their portfolio liquidity. During low volatility markets, mutual funds rely heavily on cash but less on liquidity assets and tend to increase their portfolio illiquidity. Upon further examination of funds across portfolio liquidity profiles, the authors find that liquid funds increase portfolio liquidity when facing outflows, whereas illiquid funds maintain their portfolio liquidity position. The different liquidity strategies have significant impact on funds' near-term performance. Specifically, liquid funds underperform illiquid funds following the increase in their portfolio liquidity.Originality/valueThis paper contributes to the literature on liquidity management by asset managers by taking a holistic approach to examine funds liquidation practice at the portfolio holdings level. Considering the recent increase in market volatility, mutual fund liquidity management has drawn an increasing share of interest and attention from policy makers, investment professionals, and academia. This study covers both uncertain and stable market states during a long sample period and provides empirical evidence on the flow-induced liquidation decisions by equity mutual funds. In addition, this paper also contributes to the literature on mutual fund performance by providing evidence that funds' liquidity strategies significantly impact their near-term performance.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a40e93f2ce3c4fdcdfc165ee71e35a72",
  "timestamp": "2025-05-15T01:05:04.367091"
}