{
  "id": 923,
  "title": "Postdisaster image-based damage detection and repair cost estimation of reinforced concrete buildings using dual convolutional neural networks",
  "abstract": "Reinforced concrete (RC) buildings are commonly used around the world. With recent earthquakes worldwide, rapid structural damage inspection and repair cost evaluation are crucial for building owners and policy makers to make informed risk management decisions. To improve the efficiency of such inspection, advanced computer vision techniques based on convolutional neural networks have been adopted in recent research to rapidly quantify the damage state (DS) of structures. In this article, an advanced object detection neural network, named YOLOv2, is implemented, which achieves 98.2% and 84.5% average precision in training and testing, respectively. The proposed YOLOv2 is used in combination with the classification neural network, which improves the identification accuracy for critical DS of RC structures by 7.5%. The improved classification procedures allow engineers to rapidly and more accurately quantify the DSs of the structure, and also localize the critical damage features. The identified DS can then be integrated with the state-of-the-art performance evaluation framework to quantify the financial losses of critical RC buildings. The results can be used by the building owners and decision makers to make informed risk management decisions immediately after the strong earthquake shaking. Hence, resources can be allocated rapidly to improve the resiliency of the community.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a411e793647d96c3784651fc7eca1094",
  "timestamp": "2025-05-15T01:56:49.550572"
}