{
  "id": 5578,
  "title": "Prevalence of Obesity in New York Nursing Homes: Associations With Facility Characteristics",
  "abstract": "Purpose of the Study: With the growing obesity epidemic, the proportion of obese U.S. nursing home (NH) residents has increased. Little is known about the characteristics of facilities that serve obese residents. We identified facility characteristics associated with risk-adjusted obesity prevalence, based on resource dependence theory. Design and Methods: Information on residents' admission records from the Minimum Data Set for New York State was linked with the NH Compare and the Online Survey, Certification, and Reporting databases for CY2005-2007. Three facility-level outcome variables were rates of risk-adjusted obesity (body mass index [BMI] >= 30), mild-to-moderate obesity (30 <= BMI < 40), and morbid obesity (BMI >= 40). Facility characteristics included financial resources, staff resources, quality of care, operational efficiency, and other resources. Individual-level factors were used to calculate risk-adjusted obesity rates. Multivariate regression models were employed. Results: Higher staffing was positively related to obesity rates. Every 0.1 increase in the staffing ratio was related to higher obesity (3.9%) prevalence, mild-to-moderate obesity rate (2.6%), and morbid obesity prevalence (4.6%). Facilities with poorer quality had higher obesity rates. Presence of any quality of life (QL) deficiency was associated with higher obesity (3.2%), mild-to-moderate obesity (2.5%), and morbid obesity (3.6%). Implications: Facilities more likely to provide care to obese residents appear to be characterized by higher resource use and poorer quality. Policymakers may need to pay closer attention to the financial implications that the growing population of obese residents may have on NHs, as well as the extent to which this trend may affect facilities' resources and the quality of care they provide.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a413408020a8a7d56015b656d3e8358b",
  "timestamp": "2025-05-15T02:49:21.626102"
}