{
  "id": 8034,
  "title": "Employment status at time of acute myocardial infarction and risk of death and recurrent acute myocardial infarction",
  "abstract": "Background Employment is important for physical and mental health and self-esteem and provides financial independence. However, little is known on the prognostic value of employment status prior to admission with acute myocardial infarction (MI). Methods and results Using Danish nationwide registries, all patients between 18 and 60 years with a first-time MI admission (2010-2018) and alive at discharge were included. Rates of all-cause mortality and recurrent MI according to workforce attachment at the time of the event was compared using multivariable Cox regression. Of the 16 060 patients included in the study, 3520 (21.9%) patients were not part of the workforce. Patients who were not part of the workforce were older (52 vs. 51 years), less often men (63% vs. 77%), less likely to have higher education, more often living alone (47% vs. 29%), and more often had comorbidities, including heart failure, atrial fibrillation, hypertension, diabetes, chronic kidney disease, and chronic obstructive pulmonary disease. The absolute 5-year risk of death was 3.3% and 12.8% in the workforce and non-workforce group, respectively. The corresponding rates of recurrent MI were 7.5% and 10.9%, respectively. In adjusted analyses, not being part of the workforce was associated with a significantly higher rate of all-cause mortality [HR: 2.39 (95% CI: 2.01-2.83)] and recurrent MI [1.36 (1.18-1.57)]. Conclusion Among patients of working age who were admitted with MI and alive at discharge, not being part of the workforce was associated with a higher long-term rate of all-cause mortality and recurrent MI. Lay Summary In patients of working age admitted with a heart attack, not being part of the workforce was associated with an increased risk of mortality and new heart attacks following discharge, as compared with patients being part of the workforce. Key findingsAs compared with patients being part of the workforce, patients who were not part of the workforce had an increased risk of mortality following discharge.As compared with patients being part of the workforce, patients who were not part of the workforce had an increased risk of a new heart attack following discharge.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a41c08fcd6f2fccbcf08d553479c5048",
  "timestamp": "2025-05-15T03:14:37.330447"
}