{
  "id": 9072,
  "title": "Influence of education and subjective financial status on dietary habits among young, middle-aged, and older adults in Japan: a cross-sectional study",
  "abstract": "BackgroundResearch has suggested an association between lower socioeconomic status (SES) and unhealthy dietary habits. However, differences in the effects of different SES indicators and age remain unclear. The current study addressed this research gap by investigating the relationship between SES and unhealthy dietary habits, specifically focusing on educational attainment and subjective financial status (SFS) among varied age groups.MethodsData were derived from a mail survey of 8,464 people living in a suburb of Tokyo, Japan. Participants were classified into three age groups (20-39 years: young adults; 40-64 years: middle-aged adults; and 65-97 years: older adults). SES was assessed based on individual educational attainment and SFS. Unhealthy dietary habits were defined as skipping breakfast and a low frequency of balanced meal consumption. Participants were asked how often they ate breakfast, and those who did not respond every day were categorized as breakfast skippers. Low frequency of balanced meal consumption was defined as eating a meal that included a staple meal, main dish, and side dishes at least twice a day for less than five days per week. Poisson regression analyses with robust variance adjusted for potential covariates were used to determine the interactive effects of educational attainment and SFS on unhealthy dietary habits.ResultsIndividuals with lower educational attainment across all age groups skipped breakfast more frequently compared to those with higher educational attainment. For older adults, poor SFS was associated with skipping breakfast. Young adults with poor SFS and middle-aged adults with lower educational attainment tended to eat less balanced meals. In addition, an interaction effect was found in older adults, where those with lower education despite good SFS and those with poor SFS despite higher education were at a greater risk of falling into unhealthy diet.ConclusionsThe findings suggested that different SES indicators affect healthy dietary habits in different generations, and therefore, health policies should consider the potential influence of different SES on promoting healthier dietary habits.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a421c9c4e6efc7e718c38e951d762161",
  "timestamp": "2025-05-15T03:25:27.636279"
}