{
  "id": 3684,
  "title": "An exploration of the role and scope of the Clinical nurse consultant (CNC) in a metropolitan health service",
  "abstract": "Introduction: Clinical nurse consultants have been a part of the nursing workforce for some time however a lack of clarity regarding this role has led to significant variations in health service expectations, workloads and scope for the Clinical nurse consultants working within this metropolitan health service. Aim: The aim of this study was to explore the role of the CNC as it is perceived by them, in the context of this health service. Method: A qualitative approach was used for this study. Following ethics approval a single audio-taped focus group was undertaken to gather data. Guiding questions were used to elicit responses from the group, moderated by the co-investigators. The focus group was transcribed verbatim. Each researcher independently analysed the narrative data, using coding and clustering the data to develop primary and sub-themes. Results: Whilst each participant experiences their role individually, there were four themes derived from comments expressed by the participants: 'Diversity and conflict', 'Leaders but powerless', 'Support systems' and 'The portfolio holder role'. Conclusion: The role of the Clinical nurse consultant is complex and diverse. 'The variability in the role suggests that organisational consensus of the role, scope and purpose of the CNC position has not been actualised, resulting in a lack of support systems, and an underutilisation of the Clinical nurse consultants as leaders, where they can challenge existing practice and guide future directions in care delivery. (C) 2010 Published by Elsevier Australia (a division of Reed International Books Australia Pty Ltd) on behalf of Royal College of Nursing, Australia.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a42f5c6329f78ddd07bb912418c28331",
  "timestamp": "2025-05-15T01:19:26.278870"
}