{
  "id": 1501,
  "title": "Integration of support vector machines and mean-variance optimization for capital allocation",
  "abstract": "This work introduces a novel methodology for portfolio optimization that is the first to integrate support vector machines (SVMs) with cardinality-constrained mean-variance optimization. We propose augmenting cardinality-constrained mean-variance optimization with a preference for portfolios with the property that a low-dimensional hyperplane can separate assets eligible for investment from those ineligible. We present convex mixed-integer quadratic programming models that jointly select a portfolio and a separating hyperplane. This joint selection optimizes a tradeoff between risk-adjusted returns, hyperplane margin, and classification errors made by the hyperplane. The models are amenable to standard commercial branch-and-bound solvers, requiring no custom implementation. We discuss the properties of the proposed optimization models and draw connections between existing portfolio optimization and SVM approaches. We develop a parameter selection strategy to address the selection of big-Ms and provide a financial interpretation of the proposed approach's parameters. The parameter strategy yields valid big-M values, ensures the risk of the resulting portfolio is within a factor of the lowest possible risk, and produces informative hyperplanes for practitioners. The mathematical programming models and the associated parameter selection strategy are amenable to financial backtesting. The models are evaluated in-sample and out-of-sample on two distinct datasets in a rolling horizon backtesting framework. The portfolios resulting from the proposed approach display improved out-of-sample risk-adjusted returns compared to cardinality-constrained mean-variance optimization.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a43c5cb22afe10180bf68e3595adeca2",
  "timestamp": "2025-05-15T02:03:39.826678"
}