{
  "id": 3614,
  "title": "Comparisons of financial hardship in cancer care by family structure and among those with and without minor children using nationally representative data",
  "abstract": "Introduction: While demographic risk factors of cancer-related financial hardships have been studied, having minor children or being single have rarely been assessed in the context of healthcare-related financial hardships. Methods: Using data from the 2015 to 2018 National Health Interview Survey, we assessed financial hardship (material and psychological hardship; behavioral coping due to costs: delaying/foregoing care, reducing prescription costs, or skipping specialists or follow-up care) among adults aged 18-59 years with cancer (N = 2844) by minor child parenting status and family structure. In a secondary analysis, we compared this group with individuals without cancer. Using logistic regression models, we compared those with and without children aged <18 years, further distinguishing between those who were single versus one of two or more adults in the family. Results: Compared to individuals from families with two or more adults/without children, single adults with children more often reported cancer-related financial hardships, for example material hardship (45.9% vs. 38.8%), and reducing prescription costs, (50.7% vs. 34.4%, adjusted OR 1.57, 95% CI 1.07-2.28). Single adults without minor children and those from families with two or more adults/with minor children also reported greater financial hardships on some dimensions. Associations were similar among those without cancer, but the overall magnitude of financial hardships was lower compared to those with cancer. Conclusions: Our findings suggest that having minor children, and being a single adult are risk factors for cancer-related financial hardship. Financial vulnerability associated with family structure should be taken into consideration in healthcare, and especially cancer care.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a444fd82ae242ff96f7a1c469bda5421",
  "timestamp": "2025-05-15T02:28:29.273100"
}