{
  "id": 9388,
  "title": "20-year outcomes in adolescents who self-harm: a population-based cohort study",
  "abstract": "Background Little is known about the long-term psychosocial outcomes associated with self-harm during adolescence. We aimed to determine whether adolescents who self-harm are at increased risk of adverse psychosocial outcomes in the fourth decade of life, using data from the Victorian Adolescent Health Cohort Study. Methods We recruited a stratified, random sample of 1943 adolescents from 44 schools across the state of Victoria, Australia. The study started on Aug 20, 1992, and finished on March 4, 2014. We obtained data relating to self-harm from questionnaires and telephone interviews at eight waves of follow-up, commencing at mean age 15.9 years (SD 0.5; waves 3-6 during adolescence, 6 months apart) and ending at mean age 35.1 years (SD 0 . 6; wave 10). The outcome measures at age 35 years were social disadvantage (divorced or separated, not in a relationship, not earning money, receipt of government welfare, and experiencing financial hardship), common mental disorders such as depression and anxiety, and substance use. We assessed the associations between self-harm during adolescence and the outcome measures at 35 years (wave 10) using logistic regression models, with progressive adjustment: (1) adjustment for sex and age; (2) further adjustment for background social factors; (3) additional adjustment for common mental disorder in adolescence; and (4) final additional adjustment for adolescent antisocial behaviour and substance use measures. Findings From the total cohort of 1943 participants, 1802 participants were assessed for self-harm during adolescence (between waves 3 and 6). Of these, 1671 were included in the analysis sample. 135 (8%) reported having self-harmed at least once during adolescence. At 35 years (wave 10), mental health problems, daily tobacco smoking, illicit drug use, and dependence were all more common in participants who had reported self-harm during the adolescent phase of the study (n=135) than in those who had not (n=1536): for social disadvantage odds ratios [ORs] ranged from 1.34 (95% CI 1.25-1.43) for unemployment to 1.88 (1.78-1.98) for financial hardship; for mental health they ranged from 1.61 (1.51-1.72) for depression to 1.92 (1.79-2.04) for anxiety; for illicit drug use they ranged from 1.36 (1.25-1.49) for any amphetamine use to 3.39 (3.12-3.67) for weekly cannabis use; for dependence syndrome they were 1.72 (1.57-1.87) for nicotine dependence, 2.67 (2.38-2.99) for cannabis dependence, and 1.74 (1.62-1.86) for any dependence; and the OR for daily smoking was 2.00 (1.89-2.12). Adjustment for socio-demographic factors made little difference to these associations but a further adjustment for adolescent common mental disorders substantially attenuated most associations, with the exception of daily tobacco smoking (adjusted OR 1.74, 95% CI 1.08-2 .81), any illicit drug use (1.72, 1.07-2.79) and weekly cannabis use (3.18, 1.58-6.42). Further adjustment for adolescent risky substance use and antisocial behaviour attenuated the remaining associations, with the exception of weekly cannabis use at age 35 years, which remained independently associated with self-harm during adolescence (2.27, 1.09-4.69). Interpretation Adolescents who self-harm are more likely to experience a wide range of psychosocial problems later in life. With the notable exception of heavy cannabis use, these problems appear to be largely accounted for by concurrent adolescent mental health disorders and substance use. Complex interventions addressing the domains of mental state, behaviour, and substance use are likely to be most successful in helping this susceptible group adjust to adult life.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a446fd27b477f588fe32c2477df171f6",
  "timestamp": "2025-05-15T03:28:17.594614"
}