{
  "id": 4622,
  "title": "Are dental care records in childhood associated with financial hardship in adulthood?",
  "abstract": "Introduction: Previous studies show that dental health is associated with educational and labour market outcomes, but it is unclear whether dental care records in childhood can serve as early markers of financial hardship risk in adulthood.Methods: Data on sociodemographic variables and dental records of all children born in Finland and who lived their childhood in the city of Espoo were obtained from national registers (n=1867). Debt defaults at the age of 23 years were used as a measure of adulthood financial hardship. Caries recorded in dental check-ups and unnotified absence from dental appointments in childhood were derived from electronic health systems. Logistic regression models were fitted to investigate the extent to which these variables were associated with financial hardship in adulthood before and after adjusting for parental social assistance use.Results: The odds of adulthood debt defaults were higher for people with caries before the age of 13 years (odds ratio 1.37, compared with people without) and for people with significant caries multiple times (odds ratio 2.07). Unnotified absences from dental checks were strongly associated with debt defaults. These associations were substantially reduced after adjusting the models for parental social assistance use.Conclusions: The association between childhood dental care records and adulthood financial hardship mainly reflects the fact that parental socioeconomic status links to dental records. Nevertheless, data from dental care could be used in targeting appropriate measures to prevent financial hardship later in life.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4471ed20814ce4bfa5b2c52a799e3fc",
  "timestamp": "2025-05-15T02:39:26.936094"
}