{
  "id": 4107,
  "title": "Optimal portfolio choices to split orders during supply disruptions: An application of sport's principle for routine sourcing",
  "abstract": "Sourcing in the face of supply chain disruptions has been one of the most challenging tasks in supply chain management, particularly when such disruptions occur due to natural calamities, such as flood, fire, and earthquake, affecting both the primary and the backup suppliers. Invariably, such disruptions lead to reduced supply from the primary supplier, encouraging the supplier to place fresh orders with the backup suppliers. In order to mitigate the adverse effect of supply disruption, in this article we use the concepts underlying the well-known Duckworth-Lewis-Stern method, used in cricket, to revise the supply target of the primary supplier and to decide a target for the backup supplier. We simulated the supply disruption scenarios in an experimental setting by conducting a two-round questionnaire survey among 300 purchase managers. The means and variances of the participants' estimates of probabilities of meeting the revised targets within the scheduled time for various model-generated supply scenarios were used to find the participants' risk preferences. In the second-round survey, the participants, clustered in groups of 10, ranked their own risk preferences. These ranks were used to find the optimal portfolio choices. Finally, we validated the theoretical predictions for the risk options using two approaches-one, at the group level by estimating the within- and the between-group risk preferences of buyers, and, two, at the aggregate level, by considering all the participants, fitting quantile regression model to the experimental results, and estimating the risk preference structures for different quantiles of the relative risk-return trade-off distributions.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a45bf9cf54d8c00f8929b8e66292c08a",
  "timestamp": "2025-05-15T01:23:58.043222"
}