{
  "id": 3913,
  "title": "Balancing prosperity and sustainability: unraveling financial risks and green finance through a COP27 lens",
  "abstract": "PurposeThis study aims to examine the relationship between financial development (FD), financial risk, green finance and innovation related to carbon emissions in the G7 economies.Design/methodology/approachThis quantitative study examines the roles that financial development [FD: Domestic credit to private sector by banks as percentage of gross domestic product (GDP)], economic growth (GDP: Constant US$ 2015), financial risk index (FRI), green finance (GFIN: Renewable energy public research development and demonstration (RD&D) budget as percentage of total RD&D budget), development of environment-related technologies (DERTI: percentage of all technologies) and human capital (HCI: index) have on the environmental quality of developed economies. Based on panel data, the study uses a novel approach method of moments quantile regression as a main method to tackle the issue of cross-sectional dependency, slope heterogeneity and nonnormality of the data.FindingsThe study confirms that increasing economic development increases emissions and negatively impacts the environment. However, efficient resource allocation, improved financial systems, and green innovation are likely to contribute to emission mitigation and the overall development of a sustainable viable economy. Furthermore, the study highlights the importance of risk management in financial systems for future emissions prevention.Practical implicationsThe study uses a reliable estimation procedure, which extends the discussion on climate policy from a COP-27 perspective and offers practical implications for policymakers in developing more effective emission mitigation strategies.Social implicationsThe study offers policy suggestions for a sustainable economy, focusing on both COP-27 and the G7 countries. Recommendations include implementing carbon pricing, developing carbon capture and storage technologies, investing in renewables and energy efficiency and introducing financial instruments for emission mitigation. From a COP-27 standpoint, the G7 should prioritize transitioning to low-carbon economies and supporting developing nations in their sustainability efforts to address the pressing challenges of climate change and global warming.Originality/valueIn comparison to the literature, this study examines the importance of financial risk for G7 economies in promoting a sustainable environment. More specifically, in the context of FD and national income with carbon emissions, previous researchers have disregarded the importance of green innovation and human capital, so the current study fills the gap in the literature related to G7 economies by exploring the link between the identified variables related to carbon emissions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4713d8f050783226a35448366213884",
  "timestamp": "2025-05-15T02:31:28.327300"
}