{
  "id": 6841,
  "title": "Study on the cut-off point and the influencing factors of distress in newly diagnosed breast cancer patients",
  "abstract": "Objective Our aim is to investigate the cut-off point of distress and the influencing factors associated with distress in patients with newly diagnosed breast cancer.Methods A cross-sectional survey of distress was conducted in 167 patients with newly diagnosed breast cancer admitted to the Department of General Surgery of a tertiary care hospital from July 2020 to March 2022. Patients completed the Hospital Anxiety and Depression Scale (HADS) and the Distress Thermometer (DT) questionnaire within 3 days of admission. The HADS >= 15 was used as the gold standard, and the cut-off point of the DT measure was analyzed using the Receiver Operating Characteristic (ROC) curve. The cut-off point obtained by ROC curve analysis was used to analyze the influencing factors of distress in breast cancer patients by univariate and multivariate regression analysis.Results A total of 167 patients completed the survey, with an average HADS score of 8.43 +/- 5.84 and a total HADS score of >= 15 in 37 (22.16%) patients, the mean DT score was 2.96 +/- 1.85. ROC curve analysis showed an area under the curve of 0.885, with a maximum Jorden index (0.723) at a DT score of 4, the sensitivity was 100.0% and specificity was 72.3%. There were 73 (43.71%) patients with DT score >= 4. Regression analysis showed that insurance/financial problems, dealing with partner problems, tension, bathing/dressing problems, pain, and sleep problems were independent risk factors for l distress in newly diagnosed breast cancer patients.Conclusion A DT score 4 is the cut-off point for distress in patients with newly diagnosed breast cancer. In clinical practice, target intervention should be carried out according to the risk factors of distress of patients.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a478fb016a59f72d0708768c044627dd",
  "timestamp": "2025-05-15T03:02:07.500969"
}