{
  "id": 7802,
  "title": "Financial toxicity of cancer treatment in India: towards closing the cancer care gap",
  "abstract": "BackgroundThe rising economic burden of cancer on patients is an important determinant of access to treatment initiation and adherence in India. Several publicly financed health insurance (PFHI) schemes have been launched in India, with treatment for cancer as an explicit inclusion in the health benefit packages (HBPs). Although, financial toxicity is widely acknowledged to be a potential consequence of costly cancer treatment, little is known about its prevalence and determinants among the Indian population. There is a need to determine the optimal strategy for clinicians and cancer care centers to address the issue of high costs of care in order to minimize the financial toxicity, promote access to high value care and reduce health disparities. MethodsA total of 12,148 cancer patients were recruited at seven purposively selected cancer centres in India, to assess the out-of-pocket expenditure (OOPE) and financial toxicity among cancer patients. Mean OOPE incurred for outpatient treatment and hospitalization, was estimated by cancer site, stage, type of treatment and socio-demographic characteristics. Economic impact of cancer care on household financial risk protection was assessed using standard indicators of catastrophic health expenditures (CHE) and impoverishment, along with the determinants using logistic regression. ResultsMean direct OOPE per outpatient consultation and per episode of hospitalization was estimated as (sic)8,053 (US$ 101) and (sic)39,085 (US$ 492) respectively. Per patient annual direct OOPE incurred on cancer treatment was estimated as (sic)331,177 (US$ 4,171). Diagnostics (36.4%) and medicines (45%) are major contributors of OOPE for outpatient treatment and hospitalization, respectively. The overall prevalence of CHE and impoverishment was higher among patients seeking outpatient treatment (80.4% and 67%, respectively) than hospitalization (29.8% and 17.2%, respectively). The odds of incurring CHE was 7.4 times higher among poorer patients [Adjusted Odds Ratio (AOR): 7.414] than richest. Enrolment in PM-JAY (CHE AOR = 0.426, and impoverishment AOR = 0.395) or a state sponsored scheme (CHE AOR = 0.304 and impoverishment AOR = 0.371) resulted in a significant reduction in CHE and impoverishment for an episode of hospitalization. The prevalence of CHE and impoverishment was significantly higher with hospitalization in private hospitals and longer duration of hospital stay (p < 0.001). The extent of CHE and impoverishment due to direct costs incurred on outpatient treatment increased from 83% to 99.7% and, 63.9% to 97.1% after considering both direct and indirect costs borne by the patient and caregivers, respectively. In case of hospitalization, the extent of CHE increased from 23.6% (direct cost) to 59.4% (direct+ indirect costs) and impoverishment increased from 14.1% (direct cost) to 27% due to both direct and indirect cost of cancer treatment. ConclusionThere is high economic burden on patients and their families due to cancer treatment. The increase in population and cancer services coverage of PFHI schemes, creating prepayment mechanisms like E-RUPI for outpatient diagnostic and staging services, and strengthening public hospitals can potentially reduce the financial burden among cancer patients in India. The disaggregated OOPE estimates could be useful input for future health technology analyses to determine cost-effective treatment strategies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a48019affe065d4c072c422f76559fe0",
  "timestamp": "2025-05-15T03:12:11.687216"
}