{
  "id": 2174,
  "title": "Measuring Risks of Confirming Warehouse Financing from the Third Party Logistics Perspective",
  "abstract": "Confirmation warehouse financing is an important model in supply chain finance. This type of financing has special characteristics due to the existence of the reverse repurchase link, and it increases the risk commitment of the core enterprise at a certain level. Previous research on supply chain financial risk mostly settled in 'all-industry, multi-model', ignoring the special risks of single mode. To supplement the vacancies in the current research, the special risks of supply chain finance should be identified under a single model. On this basis, a measurement index system for confirmation warehouse financing risk is created. The article uses a Back Propagation (BP) neural network to build a Third Party Logistics (3PL) perspective of the risk measurement model for confirmation warehouse financing. The said network is combined with the 24 sets of actual cases from ZY Logistics. MATLAB is used to train the sample data. Results show that the absolute errors-0.042998, -0.011102, 0.020514 and 0.039448-between the training value and the predicted value are smaller than the preset error value. Among the 24 cases, high-risk businesses reached 41.7%, whereas low-risk businesses only accounted for 29.2%. The ZY enterprise confirms that warehouse financial business risk is high, and this situation should be revised. Research shows that the risk measurement indicator system has good risk prediction ability. This study establishes and verifies the rationality of the risk measurement index system and provides a reliable reference for 3PL risk aversion in supply chain finance.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a48a29d48d34b98a735af795471bb7ee",
  "timestamp": "2025-05-15T02:12:17.364110"
}