{
  "id": 13,
  "title": "DESIGNING A PHRASE BANK FOR ACADEMIC LEARNING AND TEACHING: A EUROPEAN PORTUGUESE CASE STUDY",
  "abstract": ". Designing a Phrase Bank for Academic Learning and Teaching: A European Portuguese Case Study. This work focuses on the development and application of an academic phrase bank for European Portuguese. Our goal is to present an overview of this resource, discuss its potential replication in other languages, and explore its application in the classroom for teaching academic language. As the first of its kind resulting from corpora-based research, our phrase bank represents a contribution to the emerging field study of academic discourse in Portugal and a useful resource for students, teachers, and researchers. The paper begins by outlining the process of constructing the phrase bank, providing insights into the selection and categorization of formulaic academic phrases. We explore its accessibility options, including a web version and integration with a search engine powered by a Large Language Model. The paper then focuses on the findings and presents practical implementations of the phrase bank in educational settings. Outlined are two classroom activities incorporating the phrase bank, undertaken by master's students. The first activity entailed the revision of a group portfolio's introduction, employing the phrase bank to heighten awareness of communicative functions and expressions within introductions. The second activity involved peer assessment, where students evaluated their peers' literature reviews. This involved identifying communicative functions, analyzing, and rephrasing expressions related to authors and studies using the phrase bank. To facilitate the assessment, students utilized a choice board to offer constructive and considerate feedback to their classmates.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "LLMs",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a48f8a5368824163c64668337cf09c80",
  "timestamp": "2025-05-15T00:38:16.184354"
}