{
  "id": 8928,
  "title": "Correlates of elevated distress thermometer scores in breast cancer patients",
  "abstract": "Distress is prevalent in breast cancer patients and can be detrimental to quality of life, performance status, treatment adherence, and satisfaction with medical care. The National Comprehensive Cancer Network developed the distress thermometer (DT) as a self-assessment tool for screening distress in cancer patients. Given time and financial constraints, it is important to refine screening criteria to identify patients with elevated risk for distress. In this study, we identify clinical and epidemiological factors that are associated with an increased likelihood of elevated DT scores (a parts per thousand yen4 and a parts per thousand yen7). We assessed 229 female patients with the DT at their initial consultation for breast cancer at the Huntsman Cancer Hospital between September 2007 and December 2008. Descriptive statistics and logistic regression models were used to analyze DT and patient data. Patients undergoing their initial distress thermometer screening within 30 days of receiving a diagnosis of breast cancer had the highest likelihood of scoring a parts per thousand yen4 and a parts per thousand yen7 on the DT screening tool. Emotional and physical concerns were associated with scores a parts per thousand yen4 and scores a parts per thousand yen7. Spiritual concerns became significant in patients reporting scores a parts per thousand yen7. Patients who were non-Caucasian, unemployed, had a prior history of depression, presented for recurrent disease, or who had been recently diagnosed had a higher likelihood of scores a parts per thousand yen4 and scores a parts per thousand yen7. Four groups of patients should be targeted for aggressive screening; patients with a prior diagnosis of depression, patients presenting with recurrent disease, unemployed patients, and non-Caucasian patients. Interventions should address physical, emotional, and spiritual concerns.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a49352a2bfcdfaa389ea5e60b4f4da01",
  "timestamp": "2025-05-15T03:23:56.054159"
}