{
  "id": 5388,
  "title": "Exercise addiction and its related factors in amateur runners",
  "abstract": "Background and aims: This study examines exercise addiction (EA) in amateur runners from a multidimensional approach, including demographics (age, sex, educational attainment, and financial situation), training factors (duration of running activity, weekly time spent running, mean workout distance per session, other sports activities, and childhood physical activity), psychological features (perceived health, life satisfaction, loneliness, stress, anxiety, depression, body shape, and eating disorders), and anthropometrics (body mass index) that might predict EA. Methods: The well-validated Exercise Dependence Scale (EDS) was applied to evaluate the prevalence of EA in amateur runners. A multinomial logistic regression was performed to find explanatory variables of risk of EA using the SPSS 24.0 statistical software. Results: A total of 257 runners (48.9% females, M-age = 40.49, SD = 8.99 years) with at least 2 years running activity participated in an anonymous questionnaire survey. About 53.6% of respondents were characterized as non-dependent symptomatic and 37.8% as non-dependent asymptomatic. About 8.6% had prevalence of being at risk of EA. The logistic regression model displayed five variables that significantly predicted the risk of EA: (a) anxiety, (b) loneliness, (c) weekly time spent running, (d) childhood physical activity, and (e) education level. Discussion and conclusions: Findings indicate that loneliness and anxiety may lead to withdrawal and uncontrolled behavior that in turn leads to increased amount of exercise in amateur runners. Lower level of education attainment is also a likely risk of EA development, and childhood sports activity is a predictor.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4a19c8e8a37553f46222ae812928cf6",
  "timestamp": "2025-05-15T02:47:13.984188"
}