{
  "id": 3959,
  "title": "Cost-effectiveness of an adherence-enhancing intervention for gout based on real-world data",
  "abstract": "AimMedication non-adherence influences outcomes of therapies for chronic diseases. Allopurinol is a cornerstone therapy for patients with gout; however, non-adherence to allopurinol is prevalent in Singapore and limits its effectiveness. Between 2008-2010, an adherence-enhancing program was implemented at the rheumatology division of a public tertiary hospital. The cost-effectiveness of this program has not been fully evaluated. With healthcare resources being finite, the value of investing in adherence-enhancing interventions should be ascertained. This study aims to evaluate the cost-effectiveness of this adherence-enhancing program to inform optimal resource allocation toward better gout management. MethodAdopting a real-world data approach, we utilized patient clinical and financial records generated in their course of routine care. Intervention and control groups were identified in a standing database and matched on nine risk factors through propensity score matching. Cost and effect data were followed through 1-2years. A decision tree was developed in TreeAge using a societal perspective. Deterministic and probabilistic sensitivity analyses were performed to assess parameter uncertainty. ResultsAt an assumed willingness-to-pay threshold of $50000 USD ($70000 SGD) per quality-adjusted life year (QALY), the intervention had an 85% probability of being cost-effective compared to routine care. The incremental cost-effectiveness ratio was $12866 USD per QALY for the base case and ranged from $4139 to $21593 USD per QALY in sensitivity analyses. ConclusionThe intervention is cost-effective in the short-term, although its long-term cost-effectiveness remains to be evaluated.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4b8401296e6518acdd38c08bafe05b8",
  "timestamp": "2025-05-15T02:31:28.523596"
}