{
  "id": 8598,
  "title": "An Evaluation of Risk Factors for Patient No Shows at an Urban Joint Arthroplasty Clinic",
  "abstract": "Background: Patient physical health and provider financial health are both affected when patients are unable to attend scheduled clinic appointments. The purpose of this study is to identify risk factors for patients missing appointments to better target interventions to improve appointment attendance. Methods: We reviewed scheduled arthroplasty appointments at an urban academic orthopaedic clinic over a 3-year period. We collected information including sex, race, distance to clinic, language, insurance, median income of home zip code, appointment day, time, precipitation, and temperature. Mixed-level multiple logistic regression was used to model the odds of missing appointments in Stata v14. Results: Overall, 8,185 visits for 3,081 unique patients were reviewed and 90.7% of appointments were attended. After controlling for time and day of appointment, distance from the clinic, and the primary language spoken, patients with government insurance were two times as likely to miss an appointment compared with privately insured patients. White patients were two times as likely to attend scheduled appointments compared with black/Hispanic patients. Younger patients (<50 years) and older patients (>73 years) were 2.7 times and 1.8 times, respectively, more likely to miss appointments compared with those aged between 65 and 72 years. Appointments on the most temperate days were more likely to be missed, and those on the coldest days (14 degrees F to 36 degrees F) and warmest days (69 degrees F to 89 degrees F) were less likely to be missed. Discussion: Appointment no shows are associated with sociodemographic and environmental factors. This information is valuable to help better delineate novel ways to better serve these patient populations.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4bb38aa9421abbb99a8973ff8532b35",
  "timestamp": "2025-05-15T03:20:22.315315"
}