{
  "id": 6293,
  "title": "Multi-task Cox Proportional Hazard Model for Predicting Risk of Unplanned Hospital Readmission",
  "abstract": "Unplanned hospital readmissions are a tremendous challenge faced by medical providers in the United States: In 2015, 17.8% of Medicare and Medicaid patients returned to the hospital within 30 days of discharge. An unplanned readmission marks a setback in a patient's recovery and burdens hospitals financially--the estimated national cost of caring for readmitted patients is $15 billion annually. Financial penalties from the Center for Medicare & Medicaid Services intensify these costs, penalizing hospitals with high rates relative to the national average. At the University of Virginia Medical Center, the Medicare & Medicaid risk-adjusted readmission rate of 16.8% is higher than the national average of 15.2%. This higher than average rate leads to penalties, which are estimated at $ 764,000 for the 2017 fiscal year. The UVA Medical Center prioritizes reducing their readmission rate and has invested time and resources towards modeling readmission risks for their patients. Our research aims to improve the accuracy of risk projections at the Medical Center by exploring alternatives to current models. We developed a Cox proportional hazard model that takes in a set of covariates as input and predicts a patient's risk of readmission. The model had a concordance index of 0.70 resulting from 10-fold cross validation after applying the model to a test set. The Cox proportional hazard model was expanded using multi-task learning, a novel approach for survival analysis that is commonly used in classification. The new multitask Cox proportional hazard model resulted in a concordance index of 0.52. Accurately predicting a patient's readmission risk will assist the UVA Medical Center in targeting high-risk patients during outpatient and follow-up care. Medical providers will be able to utilize the modeling output to better understand factors that influence the risk of readmission.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4c5607c39fb19e17ef8ec87003ed27d",
  "timestamp": "2025-05-15T02:56:37.500314"
}