{
  "id": 7168,
  "title": "Employment outcomes among cancer patients in the United States",
  "abstract": "Background: Cancer diagnosis and treatment can lead to disruptions in employment, which can, in turn, lead to financial problems and uninsurance. We used a nationally representative survey to describe predictors of nonemployment among cancer patients compared to a matched cohort of individuals without cancer. Methods: This was a retrospective study of the 2005-2018 nationally representative Medical Expenditure Panel Survey. We included respondents aged 18-64 and identified the cohort with current cancer by healthcare utilization related to a cancer diagnosis in the given year. We propensity-score matched controls to cancer cases in a 2:1 ratio. Survey weights were applied to generate national estimates of non-employment among the study cohort compared to the overall U.S. population. The Adjusted Wald test was used to compare employment outcomes between groups. Weighted multivariable linear regression was utilized to assess factors independently associated with non-employment. Results: An estimated annual mean of 3.9 million cancer patients in the U.S. were included. Relative to controls, cancer patients had higher rates of part-year (36.0% vs 28.3%, P < 0.0001) and full-year non-employment (22.7% vs 17.5%, P < 0.0001). In a multivariable model, cancer diagnosis was associated with a 6.8% higher risk of part-year non-employment, 4.1% higher risk of full-year non-employment, and 14.8% lower individual earnings relative to the matched U.S. population. Sub-groups of cancer patients at high risk of negative employment outcomes included those enrolled in Medicaid, those without a high school degree, and those with high healthcare utilization. Low family income was the strongest predictor of non-employment. Conclusion: Cancer patients were at greater risk of non-employment relative to matched controls and adverse employment outcomes disproportionately affected cancer patients from vulnerable populations.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4d4143d071c61e4cbeb1f802eaeeeb0",
  "timestamp": "2025-05-15T03:06:01.104391"
}