{
  "id": 8028,
  "title": "Caregiver burden and familial impact in Down Syndrome Regression Disorder",
  "abstract": "BackgroundDown Syndrome Regression Disorder (DSRD) is an acute or subacute neurocognitive regression in individuals with Down syndrome (DS), characterized by a loss of previously acquired cognitive, adaptive, and social skills. DSRD profoundly affects individuals' ability to engage in activities of daily living, making them highly dependent on their caregivers who must provide significantly more support than before the DSRD diagnosis. This study aimed to examine caregiver burden, quality of life, and depression among caregivers of individuals with DSRD versus caregivers of those with DS and other neurological disorders (DSN). Design/MethodsIn this cross-sectional study, caregivers of individuals with DSRD (n = 228) and DSN (n = 137) were recruited through Children's Hospital Los Angeles neurology clinic and a Facebook DSRD support group. Participants completed standardized questionnaires assessing quality of life (PedsQL Family Impact Module), caregiver burden (Zarit Caregiver Burden Assessment, ZCB), and depression (Glasgow Depression Scale, GDS), along with additional items addressing other factors of caregiver well-being. Data were analyzed using bivariate comparisons and univariate regression models to assess differences between groups. ResultsCaregivers of individuals with DSRD were more likely than caregivers of those with DSN to report increased financial burden (p = 0.003), housing changes (p = 0.02), disrupted sleep (p < 0.001), negative impacts on social networks (p < 0.001), and worsened mental health (p < 0.001). Furthermore, DSRD caregivers reported significantly higher levels of burden (mean difference [95% CI]: 8.3 [6.3, 9.7]) and depression symptoms (2 [0.7, 3.4]), reflecting greater perceived stress and burden. They also had lower quality of life scores (-27.9 [-30.2, -25.5]), indicating a more substantial impact on overall well-being and daily functioning compared to DSN caregivers. Additionally, caregivers in the DSRD group had higher odds (odds ratio [95% CI]: 4.7 [2.9, 7.7)] of meeting clinical depression criteria (GDS score >= 13) than caregivers in the DSN group. ConclusionsCaregivers of individuals with DSRD experience significantly greater distress and burden compared to those caring for individuals with DSN. The elevated risk of depression, combined with reduced quality of life and increased burden, underscores the multimodal nature of the challenges faced by this population.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4d60869417c0c969f6e14ac89f27658",
  "timestamp": "2025-05-15T03:14:37.297840"
}