{
  "id": 9293,
  "title": "Effects of supplementing colostrum beyond the first day of life on growth and health parameters of preweaning Holstein heifers",
  "abstract": "The preweaning period for a dairy calf is characterized by high morbidity and mortality rates, leading to financial losses for producers. Identifying strategies to improve the health and welfare of calves while reducing antimicrobial use continues to be crucial to the success of the dairy industry. The objective of this study was to determine the effects of feeding colostrum replacer (CR) to dairy heifer calves beyond d 1 of life on growth, serum IgG, the incidence of diarrhea and bovine respiratory disease (BRD), and the risk of mortality in the preweaning period. At birth, Holstein heifer calves (n = 200; 50/treatment) weighing 40.7 +/- 0.35 kg (mean +/- SE) were fed 3.2 L of CR (205 g IgG/feeding) at 0 h and 12 h of life. Calves were then randomly assigned to 1 of 4 treatments: 450 g of milk replacer (MR) from d 2 to 14 (control, CON), 380 g of CR + 225 g of MR from d 2 to 3, then 450 g of MR from d 4 to 14 (transition, TRAN), 45 g of CR + 450 g of MR from d 2 to 14 (extended, EXT); or 380 g of CR + 225 g of MR from d 2 to 3, then 45 g of CR + 450 g of MR from d 4 to 14 (transition + extended, TRAN+EXT). Each treatment was reconstituted to 3 L and fed twice daily. All CR treatments were fed using bovine-derived CR containing 27% IgG. From d 15 to 41, all calves were fed 600 g of MR reconstituted to 4 L twice daily. Body weight was recorded at birth and every 7 d until study completion on d 49. Blood samples were taken daily until d 7 to evaluate serum IgG and then every 7 d until d 49. A health assessment was performed daily to evaluate calves for BRD and diarrhea. Data were analyzed using mixed linear regression, mixed logistic regression, and survival analysis models in SAS 9.4. Serum IgG concentrations were not affected by treatment for the study period. The EXT and TRAN+EXT groups had greater average daily gain (ADG) from d 7 to 14 (0.14 kg/d) and the TRAN group had greater ADG from d 14 to 21 (0.11 kg/d), compared with CON. There was no association of treatment with the odds or the duration of a diarrhea bout. However, provision of CR to the TRAN and EXT calves was associated with a reduced hazard of diarrhea compared with CON calves. Furthermore, TRAN and EXT calves have a lower hazard of mortality compared with CON calves, with TRAN and EXT calves had a 2.8- and 3.8 -times lower hazard of mortality, respectively. Our findings suggest that the supplementation of CR to dairy calves positively affects ADG, and reduces the hazard of diarrhea and mortality during the preweaning period. Future research should look to further refine the supplementation strategy of CR to calves and explore the mechanism of action.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4ea6b70d37591701ff0c5bd753b5f0b",
  "timestamp": "2025-05-15T03:27:25.006541"
}