{
  "id": 5744,
  "title": "The impact of risk management on business performance: case of Algerian construction organizations",
  "abstract": "The purpose of this study is to present a new model, based on a systemic approach, to analyze the different relationships that may exist between the risk, its management and the performance of the construction companies. Moreover, the process approach used is based first on the classification of different risks in building sector, which are then transferred to the process defined by four main activities of risk management system (RMS), namely identification, analysis, assessment and treatment of risks. In addition, external and internal functional analyses of the RMS using the application of business techniques called APTE method were conducted to describe the process that will link the types of risks to the performance of building companies. The latter is measured according to four perspectives: financial, customers, internal business process, and learning and growth. Hypotheses put in place will be tested, empirically, using a questionnaire to be distributed to customers of our system, the CEO and employees of the construction companies. Finally, the proposed model will provide a new vision on the implementation of RM in Algerian construction companies to manage risks, not only to seize the profit but also to remain competitive and survive in an increasingly dynamic world.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4f6d4fc5c349d3448ad1baa3fb52d32",
  "timestamp": "2025-05-15T02:50:53.940319"
}