{
  "id": 6105,
  "title": "Predictability of cryptocurrency returns: evidence from robust tests",
  "abstract": "The paper provides a comparative empirical study of predictability of cryptocurrency returns and prices using econometrically justified robust inference methods. We present robust econometric analysis of predictive regressions incorporating factors, which were suggested by Liu, Y., & Tsyvinski, A. (2018). Risks and returns of cryptocurrency. NBER working paper no. 24877; Liu, Y., & Tsyvinski, A. (2021). Risks and returns of cryptocurrency. The Review of Financial Studies, 34(6), 2689-2727, as useful predictors for cryptocurrency returns, including cryptocurrency momentum, stock market factors, acceptance of Bitcoin, and Google trends measure of investors' attention. Due to inherent heterogeneity and dependence properties of returns and other time series in financial and crypto markets, we provide the analysis of the predictive regressions using both heteroskedasticity and autocorrelation consistent (HAC) standard-errors and also the recently developed t -statistic robust inference approaches, Ibragimov, R., & Muller, U. K. (2010). t-statistic based correlation and heterogeneity robust inference. Journal of Business and Economic Statistics, 28, 453-468; Ibragimov, R., & Muller, U. K. (2016). Inference with few heterogeneous clusters. Review of Economics and Statistics, 98, 83-96. We provide comparisons of robust predictive regression estimates between different cryptocurrencies and their corresponding risk and factor exposures. In general, the number of significant factors decreases as we use more robust t-tests, and the t-statistic robust inference approaches appear to perform better than the t-tests based on HAC standard errors in terms of pointing out interpretable economic conclusions. The results in this paper emphasize the importance of the use of robust inference approaches in the analysis of economic and financial data affected by the problems of heterogeneity and dependence.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a4fbaebd4907fd28ab4b6628e8c42e00",
  "timestamp": "2025-05-15T02:54:39.138907"
}