{
  "id": 931,
  "title": "Patients' and Providers' Perspectives on and Needs of Telemonitoring to Support Clinical Management and Self-care of People at High Risk for Preeclampsia: Qualitative Study",
  "abstract": "Background: Preeclampsia is one of the leading causes of maternal mortality worldwide, with a global prevalence at 2%-8% of pregnancies. Patients at high risk for preeclampsia (PHRPE) have an increased risk of complications, such as fetal growth restriction, preterm delivery, abnormal clotting, and liver and kidney disease. Telemonitoring for PHRPE may allow for timelier diagnosis and enhanced management, which may improve maternal and perinatal outcomes. Objective: The objective of this study is to determine the perceptions and needs of PHRPE and their health care providers with respect to telemonitoring through semistructured interviews with both groups. This study explored (1) what the needs and challenges of monitoring PHRPE are during pregnancy and in the postpartum period and (2) what features are required in a telemonitoring program to support self-care and clinical management of PHRPE. Methods: This study used a qualitative descriptive approach, and thematic analysis was conducted. PHRPE and health care providers from a high-risk obstetrical clinic in a large academic hospital in Toronto, Canada, were asked to participate in individual semistructured interviews. Two researchers jointly developed a coding framework and separately coded each interview to ensure that the interviews were double-coded. The software program NVivo version 12 was used to help organize the codes. Results: In total, 7 PHRPE and 5 health care providers, which included a nurse practitioner and physicians, participated in the semistructured interviews. Using thematic analysis, perceptions on the benefits, barriers, and desired features were determined. Perceived benefits of telemonitoring for PHRPE included close monitoring of home blood pressure (BP) measurements and appropriate interventions for abnormal BP readings; the development of a tailored telemonitoring system for pregnant patients; and facilitation of self-management. Perceived barriers to telemonitoring for PHRPE included financial and personal barriers, as well as the potential for increased clinician workload. Desired features of a secure platform for PHRPE included the facilitation of self-management for patients and decision making for clinicians, as well as the inclusion of evidence-based action prompts. Conclusions: The perceptions of patients and providers on the use of telemonitoring for PHRPE support the need for a telemonitoring program for the management of PHRPE. Recommendations from this study include the specific features of a telemonitoring program for PHRPE, as well as the use of frameworks and design processes in the design and implementation of a telemonitoring program for PHRPE.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a5017217b791729afe26cfb87baefbc0",
  "timestamp": "2025-05-15T01:44:35.408230"
}