{
  "id": 3950,
  "title": "Understanding the use of digital finance among older internet users in urban China: Evidence from an online convenience sample",
  "abstract": "Inclusive digital financial services should welcome older populations and make them beneficiaries of the digital and financial revolution. To understand older adults' experience of using digital financial tools, we conducted an online survey of 268 older internet users aged 60 or above from urban areas of 14 Chinese provinces after China's nationwide COVID-19 lockdown in 2021. Our results revealed that older internet surfers were active in digital financial activities and engaged most with activities that were highly compatible with their lifestyles. Active users significantly differed from inactive users in sociodemographics, confirming that a digital divide related to social stratification exists among older internet users. Digital finance active users were also distinguished from inactive users' attitudes and perceptions toward digital finance. Logistic regression results indicated that perceived usefulness, access to proper devices for digital finance, risk perceptions, and perceived exclusion if not using technology were associated with their adoption of these advanced tools. Older adults reported the perceived inconvenience of in-person financial services during the lockdown. They also expressed a willingness to participate in relevant training if provided. The findings of this study could help aging-related practitioners to understand older adults' engagement in digital finance and guide policy and project design in the area of financial inclusion of the aging population.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a505dcf9414b0eb50aafa9058626810b",
  "timestamp": "2025-05-15T02:31:28.474888"
}