{
  "id": 8817,
  "title": "Comorbidities in Difficult-to-Control Asthma",
  "abstract": "BACKGROUND: Difficult-to-control asthma is associated with significant medical and financial burden. Comorbidities are known to contribute to uncontrolled asthma. Better insight into the prevalence, nature, and risk factors of comorbidities may optimize treatment strategies in patients with difficult-to-control asthma and decrease disease burden. OBJECTIVES: The objectives of this study were to assess the prevalence, number, and type of comorbidities in difficult-to-control asthma compared with not-difficult-to-control asthma, and to investigate whether specific patient characteristics are associated with particular comorbidities. METHODS: A total of 5,002 adult patients with a prescription for high-dose (> 1,000 mu g) fluticasone or oral corticosteroids, extracted from 65 Dutch pharmacy databases, were sent questionnaires about patient characteristics. Of the 2,312 patients who returned the questionnaires, 914 were diagnosed with difficult-to-control asthma. Diagnoses of comorbidities (gastro-esophageal reflux, nasal polyps, cardiovascular disease, anxiety/depression, obesity, and diabetes) were based on treatment prescriptions or questionnaires. Associations were assessed using multivariable logistic regression analyses. RESULTS: A total of 92% of patients with difficult-to-control asthma had >= 1 comorbidity. Patients with difficult-to-control asthma had more comorbidities (mean +/- SD comorbidities 2.22 +/- 1.27 vs 1.69 +/- 1.32; P < .01), and a significantly higher prevalence of each comorbidity, compared with patients with not-difficult-to-control asthma, except for diabetes and nasal polyposis. Comorbidities were associated with specific patient characteristics, including older age, female gender, smoking history, and chronic prednisone use. CONCLUSIONS: Almost all patients with difficult-to-control asthma have comorbidities, in particular asthmatic women of older age, former smokers, and asthmatics who are prednisone dependent. Recognition of these typical characteristics can help physicians in the diagnostic workup, so that adequate preventive measures can be taken. (C) 2017 American Academy of Allergy, Asthma & Immunology",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a50d58a67a299a9dcd1ee44fe5232edd",
  "timestamp": "2025-05-15T03:22:57.851691"
}