{
  "id": 4053,
  "title": "Predictors of Maternal Distress Among Mothers in Economic Hardship: A Classification and Regression Tree Analysis (CART)",
  "abstract": "A recurrent observation in poverty research is the association between many attendant stress factors and the high incidence of maternal distress. In this study, we reason that such risk factors do not preclude mothers from possessing adaptive capacities, through perceived parenting efficacy and family hardiness, as buffers against two common distress sources in low socioeconomic status (SES) households-perceived children's emotional and behavioral problems, and family's economic hardship. Using classification and regression tree analysis, we examined the moderating roles of these maternal factors in emotional distress with 513 Singaporean mothers of elementary school-age children on government financial scheme. The study affirmed that this low-resource population is not homogeneous in their perceived levels of distress and adaptive resources. These factors moderated mothers' distress along different pathways. Parenting efficacy emerged as the most important predictor across different maternal distress levels. Perceived family hardiness behaved in a unique way, evident only with mothers who reported moderate-severe distress levels. Almost half the respondents reported normal-mild distress levels. Economic hardship did not emerge as a significant predictor. The findings reiterate the usefulness of attending to both situation-specific personal efficacy beliefs and trait-like family hardiness in their potential values to buffer mothers living under economic strain. Research and practice implications were identified.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a51414bc6bac54289fa18ff9649cd9bc",
  "timestamp": "2025-05-15T02:32:27.627561"
}