{
  "id": 7896,
  "title": "Female directors and working capital management: aggressive vs. conservative strategy",
  "abstract": "Purpose The purpose of this study is to analyze the impact of board gender diversity (BGD) on working capital management (WCM) decision by scrutinizing different positions covered by female board directors. Design/methodology/approach This study uses a panel data regression model with fixed effect estimations and the generalized method of moments (GMM) to determine the impact of BGD on WCM strategy. This study uses a panel data analysis for 277 non-financial firms listed on Bursa Malaysia over the period from 2011 to 2019. Findings The results of this study show that female directors fulfilling either monitoring or executive positions increase the investment in working capital (WC), suggesting a conservative WCM. Precisely, results from this study are consistent with the embedded risk aversion traits of female executives and, hence, preserve high level of investment in WC, which allows superior levels of liquidity to meet firms' financial commitments. The results also show that Malaysia commitment to gender equality is a key moderator in the female directors - firm WCM relation. The authors find that when the level of gender equality is greater, female directors support firms in adopting aggressive WCM strategies. Practical implications This study's findings provide insights for corporate decision-makers in helping them to determine the board's design in term of roles and composition that enhances the efficiency of WC. The results also provide guidelines for policymakers and regulators to formulate strategies that support more female board representation. In this way, firms should appoint more female directors on their boards to ensure prudent WC decisions. Moreover, given that female directors are an important determinant of a firm's WC policy, investors and various internal or external monitoring groups need to factor boardroom gender diversity into their investing, hiring and monitoring mechanisms. Originality/value While prior research has examined the effect of BGD on firm performance, to the best of the authors' knowledge, this study is the first to investigate the effect of BGD on the WCM decision.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a51f98f1fd5e279ebd3a7f880a2d703c",
  "timestamp": "2025-05-15T03:13:04.952594"
}