{
  "id": 5879,
  "title": "A Study of the Effects of Exchange Rates on the Stock Companies in the Petrochemical Industry of the Eurozone",
  "abstract": "Considering the importance of the petrochemical industry as one of the strategic sectors in the eurozone economy, this study aims to evaluate the relationship between exchange rate fluctuations and stock market prices in the eurozone petrochemical industry. This paper applies Jorion's model and panel regression framework to monthly data spanning from 2002 to 2018. Panel regressions were estimated for three periods: the whole sample, the period before the financial crisis, and the period after the crisis. These divisions allowed for the testing of the persistence of exchange rate exposure in the petrochemical sector over time. This paper provides evidence of the magnitude of the impact of exchange rate shocks. Additionally, this paper shows that the petrochemical sector of the eurozone was exposed to significant exchange rate risk at the 1 percent level during the whole sample period and that this exposure was still present even after we split the test period into the precrisis and postcrisis datasets. However, foreign exchange rate exposure increased after the start of the financial crisis in 2008. The negative coefficient of the variable representing exposure suggests that the depreciation of the euro was followed by an increase in the stock returns of the petrochemical companies in the eurozone.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a52069bcc52df1f7ff1405fe41eccb0e",
  "timestamp": "2025-05-15T02:52:31.400542"
}