{
  "id": 6746,
  "title": "Patterns of Limitation in Physical Function in Late Midlife Associated with Late-Onset Alzheimer's Disease and Related Dementias: A Cluster Analysis",
  "abstract": "Background: To reduce the increasing societal and financial burden of Alzheimer's disease and related dementias (ADRD), prevention is critical. Even small improvements of the modifiable dementia risk factors on the individual level have the potential to lead to a substantial reduction of dementia cases at the population level. Objective: To determine if pattern(s) of functional decline in midlife associate with late-onset ADRD years later. Methods: Using a longitudinal study of adults aged 51-59 years in 1998 without symptoms of ADRD by 2002 and followed them from 2002 to 2016 (n = 5404). The outcome was incident ADRD identified by the Lange-Weir algorithm, death, or alive with no ADRD. We used cluster analysis to identify patterns of functional impairment at baseline and multinomial regression to assess their association with future ADRD. Results: Three groups of adults with differing patterns of functional impairment were at greater risk of future ADRD. Difficulty with climbing one flight of stairs was observed in all adults in two of these groups. In the third group, 100% had difficulty with lifting 10 pounds and pushing or pulling a large object, but only one-fourth had difficulty in climbing stairs. Conclusion: Results imply that improved large muscle strength could decrease future risk of ADRD. If confirmed in other studies, screening for four self-reported measures of function among adults in midlife may be used for targeted interventions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a53197d3303efd0a6f3454bd5ffde7ee",
  "timestamp": "2025-05-15T03:01:03.628696"
}