{
  "id": 310,
  "title": "Energy price prediction based on decomposed price dynamics: A parallel neural network approach",
  "abstract": "The growing uncertainties of the world due to geographic tensions, and weather conditions challenge the traditional method to achieve a reliable price prediction of energy future for both asset pricing and risk management. Following the initial success of deep learning models in energy price prediction, we attempt to establish a better architecture of neural networks to improve the prediction accuracy. We propose a novel Parallel Hybrid Neural Network (PHNN) model that utilizes independent sub-networks to effectively capture the distinct features of various sequences. Empirical results demonstrate that the PHNN model exhibits a significant performance enhancement of 16.68%, 14.09%, and 2.34% over the EMD-LSTM, the informer model, and the single LSTM model, respectively. In particular, the PHNN outperforms the single LSTM, which is trained on the same inputs, by 2.34% overall while by a remarkable 4.11% during event periods. This suggests that the PHNN derives notable benefits from its distinct architecture, particularly during the initial phase of extreme events characterized by significant price trend changes. Additionally, the study explores the potential benefits of incorporating additional event-tracking indicators for energy futures price forecasting. However, the findings suggest that these indicators may not consistently provide effective complementary information.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a5335f041e56e2281fdd39322013c36c",
  "timestamp": "2025-05-15T01:30:46.300612"
}