{
  "id": 11,
  "title": "Financial Risk Early Warning Based on Wireless Network Communication and the Optimal Fuzzy SVM Artificial Intelligence Model",
  "abstract": "Since the beginning of the new century, risk events such as the world economic crisis have occurred, which have greatly impacted the real economy of our country. A wireless network is a network implemented using wireless communication technology. It includes both global voice and data networks that allow users to establish long-distance wireless connections, as well as infrared technology and radio frequency technology optimized for short-distance wireless connections. These events have a great impact on many small- and medium-sized listed companies, resulting to many small- and medium-sized listed companies going bankrupt. Indeed, one of the important reasons for the frequent bankruptcy of small- and medium-sized listed companies is the lack of awareness of risk prevention and effective financial risk early warning mechanism. The support vector machine is a machine learning method based on the VC dimension theory of statistical learning and the principle of structural risk minimization. This method shows many unique advantages when dealing with classification problems and has been widely used in many fields. The purpose of this article is to realize the financial risk analysis of listed companies through wireless network communication and the optimal fuzzy SVM artificial intelligence model, which help small- and medium-sized listed companies find abnormalities in their business management activities in advance and deal with market risks in a timely manner. Taking 81 small- and medium-sized listed companies as the research object, this paper chooses the small- and medium-sized listed companies in every quarter of 2018 as the research sample. By using the financial and nonfinancial data of small- and medium-sized listed companies and introducing the support vector machine (SVM) with the fuzzy method, the model of the fuzzy support vector machine (FSVM) is constructed. And the performance of the FSVM under four different kernel functions is compared and studied. At the same time, the performance of the FSVM is compared with other artificial intelligence models. The empirical results show that different kernel functions have different effects on the prediction performance of the FCM-SVM model. Under the Gauss radial basis function, the prediction accuracy of the FCM-SVM is over 86%. It can be seen that in predicting the financial crisis of small- and medium-sized listed companies, the FCM-SVM model with Gauss radial basis function has the best predictive performance. The FSVM model based on Gauss radial basis function not only has the advantages of linearity, being polynomial, and nonlinearity of neurons but also is significantly superior to the traditional artificial intelligence model.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a54d4fdb9838811a904ed76a09691608",
  "timestamp": "2025-05-15T01:45:16.463823"
}