{
  "id": 9429,
  "title": "Managing Specialty Medication Services Through a Specialty Pharmacy Program: The Case of Oral Renal Transplant Immunosuppressant Medications",
  "abstract": "BACKGROUND: Immunosuppressive medication therapy after organ transplantation is essential for preventing transplant rejection and minimizing the need for re-transplantations. Nonadherence to immunosuppressant therapy has been identified as a major risk factor for acute complications and allograft rejection, as well as late graft rejection, and a return to dialysis after failed renal transplantation, leading to an increase in health care costs and potentially even death. OBJECTIVE: To evaluate clinical and economic outcomes of a mandatory transplant specialty pharmacy program implemented for the membership of a national commercial health plan for post-renal transplantation patients, as compared with membership using traditional retail pharmacy services. This program was delivered by a designated specialty pharmacy, which met requirements for contracted rates and provision of clinical programs and services. METHODS: The study is a 1-year retrospective claims analysis after the implementation of a transplant specialty pharmacy program that, in addition to medication dispensing, includes adherence and clinical management programs, patient education, and counseling services provided by transplant pharmacology experts. Renal transplant patients using the specialty pharmacy program were matched to those using retail pharmacies utilizing a propensity score-matching technique based on logistic regression. Primary outcomes were financial, which included pharmacy medication costs, medical Inpatient and outpatient costs, and overall health care costs. Patient adherence to transplant medication therapy and health care resource utilization were also evaluated. One-year outcomes post-specialty pharmacy program implementation were compared between the two groups with t-tests for continuous variables and chi-square tests for nominal variables. RESULTS: After propensity score matching, 519 patients were identified per group for analysis. Baseline parameters were similar between the two groups. The mean total health care cost during 1 year of follow-up was 13% lower in the specialty pharmacy program group ($24,315 vs. $27,891, P=0.03). Similarly, the mean transplant-related medical cost was 30% lower in the specialty pharmacy program group ($5,960 vs. $8,486; P=0.04), with lower cost, although not statistically significant, in both the dialysis-related and the nondialysis-related costs. The transplant-related office visit costs ($395 vs. $555; P=0.04) were significantly lower for the specialty pharmacy program cohort, while the inpatient and outpatient transplant-related costs were lower but not statistically significant in the specialty program. The weighted medication procession ratio (MPR) was higher (0.87 vs. 0.83; P<0.0001); the number of patients with a medication gap or who discontinued was lower (65 vs. 142; P<0.0001) in the specialty pharmacy program members than in the retail pharmacy members. CONCLUSIONS: This specialty pharmacy program is associated with lower transplant-related medical costs and lower overall health care costs, as well as higher transplant medication adherence within the first year of evaluation. The positive impact of health plan program design and coordinated care and oversight by transplant pharmacology experts in a specialty pharmacy program has Implications for the current health care reform and requires more research. Copyright (C) 2013, Academy of Managed Care Pharmacy. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a54de1666df9f67fa7f5208c4e7c8064",
  "timestamp": "2025-05-15T03:28:46.279391"
}