{
  "id": 7335,
  "title": "Association of Social and Behavioral Risk Factors With Earlier Onset of Adult Hypertension and Diabetes",
  "abstract": "IMPORTANCE The National Academy of Medicine has recommended incorporating information on social and behavioral factors associated with health, such as educational level and exercise, into electronic health records, but questions remain about the clinical value of doing so. OBJECTIVE To examine whether National Academy of Medicine-recommended social and behavioral risk factor domains are associated with earlier onset of hypertension and/or diabetes in a clinical population. DESIGN, SETTING, AND PARTICIPANTS This prospective cohort study used data collected from April 1, 2005, to December 31, 2016, from a population-based sample of 41 745 patients from 4 cycles of Kaiser Permanente Northern California's Adult Member Health Survey, administered to members at 19 Kaiser Permanente Northern California medical center service populations. The study used Kaplan-Meier survival tables and Cox proportional hazards regression analysis to estimate the onset of hypertension and diabetes among patients with no indication of disease at baseline. Data analysis was performed from June 2, 2017, to March 26, 2019. EXPOSURES Race/ethnicity, educational level, financial worry, partnership status, stress, intimate partner violence, concentrated neighborhood poverty, depressive symptoms, infrequent exercise, smoking, heavy alcohol consumption, and cumulative social and behavioral risk. MAIN OUTCOMES AND MEASURES Onset of hypertension and diabetes during the 3.5 years after survey administration. RESULTS The study included 18 133 people without baseline hypertension (mean [SD] age, 48.1 [15.3] years; 10 997 [60.7%] female; and 11 503 [63.4%] white) and 35 788 people without baseline diabetes (mean [SD] age, 56.2 [16.9] years; 20 191 [56.4%] female; and 24 351 [68.0%] white). There was a dose-response association between the number of social and behavioral risk factors and likelihood of onset of each condition. Controlling for age, sex, race/ethnicity, body mass index, and survey year, hazard ratios (HRs) comparing those with 3 or more risk factors with those with 0 risk factor were 1.41 (95% CI, 1.17-1.71) for developing hypertension and 1.53 (95% CI, 1.29-1.82) for developing diabetes. When the same covariates were adjusted for, having less than a high school educational level (hazard ratio [HR], 1.84; 95% CI, 1.40-2.43), being widowed (HR, 1.38; 95% CI, 1.11-1.71), concentrated neighborhood poverty (HR, 1.26; 95% CI, 1.00-1.59), infrequent exercise (HR, 1.22; 95% CI, 1.08-1.38), and smoking (HR, 1.35; 95% CI, 1.10-1.67) were significantly associated with hypertension onset. Having less than a high school educational level (HR, 1.58; 95% CI, 1.26-1.97), financial worry (HR, 1.29; 95% CI, 1.13-1.46), being single or separated (HR, 1.24; 95% CI, 1.08-1.42), high stress (HR, 1.28; 95% CI, 1.09-1.51), intimate partner violence (HR, 1.68; 95% CI, 1.14-2.48), concentrated neighborhood poverty (HR, 1.31; 95% CI, 1.07-1.60), depressive symptoms (HR, 1.28; 95% CI, 1.10-1.50), and smoking (HR, 1.53; 95% CI, 1.27-1.86) were significantly associated with diabetes onset, although heavy alcohol consumption was associated with protection (HR, 0.75; 95% CI, 0.66-0.85) rather than risk. CONCLUSIONS AND RELEVANCE Independent of traditional risk factors, individual and cumulative social and behavioral risk factor exposures were associated with onset of hypertension and diabetes within 3.5 years in a clinical setting. The findings support the value of assessing social and behavioral risk factors to help identify high-risk patients and of providing targets for intervention.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a5591579c4bdbf61cce20310165ec909",
  "timestamp": "2025-05-15T03:07:31.887142"
}