{
  "id": 8421,
  "title": "Diversification Benefits between Stock Returns from Ghana and Jamaica: Insights from Time-Frequency and VMD-Based Asymmetric Quantile-on-Quantile Analysis",
  "abstract": "Due to the susceptibility of assets to the dynamism in financial markets, the emergence of new asset classes induces empirical assessments of their risk-reduction abilities. This issue is envisaged from the perspective of new investment combinations that emerge from the new market alliance between Ghana and Jamaica. This study investigates the heterogeneous and asymmetric co-movements between stock market returns from Ghana and Jamaica with data from 04 April 2011 to 17 March 2022. The wavelet analysis is carried out, followed by causality in quantiles and quantile-on-quantile regression (QQR) analysis with decomposed return series using the variational mode decomposition (VMD) approach. The findings from the bi-wavelet analysis divulge low connectedness between stock returns from Ghana and Jamaica. The cone of influence from the coherence plot does not cover the entire spectrum, particularly beyond the annual scale. Hence, co-movements between GSECI and JSEIND beyond a year may be less significant for portfolio management. Findings from the causality test evidenced bi-directional asymmetric causality between the two markets. From the VMD-based QQR analysis, it is revealed that stock returns from Ghana and Jamaica are safe-havens, hedges, and diversifiers for each other. The significant diversification prospects between the two markets signal that the two stock markets could facilitate the inflow of capital assets for extended growth and development of their overall economies. Policymakers and regulators could attract international investors and promote the flow of funds between the two economies through effective regulation of stock markets. Specific implications for market participants and policymakers are discussed.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a56f8273c9c87b03ad807e5c6c184c47",
  "timestamp": "2025-05-15T03:18:51.542765"
}