{
  "id": 7035,
  "title": "Predictors of Depression Problems of Adults Who Live in the Security Endangered Territory",
  "abstract": "Introduction By the year 2020, if current trends for demographic and epidemiological transition continue, the burden of depression will have increased to 5.7% of the total burden of disease, thus becoming the second leading cause of disability-adjusted life year (DALY) lost. Early detection of people at risk of developing any mental disorder is extremely important in the prevention of all mental disorders. Objective The objective of the study was to determine depression predictors among adult residents in four Kosovo and Metohia municipalities predominantly inhabited by Serbian population. Methods This cross-sectional study included the representative sample of adults in Leposavic, North Kosovska Mitrovica, Gnjilane and Pristina and was performed in October/November of 2009. The sample was selected from the list of citizens older than 18, received in the above mentioned municipalities. The Goldberg General Health Questionnaire (GHQ-28) was used as a research instrument. The methods of statistical analysis included descriptive statistics, simple and multiple logistic regression analysis, and analysis of variance, with a significance level of 0.05. Results Problems with depression have been significantly associated with female sex (OR=2.24), older age (OR=1.01), lower levels of education (OR=0.50), unemployment (OR=1.09), poor financial situation (OR=0.45), abuse (OR=0.08) and assessment of the future political and security situation as a highly risky one (OR=3.01). Conclusion To determine risk groups being in greater risk to suffer from depression is important for planning, enhancing, promoting and implementing the prevention strategies for this disease.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a570119758281533b20fd3b5e8d9fead",
  "timestamp": "2025-05-15T03:04:23.015376"
}