{
  "id": 7904,
  "title": "A derived and validated score to predict prolonged mechanical ventilation in patients undergoing cardiac surgery",
  "abstract": "Objectives: Prolonged mechanical ventilation after cardiac surgery imposes a significant burden on the patient in terms of morbidity as well as a financial burden on the hospital. We undertook a retrospective analysis of 2 prospectively collected databases developed in tertiary cardiac care centers to derive and validate a risk index predicting prolonged mechanical ventilation after cardiac surgery. Methods: We studied a retrospective cohort of 32,045 patients undergoing cardiac surgery in 2 hospitals in Toronto, Canada. The development cohort consisted of 21,661 patients at Toronto General Hospital. Data Sunnybrook Health Sciences Centre, Toronto, Canada, with 10,384 patients, served as an institutional validation cohort. We operationally characterized prolonged mechanical ventilation as the duration from surgery completion to extubation exceeding 48 hours. Results: Prolonged postoperative mechanical ventilation rates in the development and validation cohort were 6% and 7%, respectively. Multivariable regression in the development cohort showed that the following factors were strong predictors of prolonged mechanical ventilation after cardiac surgery: previous cardiac surgery, lower left ventricular ejection fraction, shock, surgery involving repair of congenital heart disease, and cardiopulmonary bypass time. The intraoperative multivariable model retained good discrimination in the validation cohort, achieving a c statistic of 0.787. Conclusions: Prolonged mechanical ventilation after cardiac surgery can be accurately predicted by readily available pre- and intraoperative information.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a5785d627b5d22c0ab32311446ec533d",
  "timestamp": "2025-05-15T03:13:04.976726"
}