{
  "id": 7375,
  "title": "Risk factors associated with cutaneous anthrax outbreaks in humans in Bangladesh",
  "abstract": "Objectives To determine the risk factors associated with cutaneous anthrax infection in humans.Methods During 2013-2016, we investigated total 26 anthrax outbreaks across the country. We additionally conducted a case-control study to identify risk factors by recruiting four controls for each enrolled case. Adjusted odds ratios (aOR) and 95% confidence intervals (CI) were estimated to identify risk factors using multivariate logistic regression.Results Over the study period, a total of 1,210 suspected cutaneous anthrax cases were identified in seven districts of Bangladesh. Most of the cases (61%, n = 744) were detected from Meherpur district. Cases were detected over the year, with the peak number of outbreaks occurring in May. The overall attack rate of suspected cutaneous anthrax cases for 16 outbreaks was 20%, with the highest rate occurring among individuals aged 40-49 years. Persons who had a cut injury (aOR 19.04, CI: 4.08-88.86), weighed raw meat (aOR 5.73, CI: 3.03-10.83), mixed bones and meat (aOR 4.64, CI: 3.03-7.09), observed livestock slaughtering (aOR 2.86, CI: 2.02-4.04), had direct contact to an anthrax suspected livestock (aOR 2.68, CI:1.61-4.45), slaughtered livestock (aOR 2.29, CI: 1.3-4.02), and who did not wash hands with soap and water after direct contact (aOR 2.57, CI: 1.89-3.5) were more likely to develop cutaneous anthrax than people who did not have these exposures.Conclusion Prior cut injuries on exposed body areas during meat handling and slaughtering of sick livestock were identified as potential risk factors for cutaneous anthrax, highlighting the importance of preventing the slaughter of sick animals. However, stopping slaughtering sick livestock, handling meat and livestock by-products to reduce anthrax exposures from livestock to humans may be difficult to achieve given the associated financial incentives in Bangladesh. Interventions such as hand washing with soap during slaughtering and processing meat can be targeted to affected communities to ameliorate some risk.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a58d6c3e03d69858655becbcd448c45c",
  "timestamp": "2025-05-15T03:08:00.759894"
}