{
  "id": 5234,
  "title": "Direct and indirect effects of socioeconomic status on sepsis risk and mortality: a mediation analysis of the HUNT Study",
  "abstract": "Background Socioeconomic status (SES) may influence risk of sepsis and sepsis-related mortality, but to what extent lifestyle and health-related factors mediate this effect is not known. Methods The study included 65 227 participants of the population-based HUNT Study in Norway linked with hospital records to identify incident sepsis and sepsis-related deaths. Cox regression estimated HRs of sepsis risk and mortality associated with different indicators of SES, whereas mediation analyses were based on an inverse odds weighting approach. Results During similar to 23 years of follow-up (1.3 million person-years), 4200 sepsis cases and 1277 sepsis-related deaths occurred. Overall, participants with low SES had a consistently increased sepsis risk and sepsis-related mortality using education, occupational class and financial difficulties as indicators of SES. Smoking and alcohol consumption explained 57% of the sepsis risk related to low education, whereas adding risk factors of cardiovascular disease and chronic diseases to the model increased the explained proportion to 78% and 82%, respectively. Conclusion This study shows that SES is inversely associated with sepsis risk and mortality. Approximately 80% of the effect of education on sepsis risk was explained by modifiable lifestyle and health-related factors that could be targets for prevention.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a59e5285beb56d78443e87f75bce107c",
  "timestamp": "2025-05-15T02:45:47.391306"
}