{
  "id": 7502,
  "title": "Earnings and Financial Compensation from Social Security Systems Correlate Strongly with Disability for Multiple Sclerosis Patients",
  "abstract": "Background Multiple sclerosis (MS) patients earn lower incomes and receive higher benefits. However, there is limited knowledge of how this is correlated with their disability. Objective To elucidate sources and levels of income among MS patients with different disability, assessed with the Expanded Disability Status Scale. Methods A total of 7929 MS patients aged 21-64 years and living in Sweden in 2010 were identified for this cross-sectional study. Descriptive statistics, logistic and truncated linear regression models were used to estimate differences between MS patients regarding earnings, disability pension, sickness absence, disability allowance, unemployment compensation, and social assistance. Results The average level of earnings was ten times lower and the average level of health-related benefits was four times higher when comparing MS patients with severe and mild disability. MS patients with severe disability had on average SEK 166,931 less annual income from earnings and SEK 54,534 more income from benefits compared to those with mild disability. The combined average income for MS patients was 35% lower when comparing patients in the same groups. The adjusted risk ratio for having earnings among MS patients with severe disability compared to the patients with mild disability was 0.33 (95% CI 0.29-0.39), while the risk ratio for having benefits was 1.93 (95% CI 1.90-1.94). Conclusions Disease progression affects the financial situation of MS patients considerably. Correlations between higher disability and patient income were observed, suggesting that earnings and benefits could be used as measures of MS progression and proxies of disability.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a59f1643b88b2d562e00ae2eb595cba5",
  "timestamp": "2025-05-15T03:09:07.350203"
}