{
  "id": 5634,
  "title": "Attitudes, stressors and work outcomes related to the COVID-19 pandemic among dental assistants in Germany: a cross-sectional study",
  "abstract": "Objectives The COVID-19 pandemic has posed great challenges to medical professionals worldwide. Dental assistants (DAs) are at exceptionally high risk of infection with SARS-CoV-2 due to frequent and close patient contact and involvement in various high-risk dental procedures. This study aimed to investigate attitudes, stressors and work outcomes among DAs from all over Germany at the peak of cases in spring 2020. Design Cross-sectional study. Descriptive analysis and logistic regression. Setting Dental, maxillofacial surgery and orthodontic practices across Germany, April 2020. Participants Participants aged 18 years and above and currently working as DAs in Germany. Primary and secondary outcome measures A self-devised online questionnaire was employed comprising questions on SARS-CoV-2-related attitudes, stressors and work outcomes. Validated scales assessed symptoms of depression and anxiety. Results Among 1481 participating DAs (median age 35 years, 98.4% female, 91.8% working in dental practices), major stressors were uncertainty about the pandemic's temporal scope (97.9% agreement, n=1450), uncertainty about one's financial situation (87.8%, n=1301), uncertainty about how to act correctly (87.6%, n=1298) and thoughts about a possible infection during work (83.8%, n=1241). Forty-two per cent of DAs (n=622) felt sufficiently prepared for dealing with patients with SARS-CoV-2. Only 17.5% (n=259) agreed that material for personal protection was sufficiently available. Multivariable logistic regression analyses suggested that working in a dental practice, compared with orthodontic and maxillofacial surgery practices, was significantly associated with uncertainty about one's financial situation (OR 2.13 (95% CI 1.33 to 3.44)) and with the reported availability of personal protective equipment (PPE) (0.55 (0.36 to 0.84)). Conclusions Training about correct behaviour of DAs during future infectious disease outbreaks is needed, especially for DAs working in dental practices. In the future, it will also be necessary to strengthen supply chains to ensure that PPE is sufficiently available in a timely manner.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a5af6275b74b56aa15cbd1d1bff866fd",
  "timestamp": "2025-05-15T02:49:50.304927"
}