{
  "id": 3387,
  "title": "Green innovation and performance: moderation analyses from Thailand",
  "abstract": "Purpose The purpose of this paper is to investigate the influence of green product innovation performance (GPIP) on a firm's financial performance (i.e. a firm's profitability and risk). In addition, it has adopted the resource-based view and contingency theory to explore how GPIP and a firm's financial performance relationship is manifested when subject to the moderating role of a firm's market resource intensity and certain environmental factors, such as technological turbulence and market turbulence. Design/methodology/approach Data were collected from 202 publicly listed Thai manufacturing firms. This research has used hierarchical regression analyses to empirically test the proposed research hypotheses. Findings The findings reveal that GPIP exerts a significant influence on a firm's financial performance, i.e. higher the GPIP, higher the firm's profitability and lower the firm's financial risk. Moreover, findings support the theoretical assertions that the higher level of market resource intensity, market turbulence and technological turbulence further strengthens GPIP and a firm's financial performance relationship. Originality/value By considering the independent moderating role of market resource intensity, market turbulence and technological turbulence, this research has contributed to reconcile the previously disparate findings regarding the GPIP and a firm's financial performance relationship. Moreover, this research has highlighted the role of the essential moderators that business managers must understand and adjust to capitalize on and achieve superior financial performance.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a5bff6294a32dab0634102a46be1a1b7",
  "timestamp": "2025-05-15T02:25:40.178354"
}