{
  "id": 6908,
  "title": "Climate shocks and poverty persistence: Investigating consequences and coping strategies in Niger, Tanzania, and Uganda",
  "abstract": "This study investigates key correlates of poverty persistence and the consequences and coping strategies of climate-induced shocks and stressors in Niger, Tanzania, and Uganda. It relies on household panel data merged with data on subnational disasters across the three countries and employs multiple measures to capture disaster prevalence of droughts, floods, and epidemics, recorded variably at the household and subnational levels. Multivariate regression analysis uncovers that environment shocks prolong poverty through direct biophysical impacts but also indirectly through various negative consequences and distress coping mechanisms in which vulnerable households engage. These include reduced food consumption and food insecurity and reduced asset values. While subnationally there are positive undercurrents, through relief aid and other forms of support that could help protect or replace assets, at the micro-level, the results suggest that many households may survive through migration and local remittances to complement household welfare. Ensuring a supportive financial environment for poor households in these contexts, alongside risk-informed policy and programming, would help alleviate key stressors that keep households persistently under the poverty line in contexts of climate-induced shocks and stressors.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a5db94e2c373c5ad580263f799266696",
  "timestamp": "2025-05-15T03:02:41.366507"
}