{
  "id": 7064,
  "title": "The Relationship of Cataract and Cataract Extraction to Age-related Macular Degeneration: The Beaver Dam Eye Study",
  "abstract": "Objective: To examine the associations of cataract and cataract surgery with early and late age-related macular degeneration (AMD) over a 20-year interval. Design: Longitudinal population-based study of age-related eye diseases. Participants: Beaver Dam Eye Study participants. Methods: Persons aged 43 to 86 years participated in the baseline examination in 1988-1990. Participants were followed up at 5-year intervals after the baseline examination. Examinations consisted of ocular examination with lens and fundus photography, medical history, measurements of blood pressure, height, and weight. Values of risk variables were updated, and incidences of early and late AMD were calculated for each 5-year interval. Odds ratios were computed using discrete linear logistic regression modeling with generalized estimating equation methods to account for correlation between the eyes and multiple intervals. Main Outcome Measures: Age-related macular degeneration. Results: After adjusting for age and sex, neither cataract nor cataract surgery was associated with increased odds for developing early AMD. Further adjusting for high-risk gene alleles (CFH and ARMS2) and other possible risk factors did not materially affect the odds ratio (OR). However, cataract surgery was associated with incidence of late AMD (OR 1.93; 95% confidence interval [CI], 1.28-2.90). This OR was not materially altered by further adjusting for high-risk alleles (CFH Y402H, ARMS2) or other risk factors. The OR for late AMD was higher for cataract surgery performed 5 or more years prior compared with less than 5 years prior. Conclusions: These data strongly support the past findings of an association of cataract surgery with late AMD independent of other risk factors, including high-risk genetic status, and suggest the importance of considering these findings when counseling patients regarding cataract surgery. These findings should provide further impetus for the search for measures to prevent or delay the development of age-related cataract. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012;119:1628-1633 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a5e01a448d5a905d772152d99363e68a",
  "timestamp": "2025-05-15T03:05:03.362721"
}