{
  "id": 321,
  "title": "Quantitative strategy for the Chinese commodity futures market based on a dynamic weighted money flow model",
  "abstract": "Due to the short mechanism of the commodity futures market, a dynamic weighted money flow model is proposed in this paper. The model proposed herein is based on the original money flow model but considers the impact of changes in both open interest and price on money flow. The proposed model aptly depicts the overall law of money flow in the Chinese commodity futures market. The results regarding correlation between current money flows and future futures prices show that there are 17 futures contracts with strong negative correlations and three futures contracts with strong positive correlations between 2011 and 2013. Then, the logistic regression, Bayesian discriminant, decision tree, random forest and support vector machine models are applied to validate the forecasting ability of the proposed money flow model with respect to price fluctuations. The average prediction accuracies of the above models exceed 55%, indicating that the money flow model proposed in this paper has a strong forecasting ability. Finally, a binary classification logistic regression strategy based on the dynamic weighted money flow model is established for back-testing and is compared to the double-moving average strategy and the buy-hold strategy. The back-testing results show that the cumulative annualized yield of the portfolio that uses the strategy proposed in this paper is 281.95%. Therefore, the proposed strategy is far superior to other strategies and exhibits better profitability. (C) 2018 Elsevier B.V. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a5f6fcd8542abfb49e9a47c7dc3db6ce",
  "timestamp": "2025-05-15T00:42:00.434342"
}