{
  "id": 5020,
  "title": "The impact of energy-related uncertainty on China's overall and sectoral stock returns: Evidence from quantile-on-quantile regression",
  "abstract": "Energy acts as the lifeblood of the global economic and financial system. While the existing literature has probed the link between policy uncertainties and various economic and financial indicators, the specific nexus between energy-related uncertainty and the stock markets remains relatively understudied. This study explores this critical nexus by employing quantile-on-quantile (QQR) regression approach and a novel energy-related uncertainty measure from January 2005 to October 2022; assessing whether energy-related uncertainty influences China's overall and sectoral stock returns. The empirical outcomes show that the lower, middle and upper quantiles of energy-related uncertainty (0.1-0.9) have both negative and positive impacts on the lower, medium and higher quantiles (0.1-0.9) of Shanghai stock returns (SSR). At the sectoral level, similar to the SSR, the returns of consumer staples, consumer discretionary, financials, energy, industrials, materials, healthcare, information technology, utilities, and telecommunication sector receive both negative and positive spillovers from energy-related uncertainty in higher quantiles. These results are further substantiated by the Wavelet Quantile Regression (WQR) approach. The asymmetric or heterogeneous results infer that while energy-related uncertainty exerts downward pressure on stock returns, it incentivizes investors to demand a higher risk premium, which, in turn, augments stock market returns in China. These asymmetric findings have useful implications for policymakers and investors.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a6015d5723414ad23ce3efd05ce3c981",
  "timestamp": "2025-05-15T02:43:40.099143"
}