{
  "id": 7944,
  "title": "The association of perceived stress with depressive symptoms in older Taiwanese-Result of a longitudinal national cohort study",
  "abstract": "Objective. To determine the impact of perceived-stress over one's own health, financial condition, job, and conflict with family members, and family members' problems on depressive symptoms in older adults. Methods. We analyzed datasets of the Taiwan Longitudinal Survey on Aging, and used self-reported stress in 2003 and 2007 to represent long-term stress conditions in 4854 >= 50-year old persons. The impact of long-term stress on depressive status (evaluated with CES-D10, score range 0-30) was determined with multivariate logistic regression analysis. Persons with proxy interviews, incomplete CES-D data, or cognitive impairment were excluded. Results. Perceived-health stress had stronger impacts on depressive symptoms than most other stress situations. Job-related stress showed no impact. Other stress situations showed modest associations in the middle-aged and young-olds. Ongoing stress had stronger impacts than past stress. Excluding health and job stresses, the impact generally decreased with aging. The association with clinically relevant depression generally followed that with depressive symptoms. Conclusion. All perceived stresses are not equal in their impacts on subsequent depressive symptoms. Perceived-health stress has stronger impacts under most conditions. Better understanding of the associations of various stressors with depressive symptoms could enhance planning of effective strategies to reduce the risk of depression in older persons. (C) 2013 Elsevier Inc. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a6080d3bf70c10a0fa4dec58d0efde8d",
  "timestamp": "2025-05-15T03:13:30.694198"
}