{
  "id": 6846,
  "title": "Factors associated with depression, anxiety, and stress symptoms among men in a rural area in Vietnam during COVID-19",
  "abstract": "BackgroundThe COVID-19 pandemic has affected health and well-being worldwide, and its psychological effects are receiving substantial attention in the scientific literature. Research to date shows that the pandemic has increased prevalences of depression, anxiety, and stress. This study aimed to estimate the prevalence of mental health symptoms and identify the associated factors among men in a rural area of Vietnam during the COVID-19 pandemic. Methods and findingsDuring July 15-31, 2020, we conducted a cross-sectional survey of 1,085 men from 18 years old in 11 rural districts in Thanh Hoa province, Vietnam, and assessed their mental health using the Depression, Anxiety and Stress Scale - 21 Items (DASS-21). Outcomes assessed were have a symptom of depression, anxiety, and stress; risk factors measured included age, religion, marital status, education, occupation, and financial status. Multiple linear regression was performed to determine the statistical significance of associations between risk factors and mental health symptoms. Findings showed that the prevalences of having a symptom of depression, anxiety and stress among participants were 6.39, 9.72, and 5.65%, respectively. Regression model showed being younger (95% CI: -0.030; -0.004, p = 0.001), men had high school degree (95% CI: -0.671; -0.074, p = 0.014), men living in nearly poor houshoulds (95% CI: 0.067, 1.905, p < 0.05) and poor housholds (95% CI: 0.608; 2.721, p < 0.05) had significantly lower depression scores than others. ConclusionPrevalences of having symptoms of depression, anxiety and stress were much higher than in similar previous research in rural Vietnam, suggesting that mental health problems among men in this setting became more common during the COVID-19 pandemic. Age, religion, level of education and family income status were statistically significant predictors of mental health problems. These findings provide useful insights into the impact of pandemics on mental health.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a609a0903cc426eb2bea9e58d2718ed4",
  "timestamp": "2025-05-15T03:02:07.520081"
}