{
  "id": 3276,
  "title": "Large-scale school building infrastructure improvement: The case of the city of Cali, Colombia",
  "abstract": "Quality education is influenced by various factors, including infrastructure, curricula, and educators. Among these factors, school infrastructure significantly impacts the learning process. However, managing and improving existing school infrastructure in low- and middle-income countries presents complex challenges due to limited resources, inadequate regulations, and poor maintenance practices. To effectively prioritize limited funds and balance short-term needs with long-term sustainability, decision-making processes must consider simultaneously functionality and safety aspects. This paper introduces an extended decision-making framework for enhancing school buildings, by determining optimal investment levels and prioritizing interventions in the building portfolio. The framework comprises multiple analytic models that are interconnected. The methodology starts with the identification of building typologies using a clustering algorithm; then, through a multi-criteria utility function with parametrized decision-maker profiles, it considers the trade-offs between safety and functionality; last, an optimization model prioritizes the buildings' interventions. The framework is adapted to a regional context in the city of Cali (Colombia). The outcome of this implementation provides analytics to decision-makers at an early stage in the formulation of school building improvement programs. This helps unveiling the extent of the project by defining the needs of improvement and the budget required to implement a large-scale intervention program.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a61a0d46b33adebe3621c3ccd5c82d61",
  "timestamp": "2025-05-15T01:15:26.159518"
}