{
  "id": 4294,
  "title": "Leveraging random forest in micro-enterprises credit risk modelling for accuracy and interpretability",
  "abstract": "This paper applies the Random Forest (RF) method for the robust modelling of credit default prediction. This technique has been proven as an efficient classifier and can provide better interpretability in comparison to other classifiers. Using Chines micro-enterprise credit data set, this study emphasizes the multidimensional analysis of credit risk, such as the whole sample, subsample, and the incremental effect of the group of predictors. To that end, relative variable importance (RVIs) has been presented for all predictors according to the contribution in the prediction accuracy so that to ensure interpretability of the model. The empirical findings confirm that RF technique is reliable and efficient across all of the criteria used in this study. In addition, the examined experimental analysis indicates that non-traditional variables have a significant effect on the classification accuracy. Thus, this paper recommends some alternative predictors like the legal representative's basic information, internal non-financial factors, along with traditional financial variables for sustainable model development. The performance is compared from the perspective of five different performance measures. This modelling algorithm can be used by different financial markets participants to measure systematically credit default prediction of individual and institutional customers.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a622401d50215f191f444701946a3357",
  "timestamp": "2025-05-15T02:35:26.301866"
}