{
  "id": 7422,
  "title": "Effectiveness of unreinforced masonry seismic retrofit programmes: review of policies in New Zealand and the United States",
  "abstract": "Implementing seismic risk mitigation programmes for earthquake-prone unreinforced masonry buildings (URM) is critical to ensure public safety and community resilience in regions of moderate and high seismicity. In New Zealand, it is a mandatory requirement to strengthen earthquake-prone buildings within a prescribed timeframe. However, the rate of compliance has been slow. Building owners delay or hesitate to undertake seismic strengthening, mainly due to uncertainties involved in cost (Egbelakin et al., 2014) [1]. While cost is the pivot of the owner's decision-making process, an effective design of government-led programmes is essential to engage the owners and increase the rate of compliance. This paper compared similar mandatory URM programmes in the United States and New Zealand to identify critical contributors to the success of each programme. In addition, this paper implements a regression analysis using actual remediation cost data gathered from a recent mandatory strengthening programme in New Zealand to identify significant cost factors in seismic strengthening. From the comparison, six key contributors to programme success were recognised, including 1) efficient and flexible financial options; 2) alternative retrofit design solutions; 3) fair penalties and enforcement tools; 4) a clearly laid out action plan and time limits for compliance; 5) dedicated local council staff and case managers; 6) consultation with building owners. The cost model suggested that building characteristics, location, and heritage status are significant in seismic strengthening costs. The findings contribute to the fine-tuning of future programme designs and the understanding of financial impediments building owners face in seismic strengthening. Significant cost factors identified in this study indicate where the allocation of government funding is required the most to maximise the incentivising of owners for early adoption of compliance measures.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a62f778912be93c8d3bfcb7c1356caa0",
  "timestamp": "2025-05-15T03:08:37.763221"
}