{
  "id": 8740,
  "title": "Adherence and virologic suppression during the first 24 weeks on antiretroviral therapy among women in Johannesburg, South Africa - a prospective cohort study",
  "abstract": "Background: Adherence is a necessary part of successful antiretroviral treatment (ART). We assessed risk factors for incomplete adherence among a cohort of HIV-infected women initiating ART and examined associations between adherence and virologic response to ART. Methods: A secondary data analysis was conducted on a cohort of 154 women initiating non-nucleoside reverse transcriptase inhibitor (NNRTI)-based ART at a single site in Johannesburg, South Africa. Ninety women had been enrolled in a prevention of mother-to-child transmission (pMTCT) program and were exposed to single-dose nevirapine (sdNVP) > 18 months earlier. Women were interviewed pre-treatment and clinical, virologic and adherence data were collected during follow-up to 24 weeks. Incomplete adherence to ART was defined as returning > 5% of medications, estimated by pill counts at scheduled visits. Multivariable logistic regression analysis and unadjusted odds ratio (95%CI) were performed, using STATA/SE (ver 10.1). Results: About half of the women (53%) were < 30 years of age, 63% had < 11 years of schooling, 69% were unemployed and 37% lived in a shack. Seven percent of women had a viral load > 400 copies/ml at 24 weeks and 37% had incomplete adherence at one or more visits. Incomplete adherence was associated with less education (p = 0.01) and lack of financial support from a partner (p = 0.02) after adjustment for confounders. Only when adherence levels dropped below 80% was there a significant association with viremia in the group overall (p = 0.02) although adherence < 95% was associated with viremia in the sdNVP-exposed group (p = 0.03). The main reasons for incomplete adherence were being away from home, busy with other things and forgetting to take their medication. Conclusion: Virologic response to NNRTI-treatment in the cohort was excellent. However, women who received sdNVP were at greater risk of virologic failure when adherence was < 95%. Women exposed to sdNVP, and those with less education and less social support may benefit from additional adherence counseling to ensure the long-term success of ART. More than 80% adherence may be sufficient to maintain virologic suppression on NNRTI-based regimens in the short-term, however complete adherence should be encouraged.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a639e3ba6a2855d68a317f1a91d6c91a",
  "timestamp": "2025-05-15T03:21:56.625509"
}