{
  "id": 8514,
  "title": "Caregiving: a risk factor of poor health and depression among informal caregivers in India- A comparative analysis",
  "abstract": "Background In an ageing society, the provision of long-term care is the prime need. In Indian cultural setting, family members are the informal, albeit primary caregivers to the elderly. Caregiving demands intense emotional and financial involvement. While taking care of elderly persons' health and wellbeing, these family members, acting as informal caregivers, may themselves become vulnerable to poor health due to additional stress and burden. Using a nationally representative survey, the study tried to identify how health condition varies within caregivers and a comparative analysis of how in similar socio-economic background health condition varies between caregivers and non-caregivers. Method The data, used for the analysis, is taken from Longitudinal Ageing Study in India (LASI), Wave I. Both descriptive and multivariable regression analysis are done in different models along with interaction effect of caregiving to understand the difference in health status between caregiver and non-caregivers. Results Nearly 29% and 11% of the informal caregivers, reported to have depressive symptoms and poor self-rated health (SRH), respectively. Almost half of the caregivers, who provide care for more than 40 h a week, are diagnosed to have depressive symptoms. They are also at higher risk of having depressive symptoms (AOR 1.59 CI 1.16-2.18) and poor SRH (AOR 1.73 CI 1.11-2.69) than those who invest less than 40 h in a week. In almost every socio-economic condition, caregivers are at a higher risk of having depression and poor health than non-caregivers. Caregivers, who are widowed, live in rural areas or are not satisfied with current living arrangement are more vulnerable to have depressive symptoms. On the other hand, caregivers of age 45-59 years, widowed, male and who live only with their children with spouse absent, have almost 2 times higher odds of poor SRH than non-caregivers. Conclusion Caregivers are more susceptible to depression and poor self-rated health compared to non-caregivers irrespective of their socio-economic characteristics, only the magnitude of vulnerability varies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a642332e263d401f2cd1e1725b7f5783",
  "timestamp": "2025-05-15T03:19:51.969783"
}