{
  "id": 4138,
  "title": "Easy-to-prepare graphene-based inkjet-printed electrodes for diclofenac electrochemical sensing",
  "abstract": "Inkjet-printed electrodes (IPEs) from flexible Kapton (R) as substrate and easy to prepare graphene oxide (GO)based inks (K/GO) were prepared using a standard desktop printer. Subsequently, they were submitted to a postprocessing thermal treatment (K/GO_TR400) and assessed as disposable working electrodes (WEs) for diclofenac (DCF) indirect electrochemical detection at pH 7.0 (close to physiological pH value). DCF monitoring is attracting much interest, due to its classification as contaminant of emerging concern in water sources. The performance of the printed active sensor material was compared to that of thermally reduced (at 400 degrees C) graphene oxide (TRGO-400, in a powder form), which has been successfully used as glassy carbon electrode (GCE) modifier for the detection of DCF. This electrode worked linearly within the concentration range between 5 and 25 mu M with an LOD value of 2.25 mu M. Moreover, the morphology and chemical composition of the obtained IPEs were characterized by means of scanning electron microscopy (SEM) and X-ray photoelectron spectroscopy (XPS) and compared with GCE/TRGO-400. Cyclic voltammetry (CV) and differential pulse voltammetry (DPV) measurements using a miniaturized 3-electrode cell of the post-processed IPEs showed a promising electrochemical performance for DCF sensing. Thus, this study demonstrated the effective partial recovery of the valuable properties of graphene on the IPEs after the thermal treatment and the successful production of flexible and disposable electrodes for target analyte detection. Therefore, this is a promising alternative to conventional modified GCEs, as it offers a facile approach for the fabrication of cutting edge graphene-based electrodes and widens the available portfolio of electrochemical sensors towards detection of water contaminants of emerging concern.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a64c7ee0cad278ea4698457f0bfa90a3",
  "timestamp": "2025-05-15T01:23:58.196473"
}