{
  "id": 3097,
  "title": "The Effect Of Financial Literacy On Participation In Investment Markets: A Study On University of Health Sciences Students",
  "abstract": "The purpose of this study is to examine the effect of university students' financial literacy level on their participation in financial investment markets. For this purpose, a survey was conducted with the participation of 703 undergraduate and associate degree students at the University of Health Sciences. The obtained data were subjected to logistic regression analysis. According to the analysis results, objective financial literacy did not have a significant effect on participation in investment markets. It was determined that perceived financial literacy impacts participation in investment markets. Further, while it was concluded that risk aversion, savings tendency, gender, age, working status, and the presence of family members in the field of finance had an impact on students' participation in financial investment markets, it was determined that education level was not an explanatory factor on participation in such markets. Additionally, while a positive relationship was found between perceived higher financial literacy, propensity to save, age, being employed, having a family member working in the field of finance, and investing in financial instruments, a negative relationship was determined between risk aversion, being a woman, and investing in financial instruments. Consequently, although students invest in financial instruments based on a rational reason in accordance with their level of financial literacy, in reality, they do not have this level of financial literacy, and their financial investments consist of speculative investments that are not supported by basic investment knowledge. Although they intend to act consciously when making investment decisions, they make unconscious investments without realising it.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a686c2afe55e9955df767aa4c4229595",
  "timestamp": "2025-05-15T02:22:25.170588"
}