{
  "id": 8485,
  "title": "Sociodemographic and environmental characteristics associated with thoughts of death and suicidal ideation in community-dwelling residents of a rural town in Japan: analyses from a perspective of accompanying problems",
  "abstract": "Objective Suicide prevention has been focused on primary prevention as a group rather than individuals. However, we aimed to identify sociodemographic and environmental characteristics of individuals with suicidal thoughts among rural residents in Japan.Methods In 2015, a cross-sectional home visit survey was conducted in a rural town in Akita Prefecture. A total of 1,844 residents aged >= 20 years (response rate, 65%) answered a self-administered questionnaire about suicidal thoughts in the past one month. Multivariate logistic regression analyses were used to investigate sociodemographic and environmental characteristics associated with suicidal thoughts in models with accompanying problems for human relations problems (HRP), health problems (HP), and financial problems (FP), or with no accompanying problems.Results In total, 218 (men 9.4%, women 13.8%) had suicidal thoughts with accompanying problems for HRP (n = 104), HP (n = 112), and FP (n = 72). The risk characteristics were Kessler Psychological Distress Scale scores >= 9 in models with HRP, HP, and FP or with no accompanying problems; being a woman and current smoking with no accompanying problems; absence of a person for help in a model of FP; and absence of family member for help in a model of HRP or with no accompanying problems. The mitigating factor were being optimistic (a domain of resilience skills identified by factor analysis) in models of HRP, HP, and FP or with no accompanying problems; being aged 70-79 and being aged >= 80 in a model of HRP.Conclusions Suicidal thoughts among rural residents in Japan were associated with multifactorial sociodemographic and environmental characteristics.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a695bcd9368c9c01dae8e5bbc00a02f3",
  "timestamp": "2025-05-15T03:19:21.324785"
}