{
  "id": 7914,
  "title": "Rural Living as Context: A Study of Disparities in Long-Term Cancer Survivors",
  "abstract": "Purpose/Objectives: To explore the impact of rurality on health-related quality-of-life (HRQOL) disparities in rural long-term cancer survivors. Design: Cross-sectional survey. Setting: Rural-Urban Continuum Codes (RUCC) 7, 8, and 9. Sample: 91 adults at least five years post-treatment. Methods: Mailed surveys measured HRQOL, self-esteem, and social support. Regression models were estimated to isolate (from self-esteem and social support) the effect of level of rurality on HRQOL. Main Research Variables: HRQOL, self-esteem, social support, and rurality. Findings: No differences in demographic characteristics existed among RUCCs. Survivors residing in RUCCs 7 or 8 tended to be similar in several dimensions of HRQOL. Survivors living in RUCC 7 reported significantly lower social function and greater financial difficulty and number of symptoms compared to survivors in RUCC 9 (the most remote). Self-esteem and social support strongly correlated with HRQOL. Conclusions: The significant impact of rurality on HRQOL beyond self-esteem and social support suggests its role in explaining cancer survivorship disparities and directing practice. Until additional exploration can identify mechanisms behind rurality's impact, consideration of level of rurality as a potential factor in evaluating survivors' HRQOL outcomes is reasonable. Implications for Nursing: Survivor context (e.g., level of rurality) influences HRQOL outcomes. Context or culture-relevant risk minimization and HRQOL optimization nursing practices are indicated.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a6b09ae02f01eeea83571a0497be06ea",
  "timestamp": "2025-05-15T03:13:30.632161"
}