{
  "id": 2771,
  "title": "Impacts of financial risk and economic crime on corporate social responsibility in Chinese firms",
  "abstract": "This study empirically examines the complex relationship between financial risk, economic crime, and Corporate Social Responsibility (CSR) among 435 firms listed on the Shenzhen Stock Exchange of China from 2010 to 2021. Utilizing Propensity Score Matching (PSM), logistic regression, and the Two-Stage Least Squares (2SLS) models were used to analyze the dynamics of these variables. The results reveal that Financial Risk (FR) has a significant positive relationship with CSR, suggesting that higher financial risk is associated with increased CSR activities. Similarly, Gross Domestic Product (GDP) and Inflation (INF) also exhibit positive associations with CSR, indicating that economic growth and inflationary pressures drive greater corporate responsibility. The negative impact of economic crime on CSR suggests that improving governance and reducing corruption could lead to more corporate responsibility. Interest Rates (IR) further enhance CSR, showing a strong positive effect. All relationships are statistically significant at the 1% level, highlighting the robustness of these findings. This study underscores the importance of economic stability and the role of financial risk in fostering CSR while emphasizing the detrimental effect of economic crime on corporate responsibility. These insights underline the dual benefits of promoting CSR as a mechanism for financial stability and crime reduction, which has significant implications for China's broader economic landscape.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a6c69d77020c1c3684622fb0ef8a0b87",
  "timestamp": "2025-05-15T02:19:08.374683"
}