{
  "id": 4626,
  "title": "Polymorphisms in the Vascular Endothelial Growth Factor Gene and Risk of Age-related Macular Degeneration The Rotterdam Study",
  "abstract": "Purpose: Vascular endothelial growth factor (VEGF) is an important regulator of angiogenesis and a target for inhibition therapy in wet age-related macular degeneration (AMD). The purpose of this study was to examine whether genetic variation in the VEGF gene is associated with AMD and, especially, with its wet end stage. Design: Prospective population-based cohort study. Participants: Four thousand two hundred twenty-eight participants aged 55 years and older. Methods: AMD was classified according to a modified International Classification System using fundus color images. Genotypes and haplotypes were determined for 3 functional VEGF single nucleotide polymorphisms (SNPs): C-2578A, G-1154A, and G-634C. Cox proportional hazards regression analyses were used to investigate possible associations between the individual SNPs and incident AMD. The Haplo.Stats program was used to test the associations between VEGF gene haplotypes and incident AMD. Main Outcome Measure: AMD Results: Of 4228 participants at risk for incident early and late AMD for whom blood specimens were available for VEGF genotyping, incident early AMD developed in 514 and incident late AMD developed in 89 (35 dry and 54 wet) after a mean follow-up of 7.4 years. None of the SNPs showed a significant association with incident early or late AMD, especially not with incident wet AMD. Haplotype analyses also detected no associations. Conclusions: The a priori hypothesis that 3 common SNPs in the VEGF gene would be a risk factor for AMD, especially the wet form, could not be confirmed. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2008; 115:1899-1903 (C) 2008 by the American Academy of Ophthalmology.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a6cfdd3eabddb00c9311e32f1235749d",
  "timestamp": "2025-05-15T02:39:26.941174"
}