{
  "id": 3106,
  "title": "The Nanotechnology Innovation Diamond, a model for successful nanoscience research and development",
  "abstract": "Although technology innovation management has been extensively studied, little research has been conducted in nanotechnology-focused innovation management. No model currently exists on nanotechnology innovation management and the related critical success factors. Based on a literature review of nanotechnology characteristics and reported successful nanotechnology research, six essential factors of success were identified. These factors are consumer acceptance of nanotechnology, hybridisation of nanotechnology innovations into existing industries and markets, multidisciplinary project teams, agglomeration and clustering of nanotechnology research projects, research and development (R&D) and commercialisation skills and capabilities, and working within a conducive innovation environment. These six factors were crystallised into the Nanotechnology Innovation Diamond, a model for successful nanoscience research and development. The proposed model was then validated using confirmatory factor analysis (CFA) from a survey of 167 nanotechnology experts from South Africa. The results indicate that at 95% confidence level, the proposed model satisfied the minimum CFA model fit requirements, and the six proposed critical success factors are significant for successful nanotechnology R&D. The presented model can be used to increase the rate of success of nanotechnology R&D projects, nanotechnology project portfolio selection, and nanotechnology foresight exercises.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a6d6d0f35912c8e34d54dc288927c493",
  "timestamp": "2025-05-15T01:13:45.169424"
}