{
  "id": 453,
  "title": "Fuzzy Comprehensive Evaluation Model of Project Investment Risk Based on Computer Vision Technology",
  "abstract": "With the development of the economy and real-time embedded systems and the progress of science and technology, people's economic income forms have undergone tremendous changes, and the concept of financial management has become clearer in people's property income arrangements. Project investment is one of the most popular financial management methods in the era of big data. Both large enterprise groups and individual petty bourgeoisie groups have begun to pay attention to the risks and benefits brought by the new financial management method of project investment. This paper's goal is to develop a fuzzy comprehensive evaluation (FCE) model for project investment risk based on computer vision technology and explore the application of computer vision technology in project investment risk evaluation. This article first uses a real-time embedded system to understand the basic process of project investment and select 10 investment experts for risk assessment, risks, and causes of the risks through literature research and case analysis. Then, this paper establishes a model of fuzzy comprehensive evaluation of project investment risk through computer vision technology, real-time embedded systems, and neural network models in big data and artificial intelligence technology to realize the analysis and prediction of project investment risk. The fuzzy comprehensive evaluation method and analytic hierarchy process (AHP) are used in this evaluation model to evaluate and forecast project investment risks. In addition, this paper also trains and tests the risk evaluation model of this research through the support vector machine classification algorithm, the real-time embedded system, and the average random consistency index. The research shows that the fuzzy comprehensive evaluation model of this study has higher accuracy for project investment risk evaluation than other risk evaluation methods. For example, for the investment risk of chemical fiber projects, this research model evaluated the factors such as organization, management, technology, and economy and found that the risks were all higher than 21.36%, which concluded that the overall investment risk of chemical fiber projects was relatively high.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a6db4382eac618edbf7d4d10a0b6e5e6",
  "timestamp": "2025-05-15T01:50:52.685781"
}