{
  "id": 5633,
  "title": "Engineer CEOs and corporate risk taking",
  "abstract": "PurposeThis study aims to examine whether engineer chief executive officers (CEOs) influence corporate risk-taking behaviour. We further examine the corporate characteristics that facilitate this association.Design/methodology/approachWe argue that engineer CEOs have unique skills and access to technical and/or technological social circles, increasing their self-confidence in decision-making. Using upper echelon and imprint theories, we hypothesise a positive association between engineer CEOs and corporate risk-taking. We hand-collected data of engineer CEOs in a sample of Australian listed firms from 2015 to 2022, and corporate risk-taking is measured based on stock return volatility and return on asset volatility over three overlapping years. The hypothesis is examined using regression analysis, followed by robustness tests.FindingsThe analysis indicates a positive association between engineering CEOs and corporate risk-taking. The results are robust to fixed effect regressions, propensity score matching, accounting for residuals of the engineer CEO variable, and two-stage least squares (2SLS) methods. We traced sources of corporate risk-taking, finding that financial leverage and sales growth facilitate risky investments.Practical implicationsThe results present implications for the literature, corporate leaders, investors and regulators in understanding the role of CEOs' technical expertise in determining corporate risk appetite. The results are insightful for stakeholders by revealing that engineer CEOs increase the corporate risk profile.Originality/valueThis paper reveals that engineering CEOs increase corporate risk profiles, showing the importance of considering the specific expertise of leaders independently in understanding corporate risk-taking behaviour.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a6f374c445a8e65ae09641865b933089",
  "timestamp": "2025-05-15T02:49:50.300314"
}