{
  "id": 6952,
  "title": "Risk factors for prospective increase in psychological stress during COVID-19 lockdown in a representative sample of adolescents and their parents",
  "abstract": "Background COVID-19 lockdown measures imposed extensive restrictions to public life. Previous studies suggest significant negative psychological consequences, but lack longitudinal data on population-based samples. Aims We aimed to prospectively identify increased psychological stress and associated risk factors in parent-child dyads. Method We conducted a prospective, observational online study on a representative German sample of 1221 adolescents aged 10-17 years and their parents. Psychological stress and psychosocial variables were assessed before the pandemic (baseline) and 1 month after the start of lockdown (follow-up), using standardised measures. We used multilevel modelling to estimate changes in psychological stress, and logistic regression to determine demographic and psychosocial risk factors for increased psychological stress. Results The time of measurement explained 43% of the psychological stress variance. Of 731 dyads with complete data, 252 adolescents (34.5%, 95% CI 31.0-37.9) and 217 parents (29.7%, 95% CI 26.4-33.0) reported a significant increase in psychological stress. Baseline levels were lower than in dyads without increased psychological stress. Risk factors for increased psychological stress included sociodemographic (e.g. female parents, severe financial worries) and emotion regulation aspects (e.g. non-acceptance of emotional responses in parents, limited access to emotion regulation strategies in adolescents), explaining 31% of the adolescent (Nagelkerke R-2 = 0.31) and 29% of the parental (Nagelkerke R-2 = 0.29) model variance. Conclusions This study is the first to prospectively show an increase in psychological stress during COVID-19 lockdown in a representative family sample. Identified demographic and psychosocial risk factors lead to relevant implications for prevention measures regarding this important public health issue.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a6f41a34e5a0b9cc55a06d81dd424c2b",
  "timestamp": "2025-05-15T03:03:13.523690"
}