{
  "id": 4191,
  "title": "The effect of co-patenting as a form of knowledge meta-integration on technological differentiation at Siemens",
  "abstract": "PurposeThe paper proposes an answer to one of the most important questions in corporate innovation management: what mechanisms of technological diversification exist within multinational companies? It is ascertained that research and development (R&D) intra-firm co-invention or co-patenting is one of those mechanisms. Co-invention implies knowledge-sharing, which should lead to unique combinations of knowledge and expertise and hence technological diversification of patent applications.Design/methodology/approachThis paper offers a novel conceptual framework exploring the relationship between patents' technological diversification and a detailed classification of different forms of international co-invention. Based on the case of Siemens' Patent Cooperation Treaty (PCT) applications, the revealed technological advantage (RTA) index is utilized to measure the extent of the technological diversification of patent output.FindingsThe results show that patent applications generated by subsidiaries in advanced economies in cooperation with other subsidiaries feature unique technological areas that deviate from the company's overall technological specializations. These results provide a strong argument in favor of inter-subsidiary or horizontal co-patenting as a mechanism of new knowledge creation.Research limitations/implicationsOn the conceptual level, the results accentuate inter-subsidiary patenting being an important mechanism of knowledge meta-integration boosting technological diversification. The obvious limitation of this paper lies in exploring a single company case, which restricts the generalizability of our findings. Due to the dynamic nature of technological change, the author's dataset also suffers from a lack of temporal external validity. Future research can expand the scope in both regards in applying our co-invention mode typology.Practical implicationsBased on the results, to diversify knowledge portfolio, companies should strengthen the co-patenting effort and reinforce horizontal (inter-subsidiary) R&D collaborations.Originality/valueTo the author's knowledge, this is the first time when such a nuanced typology of co-invention modes is being utilized to understand the effect of different co-invention categories on knowledge diversification.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a711f23ccd07f13c8a37e51a33fd4a25",
  "timestamp": "2025-05-15T01:24:51.388689"
}