{
  "id": 4209,
  "title": "Common risk factors for Latin American electric utilities",
  "abstract": "Investment in electric power infrastructure is needed to ensure access to affordable, secure, and sustainable energy in Latin America by 2030. A determining factor to stimulate this type of investment is the rate of return approved by the regulatory commissions. The return expected by investors (cost of equity) depends on the risks associated with these investments. Regulatory commissions commonly use the Capital Asset Pricing Model (CAPM), for which only market risk is relevant. Market risk is low for regulated firms, ignoring other risk types, and is measured with firms and variables outside the Latin American region. This procedure, however, does not consider the risks these types of investments are exposed to in Latin America. In this analysis, six risk factors were initially proposed to explain the risk-return relationship of these types of investments; nevertheless, after an exploratory analysis of the factors, two factors were eliminated to form a four-factor model (Electric-4). Then, the CAPM model was contrasted with the Electric-4 model. Both models used Latin American firms and market variables, and both were evaluated between July 2010 and July 2022. The analysis sample comprises 28 electric utilities dedicated to transmission and distribution. Through regression analysis, we found that the Electric-4 model explains a higher percentage of the variations in the portfolio returns of electric utilities in the Latin American Integrated Market (MILA), Sao Paulo Stock Exchange (BM&F), and Buenos Aires Stock Exchange (BCBA). These results help to understand the risk-return relationship of electric power infrastructure investments in the Americas for investment decision-making. In addition, the proposed model aids the regulatory commissions in Latin America in establishing an adequate return on equity cost of capital that encourages investments in electric power infrastructure.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a71613c264b8b9f55e6a794525965525",
  "timestamp": "2025-05-15T01:24:51.454627"
}