{
  "id": 1870,
  "title": "A New Hybrid AHP and Dempster-Shafer Theory of Evidence Method for Project Risk Assessment Problem",
  "abstract": "In this paper, a new hybrid AHP and Dempster-Shafer theory of evidence is presented for solving the problem of choosing the best project among a list of available alternatives while uncertain risk factors are taken into account. The aim is to minimize overall risks. For this purpose, a three-phase framework is proposed. In the first phase, quantitative research was conducted to identify the risk factors that can influence a project. Then, a hybrid PCA-agglomerative unsupervised machine learning algorithm is proposed to classify the projects in terms of Properties, Operational and Technological, Financial, and Strategic risk factors. In the third step, a hybrid AHP and Dempster-Shafer theory of evidence is presented to select the best alternative with the lowest level of overall risks. As a result, four groups of risk factors, including Properties, Operational and Technological, Financial, and Strategic risk factors, are considered. Afterward, using an L2(boolean AND)4 Taguchi method, several experiments with various dimensions have been designed which are then solved by the proposed algorithm. The outcomes are then analyzed using the Validating Index, Reduced Risk Indicator, and Solving Time. The findings indicated that, compared to classic AHP, the results of the proposed hybrid method were different in most cases due to uncertainty of risk factors. It was observed that the method could be safely used for selecting project problems in real industries.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a71bab48e0bb784eeece52ed5fb945be",
  "timestamp": "2025-05-15T02:08:38.938351"
}