{
  "id": 4135,
  "title": "Does Geopolitical risk drive natural resources extraction globally? A Case of Global",
  "abstract": "Debate on the natural resources is been quite extensive in previous decades while the influence of total natural resources has been sidelined, whereas the impact of many intrinsic factors involve in the driving of natural resources higher or lower presented but not analyzed globally. Therefore, this study aims to investigate the impact of geopolitical risk on the total natural resources with the controlled variables i.e. financial development, renewable energy and trade from 1986 to 2021. Advanced econometric approaches are considered for the study such as for the unit root properties determination in the data, we use ADF-GLS, to examine the long run cointegration between dependent and independent variables, we have used Bayer-Hanck cointegration approach, while the novel methods of moments of quantile regression (MMQR) is employed for long-term impact of variables on the dependent variable and for the robustness check, we have employed bootstrap quantile regression. The empirical findings of the study divulges that geopolitical risk have significant negative impact on the total natural resources across quantiles while the geopolitical risk is insignificant in the lower quantiles because of the precautionary measures countries take to fulfill its demands from natural resources. The results also concluded positive impact of trade on the natural resources while this study recorded negative influence of renewable energy and financial development on the total natural resource across all quantiles. BSQR approach has confirmed the validity of the results of MMQR approach. The study implies that practitioners and scholars should focus on the stability of the regions by devising policies of political harmony and friendly nations.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7207d60c2fec618377e834f364d9619",
  "timestamp": "2025-05-15T02:33:42.050303"
}