{
  "id": 5371,
  "title": "The role of risk management committee on the relationship between corporate carbon emission disclosure and capital structure",
  "abstract": "This study aims to examine the association between carbon emission disclosure and corporate capital structure, moderated by the presence of a risk management committee. Specifically, we aim to explore whether the existence of a risk management committee can mitigate the risks faced by companies when formulating capital structure strategies. We use data from non-financial companies listed in the Carbon Disclosure Project (CDP) from 2015 to 2021 that disclose information on carbon emissions. To test our hypotheses, we employ fixed-effects regression with standard error estimates. Our findings provide evidence that carbon emission disclosure is positively related to corporate capital structure, and that the moderating effect of the risk management committee is also positively associated with carbon emission disclosure and corporate capital structure. In addition, we conduct robustness and endogeneity tests, including Heckman (1979) two-stage least squares, entropy balancing, propensity score matching, and two-step GMM using Arellano-Bond estimation. Furthermore, our study includes a batterary of cross-sectional tests to rigorous the main findings. Finally, our study contributes to the literature on sustainable strategies and sustainable financing at the corporate level.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7210b91b32d919760e7df553df67cbe",
  "timestamp": "2025-05-15T02:47:13.903665"
}