{
  "id": 2851,
  "title": "Two-stage technology opportunity discovery for firm-level decision making: GCN-based link-prediction approach",
  "abstract": "In this study, we propose a graph convolution network (GCN)-based patent-link prediction to predict technology convergence. We address the limitations of previous works, which neglect both the global information of a convergence network and the node features. We employ three features: GCN node features to represent global information, node features to characterize what kinds of information they have and how they are similar, and edge similarity to represent how frequently the two nodes are connected. Considering three categories of in-formation, we conduct link prediction using machine learning (ML) to identify potential opportunities. To identify areas of technology convergence, we also support firm-level decision making using portfolio analysis. This study consists of two main stages: opportunity discovery which employs both GCN-based link prediction and ML, and opportunity validation which evaluates whether the identified technology opportunities are suitable from the firm's perspective. A case study is conducted for the mobile payment industry. A total of 17,540 patent documents with 36,871 positive links are used for GCN link prediction and ML. As a result of firm-level op-portunity validation, a total of 395 cooperative patent classifications (CPC) were predicted to be possibly linked with 32 current CPCs of the target firm. The contributions come from two main aspects. From a theoretical perspective, this study employs GCN and node features to reflect the global graph structure for technology convergence. From a practical perspective, this study suggests how to validate the identified opportunities for firm-level applications.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7300dd9aa8f7db68077756abef2bf70",
  "timestamp": "2025-05-15T01:11:17.356400"
}