{
  "id": 8057,
  "title": "Does a differentiation strategy lead to more sustainable financial performance than a cost leadership strategy?",
  "abstract": "Purpose - The purpose of this paper is to investigate the relationship between the strategic positioning of firms and the sustainability of firm performance. The paper argues that pursuing a differentiation strategy leads to more sustainable financial performance compared to following a cost leadership strategy. However, a differentiation strategy may also be associated with greater risk. Design/methodology/approach - To investigate the research questions, the authors utilize publicly available archival data consisting of 12,849 firm-year observations for the period 1989-2003. In the first stage of the analysis, factor analysis is used to determine firms' strategic positioning. The resulting factor scores are subsequently used in regression analysis to investigate the sustainability of performance based on the strategic positioning of firms. Findings - The results indicate that both cost leadership and differentiation strategies have a positive impact on contemporaneous performance. However, the differentiation strategy allows a firm to sustain its current performance in the future to a greater extent than a cost leadership strategy. The differentiation strategy, though, is also associated with greater systematic risk and more unstable performance. Originality/value - Sustainability of performance refers to how much a firm's current profitability can be sustained in future periods. The main contribution of this study is the comparison of generic strategies based on the sustainability of firm performance. This aspect of the strategy-performance link has not been considered in prior work. Another contribution of the study is that it considers multiple dimensions of firm performance in order to evaluate the trade-offs involved with pursuing different strategies. In particular, the authors contribute to the literature by documenting that while differentiation leads to more sustainable earnings, it also leads to riskier and more unstable earnings.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7341a3a56b95c245a0f27bd49faf825",
  "timestamp": "2025-05-15T03:14:37.410913"
}