{
  "id": 5253,
  "title": "Brown Risk or Green Opportunity? The dynamic pricing of climate transition risk on global financial markets",
  "abstract": "There is mixed evidence about the pricing of climate transition risk on financial markets. I contribute to this debate methodologically by measuring firms' climate transition risk with a sector/technology classification. Thereby, I complement approaches relying on contested ESG and incomplete CO2 data. Moreover, I contribute empirically by comparing the pricing of brown and green pure-play companies in the time-series and crosssection. By focusing on companies' technologies, I find that green stocks outperform significantly in the timeseries. The annual outperformance of green vs. brown stocks of similar to 20 % is higher than previous estimates and very robust. Interestingly, the green outperformance accelerated after the Paris Agreement, suggesting that green stocks benefited from an unexpectedly strong increase in transition risk concern. I also calculate a technologybased Brown Minus Green Factor, which exhibits low correlations with other factors. Using the Fama and MacBeth (1973) procedure, I find initial evidence that the factor is negatively priced in the cross-section of returns. Through propensity score matching, I finally show that brown firms carry substantially higher forwardlooking dividend yields, indicating that investors expect higher payouts for holding riskier assets.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a756a32ee79ab3c212f8aa2d7f861880",
  "timestamp": "2025-05-15T02:45:47.505802"
}