{
  "id": 9183,
  "title": "Understanding factors that impact the acquisition of Independent Living Skills among young people transitioning from Out-of-Home Care",
  "abstract": "Background and Aims: Independent Living Skills (ILS) are essential to support young people as they enter adulthood. Negative outcomes are consistently observed across a variety of different independent living areas of life for care experienced young people. This study aimed to analyse ILS measure scores across eight ILS domains and overall, completed by young people from Western Australia (WA), to understand how they differ between participants who were still in-care (n = 49) and who had left-care (n = 73), and what factors (such as care experience and personal characteristics) moderate the acquisition of ILS. For this paper, the overarching concept of ILS is defined by young people's ILS measure scores, where higher self-reported scores are interpreted as greater confidence and competence in ILS (overall and for each of the eight ILS domains). Methods: Participants (N = 122) aged between 15 and 25 years completed an ILS measure as part of the Navigating Through Life, longitudinal, mixed-method, population-based study. This present study considers data from wave 1 (of 5) of the NTL study, where eight ILS domains were identified: Financial Management, Knowledge of Accessing Available Supports, Managing Housing, Education Planning, Job Seeking, Health Risk Management, Domestic and Self-help Task, and Managing Relationships. This study explored how dependent variables (the ILS overall scores and 8 ILS domain scores) are associated with participants' care experience and demographic characteristics (the independent variables) via linear regression and an exploratory multivariate moderator analysis. Results: The in-care and left-care groups' ILS measure scores were comparable. Of the independent variables, care status, self-determination, and regionality were significant (p-value=<.05), predicting greater ILS measure scores across the ILS domains and/or overall. Whereas the independent variables of placement stability, longest placement type, gender, taking part in an enhanced leaving care scheme (ELCS), and Aboriginal and Torres Strait Islander status were not significant predictors of higher ILS measure scores. Moderator analyses were conducted for the overall ILS scores, the Health Risk Management, and the Domestic and Self-help Task domain scores (dependent variables). No significant interaction effects were found for care status, self-determination, and regionality, which were identified as significant factors in and of themselves. Discussion and Conclusion: This study emphasises that ILS domains are interlinked, and findings should be utilised to further highlight the significance of the transition to adulthood stage, especially given the similarities in scores for both in-care and left-care groups. Future research could look at transition pathways that prioritise different ILS domains depending on young people's different needs at different times to support their overall ILS acquisition.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7635a97858d94e7d524a1cd1196224e",
  "timestamp": "2025-05-15T03:26:25.970816"
}