{
  "id": 6404,
  "title": "Are crypto-investors overconfident? The role of risk propensity and demographics. Evidence from Brazil and Portugal",
  "abstract": "Purpose - The crypto market is growing quickly, marked by a lack of fundamentals, and the risks are not yet fully comprehended by participants. Our goal is to investigate overconfidence in this market and analyze the role that risk propensity and certain demographics play. Design/methodology/approach - We conducted a survey in Brazil and Portugal, leveraging an online questionnaire disseminated via social media channels to engage a diverse adult population. We collected a total of 826 responses, addressing ethical considerations throughout the process. The data analysis was conducted using SPSS statistical software and logit regression modeling. Findings - Our study reveals that overconfidence is a notable bias that distinguishes individuals who invest in cryptocurrencies from those who do not. Although overconfidence and risk propensity are closely linked, they originate from distinct personal characteristics. Furthermore, our findings indicate that age and market experience positively correlate with overconfidence and negatively correlate with risk propensity. Financial knowledge, interestingly, did not prove to be a significant factor for cryptocurrency investment. Originality/value - Our research augments the existing literature on overconfidence, delving into this phenomenon in a new subdomain, and in doing so, it enriches our comprehension of the unique and still relatively under-researched cryptomarket. Moreover, we illuminate individual factors that sway the decision to invest in cryptocurrencies and should be considered by market participants.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7673040bb869f18bf3be317e3ebe04c",
  "timestamp": "2025-05-15T02:57:38.843898"
}