{
  "id": 7051,
  "title": "Digital Transformation and ESG Performance: A Quasinatural Experiment Based on China's Environmental Protection Law",
  "abstract": "The bioeconomy model provides an alternative view of global economic systems by putting sustainable practices combined with digital approaches at the forefront to tackle issues such as climate change. To address this new business trends, financial institutions began to set up the environmental, social, and governance (ESG) business units to evaluate their business strategies. This paper is aimed at examining the nonfinancial effect created by the digital transformation (DT) activities, highlighting the role of enterprise heterogeneity after the implementation of Environmental Protection Law (EPL) in China. We employ the panel data of A-share listed companies from 2010 to 2020, selecting DT and ESG indicators as the important representations of Industry 5.0. Our empirical results demonstrate a positive impact of EPL on the ESG performance in sight of resource enterprises (REs), environmental enterprises (EEs), and polluting enterprises (PEs), but a negative impact of EPL on the DT indicators among those environmental related industries. Additional causal relationship regression reveals that enterprise DT has an intrinsic promoting effect on the ESG performance, emphasizing on the high risk of digitization process being the shock transmitters to enterprise nonfinancial indices. Notably, the connectedness of environmental policy illustrates dynamic patterns by parallel trend test and propensity score matching (PSM) DID regression. This paper is prone to benefit lawmakers, regulators, and firm executives responsible for analyzing and assessing enterprise digitization behavior by exploring the influence of macrolevel environmental policy.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a77fb9002848ef725530d4ba59727fc2",
  "timestamp": "2025-05-15T03:04:23.038902"
}