{
  "id": 3431,
  "title": "Approaches on Correlation between Board of Directors and Risk Management in Resilient Economies",
  "abstract": "The recent financial crisis highlighted the need for a strong emphasis on the effectiveness of board risk oversight practices. Good corporate governance upholds effective risk management, which in turn ensures the flexibility to reply to unpredicted threats and take benefit of opportunities. Thus, risk management affords corporate resilience that engenders competitive advantage due to the capacity to circumvent, deter, defend, react, and adjust to any kind of disturbance, besides recovering quickly. Guaranteeing that the board is prepared and adequately resilient to deal with a crisis circumstance is a crucial part of good governance. By employing a data set of companies listed in Romania, this paper analyzes whether boards of directors influence risk management. We measure boards by means of size, independence, diversity, establishment of Consultative Committees, as well as CEO duality, gender, age, and tenure. Based on ten financial ratios, we develop two risk indicators regarding shareholders' wealth and short-term risk, alongside a global business failure risk tool, by means of principal component analysis. Furthermore, the output of the multivariate regression analysis show that CEO gender, the size of the board, and Audit Committee negatively influence business failure risk.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a788c1b17ca2a5810eda5712182b0f42",
  "timestamp": "2025-05-15T02:26:09.154064"
}