{
  "id": 8827,
  "title": "Cost-related medication nonadherence in US adults with asthma The National Health Interview Survey, 2013-2020",
  "abstract": "Background: Asthma is a chronic disease that needs long-term control for secondary prevention. Health-related expenditures resulting from asthma are rising in the United States, and medication nonadherence is associated with adverse health outcomes in patients with asthma.Objective: To estimate the prevalence and risk factors of cost-related medication nonadherence (CRN) in individuals with asthma in the United States.Methods: We identified patients aged above or equal to 18 years with a history of asthma in nationally representative cross-sectional data, the National Health Interview Survey 2013 to 2020. Participants were considered to have experienced CRN if at any time in the 12 months they reported skipping doses, taking less medication, or delaying filling a prescription to save money. The weighted prevalence of CRN was estimated overall and by subgroups. Logistic regression was used to identify CRN-related characteristics.Results: Of the 26,539 National Health Interview Survey participants with a history of asthma, 4360 (15.77%; representing 3.92 million of the US population) reported CRN, with 10.12% (weighted 2.51 million) of patients skipping doses to save money, 10.82% (weighted 2.69 million) taking less medication to save money, and 13.35% (weighted 3.31 million) delaying filling a prescription to save money. The subgroups young, women, low income, no health insurance, currently smoking, and with comorbidities had a higher prevalence of CRN. The results of this sensitivity analysis did not differ from the overall results.Conclusion: In the United States, 1 in 6 adults with a history of asthma is nonadherence with medications due to costs. Removing financial barriers to accessing medication can improve medication adherence in patients with asthma.(c) 2023 American College of Allergy, Asthma & Immunology. Published by Elsevier Inc. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7969df204830b31d92f67f0da5f36ba",
  "timestamp": "2025-05-15T03:22:57.890375"
}