{
  "id": 8756,
  "title": "Mental Health and Related Factors Among Undergraduate Students During SARS-CoV-2 Pandemic: A Cross-Sectional Study",
  "abstract": "BackgroundMental health problems among undergraduates are a significant public health concern. Most studies exploring mental health in this population during the pandemic have been conducted in high-income countries. Fewer studies come from Latin American countries. The aim of this study was to determine the prevalence of depression, anxiety, stress, insomnia, and suicide risk, and explore the association with several relevant variables in personal, family, university, and SARS-CoV-2 pandemic domains. MethodsA cross-sectional study was conducted in Chile in a medium-size private University. Outcome variables were explored with valid instruments: Depression, Anxiety, and Stress Scale (DASS-21), Insomnia Severity Index (ISI), and the Columbia-Suicide Severity Rating Scale (C-SSRS). Independent variables from personal (e.g., sex, age, sexual orientation, history of mental health problems, substance use), family (e.g., parental educational background, family history of mental health problems, family functioning), university (e.g., course year, financial support, psychological sense of university belonging, history of failing subjects) and SARS-CoV-2 domains (e.g., history of personal and family contagion, fear of contracting SARS-CoV-2, frequency of physical activity, keeping routines and social contact). Multivariable logistic regression models were conducted for each outcome, after univariable and domain-specific multivariable models. The significant variable at each step was selected if the p-value was <= 0.05. ResultsA total of 5,037 students answered the survey-the global response rate of 63.5%. Most of the students were females (70.4%) and freshmen students (25.2%). The prevalence of mental health problems was high: depression (37.1%), anxiety (37.9%), and stress (54.6%). Insomnia was reported in 32.5% of students, and suicide risk in 20.4% of students. The associated variables at personal domain were history of mental health problems, substance use, and sexual orientation; at family domain, family functioning and family history of mental health problems; at university domain, violence victimization and sense of belonging; and in SARS-CoV-2 domain, having a daily routine and fear to contracting SARS-CoV-2 by students themselves or others. ConclusionsThe prevalence of mental health problems is high among undergraduate students and some of the associated factors, such as victimization and a sense of belonging can be used in preventive interventions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a79612cf1b291f29448f0d76bfd5a92c",
  "timestamp": "2025-05-15T03:21:56.737784"
}