{
  "id": 474,
  "title": "Optimizing investment portfolios with a sequential ensemble of decision tree-based models and the FBI algorithm for efficient financial analysis",
  "abstract": "This research presents a comprehensive, sequential ensemble framework meticulously crafted for optimizing investment portfolios, focusing on the construction industry. It employs decision tree-based and metaheuristic optimization algorithms to create an efficient stock-selection framework grounded in financial analysis. This approach offers a profitable investment strategy integrated with portfolio optimization while systematically lowering the portfolio investment threshold. In this framework, a web crawler was deployed to gather daily closing prices of stocks from the Taiwan Stock Exchange, along with monthly revenue data and financial statements. Subsequently, decision tree-based models were utilized to pinpoint the fundamental financial indicators with significant explanatory power over revenues. The stock selection conditions aligned with these indicators were optimized through a newly developed metaheuristic algorithm named the forensic-based investigation (FBI) optimizer. The optimal conditions were subsequently integrated with the equal-weighting scheme, mean-variance method, and hierarchical risk parity to identify the most effective investment portfolio strategies. Backtesting results showed that the proposed stock-portfolio investment strategy, optimized through machine learning and a metaheuristic algorithm, is well-suited for construction and all -stock categories. This study equips professional investment advisors or securities investment institutions with a decision-aid expert system for initial stock selection.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7a0e73fc0654a1592134cec4c855a04",
  "timestamp": "2025-05-15T01:51:31.206445"
}