{
  "id": 8033,
  "title": "The burden of chronic diseases in a rural North Florida sample",
  "abstract": "Background: The degree of health disparities present in rural communities is of growing concern and is considered urgent since rural residents lag behind their urban counterparts in health status. Understanding the prevalence and type of chronic diseases in rural communities is often difficult since Americans living in rural areas are reportedly less likely to have access to quality health care, although there are some exceptions. Data suggest that rural residents are more likely to engage in higher levels of behavioral and health risk-taking than urban residents, and newer evidence suggests that there are differences in health risk behavior within rural subgroups. The objective of this report is to characterize the prevalence of four major and costly chronic diseases (diabetes, cardiovascular disease, cancer, and arthritis) and putative risk factors including depressive symptoms within an understudied rural region of the United States. These four chronic conditions remain among the most common and preventable of health problems across the United States. Methods: Using survey data (N = 2526), logistic regression models were used to assess the association of the outcome and risk factors adjusting for age, gender, and race. Results: Key findings are (1) Lower financial security was associated with higher prevalence of cardiovascular disease, arthritis, and diabetes, but not cancer. (2) Higher levels of depressive symptoms were associated with higher prevalence of cardiovascular disease, arthritis, and diabetes. (3) Former or current smoking was associated with higher prevalence of cardiovascular disease and cancer. (4) Blacks reported higher prevalence of diabetes than Whites; Black women were more likely to report diabetes than all other groups; prevalence of diabetes was greater among women with lower education than among women with higher education. (5) Overall, the prevalence of diabetes and arthritis was higher than that reported by Florida and national data. Conclusions: The findings presented in this paper are derived from one of only a few studies examining patterns of chronic disease among residents of both a rural and lower income geographic region. Overall, the prevalence of these conditions compared to the state and nation as a whole is elevated and calls for increased attention and tailored public health interventions.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7a1a346ba858a8320a12acb508b06aa",
  "timestamp": "2025-05-15T03:14:37.323331"
}