{
  "id": 8901,
  "title": "The Role of Physician Professional Networks in Physicians' Receipt of Pharmaceutical and Medical Device Industries' Payments",
  "abstract": "BACKGROUND: Financial relationships between physicians and the pharmaceutical and medical device industries are common, but the factors associated with physicians receiving payments are unknown. OBJECTIVE: The objective of this study is to evaluate the influence of physicians' professional networks' characteristics on the receipt of payments among physicians. DESIGN: Network analysis of cross-sectional data PARTICIPANTS: US physicians who shared Medicare patients with other physicians in 2015 (N=357,813). EXPOSURE (INTERVENTION): Proportion of a physician's professional network that received industry payments and other network characteristics including number of physician connections, how central the physician is within the network, and the tightness of the referral network in which a physician is located. MAIN OUTCOME MEASURES: Relative risk of receiving industry payments. We used modified Poisson regression to control for confounding by gender, time since graduation, practice size, and practice setting (teaching hospital vs. not). We included dummy variables for specialty and hospital referral region level. KEY RESULTS: The proportion of a physician's peers in their professional network that received payments was strongly associated with receipt of pharmaceutical or device industry payments by the physician (top vs bottom quartile aRR=1.28, 95%CI=1.25-1.31). Physician's centrality within a network had a small positive effect on receiving payment (top vs bottom quartile aRR=1.02, 95%CI=1.01-1.04). Network density also had a small negative association with receipt of payment (top vs bottom quartile aRR=0.97, 95%CI=0.96-0.98). CONCLUSIONS: Network characteristics, particularly the receipt of payments among physicians one shares patients with, are associated with whether a physician receives payments. This finding has implications for institutional regulation of industry payments to physicians and demonstrates how institutional policy may impact not only the physicians within the institution but also physicians outside of the institution.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7a594c729d04e4adfed9714030b1eb1",
  "timestamp": "2025-05-15T03:23:27.866687"
}