{
  "id": 2705,
  "title": "Predicting Porosity by Using Seismic Multi-Attributes and Well Data and Combining These Available Data by Geostatistical Methods in a South Iranian Oil Field",
  "abstract": "Determination of petrophysical parameters by using available data has a specific situation in exploration and production study in oil and gas industries. For example, estimating of corrected porosity as a petrophysical parameter can help in decisions that have high financial risk such as drilling. Therefore, study of seismic data, extraction of seismic attributes from them, and incorporation of these attributes by well log data is an important key for detection of reservoir properties. The authors' main purpose was to enhance the characterization of subsurface reservoir by improving the prediction of porosity through the combination of reservoir geophysics (seismic attributes) and well logs data. At first step, inversion was carried out on seismic data and well logs, subsequently seismic attributes were extracted from the mentioned data by mathematical algorithms. Next the extracted seismic attributes were combined by using step-by-step regression algorithm. In next stage, the authors determined a relationship among a set of seismic attributes and a reservoir parameter such as porosity in well locations by using a neural network, and then this relationship was used for calculation reservoir parameters from sets of appropriate seismic attributes throughout a seismic volume. Therefore it is possible to plot porosity in areas of reservoir that are far from the wells. There is a good correlation between porosity log and this predicted porosity from seismic attributes. This porosity is use as secondary variable in collocated cokriging technique for interpolating porosity in studied reservoir zone.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7aec0fe024c4fa2e52aa93af1879b64",
  "timestamp": "2025-05-15T02:18:06.272318"
}