{
  "id": 3104,
  "title": "Portfolio Management and Stock Request Behavior: Implications for Developer- and Economy-Oriented Game Design",
  "abstract": "The realm of retail investment encompasses a spectrum of decisions made by individuals seeking to allocate resources in anticipation of future returns. This study examines the implications of portfolio management and stock request behavior for developer- and economy-oriented game design. The research methodology uses a simulated investment game to bridge the gap between simulated environments and real-life investment scenarios. A total of 888 participants, aged 20-24 years, engaged in the game, which featured 66 companies and 49 rounds, simulating a 49-day tenure of companies in the market. We employed Bayesian statistical methodology to estimate the likelihood of participants being female based on the sex ratio in the sample. Additionally, we used SVD (singular value decomposition) to smooth the data matrix representing the investment choices made by participants across the companies and rounds. Furthermore, we employed the DBSCAN algorithm to detect clustering in the 66 rows of SVD-smoothed mean share prices. By incorporating elements of realism, complexity, and strong participant motivation, we provided a robust and immersive investment experience compared to existing investment games. The findings contribute to a better understanding of individual investment decision-making processes within the game theory framework.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7b3b68118099e588c1bb1e22e4953d7",
  "timestamp": "2025-05-15T01:13:45.159916"
}