{
  "id": 1375,
  "title": "Estimating the relative effects of raw material prices, sectoral outlook and market sentiment on stock prices",
  "abstract": "Identification of key determinants responsible for driving stock prices across the world is of paramount practical importance. The task is extremely arduous owing to sensitiveness of financial markets to macroeconomic shocks, external chaos, political instability and natural calamities. In this work, effort has been made to critically evaluate the influence of raw material prices, sectoral outlook, and market sentiment on stock prices at a granular level in the Indian context. The research resorts to wavelet analysis and machine learning models to estimate time varying dependence and explanatory capabilities of respective constructs. Wavelet coherence and correlation analyses have been conducted to decode the interaction bond of three determinants i.e., raw material prices, sectoral outlook, and market sentiment with stock prices of a sample set of Indian companies during short, medium, and long run scales. Boruta feature selection algorithm has been applied in conjunction with three dedicated machine learning approaches namely, Random Forest, Gradient Boosting, and Genetic Algorithm for ranking the three features based on their explanatory capabilities across different time intervals. Overall findings suggest that the influence of respective features varied across different time horizons which can be leveraged for portfolio management.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7beb1e5f898392a9178273e83a0d113",
  "timestamp": "2025-05-15T00:54:56.539055"
}