{
  "id": 9378,
  "title": "Skilled Nursing Facility Changes in Ownership and Short-Stay Medicare Patient Outcomes",
  "abstract": "Importance Skilled nursing facility (SNF) changes in ownership are receiving attention in the national conversation regarding health care quality and oversight. SNF ownership changes have been cited as possible ways for SNFs to obscure financial arrangements and shift funds away from patient care; however, it is unclear whether ownership changes are associated with quality outcomes, especially for short-stay patients.Objective To determine which SNF characteristics are associated with changes in ownership and whether ownership changes were associated with differences in short-stay patient outcomes.Design, Setting, and Participants This cohort study was a secondary analysis of 2016 to 2019 Medicare administrative data including SNFs in the United States with complete data. Data were analyzed from January 2016 through December 2019.Exposure SNF change in ownership.Main Outcomes and Measures Outcomes of interest were facility-level risk-adjusted rates of hospital readmissions, emergency department visits, and community discharge for short-stay patients after admission to an SNF. Analyses were conducted using multivariable logistic regression and controlled interrupted time series.Results Of 11 004 SNFs, 1459 (13.26%) changed ownership between 2016 and 2019. Compared with for-profit SNFs, nonprofit and government SNFs had lower odds of changing ownership (nonprofit: odds ratio [OR], 0.40; 95% CI, 0.32-0.49; government: OR, 0.26; 95% CI, 0.17-0.41). Chain SNFs had higher odds of changing ownership than nonchain SNFs (OR, 1.38; 95% CI, 1.21-1.59). Urban SNFs with lower occupancy rates (OR per 10-percentage-point decrease, 1.19; 95% CI, 1.14-1.25), larger Medicaid populations (OR per 10-percentage-point increase, 1.17; 95% CI, 1.13-1.22), and lower staffing ratings (OR per 1-star increase on staffing rating, 1.18; 95% CI, 1.14-1.25) had higher odds of changing ownership. Descriptively, all 3 quality outcomes were worse throughout the study in SNFs undergoing ownership change compared with controls that did not change ownership. However, results of interrupted time series models found no associations between an ownership change and hospital readmissions or community discharge rates. Ownership change was associated with a short-term increase of 0.32 (95% CI, 0.03 to 0.62) percentage points in emergency department visits.Conclusions and Relevance In this cohort study of 11 004 SNFs in the US between 2016 and 2019, SNF characteristics historically associated with lower quality were more likely to change ownership; however, ownership changes were only associated with short-term increases in ED visits. These results suggest that SNF ownership changes may be a symptom, not a cause, of lower quality.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7c13a34b81b80ddc5a270a5c9766fe8",
  "timestamp": "2025-05-15T03:28:17.568497"
}