{
  "id": 7503,
  "title": "Is ESG disclosure associated with bank performance? Evidence from the Visegrad Four countries",
  "abstract": "Purpose - The purpose of this paper is to investigate the relationship between ESG disclosure and banks performance and to discuss how banks are committed to the implementation of sustainability issues. Design/methodology/approach - The authors examined the annual, risk and sustainability reports published by 26 banks located in four Central European countries (Czech Republic, Hungary, Poland and Slovakia) in the period of 2017-2021. The authors applied the methodology of content analysis and developed indexes. Panel regression was performed to improve and ensure the robustness of this study. Findings - The results show that social and governance aspects dominate the ESG preparedness; however, after 2019, there was a significant improvement in the integration of environmental issues. This study confirms a strong association between bank size (total assets) and ESG reporting, and between capital adequacy and ESG reporting. The results demonstrate that there is no connection between banks' operational and financial performance and ESG disclosure. Finally, this study concludes that the integration of ESG risks into the risk management framework is at an early stage. Practical implications - This study also adds to the existing research in the field of sustainability reporting. For regulators, this research proves their essential role in the facilitation of sustainable development. For practitioners, the ESG disclosure index could serve as a detection tool in the sustainability self-assessment process. Originality/value - The authors examined - through a self-developed multidimensional ESG disclosure index - the sustainability reporting of the banking sector in four countries from the Central European region.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a7f58e96c566cb94327656b15f76c6fb",
  "timestamp": "2025-05-15T03:09:07.352185"
}