{
  "id": 264,
  "title": "The effect of international energy market shocks on coal price of China based on the fuzzy integrated vector auto regression and error correction model",
  "abstract": "From the perspective of external market shocks, this paper proposed fuzzy integrated vector auto regression (FVAR) model that determines the long-term basis and short-term basis interactions of China's coal price with international energy prices. The proposed FVAR preform coal price fluctuation based on long-term and short term span in six stages including unit root testing, Johansen cointegration test, vector auto regression (VAR) model construction, fuzzification of VAR model, vector error correction (VEC) model and an impulse response function(IRF). It is observed that there is a steady long-term stability and equilibrium bond between the China's domestic coal price, international coal price and the international crude (unrefined) oil price. The international coal and international crude oil price have an opposite effect on China's domestic coal price. In addition, the former has a stronger fuzzy price discovery function on China's domestic coal market than the latter. In the short term, China's domestic coal price is more complex to instability reactions and is affected by market expectations. The international energy market is more effective than domestic coal market, and there is a relatively stable price adjustment mechanism between the two, with the international coal price playing a leading role in the fuzzy guidance of China's coal price. Therefore, in reference to international energy pricing models, the paper proposes a fuzzy pricing model for a coal futures index based on the coal futures trading price and supplemented by the premium and discount agreed to by both trading parties.",
  "year": 2021,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a80234d1102258cbf1eebb947fe81ec1",
  "timestamp": "2025-05-15T01:30:19.053273"
}