{
  "id": 3989,
  "title": "Maintaining web-based bibliographies: A case study of Iter, the bibliography of renaissance Europe",
  "abstract": "This paper introduces Iter [1], a newly formed, non-profit research project dedicated to increasing access to all published materials pertaining to the Renaissance and, eventually, the Middle Ages. Issues related to building and maintaining Iter's first Web-based bibliography, the Iter Bibliography are discussed, focusing exclusively on printed secondary materials from the journal literature. Information management issues can be divided into the issues related to the management of the information in the her records, and those related to the management of these records in the Iter database. Tools used to help manage and enable access to the information in the Iter records include: Machine Readable Code (MARC) record format; Angle-American Cataloguing Rules (AACR2R); Library of Congress Subject Headings (LCSH); Abridged Dewey Decimal Classification system (DDC); and automated authority files using a DRA cataloguing system. A special record status code assigned to each record is used to help manage the records in the Iter database. The code, which is used to identify all records from a particular journal at a specific step in the work flow, facilitates the movement of records from one step in the work flow to another. Careful consideration was given regarding the tools selected to help maintain the Iter Bibliography. In the end, the information management decisions made for the Iter Bibliography will have a pronounced affect on the way users query the Bibliography and view search results. Lessons learned will help structure how new bibliographies are added to Iter's portfolio of online services.",
  "year": 1997,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a810c716572c448045a0fdc0208c281c",
  "timestamp": "2025-05-15T01:22:39.437053"
}