{
  "id": 8830,
  "title": "Correlates of suicidal ideation related to the COVID-19 Pandemic: Repeated cross-sectional nationally representative Canadian data",
  "abstract": "Objective: With significant levels of mental distress reported by populations, globally, the magnitude of suicidal ideation during and beyond the COVID-19 pandemic is a central concern. The goal of this study was to quantify the extent of pandemic-related suicidal ideation in the Canadian population during the first ten months of the pandemic and identify sociodemographic and pandemic-related stressors associated with increased risk of ideation. Method: Data were derived from three rounds of a mental health monitoring survey, nationally representative by age, gender, household income, and region, delivered online in May 2020, September 2020, and January 2021. Bivariate analyses were used to quantify the proportion of respondents in Canada reporting suicidal ideation by sociodemographic factors and pandemic-related stressors. Unadjusted and adjusted multivariable logistic regression was used to study the association between suicidal ideation and correlates within four pandemic-related stressor categories (financial, relationship, substance use, COVID-19 exposure). Results: Of the 7002 respondents, 6.2% (n = 433) reported experiencing suicidal thoughts or feelings as a result of the pandemic within the two weeks prior to taking the survey. In terms of sociodemographic factors, suicidal ideation was more commonly reported among those who were not cisgender, <65 years-old, single, Indigenous, LGBT2Q+, and who experience a pre-existing mental health condition. After adjusting for sociodemographic factors, indicators across all four pandemic-related stressor categories were associated with two or more times the odds of suicidal ideation. Conclusion: Disparities in COVID-19 related suicidal ideation have persisted throughout the first year of the pandemic for specific sociodemographic sub-groups and those who have faced stressors related to finances, relationships, increased substance use, and COVID-19 virus exposure. To best address these disparities and to prevent a transition from suicidal ideation to action, appropriate planning, resources, and policies are needed to ensure health and well-being for everyone.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a81524c6f7421d9bf7da0c9452ec81dd",
  "timestamp": "2025-05-15T03:22:57.895369"
}