{
  "id": 9300,
  "title": "Current status and influential factors associated with adherence to self-monitoring of blood glucose with type 2 diabetes mellitus patients in grassroots communities: a cross-sectional survey based on information-motivation-behavior skills model in China",
  "abstract": "ObjectiveSelf-monitoring of blood glucose (SMBG) plays a vital role in the maintenance of blood glucose with type 2 diabetes mellitus(T2DM) and pre-diabetes patients. The study was intended to describe the current status of SMBG with T2DM and pre-diabetes patients in grassroots communities, explore the relationship between SMBG frequency and blood glucose level and apply information-motivation-behavior(IMB) model to analyze the potential influencing factors of SMBG compliance based on electronic questionnaires. MethodsA cross-sectional study was conducted with 1388 T2DM and pre-diabetes patients who completed electronic questionnaires composed of demographics and IMB model content. Chi-square test, Mann-Whitney U test and multivariable logistic regression model analysis were utilized to explore deeply causes of SMBG compliance. ResultsThe results of this study showed that among 1388 T2DM patients, only 26.2% (363/1388) patients reached SMBG standard, indicating low compliance with SMBG. Given that SMBG is one of the individual predictors of type 2 risk in prediabetes patients, this result suggests that the SMBG compliance rate needs to be improved. Patients with fixed occupation (OR=1.989, P=0.035), BMI in normal range (OR=1.336, P=0.049), smoking habit(OR=1.492, P=0.019), understanding SMBG frequency (OR=1.825, P<0.001), understanding control goal of blood glucose (OR=1.414, P<0.001), knowing all the functions of the blood glucose meter (OR=1.923, P<0.001), buying a blood glucose meter/test paper conveniently(OR=2.329, P=0.047), taking supplementary measurement when forgetting blood glucose test(OR=2.044, P=0.005), rotating all the fingers when measuring blood glucose (OR=1.616, P<0.001) and less pain at the needling site(OR=2.114, P<0.001)were independently promoting factors of adherence to SMBG. However, the lack of accessibility and convenience of blood glucose meter or heavy financial burden were blocking factors of adherence to SMBG. Moreover, there were still bottlenecks such as lack of health care knowledge and needle pricking pain. ConclusionThis study verified the practicability of applying IMB model to SMBG with T2DM and pre-diabetes patients. Adherence to SMBG still remained to improved, and putting more emphasis in improvement of individual information, motivation and behavioral skills with patients might be beneficial to maintain better adherence to SMBG in long-term routine of diabetes self-management.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a81873a2b08bd6e4b26ab0610b0f618a",
  "timestamp": "2025-05-15T03:27:25.063341"
}