{
  "id": 1881,
  "title": "Sovereign CDS Spread and Term Structure Forecasting Based on Neural Network",
  "abstract": "The article aims to forecast credit risk for BRICS countries using daily credit default swaps (CDS) spreads obtained from Datastream data base from 2018 to 2023. Our approach consists, first, of forecasting the CDS spread in order to estimate the forecasted CDS term structure. The general regression neural network (GRNN) is used to predict the CDS spread. By checking the accuracy of the prediction, the results show that the GRNN model can be recommended as an effective forecasting tool for CDS spread. Second, the predicted spreads are used to estimate the forecasted CDS term structure using the Nelson-Siegel model. The results show that for Russia, overall, the CDS spreads in the long term are less than those in the short term, which implies that the future outlook is more optimistic, given the events that occurred during the study period, but it still retains the highest level of credit risk compared to other countries. Unlike Brazil, India and South Africa, the future outlook is more pessimistic. For China, the term structure is unstable; in the short term, there is a tendency to reduce the risk, but for longer horizons, the risk will increase. Thus, BRICS countries have different risk profiles depending on investment horizons. The study's findings help policymakers in developing tailored risk management strategies for BRICS countries and guide investors in making informed credit investment decisions. The use of advanced forecasting tools like GRNN and Nelson-Siegel models emphasizes the importance of sophisticated techniques in enhancing financial market resilience.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a81a429b8356d5ef324df111bbc7776f",
  "timestamp": "2025-05-15T02:08:39.023905"
}