{
  "id": 2722,
  "title": "The Impact of Financial Culture on the Operation of Hungarian SMEs before and during COVID-19",
  "abstract": "The main aim of this study is to explore the conceptual framework of corporate financial culture and its practical relevance in an emerging Central European market economy, at the level of the Hungarian SME, with a special emphasis on the Hungarian SME sector. In our study, we highlight each dimension of corporate financial culture, focusing on the established corporate financial culture index, and within it, we examine the significance of the financial management elements sub-index and the risk and insurance sub-index separately. In addition, we look for logical, causal, and statistically verifiable relationships between corporate financial literacy and the outcome of corporate financial decisions and corporate risk taking. The relationships were broken down over two years in the analysis. Approximately 2167 responses were included in the 2019 sample and 3281 in the 2021 sample. These representative samples were taken from the Hungarian SME sector and multiple linear regression models were built to find a significant moderation effect of financial literacy between perceived risks and the insurance activity of companies. We conducted our research in two different periods, the unique feature of which is that we conducted a survey before and during the coronavirus crisis, so we could make a comparative analysis. The method used in this research study is a literature review analysis of reference manuscripts, discussing topics related to financial literacy, corporate risk management, and corporate financial management, published in the last 10 years. Our results show that there are positive and significant relationships between company management, corporate risk management, and corporate financial literacy. The results of our study draw the attention of company leaders to the practical significance of financial culture-efficiency, profitability, and stability.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a81fadcd2b7352b3fd63cbb0863d7644",
  "timestamp": "2025-05-15T02:18:37.039341"
}