{
  "id": 5893,
  "title": "Improvements and Gaps in Financial Risk Protection Among Veterans Following the Affordable Care Act",
  "abstract": "Background Despite public perception, most of the nearly 20 million US veterans have health coverage outside the Veterans Health Administration (VHA), and VHA eligibility and utilization vary across veterans. Out-of-pocket healthcare spending thus remains a potential source of financial hardship for veterans. The Affordable Care Act (ACA) aimed to expand health insurance access, but its effect on veterans' financial risk protection has not been explored. Objective To evaluate whether ACA implementation was associated with changes in veterans' risk of catastrophic health expenditures, and to characterize drivers of catastrophic health spending among veterans post-ACA. Design Using multivariable linear probability regression, we examined changes in likelihood of catastrophic health spending after ACA implementation, stratifying by age (18-64 vs 65+), household income tercile, and payer (VHA vs non-VHA). Among veterans with catastrophic spending post-ACA, we evaluated sources of out-of-pocket spending. Participants Nationally representative sample of 13,030 veterans aged 18+ from the 2010 to 2017 Medical Expenditure Panel Survey. Intervention ACA implementation, January 1, 2014. Main Measures Likelihood of catastrophic health expenditures, defined as household out-of-pocket spending exceeding 10% of household income. Key Results Among veterans aged 18-64, ACA implementation was associated with a 26% decrease in likelihood of catastrophic health expenditures (absolute change, -1.4 percentage points [pp]; 95% CI, -2.6 to -0.2; p=0.03), which fell from 5.4% pre-ACA to 3.9% post-ACA. This was driven by a 38% decrease in catastrophic spending among veterans with non-VHA coverage (absolute change, -1.8pp; 95% CI, -3.0 to -0.6; p=0.003). In contrast, catastrophic expenditure rates among veterans aged 65+ remained high, at 13.0% pre- and 12.5% post-ACA. Major drivers of veterans' spending post-ACA include dental care, prescription drugs, and home care. Conclusions ACA implementation was associated with reduced household catastrophic health expenditures for younger but not older veterans. These findings highlight gaps in veterans' financial protection and areas amenable to policy intervention.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a829dc3a2bd77e999757236898583d3f",
  "timestamp": "2025-05-15T02:52:31.469778"
}