{
  "id": 8621,
  "title": "Driving Factors for Agricultural Graduates' Involvement in Agribusiness Enterprise in Nigeria",
  "abstract": "Eradicating the high level of youth unemployment remains a global challenge, especially in sub-Saharan Africa. Youth involvement in agriculture, which could have lower unemployment, is low. Despite a high volume of literature on youth involvement in agriculture, agricultural graduates have received little research attention. Therefore, this study assessed agricultural graduate involvement in agribusiness enterprises to fill the research gap. Data were collected from 200 agricultural graduates who were randomly selected. Descriptive statistics and logistic regression were methods of data analysis. The results revealed that, unlike other youths, agricultural graduates had a positive opinion about agriculture. Although about half were involved in agribusiness, almost all of them were willing to engage in it if supplied with production resources, especially land and capital for start-ups. Family land, access to credit, perceived benefits, attitudes, location, and gender significantly influenced agricultural graduates' participation in agribusiness. To be self-employed and an employer, to be financially independent, to be food secure, due to access to land, due to access to credit, parental influence, satisfaction, and personal growth, and to continue the family business were the reasons why agricultural graduates became involved in agribusiness enterprises. On the other hand, lack of capital, lack of access to land, the risk involved in agriculture, poor agricultural pricing, poor agricultural support from the government, seeking a white-collar job, and peer influence were reasons why some agricultural graduates were not involved in agribusiness. Hence, agricultural graduates should be encouraged and supported with resources, especially arable land, and capital, by the government, development agencies, and financial institutions to ensure effective participation in agribusiness.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a82b9b73f7acacbd69179c3a1843698b",
  "timestamp": "2025-05-15T03:20:55.846397"
}