{
  "id": 3878,
  "title": "The impact of financial incentives on SNAP transactions at mobile produce markets",
  "abstract": "Background Offering financial incentives promotes increases in fruit and vegetable purchases in farmers' markets and supermarkets. Yet, little is understood about whether food-insecure adults purchase more fruits and vegetables as a result of receiving financial incentives in mobile produce market settings. Methods In 2018-2019, Food on the Move provided a 50% discount to customers using Supplemental Nutrition Assistance Program (SNAP) benefits to purchase fruit and vegetables from 16 market locations in Rhode Island (n = 412 market occasions). We used mixed multivariable linear regression to estimate the difference in total dollar sales per transaction per month between SNAP transactions and non-SNAP transactions. We also estimated the difference in out-of-pocket dollar sales per transaction per month between SNAP and non-SNAP transactions, less the 50% discount. This reflects the actual amount spent on fresh fruits and vegetables purchased per visit. In both models, we controlled for the number of market sites per month, with fixed effects for quarter and year. We estimated random intercept variance for date of transaction and market site to adjust for clustering. Results In 2018-2019, the majority of market transactions (total n = 13,165) were SNAP transactions [n = 7.988 (63.0%)]. On average, customers spent $17.38 (SD = 16.69) on fruits and vegetables per transaction per month. However, customers using SNAP benefits spent significantly more on FVs per transaction per month [$22.01 (SD = 17.97)] compared to those who did not use SNAP benefits [9.81 (SD = 10.68)] (beta = $10.88; 95% CI: 10.18, 11.58). Similarly, out-of-pocket dollar sales per SNAP transaction per month (i.e., less the 50% discount) were significantly higher [$11.42 (SD = 9.44)] relative to non-SNAP transactions [$9.40 (SD = 9.33)] (beta = $1.85; 95% CI: 1.44, 2.27). Conclusions Financial incentives contributed to higher fruit and vegetable purchases among low-income customers who shop at mobile produce markets by making produce more affordable. Higher spending on fruits and vegetables may promote healthy diet behaviors and reduce chronic disease risk among food-insecure adults.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8384f640898cbb63396d054c6f84e18",
  "timestamp": "2025-05-15T02:30:58.241116"
}