{
  "id": 785,
  "title": "Automated Portfolio Rebalancing using Q-learning",
  "abstract": "Fund Managers and retail Do-it-yourself investors constantly seek ideas and techniques to invest their wealth in various financial assets to maximize their wealth over time while trying to minimize the Investment Risk and Transaction costs. This study uses Basic Q-Learning Reinforcement Learning agents who will learn market patterns to trade in financial assets to maximize the fund value, using portfolio returns net of transaction costs as the learning criteria. 15 Indian financial assets covering Equity Sectoral Indices, Government Security Indices and Gold spot prices were chosen and a Reinforcement Learning agent was trained on each of them. The Reinforcement Learning agents were given Simple Moving Averages, 52-Week Stochastic Indicator and Price Change Momentum Indicators for their respective financial assets to train on. Testing was conducted for the Year 2019 and evaluation of the performance was done using the annual returns net of transaction costs, Max Drawdown and Standard Deviation, in comparison to the benchmarks. Most of the agents have been able to reduce the Max Drawdown and Standard Deviation while there is further scope to improve on the Fund Performance. The study has been successful in implementing a basic Q-Learning algorithm for Portfolio optimization to reduce the downside risk and the study would lay the foundation to perform further research on this Subject to maximize wealth creation from Financial Markets. Exploration of further features, tuning of hyper-parameters for each Asset & use of Deep Q-Learning algorithm could be explored further to take forward this research.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a83f42fcaa247a93716c4acfbf8de059",
  "timestamp": "2025-05-15T01:55:08.016348"
}