{
  "id": 8854,
  "title": "National Trends in Health Insurance Coverage of Pregnant and Reproductive-Age Women, 2000 to 2009",
  "abstract": "Purpose: Health insurance facilitates financial access to health services, including prenatal and preconception care. This study characterized changes in health insurance coverage among reproductive-age women in the United States from 2000 to 2009. Methods: Data from female respondents (ages 18-49) to the National Health Interview Surveys, 2000 to 2009 (n = 207,968), including those pregnant when surveyed (n = 3,204), were used in a repeated cross-sectional design. Changes over time were estimated using longitudinal regression models. Main Findings: Of the reproductive-age women in this study, 25% were uninsured at some point in the prior year. Ten percent of pregnant women reported currently being uninsured, and 27% and 58% reported Medicaid coverage or private health insurance, respectively. Among women who were not pregnant, 19% were currently uninsured, 8% had Medicaid, and 68% had private coverage. From 2000 to 2009, an increasing percentage of reproductive-age women reported having gone without health insurance in the past year. Controlling for sociodemographic and health variables, the chances that a reproductive-age woman had been uninsured increased by approximately 1.5% annually (p < .001), and did not differ between pregnant women and those who were not pregnant. The odds that an insured pregnant woman had Medicaid coverage increased 7% per year over the study period (p < .001), whereas the odds of private coverage decreased. Conclusion: Reproductive-age women are increasingly at risk of being uninsured, which raises concerns about access to prenatal and preconception care. Among pregnant women, access to private health insurance has decreased, and state Medicaid programs have covered a growing percentage of women. Health reform will likely impact future trends. Copyright (C) 2012 by the Jacobs Institute of Women's Health. Published by Elsevier Inc.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8569fe628c80f72b371a8607f31cb50",
  "timestamp": "2025-05-15T03:22:57.947430"
}