{
  "id": 6429,
  "title": "PTSD, depression, and health status in Lebanese civilians exposed to a church explosion",
  "abstract": "Objective: This study examined the effect of stressors on PTSD, depression, and health status in a sample of Lebanese civilians exposed to a church explosion and their comparison groups (33 victims, 30 family members, and 30 neighbors) one year after the event. Method: This descriptive study used interviews that were conducted with the participants in their homes. The main outcome measures were the Clinician Administered PTSD Scale Version I, Beck Depression Inventory, and change in health service utilization in the past year. Multivariate analysis was done using logistic regression to predict the study outcomes. Results: PTSD was present in 17.2% of the total sample, depression in 41.9% and the mean increase in doctors' visits was 2.05 +/- 2.97. In the victims' group, 39% met PTSD diagnostic criteria, 51% were depressed, and 45% reported deterioration in their health status. These rates were significantly higher than those in the comparison groups. Also, females were 2.62 times more at risk than males for depression. Victims were 7.35 times and those with financial problems 2.67 times more at risk of having increased doctor's visits than their family or neighbor comparison groups. Conclusion: The results suggest that PTSD, depression, and health status deterioration in trauma victims may persist over time. Resources such as social support can help attenuate the symptoms of those at a higher risk.",
  "year": 2003,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a873bcff7308028fda88dbb224159de7",
  "timestamp": "2025-05-15T02:58:05.638184"
}