{
  "id": 3962,
  "title": "Re-evaluating the hedge and safe-haven properties of Islamic indexes, gold and Bitcoin: evidence from DCC-GARCH and quantile models",
  "abstract": "PurposeThis paper aims to investigate the hedge, safe-haven and diversifier properties of Islamic indexes, Bitcoin and gold for ten of the most affected countries by the coronavirus, which are the USA, Brazil, the UK, Italy, Spain, Germany, France, Russia, China and Malaysia. Design/methodology/approachThis research uses the Ratner and Chiu (2013) methodology based on the dynamic conditional correlation models to improve Baur and McDermott (2010). The authors adopt a careful investigation of the features of a diversifier, hedge and safe haven using the dynamic conditional correlation-GARCH and quantile regression models. FindingsEmpirical results indicate that Islamic indexes are not considered as hedge assets for the conventional market for all studied countries during the COVID-19 pandemic crisis period. However, gold works as a strong hedge in all countries, except for Brazil and Malaysia. Bitcoin is a strong hedge in the USA and a strong hedge and safe haven in China. Practical implicationsInternational investors in China and the US stock markets should replace Islamic left-to-right markindexes with Bitcoin in their conventional portfolio of securities during the pandemic. Originality/valueTo the best of the authors' knowledge, this is the first paper that re-evaluates the hedge, safe-haven and diversifier properties of Islamic indexes, Bitcoin and gold for ten of the most affected countries by the coronavirus.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8730c7fdb17069df7993e34eeb6aaff",
  "timestamp": "2025-05-15T01:22:39.364636"
}