{
  "id": 6385,
  "title": "Do emerging market corporates mimic the payout policy of peers?",
  "abstract": "PurposeThis study aims to investigate the effects of peers on corporate payout policies in one of the largest emerging markets - India. It also examines the motives for mimicking payout decisions.Design/methodology/approachThe sample is composed of 3,024 non-financial and non-government firms listed on the National Stock Exchange (NSE) and Bombay Stock Exchange (BSE) for the period 1995 to 2020. To encounter the endogeneity problem, the instrumental variable technique based on peer firms' idiosyncratic risk is used to estimate the effects of peers on firms' payout policy. To define peer reference groups, the authors use the basic industry classification of the firms.FindingsThe results indicate a significant positive impact of peers on firms' dividend policies in India. A firm with all dividend-paying peers is more likely to declare dividends than the one with no dividend-paying peers. Further, peer effects are found to be more pronounced amongst larger and older firms, thus supporting the rivalry theory of mimicking.Originality/valueTo the best of the authors' knowledge, the present study is the first of its kind that attempts to understand peer effects on payout decisions in an emerging market India, that offers a unique institutional setting. Moreover, the authors extend the existing literature by investigating the peer effects on a firm's payout policies considering various firm-level characteristics, such as growth opportunity, cash holding, financial constraint and profitability, which previous studies have not taken into consideration. These results provide additional insights into the heterogeneity and motives behind peer effects.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8760b62d40277f47f3eb8f27be44909",
  "timestamp": "2025-05-15T02:57:38.745760"
}