{
  "id": 5638,
  "title": "Top management team heterogeneity, corporate social responsibility and firm risk: an emerging country perspective",
  "abstract": "Purpose This study aims to examine the effects of top management team (TMT) heterogeneity and corporate social responsibility (CSR) on the firm risk of Bursa Malaysia listed firms. Also, this study examines the moderating effect of CSR between TMT heterogeneity and firm risk. Design/methodology/approach This study uses panel regression models to test the hypotheses. The sample of this study is Bursa Malaysia non-financial listed firms from 2013 to 2017 with 3,055 observations. Findings This study finds significant effects of TMT age and tenure heterogeneities on total risk. Effects on idiosyncratic risk are evident only within age heterogeneity. Further, this study finds negative effects of CSR on total and idiosyncratic risks. CSR significantly moderates the relationship between total TMT heterogeneity and firm systematic risk. Practical implications This study reduces the literature gap by providing useful insights on the effects of CSR activities and TMT heterogeneity on firm risk. The findings can also provide hints to investors to assist them in assessing firm risk based on TMT heterogeneity and firms' CSR. This study can also benefit shareholders in their attempts to mitigate the risk of their portfolio by investing in firms that are socially responsible as firms with high CSR suffer lower total and idiosyncratic risks. Originality/value Previous studies have emphasised on the influence of TMT characteristics and CSR on firm performance. However, studies that investigate the effects of TMT heterogeneity and CSR on firm risk are limited in the context of Malaysia.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8768305b35ca9558ebae511a29a93ac",
  "timestamp": "2025-05-15T02:49:50.322255"
}