{
  "id": 7996,
  "title": "Assessment of HF Outcomes Using a Claims-Based Frailty Index",
  "abstract": "OBJECTIVES This study used a claims-based frailty index to investigate outcomes of frail patients with heart failure (HF). BACKGROUND Medicare value-based payment programs financially reward and penalize hospitals based on HF patients' outcomes. Although programs adjust risks for comorbidities, they do not adjust for frailty. Hospitals caring for high proportions of frail patients may be unfairly penalized. Understanding frail HF patients' outcomes may allow improved risk adjustment and more equitable assessment of health care systems. METHODS Adapting a claims-based frailty index, the study assigned a frailty score to each adult in the National inpatient Sample (NIS) from 2012 through September 2015 with a primary diagnosis of HF and dichotomized frailty by using a cutoff value established in the general NIS population. Multivariate regression models were estimated, controlling for comorbidities and hospital characteristics, to investigate relationships between frailty and outcomes. RESULTS Of 732,932 patients, 369,298 were frail. Frail patients were more likely than nonfrail patients to die during hospital stay (3.57% vs. 2.37%, respectively; adjusted odds ratio [aOR]: 1.67; 95% confidence interval [CI]: 1.61 to 1.72; p < 0.001); were less likely to be discharged to home (66.5% vs. 79.3%, respectively; aOR: 0.58; 95% 0: 0.57 to 0.58; p < 0.001); were hospitalized for more days (5.89 vs. 4.63 days, respectively; adjusted coefficient: 0.21 days; 95% 0: 0.21 to 0.22; p < 0.001); and incurred higher charges ($47,651 vs. $40,173, respectively; adjusted difference $9,006; 95% CI: $8,596 to $9,416; p < 0.001). CONCLUSIONS Frail patients with HF had significantly poorer outcomes than nonfrail patients after accounting for comorbidities. Clinicians should screen for frailty to identify high-risk patients who could benefit from targeted intervention. Policymakers should perform risk adjustments for frailty for more equitable quality measurement and financial incentive allocation. (C) 2020 by the American College of Cardiology Foundation.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a88dbb06069c5b886bef6e6f7de29a2b",
  "timestamp": "2025-05-15T03:14:07.283737"
}