{
  "id": 2653,
  "title": "Operational risk assessment at investment funds level",
  "abstract": "The operational risk has been analysed quite recently, both by the academic environment and by financial entities in their practical activity. This new risk has recently been introduced into the solvency models provided by the Capital Requirement and Solvency legislation. The solvency models are absolute assessment models and are based on the idea of determining an optimal solvency ratio between the level of potential losses associated with the risks a financial entity is exposed to and the level of own funds it holds. Below this optimal ratio it is considered that, in the event of a materialization of the risk, the entity will go bankrupt. In the financial industry there is also a category of financial entities that legally cannot go bankrupt, at worst they may be affected by a galloping decapitalization. This category includes investment and pension funds. Due to the fact that investment and pension funds are managed externally, the operational risk originates at the level of the manager and produces its effects on the assets held by the fund, namely on the unit value of the net asset or on the value of the net asset in case of decapitalization. In order to assess the operational risk of the funds, different approaches to Capital Requirement and Solvency should be applied. In this respect, the classification of funds according to the level of risk to which they are exposed can be done through relative assessment models, and the determination of the loss amount caused by the operational risk can be done by indirect methods. Such relative risk assessment models can also be used by financial/non-financial entities that have legal personality, as a mechanism for controlling absolute assessment models, or as a stand-alone assessment methodology if there is no regulated methodology.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a893e17211f6d5c5d86cf8e2bca42f2a",
  "timestamp": "2025-05-15T02:17:32.286699"
}