{
  "id": 6432,
  "title": "Patterns of comorbidities in hospitalised cancer survivors for palliative care and associated in-hospital mortality risk: A latent class analysis of a statewide all-inclusive inpatient data",
  "abstract": "Background: At the end of life, cancer survivors often experience exacerbations of complex comorbidities requiring acute hospital care. Few studies consider comorbidity patterns in cancer survivors receiving palliative care. Aim: To identify patterns of comorbidities in cancer patients receiving palliative care and factors associated with in-hospital mortality risk. Design, Setting/Participants: New South Wales Admitted Patient Data Collection data were used for this retrospective cohort study with 47,265 cancer patients receiving palliative care during the period financial year 2001-2013. A latent class analysis was used to identify complex comorbidity patterns. A regression mixture model was used to identify risk factors in relation to in-hospital mortality in different latent classes. Results: Five comorbidity patterns were identified: 'multiple comorbidities and symptoms' (comprising 9.1% of the study population), 'more symptoms' (27.1%), 'few comorbidities' (39.4%), 'genitourinary and infection' (8.7%), and 'circulatory and endocrine' (15.6%). In-hospital mortality was the highest for 'few comorbidities' group and the lowest for 'more symptoms' group. Severe comorbidities were associated with elevated mortality in patients from 'multiple comorbidities and symptoms', 'more symptoms', and 'genitourinary and infection' groups. Intensive care was associated with a 37% increased risk of in-hospital deaths in those presenting with more 'multiple comorbidities and symptoms', but with a 22% risk reduction in those presenting with 'more symptoms'. Conclusion: Identification of comorbidity patterns and risk factors for in-hospital deaths in cancer patients provides an avenue to further develop appropriate palliative care strategies aimed at improving outcomes in cancer survivors.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8b7b660b3262edfef20cceb970f447a",
  "timestamp": "2025-05-15T02:58:05.656828"
}