{
  "id": 5614,
  "title": "Portfolio constructions in the stock market based on Data Envelopment Analysis and Stochastic Frontier Analysis",
  "abstract": "The study compares the results of applying the parametric method of Stochastic Frontier Analysis (SFA) and the non-parametric Bias-corrected Data Envelopment Analysis (DEA) for forming integrated stock selection metrics in portfolios based on diverse financial and non-financial indicators of U.S. issuing companies. The authors implement a novel approach in which input and output indicators for both stochastic frontier analysis and data envelopment analysis models are pre-selected using regression analysis. Deviations of identified company indicators from median industry values are considered. Significant characteristics in explaining stock returns include board size, proportion of independent directors, board meetings attendance, and among financial and market characteristics - the net debt to EBITDA ratio and past stock returns (momentum-effect). It is demonstrated that portfolios consisting of 20-30 securities, constructed on the authors' integrated metrics, outperform in terms of returns and risk-return ratio compared to the S&P 500 index and an equal-weighted portfolio of all considered stocks. The stability of conclusions is verified through comparison with randomly generated portfolios (Monte Carlo method). The obtained results remain stable for both the pre-Covid-19 pandemic period (2008-2019) and the period including the pandemic and geopolitical tensions from 2020 to 2022. From 2008 to 2019, portfolios created using the data envelopment analysis method were more effective than those based on stochastic frontier analysis models. Conversely, during the period from 2020 to 2022, the latter demonstrated superior performance.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8b93110b833a18e47bbb6c818a64e25",
  "timestamp": "2025-05-15T02:49:50.192517"
}