{
  "id": 2605,
  "title": "Support of the SDGs as a New Approach to Financial Risk Management in Responsible Universities in Russia",
  "abstract": "The purpose of this paper was to reveal the influence of the support of the sustainable development goals (SDGs) on the financial risks of responsible universities in Russia. This paper fills the gap in the literature that exists regarding the unknown consequences of SDGs' support by responsible Russian universities concerning their financial risks. Based on the experience of the top 30 most responsible Russian universities in 2023, we used regression analysis to compile a model for their financial risk management. This model mathematically describes the cause-and-effect relationships of financial risk management in responsible Russian universities. This paper offers a new approach to financial risk management in responsible Russian universities. In it, financial risks to Russian universities are reduced due to universities accepting responsibility for state and private investors. A feature of the new approach is that the effective use of university funds is ensured not by cost savings but by the support of the SDGs. The potential for a reduction in financial risk in responsible universities in Russia through alternative approaches to financial risk management was disclosed. The proposed new approach can potentially raise (to a large extent) the aggregate incomes of responsible universities in Russia compared to the existing approach. The main conclusion is that the existing approach to financial risk management in Russian universities is based on low-efficiency managerial measures which risk burdening universities. This burden could be prevented with the newly developed approach to financial risk management in responsible universities in Russia through support of the SDGs. The theoretical significance lies in clarifying the specific list of the SDGs whose support makes the largest contribution to reducing financial risks for the universities-namely, SDG 4, SDG 8, and SDG 9. The practical significance is that the new approach will allow for full disclosure of the potential reduction in financial risks in responsible universities in Russia in the Decade of Action (2020-2030). The managerial significance is as follows: the proposed recommendations will allow improved financial risk management in Russian universities through optimization of the support of the SDGs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8c8164d3b81c84b280599c4fd9377cd",
  "timestamp": "2025-05-15T02:17:01.806153"
}