{
  "id": 2205,
  "title": "Thirty states of renewability: Controversial energies and the politics of incumbent industry",
  "abstract": "Renewable energy advocates have positioned a wide array of technologically novel energy sources as fossil fuel alternatives. These efforts to usher in renewable energy transitions have long been shaped by definitional contestations. Political ecological scholarship tells us that such definitions are meaningful. Indeed, labeling energy sources as renewable has become a power-laden act, which may spark innovation, yet simultaneously creates openings for problematic classifications and unjust socio-ecological relations. However, we still know too little about how such classification politics are taking shape within green industrial policy formation; particularly, how they encounter incumbent industries and industrial regions. In this paper, we argue that these theoretical questions are crucial for an emerging industrial political ecology and explore three recent developments in the US context. A country that has notoriously avoided open and coordinated national industrial policy, the United States has approached the renewable energy economy in a similarly geographically fragmented fashion. We highlight a central yet under-examined tool in US energy-industrial policy: the renewable portfolio standard. Mandated by 30 states, renewable portfolio standards are the US's central mechanism for renewable energy procurement-yet renewable portfolio standards diverge substantially from state to state in terms of the energy sources they classify and incentivize as renewable. We argue that industrial interests and state governments have together capitalized upon renewable portfolio standards' malleability to support regionally significant sectors, including dirty industries and industrial wastes. These industries, often controversially, thereby position themselves for rebranding and new forms of value capture.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8dae94c2aef61c2907c47771248f224",
  "timestamp": "2025-05-15T01:04:27.418782"
}