{
  "id": 5760,
  "title": "Medical Financial Hardship and Food Security among Cancer Survivors in the United States",
  "abstract": "Background: Some cancer survivors experience medical finan-cial hardship, which may reduce their food security. The purpose of this study was to explore whether medical financial hardship is related to food security among cancer survivors.Methods: The study was based on cross-sectional data from the 2020 National Health Interview Survey. We used ordinal logistic regression to examine the relationship between material, psycho-logical, and behavioral medical financial hardships and household food security (i.e., high, marginal, low, or very low) among indi-viduals ages & GE;18 years who reported a cancer diagnosis from a health professional (N = 4,130).Results: The majority of the sample reported high household food security (88.5%), with 4.8% reporting marginal, 3.6% reporting low, and 3.1% reporting very low household food security. In the adjusted model, the odds of being in a lower food security category were higher for cancer survivors who had problems paying or were unable to pay their medical bills compared with those who did not [OR, 1.73; 95% confidence interval (CI), 1.06-2.82, P = 0.027], who were very worried about paying their medical bills compared with those who were not at all worried (OR, 2.88; 95% CI, 1.64-5.07; P < 0.001), and who delayed medical care due to cost compared with those who did not (OR, 2.56; 95% CI, 1.29-5.09; P = 0.007).Conclusions: Food insecurity is rare among cancer survivors. However, medical financial hardship is associated with an increased risk of lower household food security among cancer survivors.Impact: A minority of cancer survivors experience medical financial hardship and food insecurity; social needs screenings should be conducted.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8db5d81fbf84c546596853feeb58eea",
  "timestamp": "2025-05-15T02:50:54.025967"
}