{
  "id": 7675,
  "title": "The Effect of Investing into Distribution Information and Communication Technologies on Banking Performance the Empirical Evidence from an Emerging Country",
  "abstract": "Purpose: This study aims to investigate the impact of investing into technology development on banking performance in an emerging country. Research design, data and methodology: Based on the data of 12 commercial banks listed in Vietnam from 2011 to 2019 and performing multivariable regression analyses as well as conducting a variety of robustness tests, we carry out the empirical investigation to discover this impact. Results: Our empirical evidence shows that these spending help to improve significantly performance of banks. Particularly, the technology expenditures have positive effect on the net interest margin and the non-interest income in which the level of influence on the latter is relatively remarkable in comparison with the former. At the same time, the result does not support the view that increasingly spending on technology may lead banks to face the risk of instability. Conclusions: Overall, our empirical analysis indicates that increasing investment into distribution information and communication technologies will help to enhance business strategies of banks and thus we advocate the bright side of technology development and digitalization in banking sector. We believe that the research is useful for both managers, regulators and policy makers in Vietnam as well as in countries having similar financial structure.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8db4b22818c5ff59f564f92120ca09e",
  "timestamp": "2025-05-15T03:11:04.511092"
}