{
  "id": 3466,
  "title": "THE INFLUENCE OF THE FINANCIAL INCLUSION OF THE POPULATION ON THE LEVEL OF ILLEGALLY INCOME IN COUNTRIES WITH DIFFERENT LEVELS OF ECONOMIC DEVELOPMENT",
  "abstract": "The importance of understanding why and how vital financial inclusion is is recognizing that finance or financial development plays an essential role in shaping economic stability. According to the current international assessment, finance has a positive impact on the economy. Essential functions perform information production; distribution of capital for production use; investment control and corporate control; mobilization and consolidation of savings; trade facilitation, diversification, risk management; and facilitating the exchange of goods and services. Thus, we can determine that the country's financial development depends on the implementation of the above functions. For regulators and the state as a whole, financial inclusion is a tool to reduce the level of the << shadow >> economy, through which there is money laundering, tax evasion, and so on. It is important to note that low levels of financial inclusion are mainly a problem in the economies of developing countries, although developed countries also face such challenges. The article sets and substantiates the impact of financial inclusion of the population on the level of illegally obtained income of countries with different levels of economic development. The study is conducted in several stages: the formation of an array of indicators that characterize the financial inclusion of the population and the level of illicit income for 91 countries with different levels of economic development, determination of the integrated index of financial inclusion based on factor analysis, correlation and regression analysis the Financial Inclusion Index and its components and the Basel Laundering Index. In general, it was found that the level of financial involvement of the population has a positive effect on the fight against money laundering in all countries studied. The construction of multiple regression with the inclusion as independent variable components of the financial inclusion index (activation of consumers in the financial services market, which is manifested through more active use of banking services and Internet resources to buy and pay for necessary goods or services, allows money laundering) confirm the result.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8dd259d4baafb924fed45eb9b38a4fe",
  "timestamp": "2025-05-15T02:26:48.440936"
}