{
  "id": 2068,
  "title": "Does environmental, social, and governance performance affect financial risk disclosure? Evidence from European ESG companies",
  "abstract": "PurposeThis study aims to investigate the effects of environmental, social and governance (ESG) performance on financial risk disclosure of European companies. It analyzed the relationships between ESG factors and financial risk disclosure between 2010 and 2020.Design/methodology/approachTo test their hypotheses in this study, the authors used the multivariate regression analysis on panel data using the Thomson Reuters ASSET4 database and the annual reports of 154 European companies listed in the ESG index between 2010 and 2020.FindingsEmpirical evidence shows a positive association between European companies' environmental and governance performance with financial risk disclosure, whereas social performance does not influence financial risk disclosure. Concerning the control variables, the findings demonstrate that firm size and profitability are significant factors in changing the financial risk disclosure. Nevertheless, firms' leverage is insignificantly correlated with financial risk disclosure.Originality/valueThis study extends the stream of accounting literature by focusing on the financial risk disclosure, a topic that has received little attention in previous research. Furthermore, to the best of the authors' knowledge, this study is one of the first that provides ESG companies with evidence of the effect of ESG factors on financial risk disclosure in a developed market like Europe.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8e8a1a8e0ad1759d2c85e43e8d06745",
  "timestamp": "2025-05-15T02:10:58.942060"
}