{
  "id": 8276,
  "title": "Supply chain research based on complex network theory",
  "abstract": "Supply chain is a chain structure formed by the sequential processes of production and distribution, spanning from raw material suppliers to end customers. An efficient and reliable supply chain is of great significance in enhancing enterprise's market competitiveness and promoting sustainable social and economic development. The supply chain includes the interconnected flows of materials, resources, capital, and information across various stages, including procurement, production, warehousing, distribution, customer service, information management, and financial management. By representing the various participants in the supply chain as nodes and their interactions-such as the logistics, capital flow, information flow, and other interactions-as edges, the supply chain can be described and characterized as a complex network. In recent years, using complex network theory and methods to model and analyze supply chains has attracted increasing attention from researchers. This paper systematically reviews the supply chain research based on complex network theory, providing an in-depth analysis of supply chain networks in terms of network construction, structural properties, and management characteristics. First, this paper reviews two kinds of approaches to constructing supply chain network: empirical data-based approach and network model-based approach. In the empirical data-based research, scholars use common supply chain databases or integrate multiple data sources to identify the supply chain participants and clarify their attributes, behaviors, and interactions. Alternatively, the research based on network models employs the Barab & aacute;si-Albert (BA) model, incorporating factors such as node distance, fitness, and edge weights, or uses hypergraph models to construct supply chain networks. Next, this paper summarizes the research on the structural properties of supply chain networks, focusing on their topological structure, key node identification, community detection, and vulnerability analysis. Relevant studies explore the topological structure of supply chain networks, uncovering the connections between nodes, hierarchical structures, and information flow paths between nodes. By analyzing factors such as node centrality, connection strength, and flow paths, the key nodes within the supply chain network are identified. Community detection algorithms are used to investigate the relationships between different structural parts and to analyze the positional structure, cooperative relationships, and interaction modes. Furthermore, quantitative evaluation indicators and management strategies are proposed for the robustness and resilience of supply chain networks. Further research has explored the management characteristics of supply chain networks, including risk propagation and competition game. Relevant studies have employed three main methods-epidemic model, cascading failure model, and agent-based model-to construct risk propagation models, simulate the spread of disruption risks, and analyze the mechanisms, paths, and extent of risk propagation within supply chain networks. These studies provide valuable insights for developing risk prevention and mitigation strategies. In addition, the game theory has been used to investigate the cooperative competition, resource allocation, and strategy selection among enterprises within the supply chain network. This paper reviews the research contents and emerging trends in supply chain studies based on complex network methods. It demonstrates the effectiveness and applicability of complex network theory in supply chain network research, discusses key challenges, such as how to obtain accurate, comprehensive, and timely supply chain network data, proposes standardized data processing methods, and determines the attributes of supply chain network nodes and the strength of their relationships. Furthermore, research on the structure of supply chain network has not yet fully captured the unique characteristics of supply chain networks. Existing models and methods for vulnerability assessment often fail to consider the dynamic and nonlinear characteristics of supply chain networks. Research on risk propagation in supply chains has not sufficiently integrated empirical data, overlooking the diversity of risk sources and the complexity of propagation paths. The asymmetry and incompleteness of information in supply chain networks, as well as multiple sources of uncertainty, make the prediction and analysis of multiparty decision-making behavior more complex. This paper also outlines several key directions for future research. One direction involves using high-order network theory to model interactions among multiple nodes and to describe the dynamics of multi-agent interactions within supply chain networks. Furthermore, integrating long short-term memory (LSTM) methods to process long-term dependence in time-series data can enhance the analysis of network structure evolution and improve the prediction of future states. The application of reinforcement learning algorithms can also adaptively adjust network structures and strategies according to changing conditions and demands, thereby improving the adaptability and response speed of supply chain networks in emergency situations. This paper aims to provide valuable insights for supplying chain research and promoting the development and application of complex network methods in this field.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8f34a268f5f3f7036b1d05e6ce4603c",
  "timestamp": "2025-05-15T03:17:21.479180"
}