{
  "id": 8705,
  "title": "Can measures of sleep quality or white matter structural integrity predict level of worry or rumination in adolescents facing stressful situations? Lessons from the COVID-19 pandemic",
  "abstract": "Introduction: COVID-19 has resulted in major life changes to the majority of the world population, particularly adolescents, with social-distancing measures such as home-based schooling likely to impact sleep quality. Increased worry is also likely considering the substantial financial, educational and health concerns accompanying COVID-19. White matter (WM) integrity has been shown to be associated with anxiety and depression symptoms, including worry, as well being closely associated with sleep quality. This study aimed to investigate the associations between pre-COVID sleep quality, WM structural integrity and levels of worry and rumination about COVID. Methods: N = 30 adolescent participants from Queensland, Australia, completed diffusion tensor imaging (DTI) scanning pre-COVID, the Pittsburgh Sleep Quality Index (PSQI) pre and during COVID, and 9 items designed to measure 3 constructs, perceived impact of COVID, general worry, and COVID-specific worry and rumination. Results: Sleep quality (PSQI total) was significantly poorer during COVID compared with preCOVID. Sleep onset latency measured pre-COVID was significantly associated with COVIDspecific worry and rumination. While the structural integrity of a number of WM tracts (measured pre-COVID) were found to be significantly associated with COVID-specific worry and rumination. Follow-up regression analysis using a model including pre-COVID sleep onset latency, structural integrity of the posterior limb of the internal capsule (PLIC), gender and change in PSQI explained a significant 47% of the variance in COVID-specific worry and rumination. Conclusions: These findings suggest that adolescents with poor sleep quality and perturbed WM integrity may be at risk of heightened reactivity to future stressful events and interventions should focus on improving sleep onset latency.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8f579f214a4d47f02259b03f3568c57",
  "timestamp": "2025-05-15T03:21:24.733612"
}