{
  "id": 7754,
  "title": "Positive Interaction Between Light Iris Color and Ultraviolet Radiation in Relation to the Risk of Uveal Melanoma A Case-Control Study",
  "abstract": "Purpose: To examine the association among phenotypic characteristics, chronic and intermittent ultraviolet (UV) radiation, and the risk of uveal melanoma. Design: Case-control study. Participants: Overall, between September of 2002 and March of 2005, 1677 eligible subjects (age range: 20-74 years, living in Germany) participated. Interviews were conducted with 459 incident uveal melanoma cases (response proportion 94%), 827 population controls (55%), 180 ophthalmologist controls (52%), and 187 sibling controls (57%). Methods: Data on phenotypic characteristics and chronic and intermittent UV radiation exposure were obtained from a self-administered postal questionnaire and computer-assisted telephone interview. We used conditional logistic regression to estimate odds ratios adjusting for the matching factors. Furthermore, we studied the presence of synergy (super additive of risk or relative excess risk due to interaction) between light iris color and several UV radiation exposures. Main Outcome Measures: Hair color at age 20 years, eye color, untanned skin color, ability to tan, propensity to burn on exposure, freckling, occupational sun exposure, artificial UV radiation, burns to the eyes. Results: In all 3 control groups, fair skin color, freckling as a child, nevi on the upper arms, burns to the eyes, use of sunlamps, and ever worked outside for 4 or more hours per day were positively associated with uveal melanoma. The association with eye color was apparent only in population controls (odds ratio = 1.9; 95% confidence interval [CI], 1.4-5.2), resulting in a relative excess risk due to interaction of 0.9 (95% Cl, -0.6-2.3) for light iris color and more than 5 eye burns (UV-related keratitis) and 0.6 (95% Cl, -0.3 to 1.5) for light iris color and eye protection. Conclusions: Our interaction analyses suggest that there is an etiologic synergism between light iris color and the exposure of UV radiation. People with light iris color may have an especially increased risk for uveal melanoma if they are exposed to UV radiation. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2009;116:340-348 (C) 2009 by the American Academy of Ophthalmology.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8fb3b4f7b582ea3ecc95d442f3c789f",
  "timestamp": "2025-05-15T03:11:38.582031"
}