{
  "id": 9153,
  "title": "Wealth stratified inequalities in service utilisation of breast cancer screening across the geographical regions: a pooled decomposition analysis",
  "abstract": "Background Breast cancer is the most commonly occurring cancer among women in low-resourced countries. Reduction of its impacts is achievable with regular screening and early detection. The main aim of the study was to examine the role of wealth stratified inequality in the utilisation breast cancer screening (BCS) services and identified potential factors contribute to the observed inequalities. Methods A population-based cross-sectional multi-country analysis was used to study the utilisation of BCS services. Regression-based decomposition analyses were applied to examine the magnitude of the impact of inequalities on the utilisation of BCS services and to identify potential factors contributing to these outcomes. Observations from 140,974 women aged greater than or equal to 40 years were used in the analysis from 14 low-resource countries from the latest available national-level Demographic and Health Surveys (2008-09 to 2016). Results The population-weighted mean utilisation of BCS services was low at 15.41% (95% CI: 15.22, 15.60), varying from 80.82% in European countries to 25.26% in South American countries, 16.95% in North American countries, 15.06% in Asia and 13.84% in African countries. Women with higher socioeconomic status (SES) had higher utilisation of BCS services (15%) than those with lower SES (9%). A high degree of inequality in accessing and the use of BCS services existed in all study countries across geographical areas. Older women, access to limited mass media communication, being insured, rurality and low wealth score were found to be significantly associated with lower utilisation of BCS services. Together they explained approximately 60% in the total inequality in utilisation of BCS services. Conclusions The level of wealth relates to the inequality in accessing BCS amongst reproductive women in these 14 low-resource countries. The findings may assist policymakers to develop risk-pooling financial mechanisms and design strategies to increase community awareness of BCS services. These strategies may contribute to reducing inequalities associated with achieving higher rates of the utilisation of BCS services.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a8fda35690dd31bf6c3db051658bcdaf",
  "timestamp": "2025-05-15T03:25:54.674959"
}