{
  "id": 6034,
  "title": "Quantile Dependence between Crude Oil and China's Biofuel Feedstock Commodity Market",
  "abstract": "This paper investigates the heterogeneous dependence between global crude oil futures and China's biofuel feedstock commodities under different market conditions. Quantile-on-quantile regression and the causality-in-quantiles test are employed to capture comprehensive and informative relationships. The empirical results are as follows: First, there is a positive relationship between the returns on China's biofuel feedstock commodities and crude oil. The effects are heterogeneous, conditional on the market regimes, where the impacts of the bearish/bullish crude oil market on biofuel feedstock commodity returns are significant when the commodity market in China is in a bearish/bullish state. Second, crude oil returns have reliable predictive power for the returns on China's biofuel feedstock commodities under the average market condition and move in connection with the volatility of China's biofuel-related commodity market in normal and bullish market conditions. Third, the risk reduction effectiveness of soybean and corn is significant, while for wheat, this reduction in portfolio risk is less apparent and enhanced, and the risk reduction effectiveness increases significantly during financial and oil crises. Overall, our findings will be helpful in understanding the heterogeneous interplay between global oil and China's biofuel-related commodities and in evaluating portfolio diversification opportunities under different market conditions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9145a7ebba91654cc38604814b6c342",
  "timestamp": "2025-05-15T02:54:03.409108"
}