{
  "id": 7764,
  "title": "The role of institutional mining investors in driving responsible tailings management",
  "abstract": "Recent devastating tailings dam failures have led many investors to view mining projects as increasingly risky investments compared with other industrial projects. In 2019, institutional investors worth US$14 trillion in assets called for the development of an independent classification system for quantifying the safety risks associated with tailings storage facilities (TSF), and played a central role in the Global Tailings Dam Portal Project disclosure request which called for a significant increase in transparency of TSF data. This paper draws upon an extensive literature review to explore the role and motivations of institutional mining investors in mitigating TSF failure risks. Results from qualitative interviews with institutional mining investors are presented to triangulate findings. It is concluded that the financial materiality of TSF failures cannot be argued to be the sole motivating factor for increased investor interest in this topic. Increasingly, the risk of TSF failure is being recognized as a critical environmental, social and governance (ESG) issue. Despite growing interest by investors to directly influence TSF management at mining sites, challenges arise due to the lack of a global tailings standard, technical training and differing regulations across jurisdictions. However, it is found that investors can also play an important role through pressuring company boards, and in improving the overall transparency of data associated with TSF risks. An outstanding research challenge lies in developing tools and frameworks to support investors to meaningfully incorporate TSF risks into investment decisions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a91682fbb86023b9b0210be6aa15e7ca",
  "timestamp": "2025-05-15T03:12:11.471387"
}