{
  "id": 733,
  "title": "Exploring the predictive power of artificial neural networks in linking global Islamic indices with a local Islamic index",
  "abstract": "This study aims to analyze the correlations and information flow between a local Sharia-compliant index and global Sharia-compliant indices using Artificial Neural Network (ANN) models, shedding light on the integration of international and national Sharia-compliant markets. Given recent market conditions and uncertainties at both local and global levels, the research investigates the predictive power of ANNs and examines the relationship between the Dubai Financial Market Sharia Index (DFMSI) and three well-known global Islamic indices: the Dow Jones Islamic Market World Index, the Standard and Poor's Global Sharia Index, and the Financial Times Stock Exchange Sharia All World Index. By incorporating data from multiple global Sharia indices, the study expands data sources beyond the local market, providing a comprehensive analysis of factors influencing the DFMSI's price. This approach reduces reliance on a single dataset and strengthens the robustness of the research findings. Additionally, the inclusion of the three global Sharia indices offers benefits such as access to global market insights, risk management, and practical applications for investors. The study demonstrates that ANNs, particularly the Nonlinear Autoregressive with External Input Neural Network (NARX), outperform classical models in accurately predicting the DFMSI. This research contributes significantly to the understanding of Sharia-compliant investments by providing a comprehensive analysis of how multiple global indices affect a local market index. It also offers valuable insights for investors and portfolio managers, suggesting that the integration of advanced machine learning models can enhance decision-making processes and improve risk management strategies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a92022138924af874d8392d03087921c",
  "timestamp": "2025-05-15T01:54:34.023709"
}