{
  "id": 6651,
  "title": "Female CEO succession and audit fees: evidence from China",
  "abstract": "Purpose - This paper aims to examine whether CEO succession with gender change (male to female) affects audit fees in the Chinese setting. In addition, this study examines whether the relationship exists in both types of ownership, i.e. non-state-owned enterprises (SOEs) and SOEs. Design/methodology/approach - This study uses data from all A-share non-financial firms listed on both the Shanghai Stock Exchange (SSE) and Shenzhen Stock Exchange (SZSE) for the period 2009 to 2015. To draw inferences, this study uses pooled ordinary least squares regression as a baseline technique. This study performs sub-sample analyzes for robustness. To account for endogeneity, this study uses three techniques including firm fixed-effects regression, the two-step Heckman model and the system generalized method of moments (GMM). Findings - This study documents a significantly negative relationship between CEO succession with gender change and audit fees. However, the negative effect of CEO succession on audit fees is more pronounced in non-SOEs than SOEs. This study also finds, in additional analyzes, a strong negative effect of female CEO succession on audit fees in sub-sample of large, high-risk, high-performance and firms audited by non-big auditors. The main finding is robust across three endogeneity techniques. Practical implications - The findings add to the ongoing debate about the underrepresentation of women in key executive positions such as CEO. The results suggest that CEO succession from male to female has a favorable effect on the quality of internal monitoring mechanisms (due to the superior monitoring skills of women) and enhances the quality of financial reporting. The study has practical implications for regulatory bodies and corporate decision-makers; this study encourages them to look into considering women in the executive succession framework. Originality/value - This study contributes to the literature by exploring the effect of CEO succession with gender change (male to female) on audit fees in the context of China and the existence of this relationship in non-SOEs and SOEs.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a943c2a779d29dede4a7a22d4162a691",
  "timestamp": "2025-05-15T03:00:05.062069"
}