{
  "id": 2492,
  "title": "Deep neural network for prediction of time-history seismic response of bridges",
  "abstract": "The collapse of civil infrastructure due to natural disasters results in financial losses and many casualties. In particular, the recent increase in earthquake activities has highlighted on the importance of assessing the seismic performance and predicting the seismic risk of a structure. However, the nonlinear behavior of a structure and the uncertainty in ground motion complicate the accurate seismic response prediction of a structure. Artificial intelligence can overcome these limitations to reasonably predict the nonlinear behavior of structures. In this study, a deep learning-based algorithm was developed to estimate the time-history seismic response of bridge structures. The proposed deep neural network was trained using structural and ground motion parameters. The performance of the seismic response prediction algorithm showed the similar phase and magnitude to those of the time-history analysis in a single-degree-of-freedom system that exhibits nonlinear behavior as a main structural element. Then, the proposed algorithm was expanded to predict the seismic response and fragility prediction of a bridge system. The proposed deep neural network reasonably predicted the nonlinear seismic behavior of piers and bearings for approximately 93% and 87% of the test dataset, respectively. The results of the study also demonstrated that the proposed algorithm can be utilized to assess the seismic fragility of bridge components and system.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a953c6540c587f51a35a4e2b88afc628",
  "timestamp": "2025-05-15T02:15:59.865186"
}