{
  "id": 7816,
  "title": "Public sector bank dominated financing and earning quality: Indian evidence",
  "abstract": "Purpose - Good earnings quality (EQ) provides reasonable assurance as to the reliability of future cashflow generation capability of the borrowing firms and thereby mitigates the credit risk of the banks. Against the backdrop of the stressed-assets problem in public-sector banks in India, adversely impacting the public finance system, this paper aims to explore the role of EQ of the borrowers in obtaining bank credit and the ways to mitigate the problem. Design/methodology/approach - Using a sample of listed 3,486 non-financial and non-government firms, the authors apply Jones (1991) model to estimate their EQ. Then, the authors conduct Hausman's (1970) test and find the existence of a two-way relation between bank finance and EQ. The authors adopt a two-stage least-square regression model to test the nature of the association between the two after controlling for firmand industry-level characteristics. Findings - The empirical results suggest that there exists a two-way negative association between EQ and bank finance implying that the Indian firms tend to report abnormal accruals to enhance tangibility for enjoying higher credit limits and easier access to bank finance. Also, the poor EQ is associated with earnings volatility, adversely impacting the credit quality. The findings are consistent. Practical implications - The study highlights the role of EQ in mitigating credit risk and addressing adverse selection problems in granting credit by practicing bankers. Originality/value - The findings of the study enrich the literature on EQ, capital structure, agency theory and public finance in several ways and have significant ethical and policy implications in bank-financeled economies.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a961d5774100811c1d8c2c2c8a2c39e2",
  "timestamp": "2025-05-15T03:12:36.389920"
}