{
  "id": 3594,
  "title": "Impact of different diagnostic technologies for MRSA admission screening in hospitals - a decision tree analysis",
  "abstract": "Background: Hospital infections with multiresistant bacteria, e.g., Methicillin-resistant Staphylococcus aureus (MRSA), cause heavy financial burden worldwide. Rapid and precise identification of MRSA carriage in combination with targeted hygienic management are proven to be effective but incur relevant extra costs. Therefore, health care providers have to decide which MRSA screening strategy and which diagnostic technology should be applied according to economic criteria. Aim: The aim of this study was to determine which MRSA admission screening and infection control management strategy causes the lowest expected cost for a hospital. Focus was set on the Point-of-Care Testing (PoC). Methods: A decision tree analytic cost model was developed, primarily based on data from peer-reviewed literature. In addition, univariate sensitivity analyses of the different input parameters were conducted to study the robustness of the results. Findings: In the basic analysis, risk-based PoC screening showed the highest mean cost savings with 14.98 (sic)per admission in comparison to no screening. Rapid universal screening methods became favorable at high MRSA prevalence, while in situations with low MRSA transmission rates omission of screening may be favorable. Conclusion: Early detection of MRSA by rapid PoC or PCR technologies and consistent implementation of appropriate hygienic measures lead to high economic efficiency of MRSA management. Whether general or targeted screening is more efficient depends mainly on epidemiological and infrastructural parameters.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a96acfc7e37d3e78b37ea167c65fe287",
  "timestamp": "2025-05-15T02:27:54.088908"
}