{
  "id": 2845,
  "title": "Financial inclusion choices in post-conflict and fragile states of Africa: The case of Burundi",
  "abstract": "Financial inclusion has become an important goal of the global development agenda, particularly for post-conflict and fragile states. Enhancing financial inclusion is vital for a country like Burundi which aims to achieve inclusive growth in its attempt to break free of its fragility. However, the adoption of instruments of financial inclusion such as bank account, microfinance account and mobile money account is low due to weak institutional capacity leading to high-risk exposure and a greater risk of economic instability. This study examines the factors that influence the adoption of these instruments of financial inclusion using the Multivariate Probit and Poisson regression models. The results show that there is a significant correlation between the instruments of financial inclusion, signifying that the adoption of these instruments is interrelated. The analysis also reveals that, factors such as receipt of government transfers, receipt of remittances, education, membership of a social network, access to electricity, employment status, and area of residence influence both the probability and intensity/extent of adoption of the instruments of financial inclusion. By implication, policymakers should enhance access to electricity, formalise employment and strengthen social networks to improve the adoption of financial inclusion instruments.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a98759bf388dc82a4c63e2224a9e1b02",
  "timestamp": "2025-05-15T02:19:46.689671"
}