{
  "id": 534,
  "title": "Towards sustainable development through the perspective of eco-efficiency - A systematic literature review",
  "abstract": "Sustainability concerns have increasingly gained importance among organizations and their stakeholders around the world. In this context, eco-efficiency has become a consistent tool towards the transition to sustainable development and the efforts of eco-efficiency indicators have been used for comparative studies and decision-making tasks, providing better financial, environmental, and social performance. The aim of this paper is to provide a systematic literature review on the theme of sustainable development from the perspective of eco-efficiency, with the adaptation of the Knowledge Development Process intervention instrument - constructivist (ProKnow-C). The paper identifies and structures the state-of-the-art between Eco-Efficiency and Sustainable Development with a view to: (i) selecting a Bibliographic Portfolio (BP) that is aligned with the perception of the researchers on the theme; (ii) performing a bibliometric analysis of the selected BP; (iii) performing a thematic synthesis; (iv) finding the integration of eco-efficiency and sustainable development with other approaches; (v) proposing an innovative framework to achieve sustainable development through eco-efficiency indicators; and (vi) finding paths for further research. This research makes multiple new contributions, providing both academics and practitioners a better panorama to achieve sustainable development through eco-efficiency by expanding the literature review, highlighting the synergies and barriers between eco-efficiency and sustainable development and by comparing and analysing them, showing its relevant features. In addition, we synthesized the contributions of the BP according to the BASF indicators, sustainable dimensions and four measurement levels: industry, organization, project and process to better describe the current academic scenario on the subject. (C) 2017 Elsevier Ltd. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9893e758191cae4d23dcd593a60f0c7",
  "timestamp": "2025-05-15T00:37:01.819292"
}