{
  "id": 8728,
  "title": "Impact of Antipsychotic Use on Readmission Rates in Children and Adolescents With Autism Spectrum Disorder and Irritability",
  "abstract": "Background Risperidone and aripiprazole have been established as standard pharmacological treatments for irritability and associated aggressive behaviors in individuals with autism spectrum disorder (ASD), and are the only drugs approved by the United States Food and Drug Administration for those purposes. However, the rates of readmission with the use of these drugs in the pediatric population have not been studied, leaving a gap in the knowledge of antipsychotic effects. Readmission rates are a valuable metric of treatment efficacy that also reflect the financial burden, morbidity, and medical complications associated with multiple hospitalizations. Methodology A retrospective study was conducted in 65 Hospital Corporation of America Healthcare hospitals within the United States from 2016 to 2019. Patients aged 6-17 years with a diagnosis of ASD with irritability were included. The primary outcome was 30-, 60-, and 90-day readmission rates. Chi-square tests of independence and post-hoc analyses were used to assess the relatedness between readmission rate and antipsychotic use, as well as the type of antipsychotic medication if used. A binary regression analysis was used to analyze the relationship between demographic characteristics and readmission rate in this population. Patients on antidepressants, anxiolytics, or medications primarily used as mood stabilizers were excluded from the study to reduce confounding effects of such medications. Results A total of 2,375 patients aged 6-17 years were admitted for irritability and a diagnosis of ASD. In total 323 (13.8%) patients were readmitted from this group within 30 days of discharge. After controlling for age, sex, and gender, the use of antipsychotic medication was found to decrease 30- and 90-day readmission rates with an odds ratio of 1.2 to 1.4 times compared to no antipsychotic use (p < 0.04). In patients with autism not on antipsychotics, regression analysis revealed that older age (p = 0.0471) and White race (p = 0.0471) were associated with 30-day readmission (a = 0.05). For these patients, race was also significantly associated with 60-day (p = 0.0494) and 90-day (p = 0.0416) readmission rates. In patients with autism on either risperidone or aripiprazole, age (p = 0.0393) and race (p = 0.0316) were significantly associated with 30-day readmission rate. Conclusions Antipsychotic use reduced readmission rates within 30 days and 90 days in patients with irritability and ASD. Additionally, oral aripiprazole and oral risperidone were found to be equally effective in reducing the 30-day readmission rate, and neither was superior in comparison to the other in 30-, 60-, or 90-day readmission rates. The reduced 30- and 90-day readmission rates seen in our study with the use of antipsychotic medications emphasize the importance of antipsychotic use for individuals with ASD and irritability, even if the antipsychotic is not risperidone or aripiprazole. Groups who can particularly benefit from antipsychotic use include individuals who are refractory to first- and second-line therapies, such as behavioral interventions, or for those who present with persistent and serious risk of harm to themselves or others. Additionally, the use of antipsychotic medications in this scenario may reduce hospitalizations within 30 days of discharge, allowing reduction of the financial and emotional strain associated with these readmissions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a99e7dab253b9e2bc73c0eff6289fad1",
  "timestamp": "2025-05-15T03:21:56.603630"
}