{
  "id": 4624,
  "title": "Anxiety and depression in patients with histiocytic neoplasms and their associated clinical features",
  "abstract": "Anxiety and depression are common in many cancers but, to our knowledge, have not been systematically studied in patients with histiocytic neoplasms (HNs). We sought to estimate rates of anxiety and depression and identify clinical features and patient-reported outcomes (PROs) associated with anxiety and depression in patients with HNs. A registrybased cohort of patients with HNs completing PROs including the hospital anxiety and depression scale (HADS) from 2018 to 2023 was identified. Moderate or severe anxiety or depression were respectively defined as a score of >= 11 on the HADS anxiety or depression subscales. Associations of variables, including other validated PROs, with moderate or severe anxiety or depression were modeled with logistic regression to estimate odds ratios and 95% confidence intervals. In 215 patients, similar to 1 in 3 met the criteria for anxiety or depression, and 1 in 7 met the criteria for moderate or severe anxiety or depression. These estimates remained stable over a 12-month trajectory. Rates of depression, but not anxiety, significantly differed across HN types, with patients with Erdheim-Chester disease experiencing the highest rate. In addition, neurologic involvement, unemployment, and longer undiagnosed illness interval were significantly associated with increased risk of depression. Financial burden, financial worry, and severe disease-related symptoms were correlated with increased risk of both anxiety and depression. Conversely, increased general and cognitive health-related quality of life (HRQoL) were correlated with decreased risk of both anxiety and depression. In patients with HN, anxiety and depression are prevalent, stable over time, and correlated with financial burden, symptom severity, and HRQoL. This trial was registered at www.clinicaltrials.gov as #NCT03329274.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9aad85e254335c17b38c00c7e5c46bf",
  "timestamp": "2025-05-15T02:39:26.938202"
}