{
  "id": 7745,
  "title": "Economic Challenges and Behavioral and Mental Health Risks for Overdose during the COVID-19 Pandemic among People Who Inject Drugs",
  "abstract": "People who inject drugs (PWID) are a population that disproportionately struggles with economic and mental health challenges. However, despite numerous reports of people globally experiencing new or exacerbated economic and/or mental health challenges during the COVID-19 pandemic, the literature on the effect of the pandemic on PWID and their risk for harm (e.g., overdose) remains sparse. The present study will describe reported changes during the pandemic in risk factors for drug overdose (including changes in mental health symptoms and care access) among PWID in Chicago, and it will examine associations between such risk factor changes and the experience of economic challenges during the pandemic. Participants from an ongoing longitudinal study of young PWID from the Chicago suburbs and their injection risk network members (N = 138; mean age = 28.7 years) were interviewed about changes in their experiences, substance use behavior, and mental health since the start of the COVID-19 pandemic. Bivariate cross tabulations were computed of each overdose risk factor with experiences of economic challenges during the pandemic. Fisher's Exact Tests were used to assess statistical significance. Adjusted logistic regression models were also conducted that controlled for sociodemographic characteristics, for time elapsed since the start of the pandemic, and for pre-pandemic income, homelessness, and injection frequency. Over half of our sample reported using alone more than usual during the pandemic, and over 40% reported using more than usual and/or buying drugs that were of a decreased purity or quality. Additionally, a large proportion of our sample (52.5% of those asked) reported more difficulty than usual accessing mental health care. Experiencing loss of a source of income during the pandemic was associated with using more drugs, using alone more, using a larger amount of drugs while using alone, wanting to stop using but being unable, and difficulty accessing mental health care. The preliminary associations found by the present study suggest that economic challenges or disruptions experienced during the pandemic are likely to increase risk for overdose among PWID experiencing such challenges, via changes in the above behaviors and/or conditions that are associated with risk for overdose. Intervention efforts should therefore be focused not only directly on overdose prevention, but also on assisting PWID with their economic challenges and helping them regain economic stability and access to services that may have been impeded by financial difficulty.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9bee0308c56753b9f53b80c0ab28669",
  "timestamp": "2025-05-15T03:11:38.553590"
}