{
  "id": 2517,
  "title": "Return, Diversification and Risk in Cryptocurrency Portfolios using Deep Recurrent Neural Networks and Multi-Objective Evolutionary Algorithms",
  "abstract": "Nowadays the widespread adoption of cryptocurrencies (also referred to as Altcoins) has universalized the access of the society to trading opportunities in alternative markets, thereby laying a rich substrate for the development of new applications and services aimed at easing the management of personal investment portfolios. When selecting how much to invest and in which asset it is often the case that multiple criteria conflict with each other within a single decision making process, which calls for efficient means to optimally balance such contradicting objectives. In this paper we report initial findings around the combination of Deep Learning (DL) models and Multi-Objective Evolutionary Algorithms (MOEAs) for allocating cryptocurrency portfolios. Technical rationale and details are given on the design of a stacked DL recurrent neural network, and how its predictive power can be exploited for yielding accurate ex ante estimates of the return and risk of the portfolio. These two objectives are complemented by a measure of the diversity of the investment. Results are presented and discussed with real cryptocurrency data, showcasing the potential of our technical approach to produce near-optimal portfolios by balancing the aforementioned objectives. Our study stimulates further research towards incorporating other factors in the design of predictive portfolios, such as the confidence of the DL model output.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9bf1c1c68ed9738e0d48db944b42401",
  "timestamp": "2025-05-15T01:07:35.728135"
}