{
  "id": 8531,
  "title": "The Relationship Between Intimate Partner Violence and Unintended Pregnancy: Eastern Sub Saharan African Countries' Analysis of Demographic and Health Surveys",
  "abstract": "Intimate partner violence (IPV) adversely affects female reproductive health in various ways. Similarly, it plays a critical role in women's unintended pregnancy. This study examines the relationship between IPV and unintended pregnancy in Eastern Sub-Saharan Africa (SSA) countries. This study uses data from the nationally representative Demographic and Health Surveys (DHS) in six Eastern African SSA countries. The original sample size was restricted to ever married (or cohabitating) women of reproductive age who completed the survey's Domestic Violence Module and had a pregnancy in the previous 5 years. Svyset proportion was used to estimate the prevalence and 95% confidence intervals (CI) of the study outcomes and multiple logistic regression was used to compare outcomes of last pregnancy by exposure to lifetime IPV committed by the most recent partner. The prevalence of unintended pregnancy in Eastern SSA was 38% [36.4, 40.34] among married women with high disparity among countries. This prevalence was 45% [42.05, 48.15] and 55% [50.0, 59.87] among women who had experienced any form of IPV and sexual violence, respectively. After adjusting for potential confounding factors, women with a history of sexual violence had a higher risk of unintended pregnancy [AOR: 1.80, 95% CI: 1.39, 2.33] and increased odds of unintended pregnancy for women who had more than five living children [AOR: 4.93, 95% CI: 3.40, 7.15], women who lived in rural residences [AOR: 1.42, 95% CI: 1.07, 1.90], and women who reported they had financial barriers for health care [AOR: 1.36, 95% CI: 1.13, 1.64]. Our findings suggest that IPV, particularly sexual violence, is a key player for higher risk of unintended pregnancy in Eastern SSA countries. This study highlights the need for developing programs and implementation of policies that integrate sexual reproductive health and IPV to reduce unintended pregnancy among married and single women.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9d2bb105aa27c67aef3029cd0ccbf8c",
  "timestamp": "2025-05-15T03:19:52.092160"
}