{
  "id": 5324,
  "title": "Linking gender, extramarital affairs, and HIV: a mixed methods study on contextual determinants of extramarital affairs in rural Tanzania",
  "abstract": "Background: Extramarital sex is a potential driver of human immunodeficiency virus (HIV) transmission for long-term couples in sub-Saharan Africa. It is increasingly recognized that preventing sexual risk behaviours requires an understanding and adjustment of sexual relationship factors beyond the individual level. We investigated the association between extramarital affairs and HIV status, factors associated with extramarital affairs, and created insights in the context and pathways for married men and women in rural Tanzania who engage in extramarital affairs. Methods: A cross-sectional sequential explanatory mixed method design was employed. The WHO-Social determinants of health perspective guided the study. Using logistic regression, we analysed the MZIMA project community surveillance representative sample of 3884 married partners aged 15+ residing in Ifakara town, Tanzania (2012-2013). Multinomial logistic regression analysis established the relative risk ratio (RRR) of different social and economic factors with lifetime (proxy) and recent (12 months prior to survey) extramarital affairs. Logistic regression analysis determined the association between extramarital affairs and HIV status. Semi-structured interviews and focus group discussions explored the quantitative findings, capturing the experiences and norms regarding extramarital affairs. Results: We found a significant association between lifetime (proxy) extramarital affairs and HIV infection among women only. The RRR of having extramarital affairs (lifetime proxy) was significantly higher among Village Community Bank (VICOBA) members, the re-married, consumers of alcohol, those from southern regions, non-Muslims, and those with older age. In the case of recent extramarital affairs (12 months prior to survey), associations were significant for the same variables except for religion, having an income was also associated with the outcome. Qualitative narratives reflected that, desire to prove manhood (masculinity) supported by societal normative beliefs such as; 'it is not realistic for a man to stay without extramarital partner' and religious beliefs; 'a man shall dominate a woman' encouraged men's extramarital affairs. For women, striving for financial autonomy, obligations to pay back debts borrowed from several VICOBA, and limited support from their husbands encouraged their engagement in extramarital affairs. Low relationship quality (conflict and sexual dissatisfaction) were reported to encourage both men and women's extramarital affairs. Conclusions: The findings show that the link between extramarital affairs and HIV has a gender dimension in which women are more likely to acquire HIV through extramarital affairs (case of recent extramarital affairs (12 months prior to survey). Future programs seeking to address risk sexual behaviors in Tanzanian marriages can consider context-sensitive interventions which address aspects beyond 'individual risk'and women's financial uncertainties, and include couple's relationship quality, excessive alcohol behaviors, normative masculinity ideology and societal norms, that encourage women's economic dependence and men's engagement in multiple sexual partnerships. Microfinance projects (e.g. VICOBA) could be a platform for gender-transformative approaches, combining economic empowerment and HIV risk protection strategies.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9d3b95b1634043e42ff339920638454",
  "timestamp": "2025-05-15T02:46:44.870296"
}