{
  "id": 8623,
  "title": "The Consequences of the Coronavirus Disease 2019 Pandemic on Smoking Behavior: Evidence from the English Longitudinal Study of Ageing",
  "abstract": "Introduction Smoking is a risk factor for the progression of COVID-19, with smokers having higher odds of COVID-19 progression than never-smokers. This study presents novel findings on the effect of the COVID-19 pandemic on smoking behavior in older adults. Methods Panel data were obtained from the English Longitudinal Study of Ageing (N = 60160, 12% smokers, 55% women, 62% married, mean age = 67 years, 23% employed). Fixed-effect regression models were used to estimate the extent to which the COVID-19 pandemic affected smoking behavior. A separate model was estimated for men, women, employed, and retired. Results The findings suggest a significant and positive effect of the COVID-19 pandemic on smoking behavior (beta = 0.024; P < .001). The estimated effects were stronger for men and for the sample of individuals reporting being employed. Conclusions In this study, I provide robust evidence of the effect of the COVID-19 pandemic on smoking behavior using the English Longitudinal Study of Ageing. This large and representative dataset is uniquely suited for the analysis. I find evidence that the proportion of smokers has increased significantly as a result of the COVID-19 pandemic. Implications In the United Kingdom, the proportion of smokers increased significantly as a consequence of the COVID-19 pandemic. These findings suggest that smoking behavior may have been used as a mechanism to cope with depression, stress, and anxiety due to the COVID-19 outbreak. To the extent to which smoking behavior has been used as a coping mechanism to deal with job-related issues, targeted policy action to provide financial stability to those in worse economic situations may have beneficial effects on smoking behavior.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9e105beec5435a15208ee2fc5e79209",
  "timestamp": "2025-05-15T03:20:55.851516"
}