{
  "id": 5877,
  "title": "Herding in Fast Moving Consumer Group Sector: Equity Market Asymmetry and Crisis",
  "abstract": "This study empirically examines herd behavior for fast moving consumer goods (FMCG) sector stocks under varied market return conditions and the period during the global financial crisis and its aftermath. We examine the sample of stocks trading on the Nifty FMCG Index of the Indian equity market from January 2008 up to December 2018 using the dispersion measure of cross sectional absolute deviation and examine its relationship with the market return to explore herd phenomenon. Quantile regression estimate is used and the results of the study validate rational asset pricing models as the sector does not display herding. In contrast, anti-herd behavior at lower and median quantile values is observed. A possible reason can be the non-cyclical nature of the industry where investors rely more on the fundamentals rather than crowd chasing. We also find the absence of herd phenomenon during the market asymmetries of bull and bear phases, extreme movements, the period of the global financial crisis, and afterward. We further examine herding under the impact of the information technology (IT) industry and conclude that significant return movements in IT sector impact dispersions in the FMCG industry. Also, there is a co-varying risk between the two sectors confirming the spillover in an integrated market.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9e3ffb58bff0b1298efeee29b291740",
  "timestamp": "2025-05-15T02:52:31.389460"
}