{
  "id": 4037,
  "title": "Is Artificial Intelligence Really More Accurate in Predicting Bankruptcy?",
  "abstract": "Predicting bankruptcy within selected industries is crucial because of the potential ripple effects and unique characteristics of those industries. It serves as a risk management tool, guiding various stakeholders in making decisions. While artificial intelligence (AI) has shown high success rates in classification tasks, it remains uncertain whether its use significantly enhances the potential for early warning of impending problems. The following question arises: will classical methods eventually replace the effectiveness of these advanced techniques? This paper sheds light on the fact that even classical methods continue to achieve results that are not far behind, highlighting their enduring importance in financial analysis. This paper aims to develop bankruptcy prediction models for the chemical industry in Slovakia and to compare their effectiveness. Predictions are generated using the classical logistic regression (LR) method as well as AI techniques, artificial neural networks (ANNs), support vector machines (SVMs), and decision trees (DTs). The analysis aims to determine which of the employed methods is the most efficient. The research sample consists of circa 600 enterprises operating in the Slovak chemical industry. The selection of eleven financial indicators used for bankruptcy prediction was grounded in prior research and existing literature. The results show that all of the explored methods yielded highly similar outcomes. Therefore, determining the clear superiority of any single method is a difficult task. This might be partially due to the potentially reduced quality of the input data. In addition to classical statistical methods employed in econometrics, there is an ongoing development of AI-based models and their hybrid forms. The following question arises: to what extent can these newer approaches enhance accuracy and effectiveness?",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9f08738b53d4cf2568c666821629209",
  "timestamp": "2025-05-15T02:32:27.537861"
}