{
  "id": 1338,
  "title": "Water Leak Detection and Classification using Multiple Sensors",
  "abstract": "Water leakage represents an important concern in managing Water Distribution Networks (WDNs) as more than sixty countries are still facing high water stress risk. These leaks constitute major financial loss, soil contamination and other environmental hazards, all contributing to further water scarcity. Fast-expanding water supply networks need the development of better leak detection technologies. Current technologies such as real-time monitoring of the WDNs and Machine Learning (ML) allow us to limit these losses by developing data-driven methods for leak detection. This work aims at contributing to this issue through a study of the capacity of ML methods to detect and classify types of leakage in WDNs by using acoustic measurements. For this purpose, we used a dataset generated by a laboratory-scale WDN including three types of sensors, namely accelerometers, hydrophones, dynamic pressure sensors, no-leak conditions, four leak types, various background conditions, and two network topologies. The results achieved both for the detection and classification problem are successful, suggesting that the proposed solution can be adopted to solve both the problems. Moreover in this work we have faced a problem not yet investigated in the literature, which is the different leak types classification.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9f211c627b11105a166950df55653d4",
  "timestamp": "2025-05-15T02:01:44.799350"
}