{
  "id": 6424,
  "title": "Common Mental Disorders and Economic Uncertainty: Evidence from the COVID-19 Pandemic in the US",
  "abstract": "Mental health disorders represent an enormous cost to society, are related to economic outcomes, and have increased markedly since the COVID-19 outbreak. Economic activity contracted dramatically on a global scale in 2020, representing the worst crisis since the Great Depression. This study used the COVID Impact Survey to provide insights on the interactions of mental illness and economic uncertainty during COVID-19. We used a probability-based panel survey, COVID Impact Survey, conducted in the U.S. over three waves in the period April-June 2020. The survey covered individual information on employment, economic and financial uncertainty, mental and physical health, as well as other demographic information. The prevalence of moderate mental distress was measured using a Psychological Distress Scale, a 5-item scale that is scored on a 4-point scale (total range: 0-15). The mental distress effect of employment, economic, and financial uncertainty, was assessed in a logit regression analysis conditioning for demographic and health information. It is found that employment, health coverage, social security, and food provision uncertainty are additional stressors for mental health. These economic factors work in addition to demographic effects, where groups who display increased risk for psychological distress include: women, Hispanics, and those in poor physical health. A decrease in employment and increases in economic uncertainty are associated with a doubling of common mental disorders. The population-representative survey evidence presented strongly suggests that economic policies which support employment (e.g., job keeping, job search support, stimulus spending) provide not only economic security but also constitute a major health intervention. Moving forward, the economic uncertainty effect ought to be reflected in community level intervention and prevention efforts, which should include strengthening economic support to reduce financial and economic strain.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "a9f7f9d9659be078499c00b548661bab",
  "timestamp": "2025-05-15T02:58:05.593154"
}