{
  "id": 8273,
  "title": "Impact of banking relationships and ownership concentration on corporate cash holdings in India",
  "abstract": "Purpose This study aims to investigate the impact of banking relationships and ownership concentration on corporate cash holdings (CCH) in 333 Indian micro, small and medium-sized enterprises (MSMEs) for nine years (2011-2020). Design/methodology/approach The authors use system generalized method of moments approach to examine the impact of banking relationships and ownership concentration on CCH. Findings The paper finds that the firm's number of banking relationships share a concave (inverted U-shaped) relationship with the cash holding levels. Initially, the positive relationship may signal weak creditworthiness of MSMEs or be a consequence of bank free-rider monitoring issues. The negative effect after a certain level shows that the competition among banks reduces the firm's financial constraints and therefore makes the firms hoard less cash. The authors also document an inverse relationship between ownership concentration and cash holdings. The authors' results suggest that the presence of large shareholders acts as efficient monitors, reducing the risk of potential agency conflicts and thereby managerial entrenchment resulting in lower cash levels. This association remains unchanged for MSMEs in the service sector. However, the quadratic association between banking relationships and CCH vanishes in the presence of a service sector dummy in the regression model. The authors find a significant positive linear relationship in this regard. Originality/value To the best of the authors' knowledge, this is the first paper that studies banking relationships and ownership concentration as determinants of Indian MSMEs.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa034580242e16a0ef2d2c7cce47c8cd",
  "timestamp": "2025-05-15T03:17:21.459813"
}