{
  "id": 5188,
  "title": "Assessment of the Hyperspectral Data Analysis as a Tool to Diagnose Xylella fastidiosa in the Asymptomatic Leaves of Olive Plants",
  "abstract": "Xylella fastidiosa is a bacterial pathogen affecting many plant species worldwide. Recently, the subspecies pauca (Xfp) has been reported as the causal agent of a devastating disease on olive trees in the Salento area (Apulia region, southeastern Italy), where centenarian and millenarian plants constitute a great agronomic, economic, and landscape trait, as well as an important cultural heritage. It is, therefore, important to develop diagnostic tools able to detect the disease early, even when infected plants are still asymptomatic, to reduce the infection risk for the surrounding plants. The reference analysis is the quantitative real time-Polymerase-Chain-Reaction (qPCR) of the bacterial DNA. The aim of this work was to assess whether the analysis of hyperspectral data, using different statistical methods, was able to select with sufficient accuracy, which plants to analyze with PCR, to save time and economic resources. The study area was selected in the Municipality of Oria (Brindisi). Partial Least Square Regression (PLSR) and Canonical Discriminant Analysis (CDA) indicated that the most important bands were those related to the chlorophyll function, water, lignin content, as can also be seen from the wilting symptoms in Xfp-infected plants. The confusion matrix of CDA showed an overall accuracy of 0.67, but with a better capability to discriminate the infected plants. Finally, an unsupervised classification, using only spectral data, was able to discriminate the infected plants at a very early stage of infection. Then, in phase of testing qPCR should be performed only on the plants predicted as infected from hyperspectral data, thus, saving time and financial resources.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa11f5faf5c235ccc45500fbe78eabd8",
  "timestamp": "2025-05-15T02:45:17.084896"
}