{
  "id": 7444,
  "title": "Classifying tree planters and non planters in a subsistence farming system using a discriminant analytical approach",
  "abstract": "Since the 1970s tree planting has been promoted to meet the multipurpose needs of subsistence farmers and to arrest deforestation in many developing countries. Financial support and extension systems were developed as tree growing outside the forest became more important. The limited success of the forest extension approaches used in the 1980s has been attributed to the failure to ascertain householders' priorities and attitudes to tree growing. Although the broader theoretical paradigm of factors influencing householders' planting of trees has been discussed household and regional level analyses are rare. This study used discriminant analysis to assess the extent to which social and economic factors affect smallholder farmer tree planting in Orissa, eastern India. The validity of the predictive model to define the different groups was tested by assessing the accuracy of classification. The significance of the factors was probed using the identified variables in the discriminant functions developed for smallholder farmers in the coastal and inland zones of Orissa. The results contradicted some common assumptions that only large landowners with a substantial income are innovators. The likelihood of adopting agroforestry is dependent on the progressive attitude of farmers, membership of village organisations, their wealth status and, more importantly, their perceived risk concerning agricultural production. This approach enables tree planters and non-planters to be characterised and hence give better targetting of planning and social forestry programmes.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa23f1b7cdd2c8e626a22cf4f31aa60b",
  "timestamp": "2025-05-15T03:08:37.883698"
}