{
  "id": 5497,
  "title": "Bank Risk Capital and Its Effectiveness in Selected Euro Area Banking Sectors",
  "abstract": "Risk capital or capital at risk (CaR) refers to the amount of capital set aside and maintained by banks to cover different types of risk. For banks, it is used as a buffer against claims or expenses in the event that ordinary capital is not enough to cover them. Thereby, risk capital can also be recognized as risk-bearing capital or surplus funds. Risk capital may generate very high costs, but on the other hand it protects against insolvency. That's why a bank needs to find the 'Gold mean'-the optimal value of risk capital that will not lower its efficiency, but still ensure financial security. The main objective of the study is identification of interdependencies between bank risk capital and effectiveness of the aggregated Eurozone banking sector and selected national banking sectors of the euro area. The paper tries to answer the research question whether the risk capital supports or lowers banks' operational effectiveness. The adopted research hypothesis stated that there is a positive correlation between profitability and size of bank risk capital. To verify the hypothesis regression models were used. The results indicate that the size and structure of bank capital impact on the credit institutions' effectiveness in the analyzed banking sectors, however with different intensity. Thereby, the article fulfils a research gap in the field of research studies that take into account how capital at risk and specific capital adequacy regulations may impact on a bank's efficiency.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa29bb6dc6c010958401b1b8a9269ca6",
  "timestamp": "2025-05-15T02:48:23.777863"
}