{
  "id": 4415,
  "title": "Using a dual system of reasoning in small businesses: Entrepreneurial decisions and subjective risk intelligence",
  "abstract": "This study aims at introducing subjective risk intelligence (SRI) in the context of small businesses to analyze how both rationality and intuition may influence the entrepreneurial decision-making process, particularly in affecting firms' financial equilibrium. SRI aggregates four dimensions: two positive attitudes (imaginative capability and problem-solving self-efficacy) and two detrimental ones (emotional stress vulnerability and negative attitude towards uncertainty). In particular, we argue that imaginative capability and emotional stress vulnerability refer to Kahneman's System 1 (the intuitive), while problem-solving self-efficacy and negative attitude towards uncertainty appertain to System 2 (the rational). We conducted an empirical investigation collecting data from an ad hoc survey administered to owners and managers of small businesses and their balance sheets over 2013-2017. After testing the proposed constructs' reliability, we tested the influence that both Systems 1 and 2 have on SMEs' financial structure through a pooled OLS regression estimator. Results show that the intuitive and the rational components of risk intelligence affect entrepreneurs' decision-making differently. The rational component seems to stimulate the entrepreneurial orientation to risk tolerance. The intuitive component limits the entrepreneurial propensity to take financial risks due to the desire for stability attached to this cognitive process. Accordingly, we highlight the importance of enhancing a balance between the two systems of thinking. Practical implications suggest that entrepreneurs with a dominant attitude towards problem-solving self-efficacy, or a positive attitude towards uncertainty, should invest in developing imaginative capabilities or emotional control, and vice versa.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa3579f0f7312ac72ccb651fd486948e",
  "timestamp": "2025-05-15T02:37:16.724359"
}