{
  "id": 4308,
  "title": "Assessment of Financial Toxicity Among Patients With Advanced Lung Cancer in Western China",
  "abstract": "Background: Lung cancer is the leading source of cancer-caused disability-adjusted life years. Medical cost burden impacts the well-being of patients through reducing income, cutting daily expenses, curtailing leisure activities, and depleting exhausting savings. The COmprehensive Score for Financial Toxicity (COST) was created and validated by De Souza and colleagues. Our study intends to measure the financial burdens of cancer therapy and investigate the link between financial toxicity and health-related quality of life (HRQoL) in an advanced lung cancer population.Methods: Patients aged >= 18 years with confirmed stage III to IV lung cancer were eligible. The COST questionnaire verified by de Souza et al. was used to identify financial toxicity. Multivariable linear regression analysis with log transformation univariate analysis and Pearson correlations were used to perform the analysis.Results: The majority of the patients (90.8%, n = 138/152) had an annual income of $50,000 ($7,775). The cohort's insurance situation was as follows: 64.5% of the cohort had social insurance, 20.4% had commercial insurance, and 22.0% had both. Patients who were younger age (50-59, P < 0.001), employed but on sick leave, and had lower income reported increased levels of financial toxicity (P < 0.05). The risk factors for high financial toxicity: (i) younger age (50-59), (ii) <1 month of savings, and (iii) being employed but on sick leave. Increased financial toxicity is moderately correlated with a decrease in QoL.Conclusion: Poorer psychological status and specific demographics are linked to increased financial toxicity (lower COST). Financial toxicity has a modest relationship with HRQoL and may have a clear link with HRQoL measurements.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa435de02e2546e9f5b45b5b4b956d80",
  "timestamp": "2025-05-15T02:35:26.361183"
}