{
  "id": 8779,
  "title": "Catastrophic household expenditure associated with out-of-pocket payments for dental healthcare in Spain",
  "abstract": "Objective To estimate the prevalence of catastrophic health expenditure due to dental healthcare (CHED) in Spain, quantify its intensity and examine the related sociodemographic household characteristics. Methods Data from the Spanish Household Budget Survey, which addresses more than 20,000 households each year for the period 2008-2015 were included, and the methodology proposed by Wagstaff and van Doorslaer was followed. The prevalence (number of households that devote more than a certain threshold of their income to such payments) and intensity (amount that exceeds a certain percentage of income) were estimated. Ordered logistic regression models were estimated to analyse the sociodemographic factors associated with the prevalence of catastrophic payments. Results The prevalence and intensity remained stable during the period under analysis. In terms of prevalence, a mean proportion of 7.36% of the population dedicated, in terms of intensity, more than 10% of their resources to dental care payments [mean: euro292.75 per year (SD euro2144.14)] and 2.05% dedicated more than 40% [mean: euro143.02 per year (SD euro1726.42)]. This represents 36.32% and 51.34% (for the thresholds of 10% and 40%) of the total catastrophic expenditure derived from out-of-pocket payments for dental healthcare in Spain. Conclusion This study shows that a significant proportion of catastrophic healthcare payments correspond to dental services. Being male, aged over 40 years, unattached (single, separated, divorced or widowed), having a low level of education, a low household income, being unemployed and living in an urban area are all associated with a greater risk of CHED. This finding highlights the need to establish policies aimed at increasing dental care coverage to mitigate related financial burdens on a large part of the Spanish population.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa542c44f0aed214859adcb71aa2fec9",
  "timestamp": "2025-05-15T03:22:26.022809"
}