{
  "id": 4212,
  "title": "Symbiotic relationship and attribution analysis of digitalization in agriculture, rural, and finance: evidence from China",
  "abstract": "There is a close symbiotic relationship among digital finance, digital rural and digital agriculture. The three promote and influence each other to jointly drive rural revitalization and agricultural modernization. Using panel data from 30 provinces in China spanning from 2015 to 2021, this paper quantitatively analyzes the dynamic characteristics, spatial patterns, and driving mechanisms of digital agriculture, digital rural and digital finance, and their symbiotic relationships through coupling coordination degree model (CCDM) and geographically and temporally weighted regression (GTWR). The study shows that symbiotic relationship between digital agriculture, digital rural and digital finance is dominated by coordinate relationship and quasi symbiotic relationship. The evolution of symbiotic indices is diversified, with emergence of a variety of patterns such as continuously declining, fluctuating upward, relatively stable, L-shaped, inverted U-shaped, W-shaped, V-shaped, tilted Z-shaped, M-shaped, and the symbiotic relationship and its changes exhibit significant spatial variability, agglomeration and correlation. The driving mechanism of symbiotic relationship is complicated, and the nature and intensity of factors are regional and time-varying. Except for fiscal self-sufficiency rate, which plays a long-term positive promotion role, most factors exert mixed effects (both positive promoting and negative inhibitory). For this reason, it is recommended that the government should change with the trend in management, balancing weak and strong interventions. And it should also accelerate the transformation of development policies toward spatial policies, scientifically delineate geographical zones, and establish spatial alliances, to enable leading regions to demonstrate their exemplary value, while also helping and assisting those underdeveloped to quickly achieve breakthrough in areas with distinctive advantages. In addition, it should design the digitalization policy portfolio according to the symbiotic mechanism, focusing on the synergistic relationship between key positive and negative factors.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa72a46a61f5b47254d9d275a5a8c55d",
  "timestamp": "2025-05-15T01:24:51.461300"
}