{
  "id": 7796,
  "title": "Tradeoffs in Supplier Attribute Ratings in Supplier Selection across Strategic versus Non-Strategic Purchases",
  "abstract": "Purpose: This research identifies a customer perspective that is often ignored, neglected, or undervalued in B-to-B sales - the nature of the product itself. The pivot point is whether the product/service desired is strategic (critical to the company's mission) or non-strategic (not critical to the company's mission). Methodology/Approach: A conjoint analysis was conducted for both types of purchases (strategic and non-strategic), assessing the tradeoffs and espoused preferences of four key attributes involving both the supplier and the product across three performance levels - (1) stability of the supplier, (2) reliability, (3) competitive pricing and (4) product quality. Findings: The results indicate that B-to-B customers do make tradeoffs between suppliers based on stability, reliability, pricing and product quality. The direction of the tradeoffs depends on whether the purchase is a strategic or non-strategic acquisition. The results suggest that suppliers would benefit from understanding the relationship of their products and services to the B-to-B customer's mission when the supplier is deciding how to improve performance. Research implications: Too often there is a disconnect between B-to-B salespeople and their customers resulting in suppliers failing to reach performance goals. The research focuses on the importance of B-to-B salespeople uncovering whether or not the customer considers the nature of the product being considered as strategic or non-strategic to their business. The research helps to explain some of the mixed findings in the supplier selection literature. Practical implications: The research points to the fact that customers analyze and make decisions differently depending on the type of product. Additionally, the research highlights the importance to customers of understanding the potential legal and financial risk of suppliers. This is important in that traditionally suppliers tend to focus on product features and benefits in their selling efforts. These results indicate that they should spend significant time discussing factors that illustrate legal and financial risk reduction to the customer of dealing with their companies. Originality/Value/Contribution: The study offers a new look at an age-old problem of enhancing sales performance through a new lens by considering the nature of the product (strategic versus non-strategic) through the perspective of the customer. The findings help to explain the mixed results of previous research. To date, the nature of the product and tradeoffs of attributes that customers are willing to make depending on that product classification have not been the focus, though the results suggest that understanding customer decision-making through this lens may enhance supplier success.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa81233029b7bf16f01f98035db38764",
  "timestamp": "2025-05-15T03:12:11.660243"
}