{
  "id": 2173,
  "title": "Are women's entrepreneurial intentions and motivations influenced by financial skills?",
  "abstract": "Purpose This study aims to determine the contribution of financial skills to entrepreneurial intentions among women involved in university education. Design/methodology/approach Clustering and logistic regression analyses were used to infer the determinants and motivators of entrepreneurial intention in a sample of women students at a Spanish online university. Findings Financial and numerical skills could play a significant role in boosting entrepreneurial culture, overcoming reticence and increasing awareness of business opportunities, particularly when women are motivated to increase their autonomy and income. The study offers meaningful implications for policymakers. Research limitations/implications Further research will be needed before these conclusions may be inferred to other settings and circumstances. Comparison with a similar sample of potential male entrepreneurs may also be necessary to deduce the influence of gender. Practical implications The introduction of certain financial content into the education system by governments and policymakers would produce remarkable results on entrepreneurship intention among women. Social implications Relational capital and positive social influences also contribute to mitigating the effects of risk aversion, one of the main barriers for potential female entrepreneurs. Originality/value The role of financial literacy in entrepreneurial intention among women has scarcely been addressed in academic research. The literature also has paid little attention to the analysis of what motivates women into entrepreneurship, and whether women who decide to embark on a business venture show different profiles. The aim of this study is to contribute to closing these gaps, exploring the effect of cognitive skills, personality traits, contextual factors and motivations.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa862aebe13d3a7fff67f54929dd0c15",
  "timestamp": "2025-05-15T02:12:17.360092"
}