{
  "id": 6245,
  "title": "Catastrophic out-of-pocket payments for households of people with severe mental disorder: a comparative study in rural Ethiopia",
  "abstract": "BackgroundThere are limited data on healthcare spending by households containing a person with severe mental disorder (SMD) in low- and middle-income countries (LMIC). This study aimed to estimate the incidence and intensity of catastrophic out-of-pocket (OOP) payments and coping strategies implemented by households with and without a person with SMD in a rural district of Ethiopia.MethodsA comparative cross-sectional community household survey was carried out from January to November 2015 as part of the Emerald programme (emerging mental health systems in low- and middle-income countries). A sample of 290 households including a person with SMD and 289 comparison households without a person with SMD participated in the study. An adapted and abbreviated version of the World Health Organization SAGE (Study on global Ageing and adult health) survey instrument was used. Households were considered to have incurred catastrophic health expenditure if their annual OOP health expenditures exceeded 40% of their annual non-food expenditure. Multiple logistic regression was used to explore factors associated with catastrophic expenditure and types of coping strategies employed.ResultsThe incidence of catastrophic OOP payments in the preceding 12months was 32.2% for households of a person with SMD and 18.2% for comparison households (p=0.006). In households containing a person with SMD, there was a significant increase in the odds of hardship financial coping strategies (p<0.001): reducing medical visits, cutting down food consumption, and withdrawing children from school. Households of a person with SMD were also less satisfied with their financial status and perceived their household income to be insufficient to meet their livelihood needs (p<0.001).ConclusionsCatastrophic OOP health expenditures in households of a person with SMD are high and associated with hardship financial coping strategies which may lead to poorer health outcomes, entrenchment of poverty and intergenerational disadvantage. Policy interventions aimed at financial risk pooling mechanisms are crucial to reduce the intensity and impact of OOP payments among vulnerable households living with SMD and support the goal of universal health coverage.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa92909d736f3dfdb2b7b9d1a205189b",
  "timestamp": "2025-05-15T02:56:10.986854"
}