{
  "id": 8389,
  "title": "Geographical distance predicts psychiatric treatment retention for Hispanic women with comorbid major depression and breast cancer",
  "abstract": "PurposeDepression is among the most common comorbid psychiatric disorders of patients with breast cancer. Depression decreases patient quality of life and, if untreated, can adversely affect cancer treatment. We sought to identify treatment barriers for women with breast cancer receiving psychotherapy for depression. Findings may help policy makers and researchers determine funding and design of future studies involving this population, especially in communities with high rates of health disparities.MethodsWe used data from a randomized trial for women with breast cancer and current DSM-IV non-psychotic unipolar major depressive disorder (MDD). Patients were randomly assigned to 12 weeks of one of three psychotherapies and attrition was assessed by whether subjects completed 12 weekly treatment sessions. We used descriptive analyses and logistic regression to identify treatment barriers. R shiny was used to determine study patient residences.ResultsOf 134 randomized patients, 84 (62.7%) were Hispanic. Fifty-nine patients (44%) either did not start or dropped out of treatment, 49 (83.1%) of them being Hispanic. Being a Hispanic woman, less educated, and geographically distant from treatment significantly predicted attrition. Single Hispanic mothers had significantly higher attrition risk than married and/or childless women.ConclusionIdentifying barriers to treatment is important to improve treatment adherence for patients with concurrent diagnoses of breast cancer and MDD, especially for traditionally underserved minorities. Additional support such as affordable tele-medicine, multi-language assistance, financial aid for transportation and child-care, and allocation of more funds to address some identified barriers deserve consideration to improve treatment adherence and outcomes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa94d26982dd8108f4d16007ed6daba9",
  "timestamp": "2025-05-15T03:18:19.585312"
}