{
  "id": 6207,
  "title": "A Person-Centered Approach to Capture Health Disparities and Multidimensional Impact of COVID-Related Stressors",
  "abstract": "Public Significance Statement This study examined different types of stressors that people encountered during the COVID-19 pandemic such as work interruptions, financial stress, and knowing someone infected with COVID-19. Individuals who experienced multiple financial stressors made up a small minority but had higher mental health and alcohol-related problems, as well as lower quality of life. This group of individuals may benefit from holistic interventions and community outreach. The COVID-19 pandemic has influenced people's lives in diverse ways. The authors utilized latent class analysis (LCA), a person-centered approach, to examine distinct patterns of COVID-related stressors and their associations with alcohol-related, mental health, and quality of life outcomes. Participants were 463 adults who completed the baseline assessment of the National Institute on Alcohol Abuse and Alcoholism COVID-19 Pandemic Impact on Alcohol Study from June 2020 to January 2022. Using cross-sectional data, three analytic methods (continuous sum score, categorical grouping, and LCA) were applied to model 17 COVID-related stressors. Regression analyses indicated higher COVID-related stress and endorsement of four or more COVID-related stressors were generally associated with worse health-related outcomes. LCA revealed four classes: Class 1: Minimal COVID-Related Impact (51.6%); Class 2: Work Interruptions (24.8%); Class 3: Family/Friends Affected by COVID (14.5%); and Class 4: Serious Financial Stress (9.1%). Racial/ethnic minorities were more likely to be in Class 3, whereas individuals with more years of education and higher income were less likely to be in Class 4. Individuals with a history of alcohol use disorder were more likely to be in Classes 2 and 4. Compared with Class 1, Class 4 reported highest levels of perceived stress, problematic alcohol use, anxiety symptoms, depressive symptoms, alcohol craving, loneliness, drinking to cope, and lowest levels of physical, psychological, social, and environment quality of life. COVID-related stressors disproportionately affected minority and vulnerable groups. Individuals who experienced multiple financial stressors had the greatest risk for negative health-related outcomes and may benefit from holistic interventions and community outreach.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa98a097c5d1f80c08332c1d50526309",
  "timestamp": "2025-05-15T02:55:44.657377"
}