{
  "id": 3103,
  "title": "Cost of care using prophylactic negative pressure wound vacuum on closed laparotomy incisions",
  "abstract": "Objective. We wished to determine the reduction in the rate of wound complications that would render the use of prophylactic negative pressure wound vacuum therapy (NPWT) cost saving compared to routine incision care (RC) following laparotomy for gynecologic malignancy. Methods. A decision tree was designed from a payer perspective to compare strategies for incision management following laparotomy for gynecologic malignancy: (1) RC; (2) prophylactic NPWT. Rates of wound complication, antibiotic use, re-hospitalization, re-operation, and home health use were obtained from a published cohort of 431 women who underwent laparotomy for endometrial cancer 2002-2007. Costs were estimated using Medicare reimbursements; cost of NPWT ($200) was obtained from hospital financial department. A 50% reduction in wound complications using NPWT was assigned initially and varied for sensitivity analysis. Results. The mean BMI was 36. The wound complication rate was 31% (37% for BMI > 30, 41% for BMI > 40). The overall cost of incision care was $104 lower for NPWT than for RC. At the lowest cost of NPWT ($200), the risk of wound complication must be reduced by 33% (relative risk = 0.67) for NPWT to achieve cost savings in this cohort. Modeling obese and morbidly obese cohorts, the NPWT resulted in overall cost savings of $163 and $203, respectively, and the risk of wound complication must be reduced by 28% and 25%, respectively, for NPVVT to achieve cost savings. Conclusion. If the wound complication rate can be reduced by one-third, prophylactic NPVVT is potentially cost saving in high-risk women undergoing laparotomy for gynecologic malignancy. (C) 2014 Elsevier Inc All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aa9bfe0c8e4f880a4152e8776f8112ee",
  "timestamp": "2025-05-15T02:22:25.183083"
}