{
  "id": 6949,
  "title": "Metabolic Syndrome and Lumbar Spine Fusion Surgery Epidemiology and Perioperative Outcomes",
  "abstract": "Study Design. Analysis of the National Inpatient Sample database from 2000 to 2008. Objective. To identify whether metabolic syndrome is an independent risk factor for increased major perioperative complications, cost, length of stay, and nonroutine discharge. Summary of Background Data. Metabolic syndrome is a combination of medical disorders that has been shown to increase the health risk of the general population. No study has analyzed its impact in the perioperative spine surgery setting. Methods. We obtained the National Inpatient Sample from the Hospital Cost and Utilization Project for each year between 2000 and 2008. All patients undergoing primary posterior lumbar spine fusion were identified and separated into groups with and without metabolic syndrome. Patient demographics and health care system-related parameters were compared. The outcomes of major complications, nonroutine discharge, length of hospital stay, and hospitalization charges were assessed for both groups. Regression analysis was performed to identify whether the presence of metabolic syndrome was an independent risk factor for each outcome. Results. An estimated 1,152,747 primary posterior lumbar spine fusions were performed between 2000 and 2008 in the United States. The prevalence of metabolic syndrome as well as the comorbidities of the patients increased significantly over time. Patients with metabolic syndrome had significantly longer length of stay, higher hospital charges, higher rates of nonroutine discharges, and increased rates of major life-threatening complications than patients without metabolic syndrome. Conclusion. Patients with metabolic syndrome undergoing primary posterior lumbar spinal fusion represent an increasing financial burden on the health care system. Clinicians should recognize that metabolic syndrome represents a risk factor for increased perioperative morbidity.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aaa915c19a2a013c70bccaaa2da2849c",
  "timestamp": "2025-05-15T03:03:13.513642"
}