{
  "id": 5490,
  "title": "Evaluating the effectiveness of the National Health Insurance Fund in providing financial protection to households with hypertension and diabetes patients in Kenya",
  "abstract": "BackgroundNon-communicable diseases (NCDs) can impose a substantial financial burden to households in the absence of an effective financial risk protection mechanism. The national health insurance fund (NHIF) has included NCD services in its national scheme. We evaluated the effectiveness of NHIF in providing financial risk protection to households with persons living with hypertension and/or diabetes in Kenya.MethodsWe carried out a prospective cohort study, following 888 households with at least one individual living with hypertension and/or diabetes for 12 months. The exposure arm comprised households that are enrolled in the NHIF national scheme, while the control arm comprised households that were not enrolled in the NHIF. Study participants were drawn from two counties in Kenya. We used the incidence of catastrophic health expenditure (CHE) as the outcome of interest. We used coarsened exact matching and a conditional logistic regression model to analyse the odds of CHE among households enrolled in the NHIF compared with unenrolled households. Socioeconomic inequality in CHE was examined using concentration curves and indices.ResultsWe found strong evidence that NHIF-enrolled households spent a lower share (12.4%) of their household budget on healthcare compared with unenrolled households (23.2%) (p = 0.004). While households that were enrolled in NHIF were less likely to incur CHE, we did not find strong evidence that they are better protected from CHE compared with households without NHIF (OR = 0.67; p = 0.47). The concentration index (CI) for CHE showed a pro-poor distribution (CI: -0.190, p < 0.001). Almost half (46.9%) of households reported active NHIF enrolment at baseline but this reduced to 10.9% after one year, indicating an NHIF attrition rate of 76.7%. The depth of NHIF cover (i.e., the share of out-of-pocket healthcare costs paid by NHIF) among households with active NHIF was 29.6%.ConclusionWe did not find strong evidence that the NHIF national scheme is effective in providing financial risk protection to households with individuals living with hypertension and/diabetes in Kenya. This could partly be explained by the low depth of cover of the NHIF national scheme, and the high attrition rate. To enhance NHIF effectiveness, there is a need to revise the NHIF benefit package to include essential hypertension and/diabetes services, review existing provider payment mechanisms to explicitly reimburse these services, and extend the existing insurance subsidy programme to include individuals in the informal labour market.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aaaa7428d784f1df219871fb6cccc2fd",
  "timestamp": "2025-05-15T02:48:23.724065"
}