{
  "id": 4073,
  "title": "Securing the economic management and service infrastructure of banks via the use of artificial intelligence (MO-ILSTM)",
  "abstract": "The banking industry has been a key player in economic growth, but the development of economic management and service infrastructures has not significantly reduced the current financial crisis. In service infrastructure or economic management, the challenge of making judgments and processing data inefficiently in unpredictable markets is the drawback of the existing approach. Technology-related constraints, such as scalability and connectivity issues, can hinder the application's functionality and ability to adapt to changing market conditions. Scalability and connectivity constraints can impact applications related to online banking, digital transactions, and financial data processing. This study explores the use of Mothfly Optimized Improved Long Short-Term Memory (MO-ILSTM) as a data classification technique to improve data sharing and processing effectiveness. The proposed approach overcomes the above mentioned constraints. The capacity of LSTM to identify long-range relationships in sequential data is restricted. By boosting data processing and decision-making in service infrastructure or economic management amid market volatility, MO-ILSTM aims to increase long-range dependency capture. The ILSTM approach is extended from binary data classification to various classifications, addressing the inability of economic management or service infrastructure to efficiently handle complex data processing needs and ensure prompt decision-making. The proposed research is to better predict risk, process data more efficiently, integrate economic services into the banking sector, and improve economic management and service infrastructure to lessen the effects of the financial crisis. Tests show that the ILSTM-based economic management and service infrastructure can decrease economic threat by 18 %, increase service quality by 32 %, and increase the degree of integrated economic service by 45 %. The platform can also effectively forecast financial risks, with a prediction accuracy of 75.6 % due to information exchange and interaction. Thus, the ILSTM algorithm can significantly reduce economic risks and enhance the effectiveness of economic management and service infrastructure.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aab1a30968ceae62f4c9a27abe33efe2",
  "timestamp": "2025-05-15T02:33:03.370229"
}