{
  "id": 9363,
  "title": "Factors associated with injury among Maine logging workers",
  "abstract": "IntroductionDespite dramatic improvements in safety, logging remains one of the most dangerous industries in the United States. The purpose of this study was to explore longitudinal injury trends among Maine logging workers. MethodsLoggers participated in seven quarterly surveys, over the course of 18 months. Categorical and free text data related to traumatic and acute injury, musculoskeletal disorders (MSD), and chronic pain were exported from REDCap into SAS 9.4, Excel, and NVivo, for quantitative and qualitative analysis, respectively. Time to injury was modeled using two different approaches: (1) time to the occurrence of first injury modeled by proportional hazard regression and (2) an intensity model for injury frequency. Two research team members also analyzed qualitative data using a content analysis approach. ResultsDuring the study, 204 injuries were reported. Of the 154 participants, 93 (60.4%) reported musculoskeletal pain on at least one survey. The majority of injuries were traumatic, including fractures, sprains, and strains. Lack of health insurance was found to be related to increased risk of first injury [HR = 1.41, 95% CI = 0.97-2.04, p = 0.069]. Variables found to be related to injury intensity at the univariate level were: (1) a lack of health insurance [HR = 1.51, 95% CI = 1.04-2.20, p = 0.030], (2) age [HR for 10-year age increase;= 1.12, 95% CI = 0.99-1.27, p = 0.082], and (3) years employed in logging industry [HR for 10-year increase = 1.12, 95% CI = 0.99-1.26, p = 0.052]. Seeking medical attention for injury was not a priority for this cohort, and narratives revealed a trend for self-assessment. A variety of barriers, including finances, prevented loggers from seeking medical attention. DiscussionWe found that loggers still experience serious, and sometimes disabling, injuries associated with their work. It was unsurprising that many injuries were due to slips, trips, and falls, along with contact with logging equipment and trees/logs. The narratives revealed various obstacles preventing loggers from achieving optimal health. Examples included geographic distance from healthcare, lack of time to access care, and entrenched values that prioritized independence and traditional masculinity. Financial considerations were also consistently cited as a primary barrier to adequate care. ConclusionThere is a continued need to emphasize occupational health and safety in the logging industry. Implementation of relevant safety programs is key, but it is likely that the benefits of these will not be fully realized until a cultural shift takes place within this industry.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aab1721af41a515abf8af235962dc929",
  "timestamp": "2025-05-15T03:28:17.487447"
}