{
  "id": 3488,
  "title": "An Intelligent System for Prediction of School Dropout Risk Group in Higher Education Classroom based on Artificial Neural Networks",
  "abstract": "School dropout is one of the most complex and crucial problems in the field of education. It permeates the several levels and teaching modalities and has generated social, economic, political, academic and financial damage to all involved in the educational process. Therefore, it becomes essential to develop efficient methods for prediction of the students at risk of dropping out, enabling the adoption of proactive actions to minimize the situation. Thus, this work aims to present the potentialities of an intelligent system developed for the prediction of the group of students at risk of dropping out in higher education classroom courses. The system was developed using a Fuzzy-ARTMAP Neural Network, one of the artificial intelligence techniques, which makes the continued learning of the system possible. This research was developed in the technology courses of the Federal Institute of Mato Grosso, based on the academic and socioeconomic records of the students. The results, showing a success rate of the dropout group around 92% and overall accuracy over 85%, highlights the reliability and accuracy of the system. It is highlighted that the strength and boldness of this research lies in the possibility of identifying early the eminent school dropout using only the enrollment data.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aac0ad8bfa76feec605b24015971ee31",
  "timestamp": "2025-05-15T02:26:48.541053"
}