{
  "id": 4080,
  "title": "Dynamics of selecting Islamic home financing",
  "abstract": "Islamic financing products are modes of finance based on principles of profit and loss sharing, no interest and no remunerative betting or speculation. Islamic home financing is one such mode of financing which is based on ownership sharing or deferred payment arrangement with the bank, hence avoiding chances of interest and speculation. This study examines the factors that affect customers' decision in selecting Islamic home financing services. A quantitative research methodology was adopted to study the dynamics of Islamic home financing by determining the level of key factors in Pakistani consumer market. Using stratified random sampling technique, data was collected from 250 bank customers through five-point Likert scale questionnaires. Various tests were applied to check the reliability, sampling adequacy and correlation. Multiple regression analysis was applied for hypothesis testing. The findings of the study reveal that the level of knowledge, media advertisement, bank reputation, product choices and Shariah compliance are the key factors for the Pakistani bank customers who selected Islamic home financing. More importantly, we find no significant impact of price and bank services on selection of Islamic home financing. The results of the study enable the Islamic banking professionals and managers to identify the factors that are most valuable to customers for the selection of Islamic home financing over conventional home financing modes. They are suggested to develop strategies and plans to educate people more about Islamic home finance and develop their product portfolio to provide people with more Shariah compliant choices. This study contributes to the Islamic banking literature by extending and identifying the factors of Islamic home financing.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aacd1c765150ed585481eb0211e51ee5",
  "timestamp": "2025-05-15T01:23:27.412142"
}