{
  "id": 4511,
  "title": "MAPPING OF URBAN FLOOD INUNDATION USING 3D DIGITAL SURFACE MODEL AND SENTINEL-1 IMAGES",
  "abstract": "Flooding in urban areas poses serious risks to citizens, infrastructures, and transportation. Precise and real-time delineation of the inundated areas is crucial for a better understanding of the extent of damage and high-risk areas and people evacuation actions. It also increases citizens' awareness that living in areas with high flood risk. Yazd city is characterized by low rainfall (<70 mm/yr) and the desert climate is considered the study area of this research. This city encountered a flash flood event that was generated by severe rainfall with a depth of 75 mm in 3hr (i.e., the intensity of 25 mm/hr) on July 29, 2022. Many strategic infrastructures of this city especially the railway station were flooded, which caused heavy casualties and financial losses. This study aims to monitor the flood inundated areas of Yazd city due to this flood event using remote sensing. In this research, the Sentinel-1 polarimetric radar images and the 3D model of the Yazd city surf ace were used to delineate the flooded areas. The field information of the flooded areas and the available Sentinel-1 images during or near the occurrence time of maximum flood extension were adopted. The Convolutional Neural Network (CNN) model in combination with the 3D model of the studied area was used to identify the flooded pixels in the city of Yazd. The results showed that the adopted 3D model and CNN algorithm indicated a good ability to identify flooded areas with an accuracy of 88% and a kappa coefficient of 0.83.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aae4493a4231377dfa3da70b2acb2b7a",
  "timestamp": "2025-05-15T02:37:47.606706"
}