{
  "id": 8040,
  "title": "Incidence of Nonarteritic Anterior Ischemic Optic Neuropathy: Increased Risk Among Diabetic Patients",
  "abstract": "Objective: Previous studies have identified a higher prevalence of diabetes mellitus (DM) among patient cohorts with nonarteritic anterior ischemic optic neuropathy (NAION). We sought to determine the development of incident NAION among a group of newly diagnosed patients with DM and to estimate the incidence of NAION among the elderly. Design: Medicare 5% database study. Participants: A total of 25 515 patients with DM and an equal number of age-and gender-matched nondiabetic patients. Methods: Query of Medicare 5% claims files identified patients with a new diagnosis of DM in 1994. A randomly selected control group was created using 1-to-1 propensity score matching. Patients with a diagnosis of giant cell arteritis, preexisting DM, and age 68 years or older or > 95 years were excluded. Patients with DM and controls were followed for the development of NAION over the following 4745 days. Main Outcome Measures: Incidence of NAION among patients with and without DM. Results: In each group, 85% were white, 11% were black, and 4% were other race. Patients were aged 76.4 years, and 40% were male. Mean follow-up was 7.6 years. In the diabetes group, 188 individuals developed NAION (0.7%) compared with 131 individuals (0.5%; P < 0.01) in the control group. In unadjusted Cox regression analysis, having DM was associated with a 43% increased risk (hazard ratio [HR]: 1.431; 95% confidence interval [CI], 1.145-1.789) of developing NAION. After adjusting for other covariates, the risk of developing NAION among individuals with DM was reduced to 40% (HR 1.397; 95% CI, 1.115-1.750). Male gender increased an individual's risk of developing NAION by 32% (HR 1.319; 95% CI, 1.052-1.654). No other covariate was statistically significantly associated with developing NAION. The annual incidence of NAION was 82 per 100 000 persons. Conclusions: Diabetes mellitus significantly increased the risk of the diagnosis NAION. The incidence of NAION among patients aged more than 67 years may be higher than previously reported. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 959-963 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aae73041c0ca4aba23e6a4c9aff49be7",
  "timestamp": "2025-05-15T03:14:37.357606"
}