{
  "id": 7772,
  "title": "Prevalence of domestic violence during pregnancy and related risk factors: a cross-sectional study in southern Sweden",
  "abstract": "Background: Domestic violence during pregnancy is a serious public health issue which threatens maternal and foetal health outcomes. The aim of the study was to explore prevalence of domestic violence among pregnant women in southern Sweden (Scania) and to explore associations with background factors, as symptoms of depression and sense of coherence. Methods: This study has a cross-sectional design and is the first part of a longitudinal, cohort study. Inclusion criteria were women >= 18 years, registered at antenatal care when pregnant and who understand and write Swedish or English. Questionnaires were collected prospectively at seventeen antenatal care receptions situated in the two cities and six smaller municipalities in Scania. Statistical analyses were done using descriptive statistics, chi-square tests, bivariate logistic regression and multiple regression with Odds ratios (OR) and 95% confidence intervals (95% CI). Results: Study sample included 1939 women. History of violence was reported by 39.5% (n = 761) women. Significant differences were obtained between the groups with or without history of violence regarding being single/living apart, unemployment, financial distress, smoking/snuffing, unintended pregnancy as well as history of miscarriage/legalised abortion (p < 0.001). Experience of domestic violence during pregnancy regardless of type or level of abuse was 1.0% (n = 18); history of physical abuse by actual intimate partner was 2.2% (n = 42). History of violence was the strongest risk factor associated with domestic violence during pregnancy, where all women (n = 18) exposed reported history of violence (p < 0.001). Several symptoms of depression (adjusted for low socio-economic status, miscarriage/abortion, single/living apart, lack of sleep, unemployment, age and parity) were associated with a 7.0 fold risk of domestic violence during pregnancy (OR 7.0; 95% CI: 1.9-26.3). Conclusions: The reported prevalence of domestic violence during pregnancy in southwest Sweden is low. However, a considerable proportion of women reported history of living in a violent relationship. Both history of violence and the presence of several depressive symptoms detected in early pregnancy may indicate that the woman also is exposed to domestic violence during pregnancy. Increased attention to this vulnerable group of women is needed to improve maternal and child health.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aafa1d936206805ddaaf9a411e427f90",
  "timestamp": "2025-05-15T03:12:11.494887"
}