{
  "id": 4693,
  "title": "Can the Implied Information of Options Predict the Liquidity of Stock Market? A Data-Driven Research Based on SSE 50ETF Options",
  "abstract": "Liquidity reflects the quality of the market. When the market is short of liquidity, it often causes investors' trading difficulties and stock price volatility, expanding the investment risk. As a risk management tool, options attract more informed investors to trade because of their flexible design. To explore whether the implied information based on the formation of option price can predict the liquidity of stock market, we take SSE 50ETF options from February 9, 2015, to December 31, 2020, as the research sample. Based on the idea of data-driven approach, we extract the implied information contained in option price, including implied volatility, implied volatility spread, and variance risk premium. Through the regression analysis method, we examine the ability to predict the liquidity of the stock market. The results show that implied volatility spread has the strongest ability to predict the liquidity of the stock market, and it is more significant within 270 days. Implied volatility contains the information about the short-term (120 days) liquidity of the stock market in the future. It shows that implied volatility and implied volatility spread are good indicators to predict stock market liquidity. In contrast, variance risk premium cannot predict the liquidity of stock market. The research conclusion verifies the role of option-implied information in predicting the stock market's liquidity. By extracting the information of options price, investors and financial regulators can scientifically participate in the financial market under data guidance.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aafcaa325e21901a5e9b96ecf7cc0050",
  "timestamp": "2025-05-15T02:39:57.579713"
}