{
  "id": 8532,
  "title": "Portable spirometer-based pulmonary function test willingness in China: A nationwide cross-sectional study from the Happy Breathing Program",
  "abstract": "Background:Understanding willingness to undergo pulmonary function tests (PFTs) and the factors associated with poor uptake of PFTs is crucial for improving early detection and treatment of chronic obstructive pulmonary disease (COPD). This study aimed to understand willingness to undergo PFTs among high-risk populations and identify any barriers that may contribute to low uptake of PFTs.Methods:We collected data from participants in the Happy Breathing Program in China. Participants who did not follow physicians' recommendations to undergo PFTs were invited to complete a survey regarding their willingness to undergo PFTs and their reasons for not undergoing PFTs. We estimated the proportion of participants who were willing to undergo PFTs and examined the various reasons for participants to not undergo PFTs. We conducted univariable and multivariable logistic regressions to analyze the impact of individual-level factors on willingness to undergo PFTs.Results:A total of 8475 participants who had completed the survey on willingness to undergo PFTs were included in this study. Out of these participants, 7660 (90.4%) were willing to undergo PFTs. Among those who were willing to undergo PFTs but actually did not, the main reasons for not doing so were geographical inaccessibility (n = 3304, 43.1%) and a lack of trust in primary healthcare institutions (n = 2809, 36.7%). Among the 815 participants who were unwilling to undergo PFTs, over half (n = 447, 54.8%) believed that they did not have health problems and would only consider PFTs when they felt unwell. In the multivariable regression, individuals who were <= 54 years old, residing in rural townships, with a secondary educational level, with medical reimbursement, still working, with occupational exposure to dust, and aware of the abbreviation COPD were more willing to undergo PFTs.Conclusions:Willingness to undergo PFTs was high among high-risk populations. Policymakers may consider implementing strategies such as providing financial incentives, promoting education, and establishing community-based programs to enhance the utilization of PFTs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ab042493bac70564a104f501bf541493",
  "timestamp": "2025-05-15T03:19:52.100258"
}