{
  "id": 9210,
  "title": "Factors that dynamically affect provincial incidences of catastrophic health expenditure among middle-aged and elderly Chinese population-transition of disease financial risk protection from global to local",
  "abstract": "Background The high incidence of catastrophic health expenditure (ICHE) among middle-aged and elderly population is a major deterrent for reducing the financial risk of disease. Current research is predominantly based on the assumption of spatial homogeneity of nationwide population characteristics, ignoring the differences in regional characteristics. Thus, our study aimed to explore the impact of various influencing factors on the ICHE from a spatiotemporal perspective. Methods We used data from the China Health and Retirement Longitudinal Study (waves 1 to 4), to conduct a retrospective cohort study across 28 provinces, from 2011 to 2018. We measured regional incidences of catastrophic health expenditure using methods recommended by the World Health Organization. Ordinary least squares (OLS) and geographical and temporal weighted regression (GTWR) were used as the global and local estimation models, respectively. The Fortheringham method was used to test the spatiotemporal non-stationarity. Results National ICHE showed a gradual increase from 2011 to 2015, but suddenly decreased from 2015 to 2018, also showing the spatial heterogeneity. And the southwest area and Hebei showed persistently high ICHE (Qinghai even reached the highest value of 27.5% in 2015). Out-of-pocket payment, gross domestic product, PM2.5, ageing, incidence of non-communicable diseases and disabilities, number of nurses, and health insurance coverage in the global estimation passed the significance test, and the GTWR model showed a better model fit (0.769) than the OLS model (0.388). Furthermore, except for health insurance coverage, all seven variables had spatiotemporal non-stationarity among their impacts on ICHE. Conclusion In this longitudinal study, we found spatiotemporal non-stationarity among the variable relationships, supporting regional governments' adoption of regional-target policies. First, after the completion of universal health insurance coverage, the spatiotemporal non-stationarity of the prevalence of non-communicable diseases and disability and ageing should be the focus of the next phase of health insurance design, where improvements to compensation coverage and benefit packages are possible policy instruments. Second, the governance and causes of catastrophic health expenditure need to be laid out from a macro perspective rather than only from the individual/household perspective, especially for the potential impact of economic development, air pollution and nursing resources.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ab0e8ea41b046aae7bbba11b1a93cee6",
  "timestamp": "2025-05-15T03:26:26.079265"
}