{
  "id": 5299,
  "title": "Beyond Medical Bills: The Indirect Costs of Prostate Cancer",
  "abstract": "Introduction:Both direct and indirect costs contribute to financial toxicity in prostate cancer. Indirect costs are difficult to assess and quantify and therefore remain understudied. We sought to describe the indirect costs of prostate cancer across risk groups as well as identify any associated sociodemographic factors.Methods:Patients with localized prostate cancer were surveyed regarding their indirect costs at baseline and at 3-, 6-, 12-, and 24-month follow-up. Out-of-pocket indirect costs were defined as costs paid for medication, parking, transportation, meals outside the home, and caregivers. Imputed indirect costs were calculated based on hour estimates for traveling time, missed work, additional time spent on work, and additional time dedicated to their care by caregivers. Generalized linear model regressions were performed to evaluate for potential associations between sociodemographic or clinical features with these indirect costs, stratifying by prostate cancer risk group.Results:Four hundred and ninety-five localized prostate cancer patients were included in the analysis. Indirect costs ranged from $154.00 to $717.40 for out-of-pocket and $352 to $3389 for imputed per month and did tend to be higher for higher-risk disease. In regression models, sociodemographic factors did not appear to play a strong role in variation in indirect costs.Conclusions:Within a 24-month follow-up period, we observed that indirect costs of localized prostate cancer range from $608 to $4107 per month when including lost productivity costs. Further work must be done to identify what factors contribute to increased indirect costs and financial toxicity.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ab1f9394cef1bd34ce466b77cd6fa3b2",
  "timestamp": "2025-05-15T02:46:16.264112"
}