{
  "id": 233,
  "title": "Forecasting Bitcoin Volatility and Value-at-Risk Using Stacking Machine Learning Models With Intraday Data",
  "abstract": "This paper proposes a novel stacking machine learning model designed for the accurate forecasting of Bitcoin volatility and value-at-risk (VaR). The model incorporates various volatility measures and machine learning techniques to enhance forecasting accuracy. Additionally, the model utilizes intraday return data as input features for the machine learning models. The study employs five individual models including Artificial Neural Network (ANN), Support Vector Regression (SVR), Long Short-Term Memory (LSTM), Random Forest (RF), Neural Basis Expansion Analysis with Exogenous Variables (NBEATSx), Heterogeneous Autoregressive (HAR) model, and Generalized Auto-Regressive Conditional Heteroscedasticity (GARCH). These models are subsequently integrated using a stacking machine learning approach. The findings indicate that the stacking models outperform individual models in terms of forecasting. Our approach also contributes to VaR prediction within the complex realm of cryptocurrency markets, enhancing forecasting performance through the utilization of high-frequency Bitcoin data. Additionally, we implement a k-means clustering method combined with stacking machine learning models to further enhance prediction accuracy. This research offers practical applications for investors and financial institutions, facilitating more informed investment decisions and effective risk exposure management. It is worth noting that different machine learning models exhibit varying behavior when employed within the stacking modeling architecture, highlighting the need for further research to ascertain the generalizability and applicability of this proposed method across diverse cryptocurrency markets.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ab4663254a7f7606c00aaa0b19615ba8",
  "timestamp": "2025-05-15T01:48:30.721799"
}