{
  "id": 9025,
  "title": "The effects of Chinese proprietary medicine and vaccination on patients with COVID-19: a retrospective study in Macao",
  "abstract": "Background COVID-19 is continuing to ravage globally and has resulted in a huge health and financial burden. Chinese proprietary medicines, such as Lianhua Qingwen (LHQW) and Huoxiang Zhengqi (HXZQ) capsules, have been recommended for non-high-risk patients with COVID-19 in China. Based on this, we described the baseline information, using status of LHQW and HXZQ capsules and inoculation history of quarantined patients in the second half of 2022 in Macao. Additionally, we analyzed the underlying association among medicines administration, vaccination and COVID-19 indices, in order to explore novel clues for the regular control and prevention of local epidemic situation in the future.Methods A total of 976 patients in Macao quarantine hotels from June to August 2022 were included in the present study, of which, 857 subjects were followed-up for prognosis evaluation. During quarantine, the baseline demographic information, including sex, age, BMI, occupation and personal habits were collected. Additionally, the inoculation history, medicine employment status and cycle threshold (Ct) values were also reported. We interviewed the patients for collection of their symptoms at the beginning and end of quarantine, as well as prognostic ones. Basic statistical description of baseline information, vaccination history and medication were displayed. Chi-squared test or with continuous correction test was employed for comparison of dichotomous data between two or multiple groups. Binary logistic regression was applied to reveal the correlation between potential risk factors and Ct values or prognosis symptoms. We also used Cox regression model to identify the effect of different types of vaccine products on Ct value altering rate.Results Patients who were female (52.0%), engaged in service industry (31.8%), from Macao native (65.8%), never took physical exercises (33.6%) and preferred irritated diet (59.5%) enjoyed more dominant proportions. Over 80% of participants were inoculated and 74.6% of them chose inactivated COVID-19 vaccine produced by China National Biotech Group (CNBG). Participants used LHQW capsules accounted for 92.1% and the duration of medicating lasted for one to two weeks. All of the reported symptoms were significantly ameliorated after quarantine and the duration of quarantine was concentrated on 21 days. People with different age, sex, occupation and region had different choices of HXZQ administration and vaccination. Additionally, middle dose (4-5 boxes) of LHQW capsules exhibited evidently negative association with positive Ct values (adjusted, - 0.037 +/- 0.19, p = 0.04). Two doses of CNBG and one dose of mRNA vaccine had obvious protective effect on reducing Ct positive rate (p = 0.041). Meanwhile, symptoms after quarantine were significantly positive correlated with those in prognosis (adjusted, 1.38 +/- 0.18, p < 0.0001).Conclusion Our study found that the administration of LHQW capsules was beneficial for Ct value turning negative, meanwhile, certain mixed inoculation may be the promoting factor to reduce the positive rate of Ct value. These findings provide data basis for the Chinese proprietary medicine treatment and mixed vaccination applying for prevention and control of local COVID-19 epidemic in the future.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ab47cb12666786d2ff502139280ee252",
  "timestamp": "2025-05-15T03:24:54.883523"
}