{
  "id": 5211,
  "title": "Household- and employment-related risk factors for depressive symptoms during the COVID-19 pandemic",
  "abstract": "Objectives The COVID-19 pandemic has generated multiple psychological stressors, which may increase the prevalence of depressive symptoms. Utilizing Canadian survey data, this study assessed household- and employment-related risk factors for depressive symptoms during the pandemic. Methods A sample of 1005 English-speaking Canadian adults aged 18+ years completed a web-based survey after physical distancing measures were implemented across Canada. Hierarchical binary logistic regression analyses were conducted to examine the associations of depressive symptoms with household- (household size, presence of children, residence locale) and employment-related (job with high risk of COVID-19 exposure, working from home, laid off/not working, financial worry) risk factors, controlling for demographic factors (gender, age, education, income). Results About 20.4% of the sample reported depressive symptoms at least 3 days per week. The odds of experiencing depressive symptoms 3+ days in the past week were higher among women (AOR = 1.67, p = 0.002) and younger adults (18-29 years AOR = 2.62, p < 0.001). After adjusting for demographic variables, the odds of experiencing depressive symptoms were higher in households with 4+ persons (AOR = 1.88, p = 0.01), in households with children aged 6 to 12 years (AOR = 1.98, p = 0.02), among those with a job at high risk for exposure to COVID-19 (AOR = 1.82, p = 0.01), and those experiencing financial worry due to COVID-19 ('very worried' AOR = 8.00, p < 0.001). Conclusion Pandemic responses must include resources for mental health interventions. Additionally, further research is needed to track mental health trajectories and inform the development, targeting, and implementation of appropriate mental health prevention and treatment interventions.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ab4da560a74456245395e565802f9650",
  "timestamp": "2025-05-15T02:45:17.153914"
}