{
  "id": 8169,
  "title": "An Empirical Study on the Relationship between Earnings Quality and Firm Value",
  "abstract": "I examine the relation between earnings quality and firm value. Although prior research documents the positive association between good corporate governance quality and firm value, no research has been conducted to investigate into their relation theoretically or empirically. In this study, I focus on the reliability of accounting information to explain their relation. Prior studies provide empirical evidence that firms with good corporate governance practices report more reliable accounting information. I examine the relation between the quality of earnings, perceived as the core accounting information and firm value in an attempt to provide an explanation for the positive association between corporate governance and firm value. The sample firms are selected among the manufacturing firms listed on the Korea Stock Exchange. Accounting and financial data are collected from the Fn Guide provided by a financial data serving company and cover the period between 2003 and 2005. For this study, a research hypothesis has been established; earnings quality and firm value are positively associated. Multiple regression models have been formulated to test the hypothesis. The dependent and independent variables of the model are firm value measured as Tobin's q, and earnings quality, respectively. Earnings quality is measured using three proxy variables; accrual quality, persistence of earnings, and predictability of earnings. Correlation analysis documents statistically significant positive relation among the proxy variables. Therefore, accrual quality is used as the independent variable of the regression model. Dechow and Dichev (2002) proposed accrual quality as a measure of earning quality that captures the mapping of current accruals into last-period, current-period, and next-period cash flows. I use the Dechow-Dichev measure to capture the quality of accruals. Accrual quality is measured as the absolute value of residuals from cross-sectional regression of sample firms' current accruals on lagged, current, and future cash flows from operation. The larger the absolute value of residuals the poorer the quality of earnings will be. In addition, as suggested by prior research several control variables are included in the independent variables; return on assets (ROA), firm size, leverage, operation risk, R&D and advertising activities intensity, firm age, and largest shareholder's ownership. To check the robustness of research result, I conducted additional analyses. Earnings quality is endogenous and determined by intrinsic factors, such as firms' business models and operating environments, and by management's discretionary reporting and implementation decisions. In order to control the endogeneity of earnings quality, I employed a two-stage least squares (2SLS) analyses. In the first stage, earnings quality is estimated by regressing it on several intrinsic factors influencing earnings quality: corporate governance, firm size, variability of cash flows from operation and sales, length of operating cycle, frequencies of loss years, industry code and year. In the second stage, the value of earnings quality estimated in the first stage is used as the earnings quality level of the main research model. In additional analysis, stock returns rather than Tobin's q is specified as a proxy variable for firm value. Consistent with the hypothesis I find that the firm with high quality of earning is valued more favorably in the stock market. This result implies that firm performance being equal, the higher the quality of earnings, the higher the firm value; thus, reliability of accounting information is an important factor in explaining the market value of Korean public companies. The empirical evidence of this study theoretically underpins the prior study results that high quality of earnings reduce information risk and, thereby, the cost of equity capital. This study contributes to extant literature by providing a theoretical link between corporate governance and firm value investigated mainly in finance. Many people argue that Korea firms' transparency is much lower compared with that of advanced countries' firms, and that this opacity of management is the main reason for the so-called Korea discount. As such, this study provides an insight into the relation between the transparency of management and firm value.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ab59157aaeac506770a4184d5cf0c0d6",
  "timestamp": "2025-05-15T03:16:17.322195"
}