{
  "id": 390,
  "title": "Imatinib adherence prediction using machine learning approach in patients with gastrointestinal stromal tumor",
  "abstract": "BackgroundNonadherence to imatinib is common in patients with gastrointestinal stromal tumor (GIST), which is associated with poor prognosis and financial burden. The primary aim of this study was to investigate the adherence rate in patients with GIST and subsequently develop a model based on machine learning (ML) and deep learning (DL) techniques to identify the associated factors and predict the risk of imatinib nonadherence.MethodsAll eligible patients completed four sections of questionnaires. After the data set was preprocessed, statistically significance variables were identified and further processed to modeling. Six ML and four DL algorithms were applied for modeling, including eXtreme gradient boosting, light gradient boosting machine (LGBM), categorical boosting, random forest, support vector machine, artificial neural network, multilayer perceptron, NaiveBayes, TabNet, and Wide&Deep. The optimal ML model was used to identify potential factors for predicting adherence.ResultsA total of 397 GIST patients were recruited. Nonadherence was observed in 185 patients (53.4%). LGBM exhibited superior performance, achieving a mean f1_score of 0.65 and standard deviation of 0.12. The predominant indicators for nonadherent prediction of imatinib were cognitive functioning, whether to perform therapeutic drug monitoring (if_TDM), global health status score, social support, and gender.ConclusionsThis study represents the first real-world investigation using ML techniques to predict risk factors associated with imatinib nonadherence in patients with GIST. By highlighting the potential factors and identifying high-risk patients, the multidisciplinary medical team can devise targeted strategies to effectively address the daily challenges of treatment adherence. Machine learning and deep learning algorithms were used to analyze imatinib adherence among 397 patients with gastrointestinal stromal tumor (GIST) in this study. The main indicators for predicting nonadherence to imatinib based on light gradient boosting machine were cognitive functioning, if_if_TDM, global health status score, social support, and gender. These results contribute to providing new opportunities for early identification and intervention of adherence in GIST patients, which will enhance imatinib adherence and improve clinical outcomes for this population.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ab8264d2725bc7ca320855e9ec2d161c",
  "timestamp": "2025-05-15T01:50:14.063592"
}