{
  "id": 4281,
  "title": "Taking fan engagement to a new level - assessing sports consumer interest in virtual environments and Web3 activations",
  "abstract": "PurposeThis paper explores sports consumer interest in virtual environments (VE) and Web3 activations, specifically how the level of psychological involvement, consumers' generational cohorts and previous experience with VE and Web3 activations influence consumer interest in VE and Web3 products and services related to their favorite sports team.Design/methodology/approachA survey instrument was developed and distributed online resulting in a sample size of n = 526. The survey was designed to measure consumers' psychological involvement with their favorite sports team based on the Psychological Continuum Model, and to determine respondents' interest in potential VE and Web3 activations. Finally, the survey collected demographical information and data regarding respondents' previous experience with VE and Web3 applications. Multiple regression analysis was subsequently conducted to predict the impact of (1) psychological involvement, (2) consumers' generational cohorts and (3) previous experience with VE and Web3 activations on the dependent variable consumer interest in VE and Web3 activations.FindingsThe regression model showed a significant impact of the independent variables on consumer interest in VE and Web3 activations with consumer involvement exerting the highest influence. Consumers' previous experience with VE and Web3 applications also seems to trigger interest, in line with the consumption capital theory. This study also suggests that younger generational cohorts are not intrinsically more attracted to VE and Web3 activations but their interest seems to depend on the type of activation.Research limitations/implicationsThis study is intended as a first assessment of independent variables that may have an impact on sports consumer interest in VE and Web3 activations. Further research is needed to assess the impact these variables combined with other indicators may have on consumer interest, for instance by employing a Structural Equation Modelling (SEM) approach. This research included selected VE and Web3 applications comprising online games, NFTs and cryptocurrencies, to calculate a VE and Web3 Literacy Score for the purpose of this paper. However, the umbrella term Web3 (Wang et al., 2022) could indicate a number of additional applications not considered in this research. Future studies could examine sports consumer experience with additional Web3 activations when assessing VE and Web3 Literacy.Practical implicationsThe results of this research imply the need for a diversification of the VE and Web3 portfolio offered by sports teams to cater to different consumer segments. Upcoming challenges for sports teams include motivating younger consumers to take an interest in Web3 activations beyond gaming. Additionally, sports teams should encourage loyal supporters in the advanced stages of the PCM who possess limited VE and Web3 experience, to engage in VE and Web3 activations through simplified offers complementing their overall fan experience.Originality/valueVE and Web3 activations currently offered by sports teams are still in their early stages and data underpinning their success is scarce. This is the first study examining variables that may influence consumer interest in a sports context.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ab998707b404841e894b0cd6ea49d867",
  "timestamp": "2025-05-15T01:25:23.351890"
}