{
  "id": 3351,
  "title": "Effect of earthquake sequences on risk-based catastrophe bond pricing",
  "abstract": "Catastrophe bonds (cat bond in short) are an alternative risk-transfer instrument used to transfer peril-specific financial risk from governments, financial institutions, or (re)insurers, to the capital market. Current approaches for cat bond pricing are calibrated on seismic mainshocks, and thus do not account for potential effects induced by earthquake sequences. This simplifying assumption implies that damage arises from mainshocks only, while aftershocks yield no damage. Postearthquake field surveys reveal that this assumption is inaccurate. For example, in the 2011 Christchurch Earthquake sequence and 2016-2017 Central Italy Earthquake sequence, aftershocks were responsible for higher economic losses when compared to those caused by mainshocks. This article proposes a time-dependent aggregate loss model that takes into account seismicity clustering and damage accumulation effects in the computation of damage. The model is calibrated on the seismic events recorded during the recent 2016-2017 Central Italy Earthquake sequence. Furthermore, the effects of earthquake sequence on cat bond pricing is explored by implementing the proposed model on five Italian municipalities. The investigation showed that neglecting time-dependency may lead to higher difference (up to 45%) in the cat bond price when compared to standard approaches.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aba0e54e75cf0592ff6a217e23ce9d8b",
  "timestamp": "2025-05-15T02:25:13.766646"
}