{
  "id": 4329,
  "title": "Corporate governance, litigation risk and firm performance: a mediation moderating model",
  "abstract": "Purpose The purpose of this research is to investigate how the negative effect of litigation risk on firm performance could be controlled through the channel of voluntary disclosure and under the condition of institutional ownership. Design/methodology/approach To get the objectives, the study analyzed an unbalanced panel of 918 non-financial listed Chinese firms from 2010 to 18. To capture any expected unobserved heteroscedasticity and autocorrelation in the unbalanced sample, the authors have applied fixed effect regression with robust standard errors clustered at the firms' levels as suggested by Newey and West (1987). Findings The research provides that the good disclosure practices and presence of institutional ownership in corporations raise the trust of the investors by making the corporate operation clear in the eyes of the stakeholders. This increases the corporate credibility and as consequence corporations are protected against litigation risk. Thus, in the light of the information asymmetry and signaling theories, voluntary disclosure practices, and financial institutions' ownership, bridges the information gap and transmit a positive signal in the market regarding the better financial performance of the corporations. Research limitations/implications These findings are helpful for the corporate managers for effective strategic decisions, regulatory authorities for policy formulation, and individual investors for developing a diversified investment portfolio. Originality/value By applying the mediation and moderation effects, the research enhances the understanding of the underlying causes of the association between a firm's litigation risk and its performance. The current research contributes to the literature, that agency issues which create litigation risk could be settled internally with voluntary disclosure practices and externally with institutional ownership.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "abc4365feb46570843ba2e1f5b3cc2e1",
  "timestamp": "2025-05-15T02:36:05.173653"
}