{
  "id": 2952,
  "title": "Holding the economy by the tail: analysis of short- and long-run macroeconomic risks",
  "abstract": "We put forward a macro-financial empirical modeling framework that can examine the tails of distributions of macroeconomic variables and the implied risks. It does so without quantile regression, also allowing for non-normal distributions. The framework offers a number of relevant insights into higher moments of the US output growth distribution, as well as the effects of monetary policy and financial (risk premia) shocks on downside macroeconomic risk. This is not only from the short-run perspective but also from the long-run perspective, which has remained largely unexamined in the existing Macro-at-Risk literature. In particular, we estimate the short-run (conditional) and long-run US output growth distributions and study their evolution. The short-run analysis finds that monetary policy and financial shocks render the conditional output growth distribution asymmetric. As such, they affect downside risk over and above their impact on the conditional mean that policymakers routinely focus on. The long-run analysis indicates that US output growth left-tail risk showed a general downward trend in the two decades preceding the Global Financial Crisis (GFC), but this trend got reversed post-2008. Our examination strongly points to the adopted unconventional monetary policy framework featuring quantitative easing as a potential source of elevated long-run downside tail risk in the post-GFC period.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "abc80e168afeb8c9a240708dada53cc3",
  "timestamp": "2025-05-15T02:20:48.272033"
}