{
  "id": 2088,
  "title": "Cross-Domain Disentanglement: A Novel Approach to Financial Market Prediction",
  "abstract": "Profit maximization and risk mitigation require good financial market predictions. Financial markets have a correlated nature, which means that there are some shared patterns between them; therefore, learning about one market might help understand the behavior of others. End-to-end training techniques have proven successful in financial markets, but they have flaws, such as picking up noise and failing to account for the complicated relationships across markets. We present a promising model for predicting financial markets using the correlation between the two markets, which draws inspiration from the recent progress in disentanglement learning. This model learns to disentangle representations of features shared between markets from specific representations, and removes features that cause interference. We utilized a dilated convolutional neural network as an encoder to extract features while using self-attention and cross-attention to capture specifics and shared patterns. Our model uses Dynamic Time Warping (DTW) to minimize the similarity between specific and shared patterns. It also combines DTW's alignment-based similarity with the Mean Square Error (MSE) to determine the optimal balance between alignment and prediction accuracy. We conducted our experiments using datasets that included the closing prices of Apple, Samsung, Bitcoin, Ethereum, Meta platforms, and the X platform. Spearman's rank correlation coefficient was used to evaluate the disentanglement by describing the relationship between the extracted representations. The findings confirm that our model surpasses state-of-the-art approaches in prediction error, financial risk assessment, correlation evolution, and prediction net curves, thereby giving market participants more trust in their decisions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "abcaeb685ef5f0356c619ea8573bef8b",
  "timestamp": "2025-05-15T02:10:59.045225"
}