{
  "id": 4339,
  "title": "Dangerous financing habits",
  "abstract": "The general shortage of public funds causes politicians of all shades of opinion to look for new sources of public revenue. The demand to release reserves accumulated for nuclear waste management purposes, or to transfer these reserves to public funds, shows that the battle against nuclear power is now being fought also on this front. Ir is undisputed that the electricity utilities operating nuclear power plants have always followed clear provisions of commercial and fiscal law in accumulating reserves for the demolition of reactors and for the management of spent nuclear fuel. Major problems are associated also with discounting all, or at least some, deferred waste management costs. In view of the cost risks associated with repository projects it is imperative that the capitalized worth of these reserves be protected through profitable industrial uses and strategies of diversified investment. Discounting could well diminish the necessary scope of providential measures. Moreover, it is a matter of dispute whether discounting provisions solely applying to waste management reserves may at all be laid down in fiscal law. At best, a general discounting requirement for reserves could be accepted in the interest of the required equality in taxation. However; this would render a disservice to providing for such cases in the balance sheet because, once interest gains had been siphoned off price and cost increases incalculable at the present time could no longer be absorbed financially in accordance with the polluter-pays principle. If the government were to help itself from the till by seizing funds reserved for waste management, this would block rather than support reorientation in the power economy. Fiscal participation at best could be accepted as compensation for the costs of the police protecting Castor cask transports. However, this does not require the money reserved for waste management to be transferred into a government fund. As far as regulatory effects are concerned, this change would introduce a responsibility of the government for external environmental impacts. The power industry would no longer be required to assume responsibility for providing sufficient funds to finance nuclear waste management projects. In this way, the polluter-pays principle would no longer be satisfied in environmental policy. Future reforms should continue to be judged by two yardsticks: protecting the real worth of reserves is achieved best by private industrial measures; a waste management portfolio comprising a mir of funds deposited for a fixed period, stable and high-yield interests is more likely to be established by power utilities than by government players. Secondly one nation wide solution must be found in treating reserves. In a developing Europe, different fiscal approaches taken by different German federal states, as appears to be imminent, constitute a regression to particularism.",
  "year": 1997,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "abe7944d9e705cac63661763df1974f6",
  "timestamp": "2025-05-15T01:25:50.621471"
}