{
  "id": 5789,
  "title": "Investigating the impact of social media advertising and risk factors on customer online buying behavior: a trust-based perspective",
  "abstract": "In the realm of ever-changing e-commerce, understanding the dynamics of customer online buying behavior (COBB) is pivotal. This study investigates the impact of risk factors-financial risk (FR), time risk (TR), and psychological risk (PR) along with social media advertising (SMA) on COBB with the mediating effect of trust. Grounded on the stimulus-organism-response theory, the research targets diverse segments including students, businessmen, employees, working women, and housewives. To ensure a high response rate, an online questionnaire was distributed via email, WhatsApp, and social media groups of online buyers. Convenience sampling was used to collect primary data from 350 respondents. Data analysis that employed the Statistical Package for Social Sciences, including descriptive statistics, correlation analysis, normality testing, and regression analysis, was performed for reliability, validity and hypothesis testing. The findings underscore the significant negative impact of risk factors (FR, TR, PR) on building customer trust and subsequent online shopping behavior. Social media advertising has a positive and significant impact on trust and COBB. Furthermore, trust emerged as a significant determinant of COBB, thereby validating its pivotal role in online consumer decision-making processes. Moreover, trust mediates the relationship between risk factors, SMA and COBB. This study consists of both practical and theoretical contributions, offering insights into the nuanced interplay between risk perceptions, SMA effectiveness, trust dynamics, and COBB. These insights are essential for marketers, policymakers, and researchers navigating the evolving landscape of e-commerce.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "abf09f87f1ccd4ca8e560b00bdf20cc4",
  "timestamp": "2025-05-15T02:51:30.049982"
}