{
  "id": 7863,
  "title": "A Randomized Trial to Encourage Healthy Eating Through Workplace Delivery of Fresh Food",
  "abstract": "Purpose: This study aimed to increase the consumption of home-cooked meals among employees at a large urban worksite through a fully subsidized Community Supported Agriculture (CSA) program. Design: Randomized trial. Setting: Worksite in a large northeast city. Participants: Employees were recruited through flyers, e-mail listservs, and outreach from departmental administrators (n = 60). Intervention: Intervention participants received 8 biweekly fresh food deliveries through a CSA program. They also received cooking education and support. Control participants received usual employee benefits. Measures: Consumption of meals prepared at home was the primary end point. Increased consumption of fresh fruits and vegetables was the secondary end point, and food insecurity was an exploratory end point. Analysis: Poisson regression was used to assess mean differences in weekly consumption of home-cooked meals. To assess differences in fruit and vegetable consumption and food insecurity, binary logistic regression was used to estimate odds ratios. Results: Compared to the control group, intervention participants consumed 29% more home-cooked meals per week (P < .01). Fruit and vegetable consumption also increased among intervention participants. The odds of at least twice-daily fruit consumption were 3.8 times higher among intervention participants than among controls, and the odds of at least twice-daily vegetable consumption were 6.2 times higher among intervention participants than among controls. Compared to control participants, intervention participants experienced a statistically significant 89% reduction in the odds of reporting food insecurity at follow-up, when controlling for baseline food insecurity. Participants reported perceived intervention benefits, including the opportunity to experiment with new, healthful foods without financial risk, as well as the social value of sharing recipes, food, and related conversation with colleagues. Conclusion: The study demonstrated the feasibility and potential positive effects of a subsidized workplace CSA program, augmented with cooking education and support.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "abf373f6bffc17cee647e910ab6595d4",
  "timestamp": "2025-05-15T03:13:04.836688"
}