{
  "id": 2727,
  "title": "Key market identification, mechanism transmission, and extreme shock during the risk spillover process: an empirical study of the G20 FOREX markets",
  "abstract": "The role of the G20 in global governance has been increasingly prominent in the context of the extensive spread of coronavirus disease 2019 and the aggravation of financial risk contagion. Detecting the risk spillovers among the G20 FOREX markets is crucial to maintain financial stability. Therefore, this paper first adopts a multi-scale approach to measure the risk spillovers among the G20 FOREX markets from 2000 to 2022. Furthermore, the key markets, the transmission mechanism, and the dynamic evolution are researched based on the network analysis. We derive the following findings: (1) The magnitude and volatility of the total risk spillover index of the G20 countries are highly associated with extreme global events. (2) The magnitude and volatility of risk spillovers among the G20 countries are asymmetric in the different extreme global events. (3) The key markets in the risk spillover process are identified, and the USA always occupies a core position in the G20 FOREX risk spillover networks. (4) In the core clique, the risk spillover effect is obviously high. In the clique hierarchy, as the risk spillover effect is transmitted downward, the risk spillovers present the decrease trends. (5) The density, transmission, reciprocity, and clustering degrees in the G20 risk spillover network during the COVID-19 period are much higher than that in other periods.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "abfa13ed97a29ede3afe8ae7aa7a2b79",
  "timestamp": "2025-05-15T02:18:37.083741"
}