{
  "id": 5675,
  "title": "Environmental, social and governance (ESG) disclosure and cost of equity: the moderating effects of board structures",
  "abstract": "One of the main issues in the field of sustainable finance is environmental, social, and governance (ESG). This study examines how ESG disclosure impacts the cost of equity. Additionally, it explores how the structure of the board of commissioners moderates this relationship. The structure of the board of commissioners is represented by three key factors: the proportion of independent commissioners, the board of commissioners's size, and the proportion of female commissioners. The sample used in this research was 215 non-financial companies that published sustainability reports (SR) and were listed on the Indonesia Stock Exchange (BEI) with research years 2017, 2021, and 2022 with a total of 309 observations. The research employed Ordinary Least Square (OLS) and Moderated Regression Analysis (MRA) to test the hypotheses. The findings indicate that ESG disclosure negatively impacts the cost of equity. Additionally, the study reveals that a higher proportion of independent commissioners, a larger board of commissioners's size, and a greater proportion of female commissioners mitigate company risk. These factors weaken the negative effect of ESG disclosure on the cost of equity by substituting its risk-reducing benefits. The results of these findings were further validated through additional moderating variable analysis techniques. Specifically, subgroup analysis and regression models incorporating a one-year lag for the ESG variables were employed, yielding consistent results.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "abfded749e9497ead2356c795973f109",
  "timestamp": "2025-05-15T02:50:21.196498"
}