{
  "id": 8106,
  "title": "CAPITAL ADEQUACY AND LIQUIDITY IN THE CONTEXT OF BANK STABILITY: CASE OF LATVIA",
  "abstract": "The importance of bank capital management and liquidity is widely discussed in scientific literature and professional industry publications. Besides, capital adequacy and liquidity indicators are the most important tools used for regulatory purposes to maintain stable banking system in a country. Capital and liquidity are essential for ensuring bank stability as well as form the basis for successful bank performance. Consequently, bank stability is vital for the economic growth of any country. The objective of this paper is to analyse the capital adequacy and liquidity of Latvian commercial banks in the context of stability. The paper provides analysis of z-score as a measure of stability as well as of capital adequacy, liquidity of Latvian banks in the period from 2008 until 2016. The analysis is done using quantitative and qualitative analysis methods based on the financial statement data of Latvian commercial banks over nine years. The analysis is based on classification of banks into groups depending on the size of bank total assets. The paper reveals the differences in formation of liquid reserves and reserves of capital in different groups of banks. The analysis has shown the dependence between bank size in terms of assets and bank liquidity: small banks maintain higher liquidity standards to preserve its stability. Besides, decrease in bank liquidity is associated with an increase in risk-weighted assets and a decrease in bank stability. This dependence was revealed in all bank groups independently from its size. Moreover, in small banks growth of capital is accompanied by a decrease in liquidity.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ac097af4744f26918c6c3cf6fde6f1df",
  "timestamp": "2025-05-15T03:15:09.442841"
}