{
  "id": 4895,
  "title": "Environmental, social, and governance (ESG) performance and financial outcomes: Analyzing the impact of ESG on financial performance",
  "abstract": "Background: Environmental Social Governance (ESG) investment had entered a phase of rapid development in the past few decades as most nations had put forward carbon neutral initiatives. ESG would receive more attention from the industry and academia in a global environment full of uncertainties. Companies benefit from the sharing of ESG data by improving their brand image, which attracts funding, lowers financing costs, and increases valuation.Purpose: To explore how ESG drives corporate financial performance. Also, the research examines the interrelation of ESG presentation and corporate presentation.Design: /methodology/approach: Over an interval of 10 years (2011-2020) using a sample of 3332 listed organizations worldwide. The theory of the research is on the basis of stakeholder and transmitting signal theory and multiple regression and categorized regression were applied with STATA 16.0 software.Results: The study utilizes a large dataset of 24,076 valid observations, providing robust statistical power for the analysis. The study findings proved that ESG performance is positively interrelated with corporate performance (p < 0.01). According to the findings of the study, at 1% of the level related to significance (p < 0.01), the regression coefficient for ESG is considerably positive. Thus, the influence of ESG rating on corporate performance is significant for large-scale companies and insignificant for small-scale companies. The results demonstrate that the positive impact of ESG rating on corporate financial performance is more pronounced in the high risk case than in the low risk case (p < 0.01). The results highlight the importance of ESG performance in today's world. Overall, the study gives precious perception about the interrelation between ESG and corporate financial performance (CFP).Policy implications: The researchers believe that the results of this study are beneficial to companies and governments in the development of environmentally conscious industries since they demonstrate corporate success through ESG. More realistically, the ESG can boost corporate firm performance by enabling businesses to maintain sustainability, establish a solid reputation, win the trust of stakeholders, and contribute to solving national sustainable development issues. Additionally, the researchers believe that the results of this study can boost management effectiveness, which in turn can help firms succeed.Originality/value: In the context of environmentally sensitive industries, this study findings provide empirical insights to the association between the corporate firms success and ESG performance. In addition, the findings provide insights to the business organizations development and the significance of ESG integration in the business organizations.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ac0ea2da603b5bdaf76ade0031be43b4",
  "timestamp": "2025-05-15T02:42:04.893667"
}