{
  "id": 6682,
  "title": "Does internal cash flow-external financing sensitivity react to economic policy uncertainty and geopolitical risk? Evidence from Saudi Arabia",
  "abstract": "PurposeThis study aims to investigate the influence of economic policy uncertainty (EPU) and geopolitical risk (GPR) on the relationship between internal cash flow and external financing in an emerging market, Saudi Arabia. It also examines the role of asset tangibility and financial crisis in establishing this relationship.Design/methodology/approachThe sample was taken from non-financial sector companies listed on the Saudi Stock Exchange between 2002 and 2019. The data were analyzed using panel data regression analysis, including ordinary least squares and fixed effects model. The author addresses potential endogeneity through the generalized method of moments.FindingsThis study found that both EPU and GPR reduce the sensitivity of external financing to internal cash flow. This implies that firms depend more on internally generated funds during periods of increased EPU and GPR. Besides, this study found that the influence of EPU and GPR on the sensitivity of external financing to internal cash flow is more (less) negative for more tangible firms (during the financial crisis period). This result implies that Saudi firms boasting a higher level of tangibility are more flexible when it comes to seeking external financing. However, the presence of uncertainty during the crisis period makes the external financing costly, and therefore, firms will be less likely to raise funds from external sources.Practical implicationsThis study has important implications for managers, policymakers and regulators. First, the paper findings provide insights for corporate decision-makers in helping them to focus on internal funds to finance their investment during uncertain times. Second, the findings help managers to understand the role of asset tangibility in raising external funding when firms face financial constraints due to uncertainty. Third, this study also helps corporates to focus on internal funds to finance their investment during the crisis period because EPU and GPR increase the cost of external finance. Finally, the results provide guidelines for policymakers and regulators to make appropriate policy measures to increase the easy availability of external finance during periods of increased EPU and GPR.Originality/valueThis paper is the first to shed light on the impact of internal funds on external financing while paying close attention to the role of EPU and GPR.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ac120cba93c78ba62aef35068489491e",
  "timestamp": "2025-05-15T03:00:35.403499"
}