{
  "id": 7409,
  "title": "Stressful Events During Pregnancy and Postpartum Depressive Symptoms",
  "abstract": "Background: Understanding the influence of perinatal stressors on the prevalence of postpartum depressive symptoms (PDS) and help-seeking for PDS using surveillance data can inform service provision and improve health outcomes. Methods: We used Massachusetts Pregnancy Risk Assessment Monitoring System (MA-PRAMS) 2007-2010 data to evaluate associations between selected perinatal stressors and PDS and with subsequent help-seeking behaviors. We categorized 12 stressors into 4 groups: partner, traumatic, financial, and emotional. We defined PDS as reporting always or often to any depressive symptoms on PRAMS Phase 5, or to a composite score >= 10 on PRAMS Phase 6 depression questions, compared with women reporting sometimes, rarely or never to all depressive symptoms. The median response time to MA-PRAMS survey was 3.2 months (interquartile range, 2.9-4.0 months). We estimated prevalence ratios (PRs) and 95% confidence intervals (95% CIs) using modified Poisson regression models, controlling for socioeconomic status indicators, pregnancy intention and prior mental health visits. Results: Among 5,395 participants, 58% reported >= 1 stressor (partner=26%, traumatic=16%, financial=29% and emotional=30%). Reporting of >= 1 stressor was associated with increased prevalence of PDS (PR=1.68, 95% CI: 1.42-1.98). The strongest association was observed for partner stress (PR=1.90, 95% CI: 1.51-2.38). Thirty-eight percent of mothers with PDS sought help. Mothers with partner-related stressors were less likely to seek help, compared with mothers with other grouped stressors. Conclusions: Women who reported perinatal common stressors-particularly partner-related stressors-had an increased prevalence of PDS. These data suggest that women should be routinely screened during pregnancy for a range of stressors and encouraged to seek help for PDS.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ac1ed96f3d399dc24eb168130d81e82e",
  "timestamp": "2025-05-15T03:08:00.909883"
}