{
  "id": 7204,
  "title": "Efficiency Assessment and Determinants of Performance: A Study of Jordan's Banks Using DEA and Tobit Regression",
  "abstract": "This comprehensive study explored the efficiency landscape of the Jordanian banking industry from 2006 to 2021, utilizing a dual-pronged approach. First, we assessed the efficiency scores of 15 commercial banks, comprising 13 conventional and 2 Islamic institutions, through data envelopment analysis (DEA). Secondly, we investigated the determinants influencing relative efficiency using the Tobit regression model. Our dataset, spanning 240 observations over 16 years, provides a nuanced examination of industry dynamics. DEA, specifically focusing on variable return to scale (VRS), unveils efficiency scores by accounting for scale inefficiencies. The research contributes insights into the operational efficacy of Jordanian banks and provides a robust methodology for understanding efficiency dynamics in the broader financial landscape. The results reveal significant relationships between return on assets, return on equity, GDP growth, and efficiency. Furthermore, it is noteworthy that Islamic banks demonstrate higher efficiency compared to conventional banks. Additionally, non-significant associations were observed with credit risk, bank size, and the ratio of loan loss provision over net income. The findings hold implications for policymakers, industry stakeholders, and researchers aiming to bolster the resilience and competitiveness of Jordan's banking sector.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ac5092a7b9b020a3038dc573136a3aa4",
  "timestamp": "2025-05-15T03:06:01.301734"
}