{
  "id": 5123,
  "title": "Understanding the financial cost of cancer clinical trial participation",
  "abstract": "Background Though financial hardship is a well-documented adverse effect of standard-of-care cancer treatment, little is known about out-of-pocket costs and their impact on patients participating in cancer clinical trials. This study explored the financial effects of cancer clinical trial participation. Methods This cross-sectional analysis used survey data collected in December 2022 and May 2023 from individuals with cancer previously served by Patient Advocate Foundation, a nonprofit organization providing social needs navigation and financial assistance to US adults with a chronic illness. Surveys included questions on cancer clinical trial participation, trial-related financial hardship, and sociodemographic data. Descriptive and bivariate analyses were conducted using Cramer's V to estimate the in-sample magnitude of association. Associations between trial-related financial hardship and sociodemographics were estimated using adjusted relative risks (aRR) and corresponding 95% confidence intervals (CI) from modified Poisson regression models with robust standard errors. Results Of 650 survey respondents, 18% (N = 118) reported ever participating in a cancer clinical trial. Of those, 47% (n = 55) reported financial hardship as a result of their trial participation. Respondents reporting trial-related financial hardship were more often unemployed or disabled (58% vs. 43%; V = 0.15), Medicare enrolled (53% vs. 40%; V = 0.15), and traveled >1 h to their cancer provider (45% vs. 17%; V = 0.33) compared to respondents reporting no hardship. Respondents who experienced trial-related financial hardship most often reported expenses from travel (reported by 71% of respondents), medical bills (58%), dining out (40%), or housing needs (40%). Modeling results indicated that respondents traveling >1 h vs. <= 30 min to their cancer provider had a 2.2x higher risk of financial hardship, even after adjusting for respondent race, income, employment, and insurance status (aRR = 2.2, 95% CI 1.3-3.8). Most respondents (53%) reported needing $200-$1000 per month to compensate for trial-related expenses. Over half (51%) of respondents reported less willingness to participate in future clinical trials due to incurred financial hardship. Notably, of patients who did not participate in a cancer clinical trial (n = 532), 13% declined participation due to cost. Conclusion Cancer clinical trial-related financial hardship, most often stemming from travel expenses, affected almost half of trial-enrolled patients. Interventions are needed to reduce adverse financial participation effects and potentially improve cancer clinical trial participation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ac63ffbaff6cff784f5cd62f1b117033",
  "timestamp": "2025-05-15T02:44:43.816546"
}