{
  "id": 66,
  "title": "AN EMPIRICAL STUDY ON CARBON PRICE PREDICTION USING STACKING ENSEMBLE MACHINE LEARNING",
  "abstract": "Carbon pricing is an essential instrument for reducing climate change and has substantial environmental protection as a co-benefit. This paper proposes a technique for predicting the price of carbon emission futures based on a stacking ensemble machine learning approach. This method incorporates the historical prices of carbon, fossil energy, and renewable energies, all of which influence carbon price fluctuations. Notably, there are no existing studies that employ renewable energy data and stacking ensemble models to forecast the futures price of European Union Allowances (EUA). By integrating diverse data sources and leveraging the powerof ensemble learning, this research aims to fill that gap. The results of the experiments demonstrate that the stacking support vector regression model outperforms traditional machine learning models and earlier single-factor approaches in predicting future carbon prices. This superior performance is attributed to the model's ability to capture complex interactions among various influencing factors, thus providing more accurate and robustpredictions. Overall, using the stacking learning model for pricing carbon has significant implications. It can lead to more informed policy decisions, better management of carbon markets, and more effective strategies for mitigating the impact of fossil fuels on the environment. By accurately forecasting carbon prices, stakeholders can enhance their planning and investment decisions, ultimately contributing to the reduction of pollution emissions and the advancement of sustainable energy practices. This approach represents a significant step forward in the utilization of advanced machine learning techniques for environmental and economic sustainability.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ac642b50dafafb5539a6253744e1203f",
  "timestamp": "2025-05-15T01:28:03.888988"
}