{
  "id": 9234,
  "title": "Socioeconomic determinants of unmet need for outpatient healthcare services in Iran: a national cross-sectional study",
  "abstract": "Background Unmet need is a critical indicator of access to healthcare services. Despite concrete evidence about unmet need in Iran's health system, no recent evidence of this negative outcome is available. This study aimed to measure the subjective unmet need (SUN), the factors associated with it and various reasons behind it in Iran. Methods We used the data of 13,005 respondents over the age of 15 from the Iranian Utilization of Healthcare Services Survey in 2016. SUN was defined as citizens whose needs were not sought through formal healthcare services, while they did not show a history of self-medication. The reasons for SUN were categorized into availability, accessibility, responsibility and acceptability of the health system. The multivariable logistic regression was used to determine significant predictors of SUN and associated major reasons. Results About 17% of the respondents (N = 2217) had unmet need for outpatient services. Nearly 40% of the respondents chose only accessibility, 4% selected only availability, 78% chose only responsibility, and 13% selected only acceptability as the main reasons for their unmet need. Higher outpatient needs was the only factor that significantly increased SUN, responsibility-related SUN and acceptability-related SUN. Low education was associated with higher SUN and responsibility-related SUN, while it could also reduce acceptability-related SUN. While SUN and responsibility-related SUN were prevalent among lower economic quintiles, having a complementary insurance was associated with decreased SUN and responsibility-related SUN. The people with basic insurance had lower chances to face with responsibility-related SUN, while employed individuals were at risk to experience SUN. Although the middle-aged group had higher odds to experience SUN, the responsibility-related SUN were prevalent among elderly, while higher age groups had significant chance to be exposed to acceptability-related SUN. Conclusion It seems that Iran is still suffering from unmet need for outpatient services, most of which emerges from its health system performance. The majority of the unmet health needs could be addressed through improving financial as well as organizational policies. Special attention is needed to address the unmet need among individuals with poor health status.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ac6fe6044cdf57d831f2b57b2c7ef6f1",
  "timestamp": "2025-05-15T03:26:54.557609"
}