{
  "id": 8599,
  "title": "Persistent unexplained physical symptoms: a prospective longitudinal cohort study in UK primary care",
  "abstract": "Background Unexplained physical symptoms (UPS) are extremely common among primary care attenders, but little is known about their longer-term outcome. Aim To investigate the persistence of somatic symptoms at 6 months among a cohort with multiple UPS, and identify prognostic factors associated with worsening symptom scores. Design and setting Prospective longitudinal cohort study involving adults attending UK general practice in North and Central London between January and December 2013. Method Consecutive adults attending nine general practices were screened to identify those with at least three UPS. Eligible participants completed measures of symptom severity (measured using the Patient Health Questionnaire Somatic Symptom Module [PHQ-15]), physical and mental wellbeing, and past health and social history, and were followed up after 6 months. Multivariable linear regression analysis was conducted to identify prognostic factors associated with the primary outcome: somatic symptom severity. Results Overall, 245/294 (83%) provided 6-month outcome data. Of these, 135/245 (55%) reported still having UPS, 103/245 (42%) had symptoms still under investigation, and only 26/245 (11%) reported complete symptom resolution. Being female, higher baseline somatic symptom severity, poorer physical functioning, experience of childhood physical abuse, and perception of poor financial wellbeing were significantly associated with higher somatic symptom severity scores at 6 months. Conclusion This study has shown that at 6 months few participants had complete resolution of unexplained somatic symptoms. GPs should be made aware of the likelihood of UPS persisting, and the factors that make this more likely, to inform decision making and care planning. There is a need to develop prognostic tools that can predict the risk of poor outcomes.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ac89074801cd4f765757218c50be573e",
  "timestamp": "2025-05-15T03:20:22.320350"
}