{
  "id": 5819,
  "title": "Disease-specific out-of-pocket healthcare expenditure in urban Bangladesh: A Bayesian analysis",
  "abstract": "Background Because of the rapid increase of non-communicable diseases (NCDs) and high burden of healthcare-related financial issues in Bangladesh, there is a concern that out-of-pocket (OOP) payments related to illnesses may become a major burden on household. It is crucial to understand what are the major illnesses responsible for high OPP at the household level to help policymakers prioritize key areas of actions to protect the household from 100% financial hardship for seeking health care as part of universal health coverage. Objectives We first estimated the costs of illnesses among a population in urban Bangladesh, and then assessed the household financial burden associated with these illnesses. Method A cross-sectional survey of 1593 randomly selected households was carried out in Bangladesh (urban area of Rajshahi city), in 2011. Catastrophic expenditure was estimated at 40% threshold of household capacity to pay. We employed the Bayesian two-stage hurdle model and Bayesian logistic regression model to estimate age-adjusted average cost and the incidence of household financial catastrophe for each illness, respectively. Results Overall, approximately 45% of the population of Bangladesh had at least one episode of illness. The age-sex-adjusted average medical expenses and catastrophic health care expenditure among the households were TK 621 and 8%, respectively. Households spent the highest amount of money 7676.9 on paralysis followed by liver disease (TK 2695.4), injury (TK 2440.0), mental disease (TK 2258.0), and tumor (TK 2231.2). These diseases were also responsible for higher incidence of financial catastrophe. Our study showed that 24% of individuals who suffered typhoid incurred catastrophic expenditure followed by liver disease (12.3%), tumor (12.1%), heart disease (8.4%), injury (7.9%), mental disease (7.9%), cataract (7.1%), and paralysis (6.5%). Conclusion The study findings suggest that chronic illnesses were responsible for high costs and high catastrophic expenditures in Bangladesh. Effective risk pooling mechanism might reduce household financial burden related to illnesses. Chronic illness related to NCDs is the major cause of OOP. It is also important to consider prioritizing vulnerable population by subsidizing the high health care cost for some of the chronic illnesses.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ac9d5f260405f486fd4ab15c26f3c5cf",
  "timestamp": "2025-05-15T02:51:58.516377"
}