{
  "id": 5501,
  "title": "Data Science: Empowering Business Strategy",
  "abstract": "Data science is a blanket term for Machine learning, Artificial Intelligence and Big Data. Data science is being used by commercial and noncommercial organizations to get the insides of their customers, their behavior about selecting a product, insides of the staff. Many of the organizations use data science to provide better services to their customers. Financial Institutions use data science to analyze and predict stock markets, determine the risk of lending money, and learn how to attract new clients for their service. Government organizations get inside of public services by using data science and also use data structures to provide better services to citizens. Universities use data science to improve research and enhance study experience of students. Data grows exponentially over the period of time. The problem of working on large data sets can be solved by using the adept algorithm for your problem, use different data structures, and by relying on tools and libraries. The three main data structures used in data science are sparse matrix, hash functions and tree structures. Python has many tools that can deal with large data sets. In reality most of the data which is stored in a relational database is structured data. Now days the data retrieve from most of the websites is not structured and cannot be used by the relational databases. This paper describes how different tools in Python can improve user experience and provide better services to customers by using appropriate data structure and algorithm. This user experience and the better services to the customer boost the business and hence it is important for business strategy and ensures quality of experience (QoE) for the delivery services to their users.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aca62c5e07ce447ada41c3d896608e9d",
  "timestamp": "2025-05-15T02:48:23.789752"
}