{
  "id": 5568,
  "title": "Operational risk and non-life insurers' performance",
  "abstract": "This study uses three methods - operational lapses, the cost-income ratio and the basic indicator approach - to measure operational risk in the non-life-insurance sector. The system generalized method of moments regression is then used to evaluate how these measures of operational risk affect the performance of the non-life-insurance industry. The study's data was collected from the audited annual financial reports of 16 non-life insurers over the period 2013-21. The operational lapses data was collected from the database of the insurance regulator (the National Insurance Commission). The findings show that operational lapses and the cost-income ratio have significant adverse effects on premium growth and financial performance. The effect of the operational lapses is negative at both the firm and industry levels. This implies that the lapses of an individual firm not only affect its own performance but also have cascading effects on the rest of the industry. The findings have implications for changes in the business models of insurers to improve customers' confidence and reduce operational costs. Typically, insurers make money from two main sources: investment income and underwriting profit. Currently, the investment income is the industry's life support due to huge underwriting losses. However, the debt exchange program initiated by the government of Ghana may wipe out the industry's investment earnings. Hence, significant improvements in the operations of insurers are needed more than ever in order to reduce operational losses and raise underwriting profits.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "acaa0336bf686092da67313b06163fa2",
  "timestamp": "2025-05-15T02:49:21.599616"
}