{
  "id": 8974,
  "title": "Evaluating the Strength of the Association Between Industry Payments and Prescribing Practices in Oncology",
  "abstract": "Background Financial relationships between physicians and the pharmaceutical industry are common, but factors that may determine whether such relationships result in physician practice changes are unknown. Materials and Methods We evaluated physician use of orally administered cancer drugs for four cancers: prostate (abiraterone, enzalutamide), renal cell (axitinib, everolimus, pazopanib, sorafenib, sunitinib), lung (afatinib, erlotinib), and chronic myeloid leukemia (CML; dasatinib, imatinib, nilotinib). Separate physician cohorts were defined for each cancer type by prescribing history. The primary exposure was the number of calendar years during 2013-2015 in which a physician received payments from the manufacturer of one of the studied drugs; the outcome was relative prescribing of that drug in 2015, compared with the other drugs for that cancer. We evaluated whether practice setting at a National Cancer Institute (NCI)-designated Comprehensive Cancer Center, receipt of payments for purposes other than education or research (compensation payments), maximum annual dollar value received, and institutional conflict-of-interest policies were associated with the strength of the payment-prescribing association. We used modified Poisson regression to control confounding by other physician characteristics. Results Physicians who received payments for a drug in all 3 years had increased prescribing of that drug (compared with 0 years), for renal cell (relative risk [RR] 1.81, 95% confidence interval [CI] 1.58-2.07), CML (RR 1.22, 95% CI 1.08-1.39), and lung (RR 1.69, 95% CI 1.58-1.82), but not prostate (RR 0.97, 95% CI 0.93-1.02). Physicians who received compensation payments or >$100 annually had increased prescribing compared with those who did not, but NCI setting and institutional conflict-of-interest policies were not consistently associated with the direction of prescribing change. Conclusion The association between industry payments and cancer drug prescribing was greatest among physicians who received payments consistently (within each calendar year). Receipt of payments for compensation purposes, such as for consulting or travel, and higher dollar value of payments were also associated with increased prescribing. Implications for Practice Financial payments from pharmaceutical companies are common among oncologists. It is known from prior work that oncologists tend to prescribe more of the drugs made by companies that have given them money. By combining records of industry gifts with prescribing records, this study identifies the consistency of payments over time, the dollar value of payments, and payments for compensation as factors that may strengthen the association between receiving payments and increased prescribing of that company's drug.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "acc002d208d1e1535ba6f531d64f486a",
  "timestamp": "2025-05-15T03:24:26.269051"
}