{
  "id": 4186,
  "title": "Cumulative financial stress as a potential risk factor for cancer-related fatigue among prostate cancer survivors",
  "abstract": "Introduction Cancer-related fatigue (CRF) is the most commonly reported treatment-related side effect of prostate cancer (PCa). Recognition of financial hardship among cancer survivors is growing. We investigated, for the first time, associations between levels of financial stress and CRF among PCa survivors. Methods We used data from PCa survivors who had been identified through two population-based cancer registries covering the Republic of Ireland and Northern Ireland and had completed a postal questionnaire. CRF was measured by the fatigue subscale of the EORTC QLQ-C30. Financial stress was assessed as household ability to make ends meet (i) pre-diagnosis and (ii) at questionnaire completion (post-diagnosis). Multivariable logistic regression was used to relate financial stress to clinically important CRF (fatigue subscale score >= 39 of a possible 100). Results Two thousand four hundred fifty-eight PCa survivors were included. Of these, 268 (10.9%) reported pre-diagnosis financial stress only, 317 (12.9%) post-diagnosis stress only and 270 (11.0%) both pre- and post-diagnosis stress (cumulative stress); 470 (19.1%) reported clinically important CRF. After controlling for confounders, survivors with cumulative financial stress exposure were significantly more likely to have CRF (OR = 4.58, 95% CI 3.30-6.35,p < 0.001), compared with those without financial stress. There was a suggestion of a dose-response relationship (OR = 1.83, 95% CI 1.27-2.65,p = 0.001 for pre-diagnosis financial stress only; and OR = 4.11, 95% CI 3.01-5.61,p < 0.001 for post-diagnosis financial stress only). Conclusions Financial stress may be an independent risk factor for CRF. Implications for Cancer Survivors There may be benefits in targeting interventions for reducing CRF towards survivors with financial stress, or developing strategies to reduce financial stress.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "accbb0ea747edc9c05f31debc41acc6e",
  "timestamp": "2025-05-15T02:34:13.429415"
}