{
  "id": 7701,
  "title": "A multivariable assessment quantifying effects of cohort-level factors associated with combined mortality and culling risk in cohorts of U.S. commercial feedlot cattle",
  "abstract": "Economic losses due to cattle mortality and culling have a substantial impact on the feedlot industry. Since criteria for culling may vary and may affect measures of cumulative mortality within cattle cohorts, it is important to assess both mortality and culling when evaluating cattle losses over time and among feedlots. To date, there are no published multivariable assessments of factors associated with combined mortality and culling risk. Our objective was to evaluate combined mortality and culling losses in feedlot cattle cohorts and quantify effects of commonly measured cohort-level risk factors (weight at feedlot arrival, gender, and month of feedlot arrival) using data routinely collected by commercial feedlots. We used retrospective data representing 8,904,965 animals in 54,416 cohorts from 16 U.S. feedlots from 2000 to 2007. The sum of mortality and culling counts for each cohort (given the number of cattle at risk) was used to generate the outcome of interest, the cumulative incidence of combined mortality and culling. Associations between this outcome variable and cohort-level risk factors were evaluated using a mixed effects multivariable negative binomial regression model with random effects for feedlot, year, month and week of arrival. Mean arrival weight of the cohort, gender, and arrival month and a three-way interaction (and corresponding two-way interactions) among arrival weight, gender and month were significantly (P<0.05) associated with the outcome. Results showed that as the mean arrival weight of the cohort increased, mortality and culling risk decreased, but effects of arrival weight were modified both by the gender of the cohort and the month of feedlot arrival. There was a seasonal pattern in combined mortality and culling risk for light and middleweight male and female cohorts, with a significantly (P<0.05) higher risk for cattle arriving at the feedlot in spring and summer (March-September) than in cattle arriving during fall, and winter months (November-February). Our results quantified effects of covariate patterns that have been heretofore difficult to fully evaluate in smaller scale studies; in addition, they illustrated the importance of utilizing multivariable approaches when quantifying risk factors in heterogeneous feedlot populations. Estimated effects from our model could be useful for managing financial risks associated with adverse health events based on data that are routinely available. (C) 2012 Elsevier B.V. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "acdec85775635dd3599363b5d7981f88",
  "timestamp": "2025-05-15T03:11:04.627390"
}