{
  "id": 7839,
  "title": "What are the most influential factors of consumers' intention to use NFC-enabled credit cards?",
  "abstract": "The aim of this study is to determine the variables which affect the intention of Near-Field Communication (NFC)-enabled mobile credit card usage by estimating a fuzzy linear regression (FLR) model. The FLR model is used to test the proposed model. Four hundred and thirty-six participants having a smartphone participated in the study. The most effective variable on the intention of NFC-enabled mobile credit card usage was the dimension that defined the perceived risk and trust. Consumers' intention to use NFC-enabled mobile credit cards increased as perceived risk decreased, and consumer trust increased. Another variable that had a high impact on the intention of using NFC-enabled mobile credit cards was identified as the perceived ease of use in the study. As the consumer's perception of ease of use increased, the intention of using NFC-enabled mobile credit cards also increased. Based on the study results, as perceived usefulness of NFC-enabled mobile credit cards increased, their intentions to use NFC mobile cards also increased in a certain and determined manner defined. The study includes key findings on consumer adoption and the use of NFC-enabled mobile credit cards for different game players such as mobile phone manufacturers, mobile network operators, business and financial institutions, merchants, bank decision makers, software developers as designers of m-payment systems, governments. The research tries to strengthen the use of fuzzy Likert scales (FLSs) in the social studies in order to remove the limitations of the Likert scale and to introduce a suitable and accurate model using FLR. No other study in the previous literature has employed the data obtained from the FLSs used in FLR models.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ace5809f99811f61e531d414ea6fee08",
  "timestamp": "2025-05-15T03:12:36.497709"
}