{
  "id": 2540,
  "title": "How Does Financial Flexibility Strategy Impact on Risk Management Effectiveness?",
  "abstract": "In the context of emerging countries trying to attract foreign investors, building governance strategies and risk management of firms is an increasing concern. This study investigates the impact of financial flexibility strategies on the risk management effectiveness of firms and mechanism of these impacts by focusing on Vietnamese listed firms by applying the fixed effect and system GMM methods on a sample of 635 Vietnamese listed firms during the 2010 to 2021 period to derive empirical models under the high risk-high return approach. We also applied robustness tests to ensure that the results are reliable. We also investigate the level of risk management effectiveness among these firms during the 2010 to 2021 period. We found that financial flexibility strategies negatively impact risk management effectiveness of firms through reducing both firm risk and firm performance. Furthermore, we found that the degree of risk management effectiveness differs between low- and high-risk firms in Vietnam, with low-risk firms displaying more effective risk management compared to high-risk firms. Our research shows that financial flexibility strategies are not conducive to risk management effectiveness; however, firms can control the impact of flexibility strategies on risk management by controlling firm performance and risk.JEL Classification: G30, G32, G39",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ace579218af9d0890afd62e032880add",
  "timestamp": "2025-05-15T02:16:32.681063"
}