{
  "id": 4521,
  "title": "Volatility Spillovers and Contagion During Major Crises: An Early Warning Approach Based on a Deep Learning Model",
  "abstract": "This paper contributes to the ongoing debate on the nature and characteristics of the volatility transmission channels of major crash events in international stock markets between 03 July 1997 and 09 March 2021. Using dynamic conditional correlations (DCC) for conditional correlations and volatility clustering, GARCH-BEKK for the direction of transmission of disturbances, and the Diebold-Yilmaz spillover index for the level of volatility contagion, the paper finds that the climbs in external shock transmissions have long-lasting impacts in domestic markets due to the contagion effect during crisis periods. The findings also reveal that the heavier magnitude of financial stress is transmitted between Asian countries via the Hong Kong stock market. Additionally, the degree of volatility spillovers between advanced and emerging equity markets is smaller compared to the pure spillovers between advanced markets or emerging markets, offering a window of opportunity for international market participants in terms of portfolio diversification and risk management applications. Furthermore, the study introduces a novel early warning system created by integrating DCC correlations with a state-of-the-art deep learning model to predict the global financial crisis and COVID-19 crisis. The experimental analysis of long short-term memory network finds evidence of contagion risk by verifying bursts in volatility spillovers and generating signals with high accuracy before the 12-month crisis period. This provides supplementary information that contributes to the decision-making process of practitioners, as well as offering indicative evidence that facilitates the assessment of market vulnerability for policymakers.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aced655930c74db592078c807abef86d",
  "timestamp": "2025-05-15T02:38:20.296954"
}