{
  "id": 7116,
  "title": "Predicting Major Economic Events with Accuracy: A New Framework for Scientific Macroeconomic Models",
  "abstract": "Despite intense studies over the last several hundred years, the questions about causes, forecasting, and prevention of economic crises remain unsolved. The poor performance of macroeconomic models during the Great Recession of 2008 has forced many economists to reexamine macroeconomic theories and search for credible alternatives to the agent-based and general-equilibrium models now currently used by most economists. This article derives a new category of macroeconomic model and applies it conceptually to explain the causes of economic crises. This model, known as the indeterministic balance sheet plus (IBS+) model, is a special breed of accounting models. It takes an indeterministic view of future balance sheets. This article proposes a classification of causes of economic crises using IBS+ models to analyze balance sheets of key economic sectors. Most economic crises are caused by mismanagement of balance sheets by key economic players, not by any fundamental flaw of capitalism. The frequency of economic crises can be minimized by proper risk management practices, but economic crises can never be completely eliminated. Historically, treating mismanagement of balance sheets as the main cause of economic crises is a generalization of Austrian business cycle theory, Fisher's debt deflation theory, and Minsky's financial instability hypothesis.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "acf0eb08e5e794f8f822445b4a275aa9",
  "timestamp": "2025-05-15T03:05:32.005400"
}