{
  "id": 8495,
  "title": "Pain among women:: Associations with socio-economic and work conditions",
  "abstract": "We examined pain prevalence (general/body sites) and its characteristics/consequences among a randomised sample of women from the general population between 18 and 64 years (n = 3616). We also scrutinised associations between pain and various factors (e.g. socio-economic) by means of multivariate logistic/linear regression analyses. The women completed a questionnaire assessing various areas (e.g. pain). The design was cross-sectional and data were collected during 8 consecutive weeks. Sixty-three per cent of women reported pain during the last 3 months, of which 65% during more than 3 months. The multivariate analyses revealed associations between various socio-economic factors (e.g. financial strain) and pain in general/all studied body sites. In addition, psychosocial work conditions (i.e. work strain and social support) were significantly related to pain. Moreover, the multivariate analyses conducted among women with pain indicated relationships between socio-economic/psychosocial work conditions, and pain characteristics (e.g. intensity) and consequences (i.e. disability). A large number of women from the general population suffer from pain, in particularly prolonged pain. Women in a deprived socio-economic situation not only run a higher pain risk, but also experience their pain as more severe/disabling than their more privileged counterparts. Improvements of, for example, the socio-economic status among women living in deprived social and material circumstances, along with improved working environment may be crucial to reduce women's pain problems. (c) 2005 European Federation of Chapters of the International Association for the Study of Pain. Published by Elsevier Ltd. All rights reserved.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "acfbb9cb9ab9c857ea1c39fc824d7f17",
  "timestamp": "2025-05-15T03:19:21.346947"
}