{
  "id": 4152,
  "title": "Examining significance of downside beta as a measure of risk - evidence from Indian equity market",
  "abstract": "PurposeMany studies have shown that from a theoretical and empirical point of view, downside risk-based measures of risk are better than the traditional ones. Despite academic appeal and practical implications, downside risk has not been thoroughly examined in markets outside developed country markets. Using downside beta as a measure of downside risk, this study examines the relationship between downside beta and stock returns in Indian equity market, an emerging market with unique investor, asset and market characteristics.Design/methodology/approachThis is an empirical study done by using ranked portfolio return analysis and regression analysis methodologies.FindingsThe study results show that downside risk, as measured by downside beta, is distinctly priced in the Indian equity market. There is a direct positive relationship between downside beta and contemporaneous realized returns, indicating a premium for downside risk. Downside risk carries a higher weightage than upside potential in the aggregate return of the stock portfolios. Downside beta is a better measure of systematic risk than conventional market beta and downside coskewness.Practical implicationsThe empirical results support the adoption of downside beta in practice and provide a case for replacing traditional beta with downside beta in asset pricing applications, trading and investment strategies, and capital allocation decision-making.Originality/valueThis is one of the first in-depth studies examining downside beta in Indian equity markets using a broad sample of individual stock returns covering a wide time range of 22 years. To the best of our knowledge, this study is the first one to compare downside beta and downside coskewness using individual stock data from the Indian equity market.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "acff8a69c0ed455e31b29eff36419ccd",
  "timestamp": "2025-05-15T01:24:25.333635"
}