{
  "id": 3563,
  "title": "Minimally invasive pancreatic anastomosis after pancreaticoduodenectomy: multi-institutional step by step video description of the technique",
  "abstract": "Minimally invasive pancreaticoduodenectomy (PD) is attracting increased interest in the pancreatic surgical community with more and more teams reporting their experience worldwide. The pancreatic anastomosis (PA) is one of the key steps and challenging manoeuvre of this procedure. Since the introduction of the minimally invasive approach for PD, several PA types have been proposed, ranging from high to low complexity, but none of them have been proven unequivocally superior to the others. Therefore, definitive consensus has not been reached yet. In the present multimedia manuscript, we report the most commonly adopted minimally invasive PA and we propose a complexity classification to guide the choice accordingly to different characteristics of the pancreatic stump. We describe five possible different PA that might be tailored to each different case, depending mainly on texture of pancreatic stump (soft/hard, lean/fatty) and the size and visibility of main duct. This manuscript presents a step-by-step portfolio of the most commonly used mini-invasive PA. This technique requires experience in pancreatic surgery and advanced minimally invasive skills. Knowledge of and proficiency in different types of PA could help reducing the incidence of postoperative pancreatic fistula.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "acff9f74140617e86ac1d0d459683c6f",
  "timestamp": "2025-05-15T01:18:20.556111"
}