{
  "id": 6778,
  "title": "Data management for the mine production planning and design",
  "abstract": "Key aspects of mining production management involve planning and design, which are very often done by departments of production planning in each mine. This production is very specific because it is inherently accompanied by uncertainty and risk which result from geological, mining, technological and financial-economical aspects. Alongside the knowledge of mining technologies, those responsible for design of mining operations have to be aquatinted with all aspects of underground mining, which sometimes can not be expressed in quantitative terms. Geological and mining conditions of the mine production are unique, therefore, it is necessary to learn them all the time. This imposes on the production planning teams the obligation of systematic learning. In order to facilitate the learning process special tools are needed. The tools must be able to register facts and assist the analysis and the assessment which are necessary to derive the afterthought being the starting point of the feedback in the learning cycle. When monitoring the practical implementation of the planning and design task, we can encounter phenomena which Could not be foreseen, difficulties which require adjustments or natural conditions which make change our assumptions. The system of monitoring and data acquisition about the implemented production process becomes of key importance. The system has been developed to be used by the production planning team in correcting the current solution or creating a new one. Thus collected information can be stored in the dedicated database. The paper briefly reviews the concept of a database for the purpose of design and planning of the mining production. This database shall comprise the information on previous mining activities, covering the geological and mining data, technological and financial data. The database is updated accordingly, to account for the progress of mining operations. Of particular importance is the cost accounting at the points where these costs are generated (using the departmental cost accounting, controlling systems and other financial recording and documentation systems). The database might also comprise the fresh and duly processed data to be utilised in the design and planning, for example, it might contain descriptive statistics and probability distributions of parameters used in stochastic models of mining activities (such as: costs, advance of mining equipment, mining advance, shutdown time, repairs, and other random parameters) as well as correlation and regression functions. The main purpose of the database is to collect information required for stochastic modelling of mining operations taking into account the involved risk and uncertainty.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad01bf19e783f11d54935d5b115d7d47",
  "timestamp": "2025-05-15T03:01:31.389442"
}