{
  "id": 7867,
  "title": "The association between elder abuse and childhood adversity: A study of older adults in Malaysia",
  "abstract": "Objectives Childhood adversity has been linked with later victimization of young and middle-aged adults, but few studies have shown persistence of this effect among elders, especially outside of North America. This research examined the association between adverse childhood experiences (ACEs) and elder abuse among older adults aged 60 years and over in Malaysia. Design Cross sectional data were collected via face-to-face interview from June to August 2019. Setting Eight government community health clinics in Kuala Pilah, a district in Negeri Sembilan state approximately 100km from Malaysian capital city Kuala Lumpur. Participants Older adults aged 60 years and above (N = 1984; Mean age 69.2, range 60-93 years) attending all eight government health clinics in the district were recruited for a face-to-face interview about health and well-being. Measurement The Adverse Childhood Experience International Questionnaire (ACE-IQ) and the Revised Conflict Tactics Scale (CTS) were utilized to estimate childhood adversity and elder abuse respectively. Results Multiple logistic regression analysis revealed a significant relationship between the number of cumulative ACEs and elder abuse. Compared to older adults with no self-reported adversity, those reporting three ACEs (OR 2.67, 95% CI 1.84,3.87) or four or more ACEs (OR 1.7, 95% CI 1.16, 2.48) had higher risk of any elder abuse occurrence since age 60 years. The effect was most prominent for financial and psychological elder abuse. The associations persisted in multivariate logistic regression models after adjusting for sociodemographic and health factors. Conclusion Early life adversities were significantly associated with victimization of older adults. Social and emotional support to address elder abuse should recognize that, for some men and women, there is a possibility that vulnerability to maltreatment persisted throughout their life course.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad22a696565bf8770249536121804b46",
  "timestamp": "2025-05-15T03:13:04.866738"
}