{
  "id": 5516,
  "title": "Health, financial stresses, and life satisfaction affecting late-life depression among older adults: a nationwide, longitudinal survey in Taiwan",
  "abstract": "The purpose of this study was to determine the incidence of depression in late life and to explore associated risk factors among Taiwanese elderly. The analyses were based on nationally representative data from the Survey of Health and Living Status of the Elderly in 1999 and 2003. A total of 1,487 respondents aged 65 years and older who completed the 10-item Center for Epidemiological Survey Depression (CES-D) scale in these two surveys and without depression in 1999 were included in the final analyses. Depression was defined as a CES-D score equal to or greater than 10. The independent variables included sociodemographic characteristics, occurrence of new diseases, social support, perceived health and financial stresses, life satisfaction, and functional condition. The incidence rate of depression over 4 years was 19.7%. Multivariate regression analyses revealed that women who perceived greater health or financial stress and who had greater life dissatisfaction or worsened functional condition were more likely to suffer depression. These findings imply that healthcare programs for older adults should include cognitive and behavioral interventions in order to prevent the development of depression in late life. (C) 2010 Elsevier Ireland Ltd. All rights reserved.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad2494c381f962c49028bd63b1f551f8",
  "timestamp": "2025-05-15T02:48:51.272392"
}