{
  "id": 39,
  "title": "RETRACTED: Identification and Early Warning of Financial Fraud Risk Based on Bidirectional Long-Short Term Memory Model (Retracted Article)",
  "abstract": "In modern market economy, corporate financial frauds emerge one after another, which have a huge impact on the stock market and triggered an unprecedented credit crisis. Therefore, it is particularly important to identify financial frauds. Improving the efficiency, accuracy, and coverage of fraud identification in financial reports through digital and intelligent means is one of the important links to improve credit risk control of securities companies and also for securities companies to accurately price related financial products of target companies. Traditional recognition methods based on artificial rules can cover relatively limited indicators; rule parameters are set randomly. Besides, it is difficult to make rules based on high-dimension indicators and to dig the hidden deep relationships between indicators. This paper summarizes the relevant indicators of financial fraud identification from the perspective of financial and nonfinancial characteristics. Then, the identification and early warning of financial fraud risk based on bidirectional long-short term memory model are proposed. This method uses the idea of ensemble learning, weights the probability of financial key indicators, and uses the optimal transfer probability to solve the financial fraud risk results. The results show that the industry-specific modeling can significantly improve the accuracy of the financial fraud identification model and it also can effectively help the government regulatory departments, investors, and audit departments to correctly identify the financial fraud of listed companies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad3e096d5de4610177500d5a2d300c3e",
  "timestamp": "2025-05-15T01:33:11.314787"
}