{
  "id": 4233,
  "title": "Investing in gold or REIT index in Turkey: evidence from global financial crisis, 2018 Turkish currency crisis and COVID-19 crisis",
  "abstract": "Purpose Under the current Coronavirus Disease 2019 (COVID-19) pandemic circumstances where the gold prices are increasing and the stocks are in free fall, this research aims to compare the returns of gold prices and Turkish real estate investment trust (T-REIT) index by covering the 2008 global financial crisis, 2018 Turkish currency crisis and 2020 COVID-19 pandemic-based economic crisis periods and examine the effects of the returns of gold and the T-REIT index on each other, a research area that has been limited in the literature. Design/methodology/approach For the empirical analysis, vector auto regression model was used, and Augmented Dickey-Fuller and Granger causality tests were also conducted. The average returns were compared with the coefficient of variation analysis. Findings The results of the study exhibited that except for the 2008 global financial crisis period, 2018 Turkish currency crisis and 2020 COVID-19 pandemic-based economic crisis, the T-REIT index performs better than gold prices, but it is a riskier instrument, and both investment instruments do not affect the returns of each other. The segmentation of both instruments recommends the fund managers including both tools for diversification of a portfolio. Research limitations/implications In Turkey, gold prices are valued based on the fluctuations of the global gold prices, as well as the Turkish Lira/US Dollar currency exchange rates. The effect of the exchange rates may be considered in future studies, and the study may be conducted based on the USD values of the T-REIT index and global gold prices. Further studies may also include the comparison between the T-REIT index returns and a set of commodities such as the Goldman Sachs Commodity Index. This study covered only the first five months of 2020 to analyze the COVID-19 pandemic-based economic crisis initial effects, and a successor study is also recommended by including more new data of the post-COVID-19 pandemic and comparing both results. Practical implications The results of the research are expected to contribute to the REIT literature and give insight to investors about their investment choices while including both investment tools in their portfolio, especially for the future conditions of the new COVID-19 pandemic-based economic crisis. Social implications The study may provide insight for individuals, especially those who are considering possible investment options in the Turkish real estate market in the post-COVID-19 pandemic crisis. Originality/value Gold and real estate have always been considered as important investment instruments. Gold is commonly accepted as a safe haven in the literature, and the REITs are considered as long-term investment instruments by many scholars. While gold prices increase in the windy periods, the returns of real estate investments have more cyclical movements based on mostly the macroeconomic conditions and its integration with stock markets, yet the real estate is a common long-term investment tool, especially because of the regular income it generates for the retirement years. By covering three crisis periods including the COVID-19 pandemic-based economic crisis effects, making research about two important investment tools would contribute to the literature, especially in which the studies in this area were very limited.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad4301ec1276a1a6d8cc49c2e62d2a7f",
  "timestamp": "2025-05-15T01:24:51.538650"
}