{
  "id": 8221,
  "title": "Unravelling the intertwined nexus of firm performance, ESG practices, and capital cost in the Chinese business landscape",
  "abstract": "This research explores the relationship between a company's commitment to Environmental, Social, and Governance (ESG) factors and its capital equity cost (COE) in the Chinese market. Using statistical methods like regression analysis, the study aims to uncover how ESG disclosure relates to COE. Key findings reveal that environmental and social disclosures increase capital equity costs, indicating higher costs for companies with strong ESG practices. However, governance disclosures don't significantly impact COE, suggesting that environmental and social aspects carry more weight in shaping investor perceptions and influencing costs compared to governance. The research also shows that this ESG-COE link is more significant for financially sound companies, indicating greater cost implications for strong performers. The study further demonstrates that strong ESG practices are perceived as lower risk, leading to lower capital equity costs. Chinese firms with high ESG scores tend to have lower capital costs, indicating rising investor appreciation for ESG in the Chinese market. The study's robustness check supports these findings, reinforcing the growing importance of ESG in investment decisions. This research has implications for companies, investors, and policymakers, stressing the role of ESG in attracting investment and reducing costs. Policymakers can use these insights to encourage improved ESG practices and transparency. Overall, the study underscores ESG's impact on capital equity costs in China, offering valuable insights for decision-makers and highlighting ESG's relevance in financial choices.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad5c074f221fc7adf8b9a0be29e6a964",
  "timestamp": "2025-05-15T03:16:48.854855"
}