{
  "id": 3955,
  "title": "A health decision analytical model to evaluate the cost-effectiveness of female genital schistosomiasis screening strategies: The female genital schistosomiasis SCREEN framework",
  "abstract": "Female genital schistosomiasis is a chronic gynaecological disease caused by the waterborne parasite Schistosoma (S.) haematobium. It affects an estimated 30-56 million girls and women globally, mostly in sub-Saharan Africa where it is endemic, and negatively impacts their sexual and reproductive life. Recent studies found evidence of an association between female genital schistosomiasis and increased prevalence of HIV and cervical precancer lesions. Despite the large population at risk, the burden and impact of female genital schistosomiasis are scarcely documented, resulting in neglect and insufficient resource allocation. There is currently no standardised method for individual or population-based female genital schistosomiasis screening and diagnosis which hinders accurate assessment of disease burden in endemic countries. To optimise financial allocations for female genital schistosomiasis screening, it is necessary to explore the cost-effectiveness of different strategies by combining cost and impact estimates. Yet, no economic evaluation has explored the value for money of alternative screening methods. This paper describes a novel application of health decision analytical modelling to evaluate the cost-effectiveness of different female genital schistosomiasis screening strategies across endemic settings. The model combines a decision tree for female genital schistosomiasis screening strategies, and a Markov model for the natural history of cervical cancer to estimate the cost per disability-adjusted life-years averted for different screening strategies, stratified by HIV status. It is a starting point for discussion and for supporting priority setting in a data-sparse environment.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad5e0a3106bc095f7bf785f23013cd70",
  "timestamp": "2025-05-15T02:31:28.501932"
}