{
  "id": 895,
  "title": "Prevalence of mental health problems among stranded international students during the COVID-19 pandemic",
  "abstract": "Background The novel coronavirus disease (COVID-19) spread fast throughout China and the rest of the world, prompting the World Health Organization to declare a worldwide pandemic on March 11, 2020. Many countries have implemented travel bans, lockdowns, and stay-at-home policies to combat the spread of the COVID-19 pandemic. This study aimed to investigate the risk factors of mental health problems among international students stranded outside of China during the pandemic. Methods A qualitative study was conducted among non-Chinese international students enrolled at Chinese universities who were stranded in their home countries. The participants were recruited using a purposive sampling technique. Following informed consent, in-depth interviews were conducted with the help of a semi-structured guide. Two independent investigators transcribed and coded the interview data. The investigators established themes after going through a detailed discussion. Results Participants reported several mental health risk factors, such as a rise in hopelessness and level of uncertainty, worry, lost interest and focus, lack of support, unemployment and financial hardships, social pressure, behavioral and mood changes, sleep disorder, and increased smoking. These mental health problems will affect the concentration and deep learning, thereby increasing academic stress. In addition, we found that the outbreak of the delta-variant led to a further increase in these mental health risk factors. Conclusions The pandemic scenario, along with international travel restrictions, increased the likelihood of mental health problems among stranded international students. Thus, preventing further rises in mental health disorders and reducing the effects of pandemic-related measures on stranded international students, such as researchers and policymakers can mitigate the pandemic's effects and achieve national or international health and educational goals. Adequate intervention for this group is strongly recommended.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad626f398cf7d2918cd294af883361a1",
  "timestamp": "2025-05-15T01:43:54.643286"
}