{
  "id": 4123,
  "title": "Poly-Strengths and Peer Violence Perpetration: What Strengths Can Add to Risk Factor Analyses",
  "abstract": "Adolescence is a high-risk time for perpetration of different forms of peer-based violence including harassment, bullying, and sexual assault. Research documents a number of important risk factors but less understood are protective factors like sense of mattering or how combinations of strengths may reduce perpetration risk. The current study examined how protective factors (i.e., positive social norms), including a diversity of strengths (termed poly-strengths), influenced the perpetration of harassment, bullying, and sexual assault for young people, while accounting for the use of alcohol both cross-sectionally and over time. Youth (N = 2232, 52.6% female) in grades 7-10 enrolled in a study using active parental consent (53% response rate) and completed online surveys in school that asked about bullying and harassment, alcohol use, positive social norms related to violence prevention, and a composite of intra-personal strengths. Follow-up surveys took place 6 months later (N = 2150). Logistic regression analyses examined how social norms and poly-strengths influenced odds of perpetration after accounting for demographic variables and the risk factor of alcohol use. Use of alcohol increased the odds of perpetrating all forms of violence. Strengths were significantly related to lower perpetration at Time 1 but not Time 2. Positive social norms reduced perpetration at both time points. The findings suggest adolescent perpetration of bullying, harassment, and sexual violence is lower in the presence of positive social norms over time and more proximally, in the presence of a diverse strengths portfolio. Prevention efforts that incorporate positive social norms and alcohol reduction strategies may reduce peer violence.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad62c1268f0e6c7182a604e8be0f9cf7",
  "timestamp": "2025-05-15T01:23:58.107830"
}