{
  "id": 3672,
  "title": "Board characteristics and negative disclosure tone",
  "abstract": "PurposeNegative disclosure tone in 10-K annual reports has economic consequences, yet relatively little is known about how it is generated. Boards of directors play an important governance role with respect to mandatory disclosures and personally sign off on Form 10-K, leading us to expect directors to influence financial reporting narratives. This study investigates whether the negative tone of firms' narrative annual report disclosures is associated with the human and social capital of its board of directors.Design/methodology/approachMultivariate regression analyses of negative disclosure tone (Loughran and McDonald, 2011) on board members' average age, gender, education, financial expertise and turnover is performed. A host of supplemental tests to corroborate our primary analysis, including using Sarbanes-Oxley's financial expert mandate as an exogenous shock to board composition, impact threshold for a confounding variable, placebo analysis, portfolio tests of more and less negative disclosing firms and portfolio tests of loud versus quiet boards are conducted.FindingsEvidence that directors' gender, education, financial expertise and board turnover are associated with more negative disclosure tone, while directors' age is associated with less negative disclosure tone is found. The study also looked within the board to differentiate whether these findings are driven by characteristics of inside directors or outside directors serving on the audit committee, or both, as these are the specific groups of directors we would expect to play a role in disclosure. It was found that negative disclosure tone is associated with a lower bid-ask spread, so this study interpreted more negative tone as containing more descriptive information.Originality/valueThis study helps decode the black box of annual report disclosure tone, which Loughran and McDonald (2011) show has important economic implications. The results help inform stakeholders such as policymakers, executives and capital market participants as to how board member traits are associated with disclosure. The findings are particularly important as this study bears witness to the increasing prominence of gender/diversity mandates (e.g. Israel, Norway, California) and financial expertise mandates (e.g. Sarbanes-Oxley).",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad6d7d6600c915f260e4979670c25ffb",
  "timestamp": "2025-05-15T01:19:26.231829"
}