{
  "id": 9395,
  "title": "Primary healthcare expansion and mortality in Brazil's urban poor: A cohort analysis of 1.2 million adults",
  "abstract": "Background Expanding delivery of primary healthcare to urban poor populations is a priority in many low- and middle-income countries. This remains a key challenge in Brazil despite expansion of the country's internationally recognized Family Health Strategy (FHS) over the past two decades. This study evaluates the impact of an ambitious program to rapidly expand FHS coverage in the city of Rio de Janeiro, Brazil, since 2008. Methods and findings A cohort of 1,241,351 low-income adults (observed January 2010-December 2016; total person-years 6,498,607) with linked FHS utilization and mortality records was analyzed using flexible parametric survival models. Time-to-death from all-causes and selected causes were estimated for FHS users and nonusers. Models employed inverse probability treatment weighting and regression adjustment (IPTW-RA). The cohort was 61% female (751,895) and had a mean age of 36 years (standard deviation 16.4). Only 18,721 individuals (1.5%) had higher education, whereas 102,899 (8%) had no formal education. Two thirds of individuals (827,250; 67%) were in receipt of conditional cash transfers (Bolsa Familia). A total of 34,091 deaths were analyzed, of which 8,765 (26%) were due to cardiovascular disease; 5,777 (17%) were due to neoplasms; 5,683 (17%) were due to external causes; 3,152 (9%) were due to respiratory diseases; and 3,115 (9%) were due to infectious and parasitic diseases. One third of the cohort (467,155; 37.6%) used FHS services. In IPTW-RA survival analysis, an average FHS user had a 44% lower hazard of all-cause mortality (HR: 0.56, 95% CI 0.54-0.59, p < 0.001) and a 5-year risk reduction of 8.3 per 1,000 (95% CI 7.8-8.9, p < 0.001) compared with a non-FHS user. There were greater reductions in the risk of death for FHS users who were black (HR 0.50, 95% CI 0.46-0.54, p < 0.001) or pardo (HR 0.57, 95% CI 0.54-0.60, p < 0.001) compared with white (HR 0.59, 95% CI 0.56-0.63, p < 0.001); had lower educational attainment (HR 0.50, 95% CI 0.46-0.55, p < 0.001) for those with no education compared to no significant association for those with higher education (p = 0.758); or were in receipt of conditional cash transfers (Bolsa Familia) (HR 0.51, 95% CI 0.49-0.54, p < 0.001) compared with nonrecipients (HR 0.63, 95% CI 0.60-0.67, p < 0.001). Key limitations in this study are potential unobserved confounding through selection into the program and linkage errors, although analytical approaches have minimized the potential for bias. Conclusions FHS utilization in urban poor populations in Brazil was associated with a lower risk of death, with greater reductions among more deprived race/ethnic and socioeconomic groups. Increased investment in primary healthcare is likely to improve health and reduce health inequalities in urban poor populations globally. Author summary Why was this study done? There is evidence, predominantly from high-income countries, that health systems with stronger primary healthcare (PHC) have better health outcomes, reduced health inequalities, and reduced financial impoverishment from healthcare costs. However, evidence from low- and middle-income countries (LMICs) often has methodological weaknesses, focuses heavily on child and maternal health, does not focus on vulnerable groups such as the urban poor, and is not often disaggregated by socioeconomic groups. The city of Rio de Janeiro has undergone a major expansion of PHC services since 2008, with investments in electronic medical records that provide a valuable experimental setting for evaluating PHC. What did the researchers do and find? Administrative welfare records of 1.2 million low-income adults in the city of Rio de Janeiro were linked with PHC records and death certificates between 2010 and 2016. The risk of death for PHC users was compared with nonusers with statistical adjustment differences between groups. Compared with nonusers, PHC users had reduced risk of death, but those with lower education, receiving welfare, or who were black or (mixed-ethnicity) had the greatest reductions. What do these findings mean? PHC usage is associated with health benefits in low-income urban populations in an LMIC and, with greater benefits in deprived socioeconomic groups, there is the potential to reduce health inequalities. Policymakers should continue to prioritize and invest in PHC as part of health system strengthening efforts and actions for progress toward Universal Health Coverage.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad707b9f69ca222135772a42dd0f8506",
  "timestamp": "2025-05-15T03:28:17.612203"
}