{
  "id": 5127,
  "title": "The effect of the late 2000s financial crisis on suicides in Spain: an interrupted time-series analysis",
  "abstract": "Background: The current financial crisis is having a major impact on European economies, especially that of Spain. Past evidence suggests that adverse macro-economic conditions exacerbate mental illness, but evidence from the current crisis is limited. This study analyses the association between the financial crisis and suicide rates in Spain. Methods: An interrupted time-series analysis of national suicides data between 2005 and 2010 was used to establish whether there has been any deviation in the underlying trend in suicide rates associated with the financial crisis. Segmented regression with a seasonally adjusted quasi-Poisson model was used for the analysis. Stratified analyses were performed to establish whether the effect of the crisis on suicides varied by region, sex and age group. Results: The mean monthly suicide rate in Spain during the study period was 0.61 per 100 000 with an underlying trend of a 0.3% decrease per month. We found an 8.0% increase in the suicide rate above this underlying trend since the financial crisis (95% CI: 1.009-1.156; P = 0.03); this was robust to sensitivity analysis. A control analysis showed no change in deaths from accidental falls associated with the crisis. Stratified analyses suggested that the association between the crisis and suicide rates is greatest in the Mediterranean and Northern areas, in males and amongst those of working age. Conclusions: The financial crisis in Spain has been associated with a relative increase in suicides. Males and those of working age may be at particular risk of suicide associated with the crisis and may benefit from targeted interventions.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad754e86ec4c682b8d87b2049dcd7ff1",
  "timestamp": "2025-05-15T02:44:43.829837"
}