{
  "id": 8301,
  "title": "Assessment of survival outcomes among lung cancer patients at the National and Referral Hospital in Kenya",
  "abstract": "Introduction: Lung cancer has a low overall survival rate linked to late diagnosis and metastasis. Unfortunately, comprehensive data within the African continent are limited due to the lack of a registry, low public awareness of lung cancer, financial constraints, and inadequate screening and treatment facilities. In addition, there was a lack of conclusive data in our setting. Therefore, this study aimed to assess survival outcomes among lung cancer patients at Kenyatta National Hospital.Methods: A hospital-based retrospective cohort study was performed to examine the survival outcomes of 151 lung cancer patients. All eligible lung cancer patients diagnosed and treated in the facility between January 1, 2018, and December 31, 2020, were included. The patients were retrospectively followed from the date of primary cancer diagnosis until death or the last follow-up period. The Statistical Package for the Social Sciences (SPSS) version 20.0 statistical software was used to enter and analyze the data. Kaplan-Meier survival and Cox regression analysis were employed to determine median survival and predictors of mortality, respectively.Results: The mean and median follow-time was 18.2 and 17.5 months, respectively. Most (98%) of the patients had non-small cell lung cancer. The 2-year survival rate was 66.7%, with 59.6% of patients having developed distant metastasis during the follow-up, while 25.1% were deceased. The median cancer-specific survival time among the study population was 18.0 +/- 3.40 months. Cox regression analyses showed that patients with distant metastasis had five times more risk of dying (AHR: 4.74, 95% CI: 2.1-10.8, p < 0.001) than patients without distant metastasis.Conclusions: The overall two-year survival rate of lung cancer patients at the Kenyatta National Hospital was 66.7%, with most patients developed distant metastasis during the follow-up period. Distant metastasis was the only significant predictor of mortality among lung cancer patients in our setting.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad76c75525ed1ee31b82f7d06b783af3",
  "timestamp": "2025-05-15T03:17:21.581066"
}