{
  "id": 3473,
  "title": "The nexus between the volatility of Bitcoin, gold, and American stock markets during the COVID-19 pandemic: evidence from VAR-DCC-EGARCH and ANN models",
  "abstract": "The spread of the coronavirus has reduced the value of stock indexes, depressed energy and metals commodities prices including oil, and caused instability in financial markets around the world. Due to this situation, investors should consider investing in more secure assets, such as real estate property, cash, gold, and crypto assets. In recent years, among secure assets, cryptoassets are gaining more attention than traditional investments. This study compares the Bitcoin market, the gold market, and American stock indexes (S&P500, Nasdaq, and Dow Jones) before and during the COVID-19 pandemic. For this purpose, the dynamic conditional correlation exponential generalized autoregressive conditional heteroskedasticity model was used to estimate the DCC coefficient and compare this model with the artificial neural network approach to predict volatility of these markets. Our empirical findings showed a substantial dynamic conditional correlation between Bitcoin, gold, and stock markets. In particular, we observed that Bitcoin offered better diversification opportunities to reduce risks in key stock markets during the COVID-19 period. This paper provides practical impacts on risk management and portfolio diversification.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad7ac1655473c3de599344687fde38d9",
  "timestamp": "2025-05-15T02:26:48.461819"
}