{
  "id": 9245,
  "title": "Opioid Dependence Syndrome and Quality of Life: A Facility-based Exploratory Study among Drug Addicts at a Tertiary Care Hospital of Kolkata, India",
  "abstract": "Introduction: Opioid dependence syndrome is considered a chronic-relapsing medical illness that can affect the Quality of Life (QoL) of Injecting Drug Users (IDUs). They are at risk of contracting Human Immunodeficiency Virus (HIV) due to unsafe injection practices. Opioid Substitution Therapy (OST) is an effective treatment option for opioid dependence as well as HIV prevention and intervention among IDUs, subsequently improving their QoL.Aim: To identify the opioids injected by addicts and evaluate QoL across different life areas among IDUs attending an OST centre. The authors also aimed to determine the factors affecting QoL regarding relationships with family and friends.Materials and Methods: A facility-based, observational crosssectional study was conducted on 168 IDUs at an OST centre in Calcutta National Medical College from April 2016 to March 2018. A predesigned and pretested structured schedule was used, which included socio-demographic characteristics, pattern of substance abuse, and HIV status. To evaluate QoL, the authors used a Likert scale with five domains specific to chronic diseases. Logistic regression was employed to determine associated factors with two QoL domains regarding relationships with family and friends. The Statistical Package for Social Sciences (SPSS) version 16.0 was used for data analysis.Results: The mean age {Standard Deviation (+/- SD)} of the study participants was 36.53 +/- 9.514 years. The most common opioids injected by IDUs were buprenorphine (89.2%). Although QoL scores varied across different domains, it can be interpreted that the majority of participants had poor QoL. When assessing QoL in terms of relationships with family and friends, there was a significant association between better QoL and financial support {Adjusted Odds Ratios (AOR) Confidence Intervals (CI)} 2.550 (1.431-6.082), favourable living arrangements AOR(CI) 2.450 (1.010-4.443), and absence of seropositivity AOR(CI) 2.462 (1.141-7.476).Conclusion: Buprenorphine was the most common substance of abuse among IDUs. The study revealed a high proportion of IDUs with poor QoL. The findings of the study might be helpful in designing appropriate strategies to improve personal relationships and social situations among IDUs.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad7cb865cee0bc667eb6ea091c90f4bf",
  "timestamp": "2025-05-15T03:26:54.588084"
}