{
  "id": 2420,
  "title": "Cost Implications of Using Carbetocin Injection to Prevent Postpartum Hemorrhage in a Canadian Urban Hospital",
  "abstract": "Objective: Recent World Health Organization (WHO) recommendations regarding uterotonics for the prevention of postpartum hemorrhage (PPH) state that carbetocin should be considered a first-line prophylactic agent for all births where its cost is comparable to other effective uterotonics. This study evaluated whether a room temperature stable formulation of carbetocin met this recommendation in a Canadian urban hospital setting. Methods: A decision tree model was developed to assess the financial implications of replacing oxytocin with carbetocin as a first-line prophylactic agent for PPH prevention in a Greater Toronto Area (GTA) hospital. The analysis accounted for the mode of delivery, efficacies of carbetocin and oxytocin in PPH prevention, occurrence of PPH-related health outcomes, and health care resource costs for PPH interventions. Results: This study found that a GTA hospital, with 3242 deliveries per year, could save over CAD $349 000 annually by switching to room temperature stable carbetocin for PPH prevention. Carbetocin was able to lower institution costs by reducing the use of health care resources for PPH management in low-risk and high-risk PPH patients. The cost-saving potential of carbetocin relative to oxytocin was largely attributed to its greater efficacy in preventing the consequences of PPH. Conclusion: The use of room temperature stable carbetocin as a first-line prophylactic agent for PPH prevention meets WHO recommendations regarding uterotonics for PPH in a GTA hospital. The model from this study can be used to determine the financial impact of switching from oxytocin to carbetocin in other jurisdictions while diversifying a hospital's pool of PPH prophylactic agents.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad7fdfddd99ff37ad111b4ffdb1dbb96",
  "timestamp": "2025-05-15T02:15:26.946043"
}