{
  "id": 8233,
  "title": "Anthropometric assessment and food intake of children younger than 5 years of age from a city in the semi-arid area of the Northeastern region of Brazil partially covered by the bolsa familia program",
  "abstract": "Objective The objective of this study was to assess the health and nutritional status of children under five years of age and to associate the quality of the foods consumed with the Bolsa Famlia Program in a city located in the Brazilian semi-arid region. Method A total of 189 children from a sample of 411 households in the city of Joao Camara (RN) were assessed. Weight and height were measured and socioeconomic and food habits were determined with the use of questionnaires. The nutritional status of the children was determined with the weight-for-age, height-for-age and weight-for-height indicators. Univariate analyses were done and bivariate and multivariate logistic regression models were constructed to test the hypothesis of the study. Results Of the studied children, 4.3% were underweight, 9.9% were stunted and 14.0% were overweight. The nutritional status of children whose families receive the Bolsa Famlia financial aid was not significantly different from those whose families do not receive the aid. In both groups, the consumption of fruits and non-starchy vegetables was low and similar. Children from families who receive the aid were 3 times more likely to eat junk food (OR 3.06 - CI 1.35-6.95). Conclusion The food intake patterns of this population indicate that they are at food and nutritional risk. Health professionals need to intervene in order to promote healthier eating habits.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad8108031192f66d3eeab8d6fffeb790",
  "timestamp": "2025-05-15T03:16:48.940629"
}