{
  "id": 8496,
  "title": "Providing instrumental social support is more beneficial to reduce mortality risk among the elderly with low educational level in Taiwan: A 12-year follow-up national longitudinal study",
  "abstract": "To evaluate whether the effects of providing or receiving social support are more beneficial to reduce mortality risk among the elderly with different educational levels. In this long-term prospective cohort study, data were retrieved from the Taiwan Longitudinal Study on Aging. This study was initiated from 1996 until 2007. The complete data from 1492 males and 1177 females aged a parts per thousand yen67 years were retrieved. Participants received financial, instrumental, and emotional support, and they actively provided instrumental and emotional support to others and involved in social engagement. Education attainment was divided into two levels: high and low. The low education level included illiterate and elementary school. The high education level included junior high school to senior high school and above college. Cox regression analysis was used to examine the association between providing or receiving social support on mortality with different educational levels. The average age of the participants in 1996 was 73.0 (IQR=8.0) years, and the median survival following years (1996-2007) of participants was 10.3 (IQR=6.7) years. Most participants were low educational level including illiterate (39.3%) and elementary school (41.2%). Participants with high educational level tend to be younger and more male significantly. On the contrary, participants with low educational level tend to have significant more poor income, more depression, more cognition impairment, more with IADL and ADL disability than high educational level. Most participants received instrumental support from others (95.5%) and also provided emotional support to others (97.7%). Providing instrumental support can reduce 17% of mortality risk among the elderly with a low level of education after adjusting several covariates [Hazard ratio (HR) = 0.83; 95% confidence interval (CI) = 0.70-0.99; p = 0.036]. Providing instrumental social support to others confer benefits to the giver and prolong life expectancy among the elderly with low educational levels.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad94887742049e393a17e4806173b54c",
  "timestamp": "2025-05-15T03:19:21.348052"
}