{
  "id": 5659,
  "title": "An empiric on geopolitical risk and the tourism-economic growth nexus",
  "abstract": "Purpose This study empirically examines the moderating role of geopolitical risk on the tourism-economic growth nexus by applying a recent geopolitical risk indicator developed by Caldara and Iacoviello (2022) in a cross-country panel data growth model context for a sample of 24 countries.Design/methodology/approach A Dummy Variable Least Squares panel data model, nonparametric covariance matrix estimator and SYS-GMM estimation techniques are employed for the analysis. The authors capture the GPR moderating effect by disaggregating the cross-country sample according to low versus high country GPR score and through a GPR interaction coefficient. Several controls are included in the models such as gross fixed capital formation and-consistent with Barro (1990)-government consumption. Trade openness is used to account for the export-led growth effect. In line with neoclassical growth theory (e.g. Barro, 1991), the authors also include the real interest rate, to account for policy makers' commitment to macroeconomic stability, financial depth, as a proxy for financial development, population growth and the level of secondary school education. The authors also control for unobserved country-specific and time-invariant effects.Findings The research finds that the interaction term of geopolitical risk significantly contributes to the predictive ability of the regression and provides empirical evidence that confirms that only in low geopolitical risk countries international tourism positively and significantly contributes to economic growth. Important theoretical and policy implications flow from these findings.Originality/value The study not only contributes to advancing academic knowledge on the tourism-growth nexus, it also has impact beyond academia. Many countries have in the past pursued and many continue to pursue, tourism specialization and/or tourism-led growth strategies based on the theoretically well-established and empirically validated positive link between inbound tourism and economic growth. The findings alert policy makers in such countries to the significant moderating role that geopolitical risk plays in affecting the above-mentioned relationship and to the importance of prioritizing geopolitical stability as a policy precursor for the successful implementation of such strategies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ad96c2c3030768a0c35f963e43690021",
  "timestamp": "2025-05-15T02:49:50.401077"
}