{
  "id": 3373,
  "title": "Related or Unrelated Variety and Economic Growth of South Asian Countries",
  "abstract": "Recent literature on knowledge spillovers argues that diversified economic structures are more conducive to knowledge spillovers than specialized structures: a concept that is generally known as Jacobian Externalities. It further argues that diversification can be further decomposed into two forms, that is, related variety (RV) and unrelated variety (UV). RV is the diversification of production in related or similar products, whereas UV is the diversification of production in unrelated or dissimilar products. Most of the existing research on RV and UV is on advanced economies, and research on developing countries, particularly in the South Asian region that mostly produces agricultural and textile products, is scarce. Therefore, this study examines the relationship between RV and UV with economic growth in six South Asian countries using secondary data from 1995 to 2019. Since products at two-digit Standard International Trade Classification are unrelated to each other, UV is calculated at the two-digit level and RV is calculated at the five-digit level because of the similarity among sectors. Using fixed-effects regressions on the standard growth model, our findings suggest that related specialization is beneficial for economic growth in South Asian countries, and UV has a positive relationship with growth only when government effectiveness is high. Our results show that South Asian countries should produce selected products under the broad product classification to benefit from economies of scale instead of diversifying their product portfolio by producing similar products.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ada46ba1f124b4c655022110557dad35",
  "timestamp": "2025-05-15T01:16:22.204636"
}