{
  "id": 5319,
  "title": "AGE-RELATED VARIATION IN RECENT LIFE EVENTS PRECEDING SUICIDE",
  "abstract": "Recent life events as reported by the next of kin were explored in male and female suicide victims to see how these factors varied across age groups by decade of age. The study population comprised all 1022 suicide victims aged 20 years and older in Finland during a 12-month period who had life event data assessed as reliable by the interviewing mental health professionals. Age-related patterns of variation of Life events were found: separation, serious family arguments, financial trouble, job problems, unemployment, and residence change were more common among younger victims, whereas somatic illness and retirement were more common among older victims. Mean number of life events, greater among men than women, tended to decline gradually across the age range. In terms of sex differences, somatic illness was more common among elderly men, while separation, financial trouble, and unemployment were more common among younger men. Most life events among younger age groups were possibly dependent upon the victims' own behavior. Logistic regression indicated association between specific life events and alcohol misuse: separation, serious family arguments, financial trouble and unemployment were especially related to alcohol misuse. Violent suicide method lacked association with life events, being commoner only among males and those not having misused alcohol. Age-and sex-specific control groups and multidimensional life event interview schedules are needed to further investigate the relative risk of life events in suicide.",
  "year": 1995,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "adb0fe7521789e8eeaf7ad23a6332e69",
  "timestamp": "2025-05-15T02:46:44.852136"
}