{
  "id": 6814,
  "title": "SOME ASPECTS REGARDING FINANCIAL MARKETS AND INSTRUMENTS IN ROMANIA",
  "abstract": "This paper tries to cover a range of Romanian financial securities and the markets in which they trade. Our goal is to introduce the readers to the features of Romanian various securities types. We refer to the traditional classification of securities, money markets instruments or capital market instruments that were developed or will be develop in Romania. The money market includes short term, marketable, liquid, low-risk debt securities. Money market instruments sometimes are called cash equivalent because of their safety and liquidity. Capital markets, in contrast, include longer term and riskier securities. Securities in the capital market are much more diverse than those found within the money market. This paper contains a discussion of Romanian markets overall: the money market, long term fixed income capital markets and equity markets and especially on both Romanian Stock Exchanges, one in Bucharest and the other in Sibiu. Also we try to explain the trends in future development of the Romanian Stock Exchange, given the fact that from January 1, our country is member of European Union and we probably will see more changes in the future regarding financial markets. Bucharest Stock Exchange was valuated in 2006 at,80 million euros, and has growing up in the last five years five times. In October 2004, BSE value was estimated at 16 million euros, but after the merge with RASDAQ the value increased Sibiu Stock Exchange value was in 2006 at 6 millions euros. The two markets wanted a merger in 2006, but it did not happened As it seems until now, we will have two financial markets, both trading with bonds and derivates. It will be regrettable if the spot market will divide, because of smallness of the market, both in value and in quantity. In the future, the remaining state-owned companies, which wanted to be listed will have to choose from the two financial markets. Until now, we saw overrated optimism or justified hopes regarding the Romanian financial markets, and especially the Bucharest Stock Exchange: this was one of the question on the Stock Exchange several years ago, when the main stocks registered fast price growth without being sustained by financial results and thus came to be valued much higher than the average of similar companies operating on more developed countries. Business growth potential was the explanation. Stock exchange analysts offered then for the price hikes of the stocks, which went way beyond the income growth pace reported by companies. The same explanation is offered today. For emerging markets like Romania, the value of price earnings ratio is less relevant, especially when speaking about non-restructured companies, still held by the state. Under the circumstances, stock prices do not reflect the actual situation of companies, but rather the investors' confidence in the future. Moreover, a higher value of PER, can point to the clear expectations of investors with regard to the growth pace of a company or activity sector.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "adb4b5e39c06a8bbe97bbd7a17f6fe02",
  "timestamp": "2025-05-15T03:02:07.396900"
}