{
  "id": 2873,
  "title": "Higher moments anomaly: evidence from the Indian equity market",
  "abstract": "Purpose The study investigates the impact of higher moments on cross-sectional returns in the Indian equity market. Design/methodology/approach Using the daily data of 3,085 Bombay Stock Exchange-listed stocks spanning over 20 years from January 2000 to December 2019, the study evaluates the relationship between higher moments (skewness and kurtosis) and stock returns at individual stock and portfolio levels. The variations in the returns of the equal-weighted and the value-weighted portfolios are analysed, where the portfolios are constructed by sorting the stocks on skewness and kurtosis. The returns are adjusted for five common factors - market excess-returns, size, value, momentum and illiquidity, to controls other cross-sectional effects. Besides, the study employs Fama-MacBeth cross-sectional regression and time-series tests of higher moments as robustness measures. Findings The study presents higher moments anomaly in the Indian equity market. Contrary to what is expected based on a risk-averse rational agent model, a robust positive relationship is observed between the skewness and stock returns. The relationship between the kurtosis and stock returns is negative, albeit statistically weak. These results are robust for the Fama-MacBeth cross-sectional regression and time-series tests. Originality/value It is among the earlier attempts to investigate the pricing impact of higher moments at different levels of asset prices in an emerging market. Besides the standard portfolio methodology for explaining cross-sectional variations, the study also employs the time-series tests for higher moment factors, hence provides more robust results. Results have wider implications for asset pricing in emerging markets and highlight many issues for further research.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "adcc6ce604695e7ca8c7011108b11c29",
  "timestamp": "2025-05-15T01:11:17.448232"
}