{
  "id": 351,
  "title": "Economic evaluation of grazing steers on summer annuals sod-seeded into warm-season perennial pasture",
  "abstract": "Objectives: Sorhgum-sudangrass (SS) and cowpea (CW) can increase cattle gains when sod-seeded to mixed bermudagrass (MB); however, establishment time and cost may not be recouped by improved animal production. Additionally, valuing weight gain at varying production stages, without a market transaction, prompted an evaluation of different pricing methods. Materials and Methods: Cattle gains on MB, SS, and a 50:50 mix of SS+CW (SSCW) pastures were evaluated. One pricing method linearly interpolated 10-yr-average prices across weight categories. A second, regression-based approach added corn and feeder cattle futures to weight to explain prices. The third used experimental years only. Results and Discussion: Greater forage quality in annuals pastures where cattle had greater ADG (1.01 kg/ head per day for SS and SSCW vs. 0.79 kg/head per day for MB) led to different cattle gains by forage and year. In 2021 grazing days were 91, 68, and 60 d for MB, SS, and SSCW, respectively, whereas they were 95 d for MB and 92 d for SS and SSCW in 2022. Despite greater ADG with annuals, delayed planting of annuals led to numerically lesser cattle gains and lesser partial returns than MB in 2021. In 2022 drought forced a rest period in MB pastures; however, greater weight gains with annuals did not recoup costs regardless of pricing method. Conclusions and Applications: Timely planting is important for increasing grazing days with annuals. With seasonal and cyclical dynamics affecting the value of weight gain, heavier ending weights were not rewarded with prices that would cover annuals establishment.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "add59dd6f3a02ad3f838d1b86a73a47b",
  "timestamp": "2025-05-15T01:31:13.140669"
}