{
  "id": 4908,
  "title": "A Centralized Credit Scoring Prototype for Microlending Institutions Using Neural Networks",
  "abstract": "Microlending involves giving small loans to people in need. Usually, these loans are issued to entrepreneurs or those who need extra cash to either expand or for personal use. Digital lending is becoming a leading source of credit especially to low-income citizens with minimal or no financial footprints in various parts of the world. It has quickly become the default way for lenders to service loan requests from borrowers due to the convenience it brings about as well as the increased number of requests that can be processed compared to the traditional way that required quite an amount of paper work. As the number of lending companies grows, there is the need to standardize the credit scoring process and maintain an updated credit activity log for every user. This ensures that lenders are always aware of any other unsettled debts a borrower might have and provides them with the most recent information to assess the risk they face by lending to a borrower. The proposed solution consists of a credit scoring neural network-based algorithm composed of a single input layer, a single hidden layer and an output layer of one neuron, and a representational state transfer (REST) based web service allows lenders to submit details of loans they have approved and issued to a borrower. The information is used to generate and keep track of the user's credit score and amount of risk lenders face should they consider lending to the user. Agile development methodology was used to develop robust credit scoring prototype and Android mobile application. The final prototype was tested to ensure that the requirements were met and the functionality working as required.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "add9cd12e2ec10daf56512544ebdfff5",
  "timestamp": "2025-05-15T02:42:04.958200"
}