{
  "id": 4314,
  "title": "CLUSTERING OF HOMOGENEOUS PRODUCTION FACILITIES BASED ON THE ANALYSIS OF TECHNOLOGICAL DATA IN THE FORMATION OF ALUMINUM ALLOYS",
  "abstract": "The continuous development of the metallurgical industry, including the current trend of improving the technological process of forming aluminum alloys, determines the need for additional research work aimed at obtaining safe and effective methods for modernizing existing technological measures for the production of aluminum alloys, considering specific requirements for their chemical composition. Modernization of the established modes of operation of the technological stages of the production process, as well as continuous monitoring of the main features of the technological operations in the manufacture of aluminum alloys, determines the achievement of new practical results in the production of modern high-quality materials with higher environmental and operational properties. All these factors directly increase the competitiveness of the industry in the world market of non-ferrous metals, increasing consumer demand for products of this kind. One of the available options for upgrading the current production cycle of aluminum alloy manufacturing is to improve the technological stage of forming aluminum melt in the melting mixer of the foundry department. In particular, it is proposed to optimize the established operating modes of production units and control actions. At the same time, there is a need to use mathematical tools designed to formalize the main features of the studied production facilities in order to continuously monitor dynamic changes in technological parameters. Proper processing of process data contributes to the application of classification cluster analysis of the existing set of casting buckets with raw aluminum based on the initial values of the concentrations of elements of the chemical composition. The cluster analysis provides an effective division of the available set of casting buckets with raw aluminum into appropriate clusters, including considering the established requirements for the selected brand of aluminum alloy according to the specifications of the order portfolio. This principle of cluster analysis, followed by software and algorithmic implementation of appropriate quality, especially with the use of a high-speed high-level programming language, will ensure the creation of a workable way to obtain the most correct options for allocating cluster sets of casting buckets for their subsequent layout and mixing. Thus, the use of cluster analysis is not only a convenient analytical tool for the study of a large array of technological data, reducing the complexity of the perception of a large amount of information about the production process by technological personnel, but also helps to reduce the number of unnecessary empirical options for incorrect layout of available casting buckets at optimal technical and economic costs.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "adebdf3370ba3bcf6763f6d17fa9704f",
  "timestamp": "2025-05-15T01:25:50.528999"
}