{
  "id": 8467,
  "title": "The IMPACT Score: A New Score to Predict the Risk of Early Mortality in Cardiogenic Shock Patients Treated With Venoarterial Extracorporeal Membrane Oxygenation",
  "abstract": "Objectives: Venoarterial extracorporeal membrane oxygenation (VA-ECMO) requires considerable human and financial resources. Few studies have focused on early mortality (ie, occurring within 72 hours after VA-ECMO implantation). The objective of this study was to establish a prognosis score-the IMPACT score (prediction of early mortality associated with VA-ECMO using preimplantation characteristics)-by determining the risk factors associated with early mortality. Design: This was a retrospective and observational study. Setting: The study was conducted at a University hospital. Participants: This single-center retrospective study included 147 patients treated with VA-ECMO for cardiogenic shock between 2014 and 2021. Methods: The primary outcome was early mortality (ie, occurring within 72 hours after VA-ECMO implantation). Multivariate logistic regression was performed using a bootstrapping methodology to identify factors independently associated with early mortality. To construct the score, identified variables had points (pts) assigned corresponding to their odds ratio. Results: A total of 147 patients were included in the study. Early mortality (<72 hours) was 26% (38 patients). Four variables were established: cardiac arrest (2 pts), lactate levels (3 pts), platelet count <100 g/L (4 pts), and renal-replacement therapy (5 pts). The IMPACT score had an area under the receiver operating characteristic curve of 0.78 (95% CI 0.86-0.70) to predict early mortality. Conclusions: In the authors' experience, 26% of patients treated with VA-ECMO presented early mortality. The IMPACT score is a reliable predictor of early mortality and may assist with VA-ECMO initiation decision-making. (c) 2023 The Authors. Published by Elsevier Inc.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "adf30ac7e7d06f3fbc6d5bdde86cd29c",
  "timestamp": "2025-05-15T03:19:21.258620"
}