{
  "id": 578,
  "title": "IntPort: An Intelligent Portfolio Construction Technique Based on Financial Forecasting by Statistical Average Method",
  "abstract": "Investors are inclined to predict stock values, and conventional studies indicate that using machine learning (ML) for stock price prediction is the most effective method. This study focuses on ML-based stock price forecasting that aims to assist people with limited investment capabilities by providing a high-quality approach to price prediction. The research utilizes various characteristics of the current stock price, such as 'Open,' 'Low,' 'High, 'Adj Close', and 'Close'. In addition, it incorporates principal component analysis (PCA), linear discriminant analysis (LDA), and a statistical average method (SAM) to create additional features. These features and current stock price attributes are combined to form a feature vector for ML methods. The study also emphasizes building a portfolio that reduces investment risk while capitalizing on the expected upward movement of stock prices. Experimental results indicate that incorporating the SAM-price feature associated with the ML technique, bidirectional long short-term memory (Bi-LSTM), leads to superior forecasting accuracy compared to existing approaches. It is evident from previous literary works that various supervised learning methods have successfully predicted stock prices. Our research is dedicated to producing a novel approach to generate better price accuracy by forecasting and an effective portfolio that can be beneficial to the general public. The investigation reveals an accuracy rate of 98.14% when applied with the SAM-price feature defined by the additional feature dataset (AFD), surpassing the accuracy achieved by traditional pricing features alone. Additionally, as a novel price feature, AFD generates no over-fitting. Furthermore, the portfolio generated using the SAM-price function demonstrates a return on investment of 145.475% and a Sharpe ratio value of 77.62, indicating a favorable risk-return trade-off.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "adfdedc80e27b493f7501c5252952699",
  "timestamp": "2025-05-15T00:45:01.364522"
}