{
  "id": 3758,
  "title": "Use of Financial Hardship as a Metric for Assessing Financial Toxicity in Surgical Trauma Patients",
  "abstract": "Background: Financial toxicity is the detrimental impact of health care costs that must be mitigated to achieve universal health coverage. Catastrophic health expenditure (CHE) is widely used to measure financial toxicity but does not capture patient perspectives of unaffordable health care costs. Financial hardship (FH), a patient-reported outcome measure, is currently underutilized but may be an important adjunct metric. The authors compare CHE to FH as metrics evaluating financial toxicity. Methods: A prospective, multicenter cohort study was conducted across 3 public and private tertiary-care hospitals in India. Adult surgical trauma inpatients in plastic and orthopedic surgery departments were assessed. The development of CHE, health expenditures >10% of annual income, and FH, the patient-reported impact of financial toxicity in the form of asset liquidation, debt acquisition, and job loss, were compared by the health system and using logistic regression models. Results: Among 744 surgical trauma patients, low income, longer hospital stays, and increased injury severity were significantly associated with the likelihood of incurring CHE and FH (P<0.05). Only FH was significantly associated with lack of insurance (OR: 0.22; 95% CI: 1.14-2.71). Public hospitals had higher rates of FH than CHE (55% versus 23%). Private hospitals had more CHE than FH (53% versus 32%). Conclusions: FH is an important metric of financial toxicity that provides important adjunct information to CHE for at-risk populations. FH is particularly informative for public institutions with low direct medical costs. Nuanced utilization of CHE and FH provides a more comprehensive, patient-oriented approach to evaluating unaffordable health care costs that can help shape financial risk protection policy.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "adfde1e7bbe1ca179c5bef6a796a641d",
  "timestamp": "2025-05-15T02:29:28.092950"
}