{
  "id": 4669,
  "title": "A Novel Deterministic Probabilistic Forecasting Framework for Gold Price with a New Pandemic Index Based on Quantile Regression Deep Learning and Multi-Objective Optimization",
  "abstract": "The significance of precise gold price forecasting is accentuated by its financial attributes, mirroring global economic conditions, market uncertainties, and investor risk aversion. However, predicting the gold price is challenging due to its inherent volatility, influenced by multiple factors, such as COVID-19, financial crises, geopolitical issues, and fluctuations in other metals and energy prices. These complexities often lead to non-stationary time series, rendering traditional time series modeling methods inadequate. Our paper presents a multi-objective optimization algorithm that refines the interval prediction framework with quantile regression deep learning in response to this issue. This framework comprehensively responds to gold's financial market dynamics and uncertainties with a screening process of various factors, including pandemic-related indices, geopolitical indices, the US dollar index, and prices of various commodities. The quantile regression deep-learning models optimized by multi-objective optimization algorithms deliver robust, interpretable, and highly accurate predictions for handling non-linear relationships and complex data structures and enhance the overall predictive performance. The results demonstrate that the QRBiLSTM model, optimized using the MOALO algorithm, delivers excellent forecasting performance. The composite indicator AIS reaches -15.6240 and -11.5581 at 90% and 95% confidence levels, respectively. This underscores the model's high forecasting accuracy and its potential to provide valuable insights for assessing future trends in gold prices. The deterministic and probabilistic forecasting framework for gold prices captures the market dynamics with the new pandemic index and comprehensively sets a new benchmark for predictive modeling in volatile market commodities like gold.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae03245f90c4ff7b98e36dad7e9262ab",
  "timestamp": "2025-05-15T02:39:57.419560"
}