{
  "id": 2819,
  "title": "Financial connectedness and risk transmission among MENA countries: Evidence from connectedness network and clustering analysis",
  "abstract": "This study examines the financial connectedness and risk transmission among MENA economies by accounting for financial connectedness in the short and long run as well dependency under extreme market conditions and network graph analysis. To this end, Composite Financial Stress Indices are constructed for 11 MENA countries. In addition, a battery of econometric models is applied including the standard spillover approach, the frequency domain method, the quantile connectedness technique, and connectedness networks analysis. Using daily data over the period from June 30, 2006 to June 30, 2021, the empirical results show a positive and strong association between financial stress co-movements and spillovers in those MENA countries, particularly during the long run and high extreme stress periods. Furthermore, the five Gulf countries are strongly financially connected among themselves than with the other countries. Contrary, to Tunisia, Saudi Arabia is the main financial stress and risk transmitter to other MENA economies whereas, the North African countries are relatively mild receivers of risk. Finally, the more open countries in terms of capital controls, particularly Kuwait, Oman, Qatar, and UAE seem to play a more central role in financial connectedness and risk spillovers.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae0ed62052c95ec56dbbeb72c6e48737",
  "timestamp": "2025-05-15T02:19:46.594204"
}