{
  "id": 6877,
  "title": "Association of Social Risks With Avoiding or Delaying Health Care and With Emergency Department Visits: Evidence From 2017 Ohio Medicaid Assessment Survey",
  "abstract": "OBJECTIVES: The primary aim was to examine the association of social risks with avoiding/delaying health care after controlling for sociodemographic covariates, and the secondary aim was to examine the association of social risks with emergency department (ED) visits after controlling for avoiding/delaying health care and sociodemographic covariates. STUDY DESIGN: 2017 Ohio Medicaid Assessment Survey data were analyzed. METHODS: Descriptive, bivariate analysis and multiple weighted logistic regressions were conducted. First, weighted logistic regression assessed the association of aggregated social risk (food insecurity, housing instability, financial strain) and health insurance type with avoiding/delaying health care after controlling for sociodemographic covariates. Next, weighted logistic regression assessed the association of social risks with ED visits after controlling for avoiding/delaying health care and sociodemographic covariates. RESULTS: Among 39,711 respondents, 21.7% reported avoiding/delaying health care and 27.2% reported having at least 1 ED visit in the past year. Individuals with higher vs lower aggregated social risk had higher odds of avoiding/ delaying health care (odds ratio [OR], 1.30; 95% CI, 1.261.34) and were more likely to have any ED visits (OR, 1.10; 95% CI, 1.07-1.13). Uninsured individuals compared with those with private insurance were more likely to avoid/delay health care (OR, 1.98; 95% CI, 1.73-2.26) and have higher likelihood of any ED visits (OR, 1.23; 95% CI, 1.06-1.42). Finally, individuals who reported avoiding/delaying getting health care were more likely to have higher odds of any ED visits (OR, 1.33; 95% CI, 1.23-1.45). CONCLUSIONS: Social risks are important factors in patients' decisions to avoid/delay health care and are associated with increased odds of any ED visits. To reduce ED visits, policy-level efforts need to be made to address these social challenges.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae1dde655b88c04ada7782128e5d099f",
  "timestamp": "2025-05-15T03:02:41.201877"
}