{
  "id": 5335,
  "title": "Money laundering through cryptocurrencies-analysis of the phenomenon and appropriate prevention measures",
  "abstract": "Purpose The aim of this paper is to assess the relevance of cryptocurrencies with regard to the money laundering risk on the market and to present widespread money laundering techniques and recognizable patterns of abuse. In addition, this paper aims to find an answer to the question to what extent the measures of the fifth EU Anti-Money Laundering Directive (AMLD) as well as other appropriate preventive measures are sufficient to reduce the money laundering risk in the area of virtual currencies (VC). Design/methodology/approach Firstly, the analysis requires a consideration of the theoretical foundations of money laundering methods, as well as a presentation of the technical foundations of cryptocurrencies and their ecosystem. Secondly, it is discussed to what extent VC are suitable for money laundering, which characteristics enable them to launder money and which new money laundering techniques result from this. In addition, a comparison of different money laundering risk classification is done in relation to VC from the perspective of different actors in the financial market. Findings Owing to their simple electronic storage and transferability, crypto assets pose a concrete risk of money laundering. Their inclusion in the fifth AMLD was therefore a necessary step by the European legislator. However, the question arises to whether the directive and the further preventive measures presented in this paper sufficiently fulfil the objective of reducing the money laundering risk in relation to VC. One positive aspect is the inclusion of the crypto custody business as a financial service in the German Banking Act. According to the definition in Section 1 (1a) sentence 2 no. 6, the offering of wallets is subject to authorization and the offering party becomes an obligated party within the meaning of the Germany Money Laundering Act. From a supervisory point of view, the new licensing requirement is very much welcomed, as the custody of private cryptographic keys entails considerable risks. However, non-custodian wallet providers who do not store the private keys of their users, are not covered. A closer analysis of the amending directive to the fourth EU AMLD reveals that other relevant players in the crypto market, such as mixer and tumbler services, are also not covered. Originality/value It is quite clear that cryptocurrencies and the blockchain technology will continue to accompany one in the coming years. Further credit institutions arising in the market exposed to the described risks will be seen. The paper will therefore present and evaluate possible risk reduction/options for anti-money laundering for new and existing financial institutions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae246c5de520d754131283aef703d1d7",
  "timestamp": "2025-05-15T02:46:44.903826"
}