{
  "id": 76,
  "title": "RETRACTED: Financial Default Risk Prediction Algorithm Based on Neural Network under the Background of Big Data (Retracted Article)",
  "abstract": "With the macroeconomy entering a new normal, many new problems are exposed in all walks of life, and the risk of default in the financial sector is also being exposed at an accelerated pace. In the context of big data, internet finance, as an important part of the financial market, also faces many risks in the process of its rapid development. Reasonable, scientific, and effective prediction and prevention of financial default risk have become a key link in the process of risk management practice in the nancial industry. Based on the powerful prediction function of the neural network, this paper combined neural network and chaos theory to construct a chaotic RBF neural network. It was applied to financial default risk prediction, which made the prediction accuracy and efficiency higher.The chaotic neural network solves the shortcomings of unstable prediction in the basic neural network and can comprehensively and accurately predict the financial default risk, so as to take measures to prevent risks. The experimental results of this paper show that the accuracy rate of the chaotic RBF neural network reaches 95%, while the accuracy rates of the BP neural network and the RBF neural network are 67% and 78%, respectively. Although the prediction accuracy of these two methods is also high, it is still not as high as the chaotic RBF neural network. Therefore, it is very meaningful to choose the chaotic RBF neural network to predict financial default risk in this paper.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae2a71036060a82335833c2d94459424",
  "timestamp": "2025-05-15T01:46:39.535147"
}