{
  "id": 6082,
  "title": "Social Determinants of Health Predict Sleep-Wake Disturbances Among Patients Living With Primary Brain Tumors: A Cross-Sectional Analysis",
  "abstract": "Introduction: Sleep disturbance (SD) and sleep-related impairment (SRI) significantly impact the lives of primary brain tumor (PBT) patients. We aimed to describe the prevalence of SD and SRI in this population, determine the reliability of the PROMIS-SD and PROMIS-SRI instruments, and identify predictive factors to support the development of targeted interventions for at-risk individuals. Methods: This cross-sectional study evaluated SD and SRI in PBT patients enrolled in a Natural History Study who completed 1-year follow-up questionnaires (N = 229). Demographic, clinical, and socioeconomic data were analyzed to identify factors associated with SD and SRI. Descriptive statistics were used to report the prevalence of sleep problems, and linear regression analysis was conducted to identify predictive factors. The reliability of sleep-related instruments was calculated using Cronbach's alpha. Results: Fifteen percent of PBT participants reported clinically significant SD and 20% reported clinically significant SRI, which were associated with financial toxicity (p < 0.001), being unemployed (p <= 0.02), and taking psychotropic medication (p <= 0.002). Good internal consistency was demonstrated by the SD (0.923) and SRI (0.925) questionnaires in this population. Conclusions: In this study, social factors such as financial toxicity and employment status were associated with SD and SRI. Psychotropic medications also impacted SD and SRI in PTB survivors, but less so than financial toxicity. Social factors and other medications may impact sleep more strongly in PBT survivors than their previous treatment courses. Implications for Cancer Survivors: SD and SRI can be impacted by multiple factors, including those not related to PBT treatment, which should be considered by their providers.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae43cad7e955584be3e2d9f1174cc6e2",
  "timestamp": "2025-05-15T02:54:38.788843"
}