{
  "id": 3383,
  "title": "Proposal for the classification on the Mexican Cooperative Financial Institutions based on Piotroski's F-score",
  "abstract": "The main objective of this research is to propose a new methodology for the classification of the Cooperative Savings and Loan Societies (SOCAPS) of Mexico that more efficiently reflects their financial situation, in order that savers and the sector's supervisory body have more reliable information about their soundness, and, in this way, the savings of the users of these entities is more protected. To do this, Piotroski (2000) F-score was adapted to the context of the SOCAPS in Mexico, thus evaluating three areas of the SOCAPS through eight indicators, which allow obtaining a rating that reflects the financial strength of these institutions; and, based on those ratings, segment them according to their financial strength. This methodology was used to analyze and classify 156 SOCAPS from Mexico, and compare the score of those that maintained their operations during the analysis period, with those that closed their operations. In this way, it was found that the SOCAPS with longer periods of time have on average a higher rating than the SOCAPS group that stopped operating, with which it can be concluded that the proposed methodology is effective as a classification criterion that serves to issue risk alerts, prudential measures and inform users about the soundness of the institution in which they deposit their assets.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae49b0c10059f6109237ea3498ca8c5d",
  "timestamp": "2025-05-15T02:25:40.158885"
}