{
  "id": 3550,
  "title": "MICROFINANCE AND THE MILLENNIUM DEVELOPMENT GOALS",
  "abstract": "In the last few decades microfinance has become one of the important tools of world poverty reduction. The paper is focused on analysing the effect of microfinance on the poverty levels in developing countries compared to world countries. As one of the main objectives of the United Nations Millennium development goals was to eradicate the extreme poverty, our paper observes the connection between the achievement of this goal at macroeconomic level and the expansion of microfinance worldwide by using multiple regression analysis. The main aims of the paper are to examine how the microfinance contributed to achievement of the Millennium development goals (mainly eradicating extreme poverty, the health improvement, gender equality and developing universal access of children to education) and to determine how the macroeconomic indicators and volume of microfinance loans influence the level of poverty in the observed developing and world countries. We compared the results of 73 world countries with 53 developing countries. The results of regression analysis show that in case of developing countries there has been proven the significance of relationship between the domestic credit provided by banking sector, gross domestic product, gross loan portfolio and poverty. The lower was the value of this variable the higher was the level of the poverty. However, in analysis of observed world countries only GDP per capita had some effect on poverty.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae55253b0e915a88ba41f4ec05004b66",
  "timestamp": "2025-05-15T01:18:20.529012"
}