{
  "id": 6184,
  "title": "The mediating role of life course cognitive reserve-enhancing factors in the relationship between adverse childhood experiences and dementia among older adults: evidence from a prospective cohort study in the United States",
  "abstract": "PurposeTo explore the relationship between adverse childhood experiences (ACEs) and incident dementia, and examine the mediating effect of cognitive reserve-enhancing factors from life course perspective. Further, we verified the heterogeneities of associations of ACEs, enhancing factors, and dementia by dementia genetic risk.MethodsData was from the US Health and Retirement Study, involving 51,327 observations (50+) with a 10-year follow-up. Dementia was determined by the modified Telephone Interview for Cognitive Status. Six ACEs were assessed from two dimensions namely financial adversity and childhood trauma. Cognitive reserve-enhancing factors were rated during three periods of life-course, namely early-life stage (educational attainment,), adulthood (household income) and late-life stage (weekly physical activity). Genetic risk was evaluated by polygenic risk score for Alzheimer's disease. Cox regression models were conducted to examine the association between ACEs and dementia risk where ACEs were deemed as a continuous variable. Mediation package in R was used to test the mediating effect. Subgroup analysis was conducted to verify the heterogeneity of dementia genetic risk.ResultsParticipants with one additional number of ACEs was associated with increased risk of dementia (HR = 1.08, 95% CI: 1.02, 1.16). The correlation of the number of ACEs and dementia was fully mediated by early-life stage enhancing factor and partially mediated by adulthood enhancing factor. The above mediating roles only exist among those with moderate and high dementia genetic risk.ConclusionExposure to a larger number of ACEs is significantly linked to dementia, and cognitive reserve-enhancing factors might mediate this association. Early interventions on the adverse life condition and emphasis on older adults with moderate and high genetic dementia risk were recommended.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae55daf5d6e2219c4f64a000101d7433",
  "timestamp": "2025-05-15T02:55:44.526092"
}