{
  "id": 8613,
  "title": "Exploring the drivers of modern slavery reporting quality in Indonesia",
  "abstract": "Vulnerability to modern slavery in Indonesia, particularly driven by poverty and discrimination against minority groups, has become a primary concern in the context of information transparency. This study aims to investigate the factors that can support the reporting quality of modern slavery in Indonesia, namely the industry sector, profitability, social responsibility commitment, and gender diversity as the moderating variable. The research utilized a sample of 225 companies listed on the Indonesia stock exchange (IDX) from 2020 to 2022. Data were collected from financial reports and sustainability reports as well as the Refinitiv Eikon database. Panel data regression analysis was conducted to analyze the determinants of the disclosure quality. The research findings indicate that high-risk industry sectors tend to disclose less information regarding modern slavery, with this outcome having a partially negative impact. However, profitability is not associated with the quality of voluntary modern slavery disclosure. In contrast, corporate responsibility commitment is positively associated. Additionally, this study reveals that gender diversity does not moderate the association between the industry sector, profitability, and corporate responsibility commitment with the disclosure quality of modern slavery. This research contributes to the growing literature on the accountability of modern slavery in an emerging country context through institutional theory and gender socialization theory lenses by identifying the firm-level factors to enhance corporate disclosure in this area. This study also contributes to corporate understanding of modern slavery issues within supply chains. With growing attention to this problem, the awareness of labor exploitation within corporate supply chains is also increasing. The findings of this research can assist companies in recognizing the importance of transparency and voluntary disclosure regarding modern slavery in their supply chains.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae5d9d4dad2e5e14529b2a5d2ac04875",
  "timestamp": "2025-05-15T03:20:55.825770"
}