{
  "id": 6094,
  "title": "IS COST A BARRIER TO SCREENING MAMMOGRAPHY FOR LOW-INCOME WOMEN RECEIVING MEDICARE BENEFITS - A RANDOMIZED TRIAL",
  "abstract": "Background: In 1991, Medicare began covering screening mammograms subject to copayment and deductible. This study evaluated the effectiveness of Medicare in removing financial barriers to screening mammography among low-income older women. Methods: In an inner-city public hospital's General Medicine Clinic, 119 consecutive, eligible, and consenting Medicare-enrolled women without known risk factors for breast cancer other than age, and no mammogram in the previous 2 years, were entered into a randomized controlled trial with follow-up after 2 months. The mean age was 71 years; 77% were black, 92% had an annual income below $10 000, and 52% had had a previous mammogram. Ail patients were counseled concerning indications for screening mammograms and Medicare coverage, and all were referred to a low-cost mammography facility. Sixty-one subjects were randomly assigned a voucher for a free screening mammogram at the referral facility. Obtaining a mammogram within 60 days of study entry was the main outcome measure. Results: Of the women given vouchers, 27 (44%) obtained screening mammograms, compared with six (10%) of those without vouchers (P<.001). Adjustment by multiple logistic regression confirmed this association, yielding an adjusted odds ratio of 7.4 (95% confidence interval, 2.5 to 21.4). Knowledge concerning mammography and breast cancer increased significantly overall (and within randomization groups) between initial interview and follow-up; fear did not change. For women without the voucher, the main reason for not obtaining a mammogram was financial; the main reason for women with the voucher was transportation. Conclusion: In a low-income, inner-city population of older women, financial barriers to screening mammography persist despite Medicare coverage.",
  "year": 1994,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae6bb11cb561bad6f121b27351fa5247",
  "timestamp": "2025-05-15T02:54:38.863422"
}