{
  "id": 8300,
  "title": "Corporate governance and voluntary disclosure: evidence from India",
  "abstract": "Purpose This study aims to examine the influence of some prominent corporate governance (CG) mechanisms such as board size (BS), board independence (BI), role duality (RD), board's gender diversity (GD), ownership concentration (OC), audit committee independence (ACI), nomination and remuneration committee (NRC) and risk management committee (RMC) on voluntary disclosure (VD), as well as different types of VD after controlling the effect of some firm-specific factors for Indian firms. Design/methodology/approach The study selects market capitalization-based top 100 non-financial and non-utility firms listed on the Bombay Stock Exchange as on 31st March 2014. Data are drawn from the Capitaline Plus database over the period of 2014-2018. Appropriate panel data regression model is applied to examine the influence of CG on VD. Findings The study reveals a significant negative influence of BI on VD while GD and RMC exhibit a significant positive influence on the same. The remaining CG mechanisms such as BS, RD, OC, ACI and NRC appear to have no significant influence on VD. Analysis into the relationship between CG mechanisms and different types of VD reveals that BI, in particular, has a strong negative influence on corporate strategic disclosure (CSD) and forward looking disclosure (FWLD) while GD and RMC both exhibit a significant positive influence on CSD, FWLD, CG disclosure and financial and capital market disclosure. Notably, none of the CG mechanisms under consideration influence human and intellectual capital disclosure. Research limitations/implications The study considers annual reports as the only medium of making VD and ignores all other sources such as websites and press releases. Besides, it mainly emphasizes on corporate board structure, board committees and OC while other ownership structure-related variables family ownership, managerial ownership are not covered, which can be analysed in future studies. Practical implications The study offers some important theoretical, as well as practical connotations for regulators and practitioners operating in India, as well as other emerging economies having similar institutional settings. Originality/value The study is the first of its kind in India that examines the influence of various CG mechanisms on different types of VD and thereby contributes novel findings in the context of an emerging economy.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae76fdef52375db6ae82c35698155d40",
  "timestamp": "2025-05-15T03:17:21.580066"
}