{
  "id": 1299,
  "title": "Classifying the minimum-variance surface of multiple-objective portfolio selection for capital asset pricing models",
  "abstract": "Portfolio selection is recognized as the birth-place of modern finance; Markowitz emphasizes computing whole efficient frontiers. Moreover, computing efficient sets has long been a topic in multiple-objective optimization. After portfolio selection, an important research direction is capital asset pricing models (CAPM). Black and Fama prove the existence of a unique zero-covariance portfolio on the minimum-variance frontier. By the zero-covariance relationship, Roll then classifies the minimum-variance frontier into a positive-covariance side and a negative-covariance side; Fama and Roll further prove zero-covariance CAPM. Recently, researchers gradually realize additional criteria and extend portfolio selection into multiple-objective portfolio selection. Consequently, the minimum-variance frontier extends to a minimum-variance surface. Moreover, the extension naturally raises questions of classifying the surface for multiple-objective CAPM. There has been no such research until now. In such an area, this paper contributes to the literature by extending the classification. We classify the surface into a positive-covariance side and a negative-covariance side, although the classification depends on specific portfolios and is thus non-uniform. We then analyze classification properties and extend relevant theorems by proposing conjectures, although the conjectures are disproved by theorems and counter-examples. Moreover, we forward the research methodology to general k-objective models, so research arenas for multiple-objective CAPM are opened. This paper brings researchers one step closer to classifying the minimum-variance surface and extending CAPM.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae767c0f50a9086542636d674466d8f9",
  "timestamp": "2025-05-15T00:54:24.612971"
}