{
  "id": 4938,
  "title": "The Role of the Rate of Profit Concept in Creating Islamic Financial Market Stability",
  "abstract": "This study aims to establish a concept of rate of profit on Islamic banking that can create economic justice and stability in the Islamic Financial Market. To determine the role of the rate of profit as the basis of the profit sharing system implemented in the Islamic financial system, we can see the connection of rate of profit in creating financial stability, especially in the assetliability management of financial institutions that generate a stable net margin or the rate of profit that is not affected by the ups and downs of the market risk factors, including indirect effect on interest rates. Based on the data collected approach, this kind of research is qualitative and quantitative research. In this research, a study-case research is held to see the effects of the use of indirect form of interest rate to the rate of profit of Islamic Bank in the period of rising interest-rate from the period of 20042009 in Bank Syariah Mandiri. The model used is a model with multiple regression analysis to determine the effect of independent factors on the Net of Profit Margin of Islamic Bank. The result from the statistical analysis shows a relationship of Net Profit Margin (NM) and its independent factors i.e. the Islamic Bank Balance Sheet Structure, SBI (Interest rate) and Bank's Capital. This research suggests the Islamic Bank to use rate of profit concept instead of rate of interest because it will inherently bring stability to Islamic Financial Market.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae785c8c91895c7d57e1b2ecc32703d9",
  "timestamp": "2025-05-15T02:42:36.179750"
}