{
  "id": 8518,
  "title": "Factors associated with equine shedding of multi-drug-resistant Salmonella enterica and its impact on health outcomes",
  "abstract": "BackgroundSalmonella enterica is an important cause of healthcare-associated infections in veterinary hospitals - with outbreaks of multi-drug resistant (MDR) Salmonella among equine cases resulting in high case fatality rates and substantial financial cost. ObjectivesStudy objectives were to 1) investigate factors associated with shedding of MDR-Salmonella enterica and 2) evaluate the effect shedding may have on health outcomes of previously hospitalised horses and their stablemates. Study designRetrospective case-control study with prospective cohort study. MethodsAnalysis of medical records (N=373; 94 culture positive, 279 culture negative) was undertaken to determine factors associated with shedding of MDR-Salmonella. Additionally, a follow-up study was conducted to assess long-term outcomes associated with shedding among previously hospitalised horses and their stablemates. Data regarding exposures of interest were collected retrospectively from medical records. Information on long-term outcomes was obtained by phone interview of owners. Multivariable regression techniques were used to investigate factors associated with shedding and subsequent health outcomes. ResultsHorses experiencing diarrhoea during hospitalisation were more likely to shed Salmonella (OR 1.88; 95% CI 1.02, 3.45) compared with horses without diarrhoea, but isolates tended to be susceptible strains. Antimicrobial therapy during hospitalisation was not associated with shedding or recovery of MDR strains. Shedding did not increase long-term risk for non-survival, colic or abnormal faeces after hospital discharge; nor increase risk for hospitalisation or occurrence of abnormal faeces in stablemates. Main limitationsData collection was reliant upon the quality of medical records and owner recall, which may have led to information bias. The study population was derived from central Kentucky and may differ from horse populations in other regions. Conclusions and clinical importanceIn general, Salmonella shedding was not associated with decreased average survival times or impacts to health of stablemates, perhaps due to owner implemented biosecurity precautions. Regardless, recently hospitalised horses should be segregated after discharge, in addition to employing rigorous hygiene practices. The Summary is available in Spanish - see Supporting Information.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae79affa4e9e26c0e79976299b495f0c",
  "timestamp": "2025-05-15T03:19:51.990433"
}