{
  "id": 6252,
  "title": "CEO experience and corporate financing decisions: Evidence from a natural experiment in China",
  "abstract": "Using the unique setting in China's economic transition and market reform, we investigate whether CEOs' experience regarding an economic boom affect corporate financing decisions. Economic booming, as a result of China's reform and open policy since 1978, affects individual risk preferences and decision behavior for those who grew up during the reform process. We find that Reform-and-Opening CEOs, who experience the reform and open-up era early in life, implement more aggressive capital structure policies and maintain higher leverage compared to Planned Economy CEOs. Furthermore, we determine that Reform-and-Opening CEOs tend to conduct debt issuance more frequently to cover financing needs as they can better deal with the liquidity risk of debt financing and confront the pressures arising from frequent monitoring by the debt markets. Using the stagewise regression, we find a cumulative effect of early growth experience. We also use the common trend test and placebo tests to deal with the concern that Reform and-Opening CEOs pursue significantly more aggressive financial policies relevant to the systematic differences. Additional tests rule out the possibility that our results are driven by industry competition, state ownership, and educational ideology.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae868c43e6d4b7b9ec69e9f59a93e6d0",
  "timestamp": "2025-05-15T02:56:11.047345"
}