{
  "id": 8332,
  "title": "A systematic approach to identify and manage supply chain risks in construction projects",
  "abstract": "PurposeThis study aims to comprehensively identify supply chain risks and their causes, the factors influencing supply chain management and techniques to successfully mitigate and control supply chain risks in construction projects. This study developed a comprehensive framework showing various supply chain risks and how these risks that influence project execution are systematically identified and managed for the overall construction project success.Design/methodology/approachThe research conducted was characterised by its descriptive, exploratory and quantitative nature. The collection of quantitative data was conducted by means of structured online questionnaires. The sample consisted of 205 construction project professionals who were selected randomly. This group included individuals with various roles in the construction industry, such as project managers, civil/structural engineers mechanical engineers, risk managers, architects, quantity surveyors, electrical engineers, construction managers, health, safety and environment managers, estate managers and other professionals. All participants were actively involved in construction projects located in the Gauteng province of South Africa. The data was analysed, using descriptive statistical methods, including factor analysis, reliability assessment and calculations of frequencies and percentages.FindingsThe result showed that predictable delivery, funding schedule, inventories, balanced demands, production capabilities, timely procurement, construction supply chain management coordination, delivery reliability, the proximity of suppliers, identification of supply chain risks in the conceptualisation stage of a project, identification of supply chain risks in the planning stage of a project, identification of supply chain risks in the execution stage and the reconciliation of material flows of the subcontractors with the contractors were identified as the key factors that influenced the construction supply chain management the most. The result also showed that subcontractor's negative attitudes towards supply chain management, procurement delays, imbalanced demands, clients' negative attitudes towards other project stakeholders, unpredictable delivery reliability, disorganised construction supply chain management approach, delayed funding, low delivery reliability, poor inventories, poor construction supply chain co-ordination, suppliers' negative attitudes towards supply chain management and when the material flows of the subcontractors with the contractors are not reconciled were identified as the factors that have the greatest impacts on construction supply chain risks management.Research limitations/implicationsFor future research, it is recommended to incorporate fourth industrial revolution) such as machine learning prediction models and algorithms, Artificial intelligence and blockchain to identify and manage supply chain, supply chain risks and project stakeholders involved in supply chain in construction projects. Green construction or sustainable construction was not fully covered in this study. The findings will be beneficial for sustainable construction projects in developing countries for sustainability, although it did not extensively cover green buildings and related risks. Practical implicationsSupply chain risk is one of the major challenges facing the construction industry because construction projects are complex by nature involving a lot of activities and participants with different responsibilities and tasks therefore it is highly recommended to implement the proposed frameworks in this paper from the conceptualisation stage to the execution stage, carefully identifying parties involved in supply chain, supply chain management, stakeholders, tasks, activities, responsibilities and supply chain risks generated as a result of the interactions between stakeholders involved in supply chain management and coordination to realise project objectives. The findings will be a foundation for identifying and managing supply risks in sustainable buildings in developing countries.Social implicationsSupply chain management is crucial in every enterprise. Managing supply chain risks is a major aspect of risk and disaster management and this implies that supply chain excellence is achievable by building communication, trust and mutual objectives, no blame culture, performance measurement, constant improvement and partnering.Originality/valueThe implementation of construction supply chain risk management framework involves assessing the impacts of these supply chain risks on the objectives of construction projects with respect to time, cost, safety, health, environment, stakeholders, financial performance, client satisfaction and quality.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae88fb9d44e9755bb02572b69dbba2e7",
  "timestamp": "2025-05-15T03:17:49.124989"
}