{
  "id": 7926,
  "title": "LOW SYSTOLIC BLOOD-PRESSURE AND SELF PERCEIVED WELLBEING IN MIDDLE-AGED MEN",
  "abstract": "Objective-To examine the relation between systolic blood pressure and self perceived wellbeing in 50 year old men. Design-Cross sectional population study of data derived from questionnaires and physical examination as a part of a cardiovascular risk factor survey. Setting-City of Gothenburg, Sweden. Study population-776 men from a random population sample of 1016 men aged 50. Methods-Self perceived wellbeing according to the Gothenburg quality of life questionnaire, which is an assessment of social, physical, and mental wellbeing in 15 different areas. Main results-Low systolic blood pressure was significantly (p < 0.05) related to impaired social wellbeing in four areas: work, home and family, financial situation, and housing. Of the items dealing with physical wellbeing, health, memory, and appetite were significantly related to blood pressure. As regards mental wellbeing, energy and self confidence were significantly related to systolic blood pressure. Diastolic blood pressure was significantly related to housing, memory, energy, patience, and self confidence. In multiple regression analyses that controlled for smoking, stress, physical activity, social activity, and emotional support, poor social, physical, and mental wellbeing were all significantly related to low systolic blood pressure independently of other factors. Low diastolic blood pressure was independently associated with poor physical and mental, but not social, wellbeing. Conclusion-Low systolic blood pressure was associated with poor perception of wellbeing in several areas. The cause is unclear.",
  "year": 1993,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae8edf2922024cf41cf3676d4c8f4529",
  "timestamp": "2025-05-15T03:13:30.658795"
}