{
  "id": 5283,
  "title": "Tech for stronger financial market performance: the impact of AI on stock price crash risk in emerging market",
  "abstract": "PurposeThe increasing awareness and adoption of technology, particularly artificial intelligence (AI), reshapes industries and daily life, fostering a proactive approach to risk management and leveraging advanced analytics, which may affect the stock price crash risk (SPCR). The main objective of the current study is to explore how AI adoption influences SPCR.Design/methodology/approachThis study employs an Ordinary Least Squares (OLS) fixed-effect regression model to explore the impact of AI on SPCR in Chinese A-share listed companies from 2010 to 2020. Further, number of robustness analysis (2SLS, PSM and Sys-GMM) and channel analysis are used to validate the findings.FindingsThe primary findings emphasize that AI adoption significantly reduces SPCR likelihood. Further, channel analysis indicates that AI adoption enhances internal control quality, contributing to a reduction in firm SPCR. Additionally, the observed relationship is notably more pronounced in non-state-owned enterprises (non-SOEs) compared to state-owned enterprises (SOEs). Similarly, this distinction is heightened in nonforeign enterprises (non-FEs) as opposed to foreign enterprises (FEs). The study finding also supports the notion that financial analysts enhance transparency, reducing the SPCR. Moreover, the study results consistently align across different statistical methodologies, including 2SLS, PSM and Sys-GMM, employed to effectively address endogeneity concerns.Research limitations/implicationsOur study stands out for its distinctive focus on the financial implications of AI adoption, particularly how it influences firm-level SPCR, an area that has been overlooked in previous research. Through the lens of information asymmetry theory, agency theory, and the economic implications of integrating AI into financial markets, our study makes a substantial contribution in mitigating SPCR.Originality/valueThis study underscores the pivotal role of AI adoption in influencing stock markets for enterprises in China. Embracing digital strategies, fostering transparency and prioritizing talent development are key for reaping substantial benefits. The study recommends regulatory bodies and service providers to promote AI adoption in strengthening financial supervision and ensure market stability, emphasizing the importance of investing in technologies and advancing talent development.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ae98fd4145c75bf122dec981ec85e9a6",
  "timestamp": "2025-05-15T02:46:16.215705"
}