{
  "id": 5385,
  "title": "Litigation Risk: Delving into Audit Quality, Internal Audit Structure, Political Connections, and Company Size",
  "abstract": "This study investigates the impact of audit quality, internal audit organizational structure, political connections, and company size on litigation risk in the consumer goods industry sector listed on the Indonesia Stock Exchange during the period from 2017 to2022. A quantitative approach was used by applying Fixed Effects, Ordinary Least Squares, Random Effects, and Robust Regression analysis simultaneously to analyze panel data. The results showed that high audit quality serves as a significant positive signal in reducing the risk of lower litigation, providing confidence to stakeholders that financial statements can be more reliable and free from material misstatement. Meanwhile, a better internal audit organizational structure introduces complexity in the management of litigation risk as the organization grows, highlighting the possibility of more complicated implications in the context of signals, when internal audit placement does not fit the needs of the organization. Political connections and company size provide positive signals regarding litigation risk, albeit with different levels of significance, indicating complexity in the dynamics of political signals and company size. The findings of this study can guide stakeholders in the appointment of agents to manage the company.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aea6f231403df396cdc951d3b64b4111",
  "timestamp": "2025-05-15T02:47:13.964508"
}