{
  "id": 4303,
  "title": "Swarm intelligence based classification rule induction (CRI) framework for qualitative and quantitative approach: An application of bankruptcy prediction and credit risk analysis",
  "abstract": "Bankruptcy prediction and credit risk analysis is one of the most significant problems in the field of accounting and financial decision making. Developing an effective classification rule induction (CRI) framework for bankruptcy prediction and credit risk analysis in appropriate time is essential to prevent the business communities from being bankrupt. Traditional statistical methods and artificial intelligence techniques play a major role to predict bankruptcy and credit risks. Most of the earlier research works were carried out on quantitative methods, while few studies have proposed on qualitative methods to improvise the performance of bankruptcy prediction models. The discovery of bankruptcy prediction in a qualitative way is an important task because it depends on the subjective knowledge of the experts. In this paper, a unified framework for qualitative and quantitative bankruptcy analysis using Ant Colony Optimization (ACO) based ant-miner algorithm is proposed. Three different natured datasets are used to present a trustworthy result. For this experiment, we have collected qualitative_bankruptcy dataset and benchmarked by UCI repository. The proposed method is successfully applied and the performance analysis prove that ant-miner method is better than existing classifiers namely Logistic Regression (LR), Multilayer Perceptron (MLP), Random Forest (RF) and Radial Basis Function (RBF) in terms of various performance analysis factors. Furthermore, the proposed ant-miner model is found to be a more suitable method for bankruptcy prediction when compared to other traditional statistical and artificial intelligence techniques. (C) 2017 The Authors. Production and hosting by Elsevier B.V. on behalf of King Saud University.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aeb98d441a2bb807b2798f1de7018e0c",
  "timestamp": "2025-05-15T02:35:26.343140"
}