{
  "id": 7193,
  "title": "International Classification System for Ocular Complications of Anti-VEGF Agents in Clinical Trials",
  "abstract": "Purpose: Complications associated with intravitreal anti-VEGF therapies are reported inconsistently in the literature, thus limiting an accurate evaluation and comparison of safety between studies. This study aimed to develop a standardized classification system for anti-VEGF ocular complications using the Delphi consensus process. Design: Systematic review and Delphi consensus process. Participants: Twenty-five international retinal specialists participated in the Delphi consensus survey. Methods: A systematic literature search was conducted to identify complications of intravitreal anti-VEGF agent administration based on randomized controlled trials (RCTs) of anti-VEGF therapy. A comprehensive list of complications was derived from these studies, and this list was subjected to iterative Delphi consensus surveys involving international retinal specialists who voted on inclusion, exclusion, rephrasing, and addition of complications. Furthermore, surveys determined specifiers for the selected complications. This iterative process helped to refine the final classification system. Main Outcome Measures: The proportion of retinal specialists who choose to include or exclude complications associated with anti-VEGF administration. Results: After screening 18 229 articles, 130 complications were categorized from 145 included RCTs. Participant consensus via the Delphi method resulted in the inclusion of 91 complications (70%) after 3 rounds. After incorporating further modifications made based on participant suggestions, such as rewording certain phrases and combining similar terms, 24 redundant complications were removed, leaving a total of 67 complications (52%) in the final list. A total of 14 complications (11%) met exclusion thresholds and were eliminated by participants across both rounds. All other remaining complications not meeting inclusion or exclusion thresholds also were excluded from the final classification system after the Delphi process terminated. In addition, 47 of 75 proposed complication specifiers (63%) were included based on participant agreement. Conclusions: Using the Delphi consensus process, a comprehensive, standardized classification system consisting of 67 ocular complications and 47 unique specifiers was established for intravitreal anti-VEGF agents in clinical trials. The adoption of this system in future trials could improve consistency and quality of adverse event reporting, potentially facilitating more accurate risk-benefit analyses. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology 2024;131:1457-1467 (c) 2024 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aece92d4d2e018aa39bbbf5e254072b8",
  "timestamp": "2025-05-15T03:06:01.258087"
}