{
  "id": 3863,
  "title": "Asymmetric effects of market uncertainties on agricultural commodities",
  "abstract": "The interplay between energy and agricultural commodities and the responses of agricultural commodities to global uncertainty factors have been receiving increasing attention due to the pivotal contributions of commodity markets to the world economy. This study investigates the asymmetric effects of oil, market volatility and sentiment, economic policy uncertainty, and geopolitical risk on agricultural commodities in a nonparametric quantile-on-quantile regression framework. The sample used for empirical analysis spans January 03, 2013, to October 21, 2022, and includes ten agricultural commodities (canola, cocoa, coffee, corn, feeder cattle, lean hogs, live cattle, orange juice, sugar, and wheat), crude oil, crude oil implied volatility (OVX), market sentiment (VIX), economic policy uncertainty of the US (USEPU), and geopolitical risk (GPR). The empirical findings suggest that crude oil fails to serve as either a hedge or safe-haven for agricultural commodities. Meanwhile, OVX and VIX serve as potential hedges against agricultural commodity shocks. At elevated levels of USEPU, agricultural commodities reveal only weak hedging capacities against the USEPU-driven downside risks and mostly act just as diversifiers of economic policy uncertainty effects. However, they could hedge against the crystallisations of the downside geopolitical risks. These findings are important for effective regulation policies, risk management, and portfolio decisions across bullish, bearish, and normal market conditions.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aed08f48a669f7a05754798b534b6110",
  "timestamp": "2025-05-15T01:21:41.350249"
}