{
  "id": 8265,
  "title": "Health-related behaviors and symptoms of anxiety and depression in Spanish nursing students: an observational study",
  "abstract": "BackgroundSymptoms of anxiety and depression are prevalent among young adults and are a significant public health issue. College students are at a higher risk of experiencing poor mental health than other young people due to several factors, including moving away from home, financial pressures, heavy workload, poor time management skills, competitivity, new processes of socialization and insufficient coping mechanisms, among others. In addition, nursing students' mental and physical health may also be affected by unhealthy lifestyle habits and health-related behaviors.AimTo determine the prevalence of symptoms of depression and anxiety, and the association between these symptoms and health-related behaviors, in a population of Spanish student nurses.MethodsCross-sectional study on a sample of 339 nursing students. We used the Hospital Anxiety and Depression Scale, the International Physical Activity Questionnaire-Short form, the Spanish Healthy Eating Index and an ad hoc questionnaire for sociodemographic variables. The association between psychological symptoms and health-related behaviors was analyzed through binary logistic regression models.ResultsThe prevalence of symptoms of depression and anxiety was 3.8% and 24.5%, respectively. Negative health-related behaviors were frequent, namely tobacco and alcohol consumption, suboptimal physical activity and diet. Moderate physical activity was associated with a lower probability of experiencing depressive symptoms. Symptoms of anxiety were related to a low level of physical activity, an unhealthy diet and alcohol consumption >= 2 times a week.ConclusionStudent nurses could benefit from the implementation of both physical and mental health promotion initiatives.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aeda7e5435de7443c0edef4239b698cf",
  "timestamp": "2025-05-15T03:17:21.429668"
}