{
  "id": 9284,
  "title": "Effectiveness of a Mobile Health Intervention (DOT Selfie) in Increasing Treatment Adherence Monitoring and Support for Patients With Tuberculosis in Uganda: Randomized Controlled Trial",
  "abstract": "Background: Directly observed therapy (DOT) is the standard method for monitoring adherenceto tuberculosis (TB) treatment. However, implementing DOT poses challenges for both patients and providers due to limited financial and human resources. Increasing evidence suggests that emerging digital adherence technologies, such as video directly observed therapy (VDOT), can serve as viable alternatives. Objective: This studyaims toevaluatetheeffectivenessofVDOT compared with usual care directly observed therapy (UCDOT). Methods: Between July 2020 and October 2021, we conducted a 2-arm, parallel-group, open-label randomized trial with a 1:1 assignment to receive either the VDOT intervention (n=72) or UCDOT (n=72) for treatment adherence monitoring at public health clinics in Kampala, Uganda. Each group was further stratified to ensure equal numbers of males and females. Eligible patients were aged 18-65 years, had a confirmed diagnosis of TB, and were undergoing daily treatment. The VDOT group was provided with a smartphone equipped with an app, while the UCDOT group followed the routine monitoring practices outlined by the Uganda National TB Program. We tested the hypothesis that VDOT was more effective than UCDOT for monitoring medication adherence. The primary outcome was adherence, defined as having >= 80% of the expected doses observed during the 6-month treatment period. An intention-to-treat analysis was conducted, and multivariable logistic regression was used to estimate the effect of the intervention on adherence monitoring. Adjusted relative risk ratios and their corresponding 95% CIs are presented. Secondary outcomesincluded treatment completion, loss to follow-up, death, and reasons for missed videos in the intervention group. Results: The intention-to-treat analysis included 142 participants, with 2 excluded due to discontinuation of medication within thefirst week after enrollment. The median age of participants was 34 (IQR 26-45) years. The median fraction of expected doses observed (FEDO) was significantly higher in theVDOT group compared with the UCDOT group (100, IQR 80-100 vs 30, IQR 10-60, respectively; P<.001). When using a FEDO cutoff of >= 80% to define optimal adherence, 63 of 142 (44%) patients met thethreshold, with a significant difference between theVDOT and UCDOT groups (56/71, 79% vs 7/71, 10%, P<.001). After adjusting for confounders, VDOT users were significantly more likely to achieve >= 80% of their expected doses observed compared with UCDOT users (adjusted risk ratio 8.4, 95% CI 4.16-17.0). The most common reasons for failing to submit videos of medication intake were an uncharged phone battery, forgetting to record videos during medication intake, and losing the smartphone. Conclusions: Enhanced VDOT was more effective than UCDOT in increasing adherence monitoring among patients with TB in Uganda. This evidence highlights the potential of digital technologies to improve treatment adherence monitoring and support in high TB burden settings with limited human resources. Trial Registration: ClinicalTrials.gov NCT04134689; http://clinicaltrials.gov/ct2/show/NCT04134689",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aee95f50c508ffffbbc7e0188f23ee5d",
  "timestamp": "2025-05-15T03:27:24.973008"
}