{
  "id": 7762,
  "title": "The Standardized Credit Rating Grade for Malaysian Listed Companies in Bursa Malaysia",
  "abstract": "The rating grade for a corporate company usually proceeds with a request from the potential clients or company to perform that rating grade by rating agencies. In addition, the request for the rating grade should be made in advance so that rating agencies have their sufficient time for the rating process. Here, not all companies have been graded by rating agencies unless the companies request to be graded. Hence, the rating grade needs to be done by using the KMV-Merton model so that any corporate company that do not have rating grade by rating agencies can be evaluated. Besides, this rating grade can be used as a credit scoring by financial institutions in monitoring credit risk, especially in loan approving cases in case the companies do not have their rating grade from rating agencies. Thus, this study has developed the standardized credit rating grade by using the KMV-Merton model as well as verifying the standardized credit rating grade with the rating grade issued by Malaysian Rating Corporation (MARC) and RAM Holdings Berhad (RAM) to show how strongly pairs of both rating grades are related. Here, after adapting the KMV-Merton model, then this study has proposed the standardized credit rating grade. However, there are overlapping problem and gapping problem between the ranges of the default probabilities for each of the standardized credit rating grade. Therefore, this study has adapted the K-Mean clustering so that the overlapping problem and gapping problems can be solved. As a result, this study has developed the standardized credit rating grade and this study shows a close correlation between the rating grades issued by MARC and RAM with the standardized credit rating grade.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aeebeb99dfc42e4706c2b5b1a6e45511",
  "timestamp": "2025-05-15T03:11:38.596146"
}