{
  "id": 7493,
  "title": "Socioeconomic disparities in the mental health of Indigenous children in Western Australia",
  "abstract": "Background: The burden of mental health problems among Aboriginal and Torres Strait Islander children is a major public health problem in Australia. While socioeconomic factors are implicated as important determinants of mental health problems in mainstream populations, their bearing on the mental health of Indigenous Australians remains largely uncharted across all age groups. Methods: We examined the relationship between the risk of clinically significant emotional or behavioural difficulties (CSEBD) and a range of socioeconomic measures for 3993 Indigenous children aged 4-17 years in Western Australia, using a representative survey conducted in 2000-02. Analysis was conducted using multivariate logistic regression within a multilevel framework. Results: Almost one quarter (24%) of Indigenous children were classified as being at high risk of CSEBD. Our findings generally indicate that higher socioeconomic status is associated with a reduced risk of mental health problems in Indigenous children. Housing quality and tenure and neighbourhood-level disadvantage all have a strong direct effect on child mental health. Further, the circumstances of families with Indigenous children (parenting quality, stress, family composition, overcrowding, household mobility, racism and family functioning) emerged as an important explanatory mechanism underpinning the relationship between child mental health and measures of material wellbeing such as carer employment status and family financial circumstances. Conclusions: Our results provide incremental evidence of a social gradient in the mental health of Aboriginal and Torres Strait Islander children. Improving the social, economic and psychological conditions of families with Indigenous children has considerable potential to reduce the mental health inequalities within Indigenous populations and, in turn, to close the substantial racial gap in mental health. Interventions that target housing quality, home ownership and neighbourhood-level disadvantage are likely to be particularly beneficial.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aef61756cbf3556251caff9bff2f34f3",
  "timestamp": "2025-05-15T03:09:07.309526"
}