{
  "id": 4496,
  "title": "Can Fulfilling Sports Corporate Social Responsibility Serve as an Immunity During the COVID-19 Pandemic? A Perspective From Social Capital and Corporate Financial Performance",
  "abstract": "The severe acute respiratory syndrome coronavirus 2 (COVID-19) has significantly impacted the global economy. Presently, societies and businesses are facing unprecedented environmental shifts, with the sports industry being caught in this tumultuous tide. COVID-19 has affected all sectors of the global economy, suggesting an urgent need for most enterprises to reconsider their business models. This study investigates the advantages of corporate social responsibility (CSR) engagement during the negative external events of the COVID-19 pandemic, focusing specifically on the relationship between sports CSR and corporate financial performance and risk. Its objective is to provide empirical evidence on how sports CSR activities influence firm value, especially when facing systemic risks, and determine whether engaging in sports CSR serves as an effective protective tool against stock price decline. Methodologically, this study targets 159 companies that have received the Taiwan's iSport Corporate Award over the years, employing the event study method and regression modeling to analyze the insurance effect of executing sports CSR on corporate financial performance during the COVID-19 pandemic. By offering empirical evidence on the relationship between CSR implementation and financial performance, this study contributes to a deeper understanding of the interconnectedness between sports CSR engagement and corporate financial outcomes, further enriching research in the realm of sports finance.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aef8e35d38585d59320556b2f0535cdc",
  "timestamp": "2025-05-15T02:37:47.559959"
}