{
  "id": 8758,
  "title": "Assessing oral health-related quality of life among older people in home-based care - survey results of the InSEMaP study in Germany",
  "abstract": "BackgroundOlder people receiving home-based care (HBC) often face barriers to access preventive oral health care (OHC) and dental treatments. Leading to deterioration of their oral healthcare. It is further deteriorated by factors such as increasing burden of systemic diseases, medicinal side effects, limited mobility, financial constraints and lack of professional OHC at home. Older people also struggle to maintain necessary daily oral hygiene, leading to malnutrition, weight loss, and a risk of a further health degradation. This cross-sectional survey aimed to investigate the oral health-related quality of life (OHRQoL) and their associated factors in HBC recipients.Methods5,280 older people (>= 60 years) living in Hamburg, who were in need of care and insured with statutory health insurance DAK-Gesundheit received the questionnaire, which included the German version of the Oral Health Impact Profile (OHIP G-14) and, the EQ-5D health-related quality of life (HRQoL) measure as well as further questions regarding the extent of informal social support, subjective oral health status, oral health behaviour, subjective cognitive status, and socio-demographic variables.ResultsThe participants (n = 1,622) had a median age of 83.2 years, with 72.0% of the sample being female. Nearly two thirds of the sample reported that their independence or abilities were significantly impaired (care level 2). Regarding oral health impacts, 40.0% of the participants reported experiencing at least one of the fourteen possible prevalent impacts of the OHIP-G14 fairly often or very often. A multivariate regression model on the severity of oral health impacts revealed, that a better HRQoL, a positive perception of one's own dental status, fewer visits to dental practices, and no need for support in OHC were associated with better OHRQoL. Conversely, respondents with a negative perception of their oral health status, more frequent visits to a dental practice, a need for support in OHC, and subjective memory impairment showed poorer OHRQoL.ConclusionsThe results highlight the risk for poor oral health among older people in HBC. We conclude that there is an urgent need to prioritise oral health, especially as poor oral health can further compromise the systemic wellbeing of these already care dependent population.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "aef91fabe061a86fa5328d0b07b41b78",
  "timestamp": "2025-05-15T03:21:56.754413"
}