{
  "id": 8240,
  "title": "The role of psychological factors on vehicle kilometer travelled (VKT) for battery electric vehicle (BEV) users",
  "abstract": "Electric vehicles (EVs) are related to various symbols, identities, and beliefs, and are considered much more than a means of transport. Existing literature has investigated the contribution of financial incentives and various psychological factors to the EV purchase decision. However, few studies investigate the effect of psychological factors on post-purchase EV use. We emphasize that the ultimate success in the widespread acceptance of EVs depends acutely on their post-purchase use. This study empirically addressed the effect of perceived attributes related to EVs, perceived accidental risk, self-environmental identity, and general environmental beliefs on the annual vehicle kilometres travelled (VKT) by battery electric vehicle (BEV) owners. Drivers who own only BEVs and those who own both internal combustion engine vehicles and BEVs were compared to identify the role of psychological factors in BEV use in a Norwegian sample. The dataset was analysed using an ordinary least squared regression model. The socio-demographic characteristics and mobility patterns of the two groups are investigated. The findings indicate that economic aspects are positively associated with annual VKT for sole BEV owners, whereas perceived operating barriers have a negative effect on annual VKT for the other group. The results suggest the inclusion of psychological factors in predicting a more precise model of the induced travel demand of EV owners, which, in turn, is necessary to estimate energy demand accurately and to take steps in establishing the required infrastructure.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af0b617c74ae338267ef8ee6584ca326",
  "timestamp": "2025-05-15T03:16:48.977602"
}