{
  "id": 7256,
  "title": "Prevalence of depression and associated factors among critically ill pregnant women in Palestine",
  "abstract": "Background Depression during pregnancy poses significant challenges for both the mother and fetus, especially in cases where pregnancy complications become life-threatening. Recognizing the prevalence and risk factors associated with prenatal depression in critically ill pregnant women is essential, particularly in resource-limited settings like Palestine. Methods A cross-sectional study was conducted among 304 critically ill pregnant women in eight Palestinian hospitals between January and March 2024. Data were collected through the Clinically Useful Depression Outcome Scale (CUDOS) and analyzed using SPSS Version 25. Descriptive statistics and multiple regression were applied to identify significant factors associated with depression severity. Results The study found high levels of prenatal depression, with a mean CUDOS score of 55.72. Frequent crying (51%) and persistent fatigue (42.4% always, 41.1% sometimes) were common symptoms. Financial instability (p = 0.003), history of miscarriage (p = 0.005), unintended pregnancies (p = 0.001), and residing in rented housing (p = 0.004) were significant predictors, explaining a substantial variance in depression scores (adjusted R-2 = 0.56, p < 0.001). Conclusions These results underscore the importance of routine mental health evaluations for critically ill pregnant women. Early detection and targeted interventions can improve outcomes for both mothers and their babies, offering essential insights for healthcare providers and policymakers. Practice implicationsIncorporating mental health screening and support within maternal care programs in Palestine can help mitigate depression among high-risk pregnant women, improving maternal and fetal health outcomes.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af0b46a5a6cbb2c4de208a89efbf7da7",
  "timestamp": "2025-05-15T03:06:35.446140"
}