{
  "id": 9159,
  "title": "Community and Hospital Factors Associated With Stroke Center Certification in the United States, 2009 to 2017",
  "abstract": "IMPORTANCE The increased number of stroke centers in the United States may not be equitably distributed across all populations. Anecdotal reports suggest there may be differential proliferation in wealthier and urban communities. OBJECTIVE To examine hospital characteristics and economic conditions of communities surrounding hospitals with and without stroke centers. DESIGN, SETTING, AND PARTICIPANTS This cohort study included all general, short-term, acute hospitals in the continental United States and used merged data from the Joint Commission, Det Norske Veritas, Healthcare Facilities Accreditation Program, state health departments, the Centers for Medicare & Medicaid Services, the American Hospital Association, the Dartmouth Atlas of Health Care, and the US Census Bureau from January 1, 2009, to September 30, 2017, to compare hospital and community characteristics of stroke-certified and non-stroke-certified hospitals and assessed characteristics of early and late adopters of stroke certification. MAIN OUTCOMES AND MEASURES Stroke center certification was the primary outcome. Risk factors were grouped into 3 categories: economic and financial, hospital, and community characteristics. Survival analyses were performed using a Cox proportional hazards regression model. RESULTS The study included 4546 US hospitals. During the study period, 1689 hospitals (37.2%) were stroke certified (961 adopted certification on or before January 1, 2009, 728 afterward). After controlling for other area and hospital characteristics, hospitals in low-income hospital service areas and the lower tertile of profit-margin distribution were less likely to adopt stroke certification (hazard ratio [HR], 0.62; 95% CI, 0.52-0.74 and HR, 0.87; 95% CI, 0.78-0.98, respectively). Urban hospitals had a higher likelihood of stroke certification than rural hospitals (HR, 12.79; 95% CI, 10.64-15.37). CONCLUSIONS AND RELEVANCE This study found that stroke centers have proliferated unevenly across geographic localities, where hospitals in high-income hospital service areas and with higher profit margins have a greater likelihood of being stroke certified. These findings suggest that market driven factors may be associated with stroke center certification.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af2fd519dc3dc258e5b2482b5b4b4f01",
  "timestamp": "2025-05-15T03:25:54.683970"
}