{
  "id": 1649,
  "title": "Business strategy and classification shifting: Indian evidence",
  "abstract": "Purpose This study aims to investigate the impact of business strategy on the classification shifting practices of Indian firms. Design/methodology/approach The study considered cost leadership and differentiation strategy. Two forms of classification shifting, namely, expense misclassification and revenue misclassification have been examined in this study. Panel data regression models are used to analyze the data for this study. Findings The results show that managers of cost leadership strategy firms are more likely to be engaged in expense misclassification, whereas firms following differentiation strategy are likely to be engaged in revenue misclassification. Subsequent tests of this study suggest that firms following a hybrid strategy (mix of cost leadership and differentiation) prefer revenue misclassification over expense misclassification for reporting inflated operating performance. These results imply that firms prefer the shifting tool based on the ease and need of each shifting strategy. These results are consistent with several robustness measures. Practical implications The results suggest that investors should understand business strategy before developing insights about the accounting quality of firms. Investors should conduct a comprehensive review of income statement items before using items for portfolio evaluation. Originality/value To the best of the authors' knowledge, this is the first study to examine the association between business strategy and classification shifting.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af49e5b291cea3cba12306c0053567e3",
  "timestamp": "2025-05-15T00:58:18.218414"
}