{
  "id": 6530,
  "title": "Multidrug resistant tuberculosis in Iceland - case series and review of the literature",
  "abstract": "Background: Multidrug resistant tuberculosis (MDR-TB) is a growing health problem in the world. Treatment outcomes are poorer, duration longer and costs higher. We report three cases of MDR-TB diagnosed in Iceland in a six year period, 2003-8. Case descriptions: The first case was a 23-year-old immigrant with a prior history of latent TB infection treated with isoniazid. He was admitted two years later with peritoneal MDR-TB. He was treated for 18 months and improved. The second case was a 23-year-old immigrant diagnosed with pulmonary MDR-TB after having dropped out of treatment in his country of origin. Clinical and microbiological response was achieved and two years of treatment were planned. The third case involved a 27-year-old asymptomatic woman diagnosed with MDR-TB on contact tracing, because of her brother's MDR-TB. 18 months of treatment were planned. Conclusions: Clustering of cases of MDR-TB in the last six years, accounting for almost 5% of all Icelandic TB cases in the period, suggests that an increase in incidence might be seen in Iceland in coming years. The infection poses a health risk to the patients and the general public as well as a financial burden on the health care system. Emphasis should be put on rapid diagnosis and correct treatment, together with appropriate immigration screening and contact tracing.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af56f1f57e747ba24253afcc913d5e98",
  "timestamp": "2025-05-15T02:59:07.485369"
}