{
  "id": 6637,
  "title": "Development of renewable energy resources by green finance, volatility and risk: Empirical evidence from China",
  "abstract": "Green finance and investment in renewable energy (RE) sources are two of the most important climate change strategies that might have a long-term impact. Micro-and macro-level data from 2010 to 2021 in China used to gain a new analysis of the impact of green finance, inflationary pressures, and geopolitical risk in improving sustainability. Regression estimation methods were used to tackle this while considering direct and indirect associations between the parameter estimates. According to recent research, environmental taxes, such as those on carbon emissions, have been shown to have a large and favorable effect on profitability in RES. The volatility of oil prices and geopolitical risk, on the other hand, has a negative influence on the investment pattern for sustainable energy sources in China. The research also shows that green rules have a significant role in reducing the impact of green finance on RE production. Green companies in China should be pushed so that RE in-vestments are regarded as a long-term strategy, according to the conclusions of the research. The study's theoretically, and empirically conclusions have supplied policymakers and environmentalists with useful in-formation for developing and implementing environmental initiatives with long-term financial benefits.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af56c0750212f465bf5f2570b1227afd",
  "timestamp": "2025-05-15T03:00:05.008347"
}