{
  "id": 7537,
  "title": "Adverse childhood experiences and their impacts on subsequent depression and cognitive impairment in Chinese adults: A nationwide multi-center study",
  "abstract": "Background: Adverse childhood experiences (ACES) are prevalent and have long-lasting effects. This study explored how ACE exposure is associated with subsequent depression and cognitive impairment and whether sociodemographic characteristics modify that association.Method: This study used data on 14,484 participants of the 2015 China Health and Retirement Longitudinal Study (CHARLS) and 2014 CHARLS life history survey. Depression was assessed using the 10-item Center for Epidemiologic Studies Depression scale. Cognitive performance was evaluated via three composite measures: episodic memory, mental intactness, and global cognition. Twelve ACE indicators were measured using a vali-dated questionnaire. Multiple regression models and stratified analyses explored the relationship between ACES and subsequent depression and cognitive impairment, as well as potential modifiers.Results: Compared with individuals without ACES, those who experienced four or more ACES had a higher risk of subsequent depression (adjusted odds ratio, aOR = 2.65, 95 % confidence intervals [CIs]: 2.21 to 3.16), poorer mental intactness (beta =-0.317 [-0.508 to-0.125]), and worse global cognition (-0.437 [-0.693 to-0.181]). Trend analyses showed a dose-response association between accumulated ACES and subsequent depression and cognitive impairment. No modifications of those associations by age, sex, educational level, or family's financial status during childhood were observed.Limitations: Self-reported measures could favour recall bias.Conclusion: Our study suggests that ACES increase the risk of subsequent depression and cognitive impairment in Chinese adults regardless of sociodemographic characteristics. These findings provide important implications for mitigating the adverse effects of early-life stress and promoting health in adulthood.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af5615f1ec5ffd777d0ddb57ba4bab74",
  "timestamp": "2025-05-15T03:09:36.904606"
}