{
  "id": 8380,
  "title": "Changes in the behavioural determinants of health during the COVID-19 pandemic: gender, socioeconomic and ethnic inequalities in five British cohort studies",
  "abstract": "Background The COVID-19 pandemic is expected to have far-reaching consequences on population health. We investigated whether these consequences included changes in health-impacting behaviours which are important drivers of health inequalities. Methods Using data from five representative British cohorts (born 2000-2002, 1989-1990, 1970, 1958 and 1946), we investigated sleep, physical activity (exercise), diet and alcohol intake (N=14 297). We investigated change in each behaviour (pre/during the May 2020 lockdown), and differences by age/ cohort, gender, ethnicity and socioeconomic position (childhood social class, education attainment and adult financial difficulties). Logistic regression models were used, accounting for study design and non-response weights, and meta-analysis used to pool and test cohort differences in association. Results Change occurred in both directions-shifts from the middle part of the distribution to both declines and increases in sleep, exercise and alcohol use. Older cohorts were less likely to report changes in behaviours while the youngest reported more frequent increases in sleep, exercise, and fruit and vegetable intake, yet lower alcohol consumption. Widening inequalities in sleep during lockdown were more frequent among women, socioeconomically disadvantaged groups and ethnic minorities. For other outcomes, inequalities were largely unchanged, yet ethnic minorities were at higher risk of undertaking less exercise and consuming lower amounts of fruit and vegetables. Conclusions Our findings provide new evidence on the multiple changes to behavioural outcomes linked to lockdown, and the differential impacts across generation, gender, socioeconomic circumstances across life, and ethnicity. Lockdown appeared to widen some (but not all) forms of health inequality.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af5804ff39f8adbd8b890cd0792ab1d4",
  "timestamp": "2025-05-15T03:18:19.557516"
}