{
  "id": 9225,
  "title": "Gender differences in the association between adverse childhood experiences and premature mortality: A prospective population study",
  "abstract": "Background: Birth cohort studies have shown that adverse childhood experiences (ACEs) are associated with all-cause mortality. The effect of ACEs on premature mortality among workingage people is less clear and may differ between the genders. Objective: In this prospective population study, we investigated the association of ACEs with allcause mortality in a working-age population. Participants and methods: In a representative Finnish population study, Health 2000, individuals aged 30 to 64 years were interviewed in 2000, and their deaths were registered until 2020. At baseline, the participants (n = 4981, 2624 females) completed a questionnaire that included 11 questions on ACEs and questions on tobacco smoking, alcohol abuse, self-reported health and sufficiency of income. All-cause mortality was analysed by Cox regression analysis. Results: Of the ACEs, financial difficulties, parental unemployment and individual's own chronic illness were associated with mortality. High number (4+) of ACEs was significantly associated with all-cause mortality in females (HR 2.11, p < 0.001), not in males. Poor health behaviour, self-reported health and low income were the major predictors of mortality in both genders. When the effects of these factors were controlled, childhood family conflicts associated with mortality in both genders. Conclusions: Among working-age people, females seem to be sensitive to the effects of numerous adverse childhood experiences, exhibiting higher premature all-cause mortality. Of the individual ACEs, family conflicts may increase risk of premature mortality in both genders. The effect of ACEs on premature mortality may partly be mediated via poor adult health behaviour and low socioeconomic status. What is already known: In birth cohort studies, adverse childhood experiences (ACEs) have been associated with all-cause mortality. In working-age people, the association of ACEs with premature mortality is less clear and may differ between the genders. What this study adds: In working -age people, high number of ACEs associate with all -cause premature mortality in females, not in males. The effect of ACEs on premature mortality may partly be mediated via poor adult health behaviour, self -reported health and low socioeconomic status.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af5f8e22e6502289b3bba59d316d5509",
  "timestamp": "2025-05-15T03:26:54.517700"
}