{
  "id": 9279,
  "title": "BUILDING INFORMATION RELATIONS IN THE SPHERE OF MINING, CRYPTOCURRENCY AND CRYPTO ASSETS ON THE EXAMPLE OF THE KYRGYZ REPUBLIC",
  "abstract": "The subject of the research is the study of mining, cryptocurrency, crypto assets in the leg-islation of the Kyrgyz Republic.Relevance. The relevance of the article is due to the presence of gaps in the field of mining, cryptocurrency, crypto assets in the legislation of the Kyrgyz Republic. The objectives of the article are to analyze the areas of mining, cryptocurrency, crypto as-sets and identify legal problems, as well as make proposals for improving the national leg-islation of the Kyrgyz Republic.Methodology. The authors use scientific methods: general methods (analysis, synthesis, in-duction, deduction, comparison); special methods (legal, comparative legal).Main results. Problems were identified, such as: lack of legal status of crypto assets, cryp-tocurrencies; lack of legal status of a cryptocurrency exchange operator; the system of risk management in the field of cryptocurrency is not indicated; lack of detailed study of the legal status of mining; subjects of mining, mining objects, classification of mining, standards for conducting financial transactions are not defined; lack of understanding of the nature of cryptocurrencies, crypto assets and virtual assets; lack of licensing and permitting activi-ties in the field of mining, cryptocurrency, crypto assets; the absence of the category of mining, cryptocurrencies, crypto assets in the State Classifier of Economic Activities; lack of legal status of blockchain in the format of a regulatory legal act and etc.Relevant proposals were given: to finalize and adopt a single regulatory legal act (in the form of a law) in the field of crypto assets, cryptocurrencies, since they are interconnected; establish the legal status of a cryptocurrency exchange operator and introduce licensing and permitting activities (obtaining a license from the National Bank of the Kyrgyz Republic); develop and adopt a regulatory legal act (in the form of a law) on mining, with a detailed designation of what mining is, its classification, mining object, mining subjects; understand the nature of cryptocurrencies, crypto assets, virtual assets and understand what they can be attributed to, in particular, to money, a product, a medium of exchange, a universal ser-vice or other activity; Enshrine in civil law the concepts of cryptocurrency, crypto assets, virtual assets, including the rights and obligations arising from them; add to the Law of the Kyrgyz Republic On licensing and permitting activities of the system in the Kyrgyz Republic paragraph 61 of Article 15 -the activity of mining, cryptocurrency, crypto assets; add a cat-egory to the State Classifier of Economic Activities -mining, cryptocurrencies, crypto assets; form a working group at the level of the Cabinet of Ministers of the Kyrgyz Republic to study blockchain technology with areas of application, both in the private sector and in the public sector, including smart contracts and etc.Conclusion. Introduce legal regulators in the field of mining, cryptocurrency, crypto assets in the Kyrgyz Republic in order to avoid possible legal gaps that can lead to negative conse-quences in relation to the state, ranging from various shadow schemes in the economy that can slow down the digital transformation of the country.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af63b97d1aa8c8d3cfb9064f9b37cf6c",
  "timestamp": "2025-05-15T03:27:24.966612"
}