{
  "id": 9058,
  "title": "Visual Functioning and Mortality of Age-Related Macular Degeneration Patients in a Colorado Cohort",
  "abstract": "Objective: To investigate the relationship between visual functioning as measured by the National Eye Institute 25-Item Visual Function Questionnaire (VFQ-25) and mortality in patients with various stages of age-related macular degeneration (AMD).Design: Observational cohort study.Participants: Patients with AMD enrolled in the University of Colorado AMD Registry between July 9, 2014 and December 31, 2021 were included.Methods: Age-related macular degeneration cases were classified into early AMD, intermediate AMD, geographic atrophy, neovascular AMD, or both advanced types of AMD (neovasuclar and geographic atrophy both present) using multimodal imaging and the Beckman and Classification of Atrophy Meetings criteria. Visual Function Questionnaire-25 composite and subscale scores at the time of study enrollment were calculated. Cox proportional hazards modeling was used to assess time to event for mortality utilizing univariate and multivariable models, which adjusted for all variables significantly associated with mortality. The measures of association were hazard ratios (HRs) and 95% confidence intervals (CIs).Main Outcome Measures: All-cause mortality statistics were obtained through a collaborative agreement with the Colorado Department of Public Health and Environment. Death rates through October 19, 2022 were compared by demographics and potential confounders.Results: Analysis was completed on a cohort of 876 patients, of which 180 (20.6%) died during the follow-up period. Average follow-up time for this cohort was 52.5 (standard deviation: 26.6) months. In univariate analysis, composite VFQ-25 score and all subscale scores aside from ocular pain were significantly associated with time to mortality. Additionally, age, AMD category, marital status, history of smoking, and multiple chronic comorbid conditions were significantly associated with time to mortality. In multivariable analysis, for each 10-point increase in a patient's VFQ-25 scores for general health and driving, the risk of death decreased with HR of 0.85 (95% CI: 0.80, 0.91; P < 0.0001) and 0.92 (95% CI: 0.87, 0.97; P 1/4 0.005), respectively. Composite and other subscale scores were not significantly associated with mortality after adjusting for confounding variables.Conclusions: This cohort of AMD patients had a 20% rate of death in the 52.5-month average follow-up time. Better general health and ability to drive, as measured by the VFQ-25, were each separately associated with significantly lower risk of death among individuals with AMD.Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology Retina 2023;7:982-989 (c) 2023 by the American Academy of Ophthalmology",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af688f874f80553a7f91c11dc9f6083f",
  "timestamp": "2025-05-15T03:24:55.030332"
}