{
  "id": 9446,
  "title": "Women with female infertility seeking medically assisted reproduction are not at increased risk of developing multiple sclerosis",
  "abstract": "STUDY QUESTION Is female infertility among women seeking medically assisted reproduction (MAR) associated with prevalent as well as incident multiple sclerosis (MS)? SUMMARY ANSWER Women with a record of female infertility did not have an increased risk of developing MS compared with apparent fertile women; however, the prevalence of MS was slightly higher among women undergoing MAR compared with women who had a child without MAR, but this was not related to origin of infertility (i.e. male versus female factor infertility). WHAT IS KNOWN ALREADY Women with MS have fewer children compared with women without MS. Persons with MS more often have other coexisting autoimmune disorders including hypothyroidism compared with the general population. Thyroid dysfunction is associated with ovarian cause of infertility, miscarriage and ovarian failure. Conversely, women with endometriosis, that is highly associated with infertility, also more often have other coexisting autoimmune diseases including MS and hypothyroidism compared with the general population. However, whether the low fertility rate among women with MS is due to a genetically predisposition to other autoimmune and endocrine disorders that leads to reduced fertility, or an active choice of the woman, disease-related pathology or treatment-specific effect on endocrine and/or ovarian function, is not completely understood. STUDY DESIGN, SIZE, DURATION A register-based cohort study of a total of 310 357 women from 1996 to 2018. A cross-sectional design was used for analysing prevalence of MS, whereas a cohort design with up to 24 years of follow-up was used for analysing incidence of MS. PARTICIPANTS/MATERIALS, SETTING, METHODS Three cohorts were included in the study (i) 55 404 women with a female infertility diagnosis registered in the Danish IVF register; (ii) 25 096 women with only male factor infertility recorded in the IVF register and thus no female infertility diagnosis and (iii) 229 857 age- and calendar-matched women with a record of first child birth in the Danish Medical Birth Register (DMBR) and no record ever in the IVF register. The prevalence and incidence of MS in the female infertility cohort were compared with the two control cohorts of apparent fertile women using log-binomial regression and Cox proportional hazard regression, respectively. MAIN RESULTS AND THE ROLE OF CHANCE The crude prevalence of having MS per 1000 persons was 3.2 for women who had undergone MAR treatment regardless of origin of infertility (i.e. male versus female factor infertility) and 2.3 for fertile DMBR controls. The age, calendar and educational level adjusted prevalence ratio of having a diagnosis of MS at the first MAR treatment was 1.27 (95% CI 1.07-1.52) for infertile women compared with fertile DMBR controls, and 1.00 (95% CI 0.77-1.31) for comparison to women with a male partner with infertility who had also undergone MAR treatment. We found no association between incident MS and female infertility compared with either of the control groups of fertile women. LIMITATIONS, REASON FOR CAUTION The cohort of infertile women is highly selected on the basis of their choice of having fertility treatment and thus does not include women with unestablished infertility or women who, for some reason, have chosen not to have MAR treatment. Additionally, due to the nature of the observational study design, we cannot exclude the possibility of unmeasured and/or residual confounding. WIDER IMPLICATIONS OF THE FINDINGS Our results suggest that women with MS may undergo MAR treatment more often than women without MS due to more awareness about the possibility of MAR treatments, sexual dysfunction related to MS disease, but also need for timing of the pregnancy to avoid an unnecessary long time period without disease modifying therapy-especially of high efficacy-and hence a wish to conceive quickly. These findings are important for clinicians dealing with women with MS of childbearing age. STUDY FUNDING/COMPETING INTEREST(S) The authors received no financial support for the study. T.I.K. has served on a scientific advisory board for Novartis and has received support for congress participation from Biogen. M.M. has served on scientific advisory boards for Biogen, Sanofi, Roche, Novartis, Merck, Abbvie and Alexion. She has received honoraria for lecturing from Biogen, Merck, Novartis, Sanofi and Genzyme and has received research support and support for congress participation from Biogen, Genzyme, Roche, Merck and Novartis. The remaining authors declare no conflict of interest.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af780223754fb3bee84cc3a862930264",
  "timestamp": "2025-05-15T03:28:46.356417"
}