{
  "id": 9232,
  "title": "Willingness to Pay for Social Health Insurance in Central Vietnam",
  "abstract": "Background: A social health insurance (SHI) program was implemented in Vietnam in 1992. Participation is compulsory for some groups, such as formal-sector workers and voluntary for other groups. In 2013, 68% of the total population was covered by SHI, with most enrollees from compulsory groups. Enrollment has remained low among persons whose enrollment is voluntary. As a result, households face financial risk due to high out-of-pocket payments for health care. The goal of this study is to identify willingness to pay (WTP) for the SHI scheme among persons whose enrollment is voluntary and to examine factors that influence their choice. Method: Three hundred thirty-one uninsured persons from three districts and one city of Thua Thien Hue province were interviewed face to face using a structured questionnaire. Contingent valuation technique was used to assess the WTP among the study participants. Each individual was asked to choose the maximum premium they were willing to pay for a health insurance card per year with three copayment levels of 0, 10, and 20%. Seven premium levels were offered ranging from 0 to 900,000 Vietnamese Dong (VND) (42.12 USD). The mean WTP of respondents for each scenario was estimated. Multiple linear regression analysis was used to identify factors influencing WTP for SHI. Results: The survey found that 73.1, 72.2, and 71.6%, respectively, for each copayment level, of the respondents would agree to participate in the SHI scheme and are willing to pay an annual premium of 578,926 VND (27.1 USD); 473,222 VND (22.1 USD); and 401,266 VND (18.8 USD) at the copayment levels of 0, 10, and 20%, respectively. The WTP for SHI is influenced by knowledge of SHI at all copayment levels (p value < 0.05). The more knowledge about SHI individuals have, the higher the WTP amount. Chronic disease was related to WTP only at a copayment level of 20% (p = 0.049). Conclusion: Enhanced awareness of the benefits of SHI among the population should contribute to expanding SHI coverage in Vietnam.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af7ac95ac01b7aa10dc61b0eaee26259",
  "timestamp": "2025-05-15T03:26:54.544446"
}