{
  "id": 8271,
  "title": "Does the Role o f Relatives on Ownership Structure Affect Firm Value?",
  "abstract": "Motivation: This paper's motivation is to provide valuable information on the issue of firm value for both enterprises and investors, finding additional factors which may strongly affect firm value but have been rarely discussed, and revealing precious results to fill a gap in present literature. Premise: Due to the importance of ownership structure and firm value to a firm, this paper investigates whether firm value would be affected by the shareowners' relatives, which has been seldom explored comprehensively in the existing literature. Approach: By utilizing the data of Taiwan Stock Exchange-listed firms, this paper first applies panel data models and then Petersen regression models for further investigation to enhance the robustness of the empirical results. Results: This paper reveals that the shareholding of directors' relatives positively relates to firm value, but the shareholding ratio of managers' relatives influences firm value negatively. Even in the opposite direction, relatives' shareholdings of the firm members do prominently impact firm value. Conclusion: This paper shows that a firm should manage the board and ownership structures properly in order to enhance a firm's value. Additionally, investors should evaluate the board and ownership structures of a firm before investing. Consistency: This paper illustrates that board and ownership structures are crucial determinants for firms to operate with financial success. By selecting firms with well-designed board and ownership structures, investors may decrease the risk of loss and reduce the investment uncertainty.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "af81099cea68f6481c1ca79603d306b4",
  "timestamp": "2025-05-15T03:17:21.441719"
}