{
  "id": 7101,
  "title": "Does CSR disclosure influence financial performance of firms? Evidence from an emerging economy",
  "abstract": "Purpose This study aims to empirically examine the relationship between corporate social responsibility disclosure (CSRD) and financial performance (FP) in Indian firms. Design/methodology/approach Data for CSRD is collected by conducting content analysis of CSRD in annual reports of the sampled firms. A multidimensional measure of CSRD is constructed based on the stakeholder theory, consisting of six stakeholder groups - employees, customers, investors, community, environment and others. The aggregate CSRD measure is created by combining disclosure of the six CSR dimensions. Multiple regression analysis is used to examine the CSRD-FP linkage, controlling for the confounding effects of size, risk, age, industry, ownership and period. Findings The results of this study indicate that the aggregate CSRD measures, both for quality and quantity, have a positive association with the accounting measures of firms' FP. However, the market measure of FP is observed to have a statistically insignificant association with aggregate quality and quantity of CSRD of Indian firms. Practical implications The results reveal that adopting transparent and extensive CSRD is relevant for the profitability of firms, and that government interventions are required to promote CSR programs, with a specific focus on the CSR dimensions that provide no apparent financial gains. Social implications This study recommends the adoption and reporting of CSR practices by Indian firms for their stakeholders. Originality/value This study contributes to the scarce literature on the CSRD-FP linkage in the context of emerging economies by using a more inclusive data set, creating a reliable measure of CSRD applicable to a large universe of firms and including relevant control variables that affect the CSRD-FP relationship.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "afb4b9b8fd5e9c88340549364f705c7c",
  "timestamp": "2025-05-15T03:05:03.551628"
}