{
  "id": 7862,
  "title": "Audit committee attributes and CSR performance in China: empirical evidence from agri-firms",
  "abstract": "The purpose of this study is to explore the impact of audit committee AC attributes on Agrifirm CSR performance before and during the COVID-19 pandemic, the study focus on Chinese Agri-firm spanning from 2017 to 2021. Data was carefully gathered from the Chinese CSMAR database, the published annual reports, World Development Indicators WDI, International Financial Statistics IFS, and Business Recorder BR, encompassing 790 Agrifirmss, which yielded 3,950 firm-year observations for our empirical analysis. We utilized ordinary least squares regression for data analysis and TOBIT regression to evaluate the robustness of the findings. The study's findings highlight that the frequency of AC meetings and the inclusion of foreign directors on the AC have a significantly positive impact on agrifirms' CSR performance, both prior to and during the COVID-19 pandemic. Moreover, AC- Expertise exhibits a positive and statistically significant association with CSR activities both before and during the COVID-19 period, whereas AC-Tenure shows a negative and significant relationship with CSR performance in both situations. This study carries practical implications for the enhancement of Agri-firms CSR activities in China. It also offers policy insights, contributing to the ongoing research concerning the impact of the AC attribute on Agri-firms CSR performance and risk management. Regulators may consider advocating for the establishment of independent and effective audit committees to increase CSR activities within an Agri-firm. The study encourages firms to contribute philanthropic donations to support those in need, which can significantly bolster the government's efforts in addressing the socioeconomic challenges brought about by the COVID. This empirical research contributes to the limited literature on the effects of AC attributes on Agri-firms CSR performance, especially in assisting those in need during challenging times.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "afb6a9808de929a9e444d1f153818e1b",
  "timestamp": "2025-05-15T03:12:36.563782"
}