{
  "id": 1536,
  "title": "Investigating the determinants of Chinese residents' intention to purchase green housing: a dual-stage structural equation modeling-artificial neural network approach",
  "abstract": "Despite the rapid development of green housing, significant challenges remain, including limited market demand. Accordingly, this research aims to elucidate the pivotal antecedents that influence residents' perceived value and purchase intention with regard to green housing. The hybrid structural equation modeling and artificial neural network method is employed to validate the research model developed from the perceived value theory and the attitude-behavior-condition theory. The results indicated that perceived functional benefit, perceived emotional benefit, publicity education, administrative regulation and social atmosphere have significant relationships with both perceived value and purchase intention. In addition, perceived social benefit and perceived performance risk only significantly impact perceived value, whereas perceived financial risk and financial incentive only significantly affect purchase intention. The artificial neural network method results showed that social atmosphere is the most crucial driver for perceived value, while perceived value is the strongest determinant for purchase intention. The theoretical contribution of the present study lies in the development of an integrated model that incorporates both psychological perception factors and external contextual factors, while also providing rigorous empirical evidence through the utilization of two statistical techniques. Moreover, this study presents insightful implications for policymakers and industry practitioners regarding the key determinants of green housing acceptance.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "afc61028e405e999d1f286033674df90",
  "timestamp": "2025-05-15T02:04:20.085698"
}