{
  "id": 4401,
  "title": "CATASTROPHIC RISK MANAGEMENT: STOCHASTIC HYBRID MODEL TO CALCULATE THE LOSS INDEX TRIGGER FOR CATASTROPHE BONDS (CAT BONDS). ADJUSTMENT USING EVOLUTIONARY STRATEGIES",
  "abstract": "Purpose: This paper develops a stochastic model to calculate the loss index trigger for catastrophe bonds as alternative instruments for the management of major insured risks, such as natural catastrophe. Methodology: The underlying loss index of catastrophe bonds is the aggregate catastrophe losses reported before the end of certain period. The catastrophe severity is defined as the sum of two random variable: the reported loss amount and incurred-but-not-yet-reported loss amount, and the central hypothesis is that the latter decreases proportionally to a linearly increasing function up to a certain time and constant thereafter, called the hybrid claim reporting rate. Randomness in the reporting process is represented by a geometric Brownian motion in the claim reporting rate. The validity of the proposed model is evaluated by estimating its parameters using machine learning techniques (specifically, evolutionary strategies, ES). Findings: The results shows that the model accurately captures the uneven behavior of the claim reporting process over time and therefore correctly describes the catastrophic claims reporting process. Originality: The model proposed allows for an easy calculation of catastrophic loss indexes, thus facilitating the pricing of loss index-triggered Cat bonds. This translates into better catastrophe risk management for both insurance and reinsurance companies, as well as for those companies that diversify their portfolios with this type of financial instruments. The simplicity of the presented model facilitates parameter estimation and simulation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "afd9b7b1291a72f1fcbf9fb0e9f13f3f",
  "timestamp": "2025-05-15T02:36:38.540657"
}