{
  "id": 2499,
  "title": "Does sectoral loan portfolio composition matter for the monetary policy transmission?",
  "abstract": "Purpose - The paper empirically explores the conditioning role of loan portfolio diversification in the monetary policy pass-through via the bank lending and risk-taking channels. Methods - Data of Vietnamese commercial banks during 2007-2019 is employed to perform regression using the two-step system generalized method of moments in dynamic panel models. For robustness, we approach different choices of monetary policy indicators, ranging from interest-based tools to quantitative-based policy, and consider a rich set of sectoral exposure measures to proxy loan portfolio diversification. Findings - Lower interest rates or greater liquidity injection during monetary expansion may increase bank lending and bank risk, thus confirming the working of the bank lending and risk-taking channels of monetary policy transmission. Notably, the potency of these banking channels may be weakened for banks diversifying loan portfolios more into various economic sectors. Implication - The findings call for monetary authorities to concentrate on certain types of banks, depending on their loan portfolios when setting monetary policy. When managing banking supervision, banking supervisors should also acknowledge the tradeoff between bank lending and bank risk in response to monetary shocks. Originality - For the first time, this paper explores the conditional role of loan portfolio composition and thus further supports the recent upsurge in empirical studies highlighting the role of business models in monetary policy pass-through.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0134ac30e686de799462c82b5f855ae",
  "timestamp": "2025-05-15T01:07:35.679287"
}