{
  "id": 6974,
  "title": "Using Hair Cortisol to Examine the Role of Stress in Children's Health Inequalities at 3 Years",
  "abstract": "OBJECTIVE: Children exposed to early adversity (eg, financial hardship, family violence, parent mental health difficulties) are at greater risk of poor health outcomes. Physiological stress is one mechanism thought to explain this pathway. We investigated associations between adversity and young children's health and whether child stress (measured using hair cortisol) mediated these associations. METHODS: This was a cross-sectional study of 3-year-old children whose mothers were recruited during pregnancy, through the right@home trial, for their experience of adversity. Using total counts of 9 sociodemographic and 9 psychosocial indicators of adversity, regression models examined relationships among adversity risk counts, child hair cortisol (potential mediator), and 5 health outcomes: externalizing and internalizing problems, physical and socioemotional wellbeing, and overweight/obesity. RESULTS: Hair cortisol data were available for 297 out of 500 (59%) participating children. When examined separately, sociodemographic adversity risk was associated with higher externalizing problems, and psychosocial adversity risk was associated with higher externalizing problems and poorer physical/socioemotional wellbeing. When examined together in a single model, psychosocial (but not sociodemographic) adversity was associated with higher externalizing problems (unstandardized mean difference [beta], 0.53; P = .002) and poorer physical wellbeing (beta, 1.19; P = .009); higher hair cortisol was associated with higher externalizing problems (beta, 0.76; P = .02). There was no evidence that stress (hair cortisol) mediated associations between adversity and health. CONCLUSIONS: In 3-year-old children, we found no evidence that physiological stress (hair cortisol) mediated associations between adversity risk and children's health. Hair cortisol may be limited as a single measure of stress, or physiological stress may not be a mechanism for explaining the effects of adversity on these young children's health.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b01cad89fbcc4dc7f913f3ff5209be44",
  "timestamp": "2025-05-15T03:03:55.684889"
}