{
  "id": 2600,
  "title": "Development of a Financial Toxicity Screening Tool for Radiation Oncology: A Secondary Analysis of a Pilot Prospective Patient-Reported Outcomes Study",
  "abstract": "Purpose: Financial toxicity is highly prevalent in oncology. Early identification of at-risk patients is essential because financial toxicity is associated with inferior outcomes. Validated general oncology screening tools are cumbersome and not specific to challenges related to radiation therapy, such as daily treatments. In the population of radiation oncology patients, no standardized, validated, rapid screening tool exists. We sought to develop a rapid, no-cost, and reliable financial-toxicity screening tool for clinical radiation oncology. Methods and Materials: We retrospectively analyzed data from a prospective survey study conducted at a large referral center with a heterogeneous population. Before treatment, a 25-item modified comprehensive survey for financial toxicity incorporating subjective and objective patient-reported measures was administered to identify factors linked to the risk of developing financial toxicity, which was defined as radiation therapy resulting in any of the following: loss of income, job, or spouse or difficulty paying for meals, housing, or transportation. We applied a logistic regression model with a stepwise, backward model selection procedure. Estimated probabilities of experiencing financial toxicity were computed using the inverse-logit transformation of the sum of patient-specific predictor values multiplied by the coefficients of the selected logistic regression model. The Youden index was used to determine a reasonable risk threshold. Results: A total of 157 patients completed the questionnaire, and 34 (22%) were assessed as experiencing financial toxicity. The model retained 3 factors: age, money owed, and copayment-related worries. It resulted in a concordance statistic of 0.85, developed with a risk threshold of 18% (Youden index, 0.59). This model conferred a sensitivity of 89%, specificity of 70%, positive predictive value of 44%, and negative predictive value of 96%. Conclusions: Our proposed financial-toxicity screen is rapid, free, sensitive, and specific, and in this study, it identified early-onset, patient-reported financial toxicity after radiation therapy with just 3 simple variables: age, money owed, and copayment-related concerns. Future research steps should include a validation cohort and identification of interventions to mitigate financial toxicity. (C) 2021 The Authors. Published by Elsevier Inc. on behalf of American Society for Radiation Oncology.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b020cebd9c52487d5d028a0c3503e271",
  "timestamp": "2025-05-15T02:17:01.794909"
}