{
  "id": 4317,
  "title": "Refinement and Reduction of Acute Oral Toxicity Testing: A Critical Review of the Use of Cytotoxicity Data",
  "abstract": "Acute oral toxicity testing is still required for the classification and labelling of chemicals, agrochemicals and related formulations. There have been increasing efforts over the last two decades to reduce the number of animals needed for this testing, according to the Three Rs concept. To evaluate the utility of an in vitro cytotoxicity test in our routine testing for acute oral toxicity, we have implemented in our laboratory the neutral red uptake (NRU) method, with Balb/c 3T3 fibroblasts after a 48-hour exposure, which was recommended in ICCVAM Report 07-4519, 2006. Initially, we tested 16 substances that had existing in vivo and in vitro data available, to prove our technical proficiency with the in vitro test. Then, testing was performed with 187 test substances, including a broad variety of chemicals, agrochemicals and formulations. The starting dose for acute oral systemic toxicity assays in rats (LD50) was estimated by using the prediction model presented in the ICCVAM validation study, and subsequently compared to the results obtained by in vivo testing performed according to, or similar to, OECD Test Guideline 423. Comparison of all of the 203 predicted LD50 values that were deduced from the in vitro IC50 values, with the in vivo results from oral toxicity studies in rats, resulted in a low overall concordance of 35%. The in vitro cytotoxicity assay achieved a good concordance of 74%, only for the weakly toxic substances (EU-GHS Cat. 4). However, it must be noted that 71% of the substances tested (i.e. 145/203) were classified as being weakly toxic in vitro. We further analysed the utility of the in vitro test for predicting the starting dose for an in vivo study, and the potential reduction in animal usage that this would engender. In this regard, the prediction by the cytotoxicity test was useful for 59% of the substances. However, the use of a standard starting dose of 300mg/kg bw by default (without previous cytotoxicity testing) would have been almost as useful (50%). In contrast, the prediction by an experienced toxicologist was correct for 95% of the substances. However, this was only performed for 40% of the substances, mainly those of no to low toxicity. Calculating the theoretical animal numbers needed in several scenarios supported these results. The additional analysis, considering some physicochemical data (solubility, molecular weight, log P-OW), substance class and mode of action, revealed no specific applicability domains. In summary, the use of the 3T3 NRU cytotoxicity data alone did not sufficiently contribute to refinement and reduction in the acute oral toxicity testing of the substance portfolio tested routinely in our laboratory.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b036b8aceaa530c142cc987a5086e9a2",
  "timestamp": "2025-05-15T01:25:50.539195"
}