{
  "id": 2563,
  "title": "Financial Development, Business Cycle and Bank Risk in Southeast Asian Countries",
  "abstract": "The paper aims to examine whether business cycles affect the link between financial development and bank risk, measured by Zscore and non-performing loans to total loans in six Southeast Asian countries, namely Indonesia, Philippines, Malaysia, Singapore, Thailand and Vietnam. This study uses a sample of 95 listed commercial banks over a 15-year period between 2004 and 2018 in the six Southeast Asian countries. This study employs panel OLS regression and modifications to tackle issues such as endogeneity and heteroscedasticity. The results show that the impact of stock market development (the ratio of the market capitalization to GDP) on Zscore is significantly positive, whereas its effect on non-performing loans is significantly negative. The findings suggest that financial development, in terms of stock market capitalization, improves banks' Zscores and reduces their level of non-performing loans, suggesting that financial development on average reduces bank risk. The impact of business cycle is insignificant towards bank risk, thus rejecting both counter- and pro-cyclical hypotheses, except for the case of risk indicator of loan loss provisions. Examining the joint effect of the business cycle and financial development on bank risk, we find that the phase of business cycles generally does not moderate the link between financial development and bank risk.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b03a2e7dc146224e178d81f21aa393e9",
  "timestamp": "2025-05-15T02:17:01.587325"
}