{
  "id": 6678,
  "title": "Financial Toxicity and Health-Related Quality of Life Profile of Patients With Hematologic Malignancies Treated in a Universal Health Care System",
  "abstract": "PURPOSE We investigated the association of financial toxicity (FT) with the health-related quality of life (HRQoL) profile of patients with hematologic malignancies treated in a universal health care system. METHODS We did a secondary analysis of six multicenter studies enrolling patients with hematologic malignancies. FT was evaluated using the financial difficulties item of the European Organisation for Research and Treatment of Cancer Quality of Life Questionnaire Core 30 (EORTC QLQ-C30). Multivariable linear regression models were used to assess the mean differences in HRQoL scores between patients with or without FT, while adjusting for key potential confounding factors. We also examined the prevalence of clinically important problems and symptoms by the experience of FT, using established thresholds for the EORTC QLQ-C30. Multivariable binary logistic regression analysis was performed to explore the risk factors associated with FT. RESULTS Overall, 1,847 patients were analyzed, of whom 441 (23.9%) reported FT. We observed statistically and clinically relevant worse scores for patients with FT compared with those without FT for all the EORTC QLQ-C30 scales. The three largest clinically relevant mean differences between patients with and without FT were observed in pain (triangle = 19.6 [95% CI, 15.7 to 23.5]; P < .001), social functioning (triangle = -18.9 [95% CI, -22.5 to -15.2]; P < .001), and role functioning (Delta = -17.7 [95% CI, -22.1 to -13.3]; P < .001). Patients with FT tended to report a higher prevalence of clinically important problems and symptoms across all EORTC QLQ-C30 scales. In the univariable and multivariable analyses, the presence of FT was associated with the presence of comorbidities, an Eastern Cooperative Oncology Group performance status >= 1, and not receiving a salary. CONCLUSION Patients with hematologic malignancies treated in the setting of a universal health care system who experience FT have a worse HRQoL profile compared with those without FT.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0569f2e98715d03411b59ad65dc2b78",
  "timestamp": "2025-05-15T03:00:35.375434"
}