{
  "id": 8278,
  "title": "Prevalence and Risk Factors of Dry Eye Disease in Japan: Koumi Study",
  "abstract": "Objective: To estimate the prevalence and risk factors of dry eye disease (DED) in a rural setting in Japan. Design: Cross-sectional study. Participants: We included 3294 subjects, aged >= 40 years who were in the residential registry for Koumi town. Intervention: Subjects in a rural mountain area, Koumi town, completed questionnaires designed to detect dry eye diagnosis and risk factors. Main Outcome Measures: Clinically diagnosed DED was defined as the presence of a previous clinical diagnosis of DED by ophthalmologists or severe symptoms of DED (both dryness and irritation constantly or often). Current symptoms of DED and possible risk factors such as age, gender, educational history, smoking history, alcohol drinking history, height and weight, visual display terminal (VDT) use, and contact lens (CL) wear, and past/current history of certain common systemic diseases were the main outcome measures. We used logistic regression analysis to examine associations between DED and other demographic factors. Results: Of the 3294 eligible residents, 2791 residents (85%) completed the questionnaire. The percentage of women with a composite outcome of clinically diagnosed DED or severe symptoms (21.6%; 95% confidence interval [CI], 19.5-23.9) was higher than that of men (12.5%; 95% CI, 10.7-14.5; P<0.001). A low body mass index (BMI; odds ratio [OR], 2.07; 95% CI, 0.98-4.39), CL use (OR, 3.84; 95% CI, 1.46-10.10), and hypertension (HT) (OR, 1.39; 95% CI, 0.94-2.06) were risk factors for DED in men. Use of a VDT (OR, 2.33; 95% CI, 1.12-4.85), CL use (OR, 3.61; 95% CI, 2.13-6.10), and myocardial infarction or angina were the risk factors (OR, 2.64; 95% CI, 1.51-4.62), whereas high BMI was a preventive factor (OR, 0.69; 95% CI, 0.48-1.01) for DED in women. Conclusions: Among a Japanese cohort, DED leading to a clinical diagnosis or severe symptoms is prevalent. Use of CLs was a common dry eye risk factor in both genders. The condition is more prevalent in men with low BMI, HT, and in women with myocardial infarction or angina and VDT use. Relevant measures directed against the modifiable risks may provide a positive impact on public health and quality of life of Japanese. Financial Disclosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 2361-2367 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b059e6f168e4c317b94cdd187d2749a9",
  "timestamp": "2025-05-15T03:17:21.507731"
}