{
  "id": 8593,
  "title": "Dialysis is an independent risk factor for perioperative adverse events, readmission, reoperation, and mortality for patients undergoing elective spine surgery",
  "abstract": "BACKGROUND CONTEXT: The prevalence of dialysis-dependent patients in the United States is growing. Prior studies evaluating the risk of perioperative adverse events for dialysis-dependent patients are either institutional cohort studies limited by patient numbers or administrative database studies limited to inpatient data. PURPOSE: The present study uses a large, national sample with 30-day follow-up to investigate dialysis as risk factor for perioperative complications independent of patient demographics or comorbidities. STUDY DESIGN/SETTING: This is a retrospective cohort study. PATIENT SAMPLE: Patients undergoing elective spine surgery with or without dialysis from the 2005-2015 National Surgical Quality Improvement Program (NSQIP) database were included in the study. OUTCOME MEASURES: Postoperative complications within 30 days and binomial reoperation, readmission. and mortality within 30 days were determined. METHODS: The 2005-2015 NSQIP databases were queried for adult dialysis-dependent and dialysis-independent patients undergoing elective spinal surgery. Differences in 30-day outcomes were compared using risk-adjusted multivariate regression and coarsened exact matching analysis for adverse events, unplanned readmission, reoperation. and mortality. The percentage of complications occurring before versus after hospital discharge was also assessed. The authors have no financial disclosures related to the present study. RESULTS: A total of 467 dialysis and 173,311 non-dialysis patients met the inclusion criteria. Controlling for age. gender, body mass index, functional status, and American Society of Anesthesiologists (ASA) class, dialysis patients were found to be at significantly greater odds of any adverse event (odds ratio [OR]=2.52 before. 2.17 after matching, p=<.001), major adverse event (OR=2.90 before, 2.52 after matching. p=<.001), and minor adverse event (OR=1.50 before matching, p=<.025. but not significantly different after matching). Further, dialysis patients were significantly more likely to return to the operating room (OR=2.77 before, 250 after matching, p=<.001), have unplanned readmissions (OR=2.73 before. 2.37 after matching. p=<.001), and die within 30 days (OR=3.77 before 2.71 after matching, p=<.001). Adverse events occurred after discharge for 51.78% of non-dialysis patients and for 43.80% of dialysis patients. CONCLUSIONS: Dialysis patients undergoing elective spine surgery are at significantly higher risk of aggregated adverse outcomes, return to the operating room, readmission, and death than non-dialysis patients. even after controlling for patient demographics and overall health (as indicated by ASA class). These differences need to be considered when determining treatment options. Additionally, with bundled payments expected in spine surgery, physicians and hospitals need to account for increased costs and liabilities when working with dialysis patients. (C) 2018 Elsevier Inc. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b05dd9d98395138ae5b6433bd90b47d1",
  "timestamp": "2025-05-15T03:20:22.287302"
}