{
  "id": 7412,
  "title": "Association between family economic decision-making power and survival outcomes among older adults in China: A population-based longitudinal study",
  "abstract": "Objective: This study examines the association between family economic decision-making power and survival outcomes among older adults. Methods: Data were drawn from the China Longitudinal Healthy Longevity Survey (CLHLS) from 2005 to 2018. Family economic decision-making power was assessed based on participants' self-reported influence over household financial matters, categorized as: making decisions on almost all household expenditures, deciding on non-essential spending, only deciding on personal expenditures, and having no decision-making power over household spending. Survival status and date of death were determined through interviews with close family members during each survey round. Cox proportional hazards regression models were used to analyze the relationship between family economic decision-making authority and survival outcomes among older adults using longitudinal follow-up data. Subgroup analyses were conducted to identify vulnerable populations. Results: The study included 10,443 older adults, of whom 5606 (53.68%) died during the follow-up period, with a median survival time of 7 years. Compared to those with full decision-making authority, the hazard ratios (95% CI) were 1.02 (0.87-1.20) for those with authority over non-essential spending, 1.22 (1.07-1.38) for those with authority over personal spending, and 1.24 (1.04-1.47) for those with no decision-making power. The impact of low decision-making authority on survival was modified by factors such as gender, occupation before age 60, household economic status, experience of child loss, and physical labor. Conclusions: Low family economic decision-making power is associated with an increased risk of mortality. Promoting active participation in financial decisions may enhance health outcomes. However, the study is limited by its focus on Chinese data, challenges in establishing causal relationships, and the measurement of decision-making power at a single point in time.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0606f7278e6ccb74b755a0490795a91",
  "timestamp": "2025-05-15T03:08:00.927413"
}