{
  "id": 7384,
  "title": "Is referral source a risk factor for coronary surgery? Health maintenance organization versus fee-for-service system",
  "abstract": "We began performing coronary artery bypass grafting for a large health maintenance organization (HMO) in 1974, as the sole provider of their cardiac surgery. The outcomes of our HMO group of patients were compared with those of our patients treated on a fee-for-service (FFS) basis. The HMO system entails preintervention and multidisciplinary screening conferences and is devoid of self-referral and personal financial incentives, Since 1985, the operative mortality for HMO patients has been consistently lower than for FFS patients. There were 8483 operations during this study period: 3168 (37%) were in the HMO group, with an overall operative mortality of 2.7%, and 5315 (63%) were in the FFS group, with an operative mortality of 4.6% (p = 0.00002). This difference was investigated with univariate and multivariable analyses. Sixteen factors were found to univariately affect the risk of operative mortality; for five of these risk correlates there mas a significant maldistribution between the HMO and FFS patients. Logistic regression was used to explore the influence of this imbalance in risk factors. The model found seven independent risk factors (left ventricular failure, emergency coronary bypass, redo bypass, nonuse of the internal thoracic artery, unstable angina, age, and diabetes) that significantly affected operative mortality. The FFS group variable closely approached independent risk significance at p = 0.059, This multivariable model explained only one third of the observed differences in actual mortality between the HMO and PFS groups. The system-wide angioplasty/coronary bypass ratio, which could not be used in a patient-specific model, was 0.6 in the HMO system and 1.5 in the PFS group. Other factors related to the operating structure of a mature, large HMO may account for the remainder of the difference. The HMO referral system, through a powerful selection process, resulted in fewer emergencies, redo bypass operations, and catheterization complications that, in turn, yielded lower operative mortality than a noncoordinated FFS system of cardiovascular management.",
  "year": 1996,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b065a858598c102ec07a99ed458431c1",
  "timestamp": "2025-05-15T03:08:00.793649"
}