{
  "id": 2013,
  "title": "Intraocular Pressure Spike Following Stand-Alone Phacoemulsification in the IRIS® Registry (Intelligent Research in Sight)",
  "abstract": "Purpose: To evaluate risk factors for intraocular pressure (IOP) spike after cataract surgery using the IRIS (R) Registry (Intelligent Research in Sight). Design: Retrospective clinical cohort study. Participants: Adults with IRIS Registry data who underwent stand-alone phacoemulsification from January 1, 2013, through September 30, 2019. Methods: Intraocular pressure spike was defined as postoperative IOP of > 30 mmHg and > 10 mmHg from the baseline within the first postoperative week. Odds ratios (ORs) for demographic and clinical characteristics were calculated with univariable and multivariable logistic regression analyses. Main Outcome Measures: Incidence and OR of IOP spike. Results: We analyzed data from 1 191 034 eyes (patient mean age, 71.3 years; 61.2% female sex; and 24.8% with glaucoma). An IOP spike occurred in 3.7% of all eyes, 5.2% of eyes with glaucoma, and 3.2% of eyes without glaucoma (P<0.0001). Multivariable analyses of all eyes indicated a greater risk of IOP spike with higher baseline IOP (OR, 1.57 per 3 mmHg), male sex (OR, 1.79), glaucoma (OR, 1.20), Black race (OR, 1.39 vs. Asian and 1.21 vs. Hispanic), older age (OR, 1.07 per 10 years), and complex surgery coding (OR, 1.22; all P < 0.0001). Diabetes (OR, 0.90) and aphakia after surgery (OR, 0.60) seemed to be protective against IOP spike (both P< 0.0001). Compared with glaucoma suspects, ocular hypertension (OR, 1.55), pigmentary glaucoma (OR, 1.56), and pseudoexfoliative glaucoma (OR, 1.52) showed a greater risk of IOP spike and normal-tension glaucoma (OR, 0.55), suspected primary angle closure (PCA; OR, 0.67), and PCA glaucoma (OR, 0.81) showed less risk (all P < 0.0001). Using more baseline glaucoma medications was associated with IOP spike (OR, 1.18 per medication), whereas topical B-blocker use (OR, 0.68) was protective (both P < 0.0001). Conclusions: Higher baseline IOP, male sex, glaucoma, Black race, older age, and complex cataract coding were associated with early postoperative IOP spike, whereas diabetes and postoperative aphakia were protective against a spike after stand-alone phacoemulsification. Glaucomatous eyes demonstrated different risk profiles dependent on glaucoma subtype. The findings may help surgeons to stratify and mitigate the risk of IOP spike after cataract surgery. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology 2024;131:780-789 (c) 2024 by the American Academy of Ophthalmology",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b066cbda42d51fee0a3014924aecf444",
  "timestamp": "2025-05-15T02:10:25.646728"
}