{
  "id": 4354,
  "title": "ISPO 17th world congress Kobe, Hyogo, Japan 5-8 Oct 2019 Abstracts",
  "abstract": "Background Spinal cord injury (SCI) is an inherently serious condition that have a profound physical, psychological, and socioeconomic impact on affected individuals. Recently, the incidence of incomplete SCIs are increasing, and the central nervous system of incomplete injury has the potential of plastic change. Hybrid assistive limb (HAL) is an exoskeleton robot suit that supports walking of persons with motor dysfunction. The effectiveness of HAL training on walking ability and balance in individuals with chronic SCI is still unlear. Aim To investigate the effctiveness of walking tarining with robot suit HAL for walking ability and balance in individuals with chronic spinal cord injury. Method Fifteen patients with chronic SCI (11 men, 4 women) classified by the American Spinal Cord Injury Association (ASIA) D (zone of partial preservation C4-L3), who received full rehabilitation in the acute and subacute phase of SCI were enrolled. A single case experimental A-B(pre-post) design study by repeated assessments of the same patients. The subjects performed 3 to 6 months (30 minutes per session, 2 times per week) HAL training with walker and supported by physical therapists. Functional outcome measures included 10-m walk test(10MWT), 6-minute walk test(6MWT), Berg balance scale(BBS), and the walking index for SCIII(WISCIII), which were evaluated without HAL. Results Twelve patients completed 3 to 6 months HAL training (3 patients dropped out after 6 or 8 sessions). Functional outcome measures were analyzed in those who completed HAL training. The mean walking speed in 10MWT increased from 0.46 +/- 0.37 m/s to 0.73 +/- 0.50 m/s (p<0.01). The improvement corresponded to a 59% faster walking than in initial evaluation. Walking distance in 6MWT increased from 127.8 +/- 112.7m to 217.5 +/- 159.1m (p<0.05). Balance evaluated by BBS also improved from 28.1 +/- 13.4 to 39.8 +/- 11.8 (p<0.01), and WISCIII from 13.8 +/- 5.1 to 17.0 +/- 2.6 (p<0.05). Discussion and Conclusion Our results suggest that HAL training could improve walking ability and balance in individuals with chronic SCI. In the past, rehabilitation for SCI focused not on functional improvement, but on compensation for impairment. HAL would facilitate motor recovery and improve mobility in chronic SCI, and may play an important role in rehabilitation for SCI in future. Further controlled studies should be needed. It is very important that people who are in need of assistive products utilise those products in their daily life. In the first part of this symposium a keynote lecture will be made by a Japanese opinion leader who is an AT development director of a national institute, and is recommended by The Rehabilitation Engineering Society of Japan (RESJA). He will talk about the current situation of assistive products development and use in Japan which is the most aged society in the world. In his speech a research project is introduced which focuses relationship of assistive products use and daily activities of older people including nonagenarians and centenarians. A panel discussion will be held in the second part of the symposium. Remarkable panelists from WHO and Japan make short presentations about the circumstances of people with disabilities or the elders and usage status of assistive products in Southeast Asian and other countries. After the short reports, the organisers from WHO and NRCPD develop discussions with the panelists about better practice of AT use or methods to improve access to high-quality affordable AT. Statement of the objective / learning objectives The aim is to bring deeper understanding among opinion leaders in P&O / Assistive Technology fields. The audience can learn the current situations of AT and be inspired to support AT development and dissemination. The Symposium 'Assistive Technologies against Ageing Society' on Sunday, 6 October 2019, consists of two presentations with the first one taking place from 13:00 - 14:15 and the second one continuing from 14:30 - 15:45. Background The Australian Orthotic Prosthetic Association (AOPA) regulates the profession of orthotist/prosthetists in Australia through the establishment, maintenance and application of professional standards, such as competency standards. While portfolios are commonly used to assess professional competency, little research has investigated how reliable these assessments are, or how reliability can be improved. Aim To evaluate how reliable AOPA's competency portfolio assessment is and examine causes of variation to improve reliability. Method Overseas trained practitioners wishing to have their qualifications and experience recognised by AOPA submitted a portfolio for assessment. Portfolios were randomly assigned to two independent assessors who determined whether the applicant's portfolio demonstrates competency against each of the 68 AOPA Competency Standards (2014) and recorded their determination as satisfied or not satisfied. An administrator collated the independent evaluations and identified any points of disagreement for discussion at a consensus meeting. To quantify interassessor reliability, the Kappa statistic was used for each of the 68 competency standards. To better understand the reasons for disagreement, semi-structured interviews were conducted with each assessor. Results Results from this study show high rates of agreement between assessors upon independent assessment. Points of disagreement were commonly resolved during the consensus meeting between assessors, disagreement was rare. The standards which experienced the highest rates of disagreement were identified. Discussion and Conclusion Evidence based standards should be supported by evidence-based processes. Competency assessment via a portfolio of evidence can be conducted and assessed by two assessors with high levels of agreement. Factors that may increase the reliability of the assessment include; appropriate assessor training, the presence of a consensus meeting and clear standards. There are opportunities to further improve the clarity of standards identified as having the lowest level of agreement. Background Evidence highlights that a major factor associated with inappropriate wheelchair distribution is the global shortage of wheelchair service provision education and training.[1-4] The World Health Organization Guidelines on the provision of manual wheelchairs in less-resourced settingsrecommend integrating wheelchair service provision content into existing academic rehabilitation programs.[1] However, a 2017 study reported limited training time allocated to wheelchair service provision in some professional rehabilitation programs in low-, middle- and high-income countries.(4) Aim To develop an evidence-based online Seating and Mobility Academic Resource Toolkit (SMART) through a mixed-methods approach to identify necessary components and investigate preliminary impact. Method Data was collected from 3 primary data sources, including an international wheelchair education survey, qualitative interview transcripts with representatives from health care professional university programs and wheelchair education integration 'pilot sites'. Data sources were analyzed using a deductive content analysis approach to produce the Seating and Mobility Academic Resource Toolkit (SMART). Subsequent analyses of SMART analytics and purposive interviews were performed to identify how the toolkit was used in a variety of settings across different types of academic rehabilitation programs and contexts. Results We received 72 responses on our international wheelchair education survey, conducted 14 qualitative interviews with health care professional university program representatives, and hosted 16 presentations from wheelchair education integration 'pilot sites' to identify integration challenges. Themes emerged related to having minimal resources (human, financial, clinical, equipment), unawareness of open-source educational materials, and lack of trained personnel to name a few. Therefore, SMART was developed and includes educational resources (e.g., syllabi, presentations, online modules, evidence-based training packages, labs, evaluations) and strategies to overcome barriers to integrating wheelchair content into curricula. Analytics reveal SMART pages have been accessed 11,703 times globally, and since its launch in April 2018, the average number of pages viewed per session have increased by 7.4%. The interview findings suggest SMART has potential to improve the wheelchair education provided in terms of pedagogic approach, content and resources used. Discussion and Conclusion SMART may facilitate the integration of wheelchair content into health care professional university curricula. Ultimately, improved education in this important area of practice may enhance the participation and quality of life of those individuals who use a wheelchair for mobility. Prosthetics and orthotics training programs may consider using globally available resources, such as SMART, to identify strategies to improve wheelchair education and to advocate for their implementation. Background Nowadays is well known that voice-activated wheelchairs help the quadriplegic get around, and houses can be equipped with similar systems to operate lights and appliances; but which are the options when besides quadriplegic there is no way to give voice commands to the wheelchair or to communicate our desires to other people. The first approach of this project was presented in the International Workshop on Wearable Robotics (WeRob 2014) and a new version in WeRob 2017[2]. Aim Provide an alternative to quadriplegic persons in order to give commands from eye blinking and communicate with outside world through Internet of Things (IoT) capabilities incorporated in a wheelchair. Method To fulfill the aim of the project, the engineering design method was followed which as first step includes the definition of a clear problem statement, then pertinent information was gathered in order to generate multiple solutions. Afterwards, the information was analyzed, a solution was selected, tested and implemented. Two approaches have been generated previously (WeRob 2014, 2017), the first one was developed with a neural signal reading device and a Bluetooth communication board; afterwards a new alternative was evaluated including eye blinking commands. Now, a faster microcontroller with IoT capabilities has been incorporated in the design process to include IoT capabilities. Results Taking a decision considering commands coming from eye blinking, to give mobility to a wheelchair, is not a simple task, bad decisions can end up in moving a person in a wrong direction which will give more difficulties instead of solutions. In the actual study a faster microcontroller with embedded software and hardware for IoT is used, this device can manage multiple sensors as inputs and multiple actuators as outputs. The raspberry Pi 3 was selected because it is single-board computer with wireless LAN and Bluetooth Low Energy (BLE) on board. The developed system discriminates an involuntary blinking from a low motion voluntary blinking and take a decision to move forward a model wheelchair. The position and given commands are sent to an IoT platform to save the wheelchair movement data. Discussion and Conclusion A single board computer with on board wireless LAN and Bluetooth gives more possibilities to incorporate IoT capabilities for decision-making about wheelchair movement, and besides that voluntary blinking recognition is detected with precision and faster. The developed system fulfils the aim to provide an alternative to quadriplegic persons in order to give commands from eye blinking and communicate with outside world through IoT capabilities incorporated in a wheelchair. Background Most cervical cord injury (CCI) people need to use a wheelchair in daily life [1]. Especially, C5-C6 level of CCI patients can't usually perform the extension movement of elbow joint so that they can't operate the wheelchair strongly. Previously, we have developed the motion assist robot, which is named Active Cast (AC) for the upper limbs to transmit their residual function around shoulder to hand operations [2]. Aim The purpose of this study is to clarify the influence of wearing AC on the musculoskeletal of their residual function during wheelchair operation by people with different symptoms of CCI. Method Two subjects with C6B1(right), C5B(left) and C6B2(both) of the Zancolli classification were participated in this evaluation experiment. The treadmill was set to reproduce the running on a slope. The inclination was set to 3% for the C5 level CCI subject, and 4% for the C6 level CCI subject in order to confirm that the musculoskeletal of their residual functions better. We used the 3D motion analysis system and a myoelectric potentiometer for the analysis during 20 [s] wheelchair operation. From the above, the effect of AC on residual muscles of CCI subjects with different symptoms was analyzed. Results Based on the experimental results without AC, we confirmed that the C5 level subject operated the wheelchair using the elbow flexion force, and the C6 level subject used the force of the pronation of forearm. On the other hand, from the results with AC, in the case of C5 level subject, the scapula elevated greatly due to locking the elbow joint, and the amount of activity of the upper trapezius muscle also increased comparing with the case without AC. In the case of C6 level subject, we confirmed that the amount of scapula abduction increased, and the serratus anterior muscle was also exerted. Discussion and Conclusion It was revealed that wearing AC induced motions and residual muscles around the shoulder of CCI subjects with different symptoms. In C5 level CCI, it was confirmed that the elevation movement of the scapula was induced, and in the C6 level CCI, the abduction motion of the scapula was induced. It was confirmed that the effect of AC differs by symptoms with the pronation of forearm. Background Patients with complete paraplegia after spinal cord injury (SCI) are difficult to walk by themselves. Gait training with conventional orthoses for complete paraplegia requires excessive upper limb usage and is difficult to train knee extensor during ambulation. We developed a new method of HAL using remaining muscle activation as a trigger for paralyzed limb, and we called heterotopic HAL method (T-HAL). Aim This study aims to describe voluntary gait and voluntary knee extension using Heterotopic Triggered HAL method in patients with complete quadri/paraplegia after chronic SCI. Method Nine patients, 20-67 years old, C6-T11, AIS A-B, were enrolled in this study. HAL session consisted of two parts: the first session was voluntary ambulation using upper limb triggered HAL (UT-HAL method). In addition, for cases who could contract hip flexor, the second session was done for active knee extension using hip flexor activation. Surface electromyography (EMG) was used to evaluate muscle activity of hip flexor and quadriceps femoris (Quad) in synchronization with a Vicon motion capture system. The modified Ashworth scale (MAS) score was evaluated before and after each session. Results There were not seen severe complications such as hypoautonomic hyperreflexia, or symptomatic venous vein thrombosis, etc. The only observed adverse event was redness caused by contact between the skin and harness in cases 1, 2, and 3 which was avoidable by using a cushion. In three cases, from C6 to T6, MAS score significantly decreased after each session. In all cases, EMG before the intervention showed no activation in either Quad. However, periodic activation of the lower limb muscles was seen during UT-HAL ambulation. In two cases, in T10-11, there was observed active contraction in both Quads and hip flexors after intervention. Discussion and Conclusion We focused on residual upper limb muscle activity and the coordination between the upper limbs and contralateral lower limbs in natural gait. We observed neurological positive changes in two cases after the intervention. Moreover, patients with cervical cord or upper thoracic cord injuries, who have difficulty performing conventional gait training with orthoses, may experience decreased spasticity and activation of paralyzed muscles. These findings suggest that T-HAL method is a feasible option for rehabilitation for complete quadri/paraplegia with chronic SCI. Background Using a seat cushion, we feel the situation where the protrusion of the ischium hits the bottom of the cushion. At the pressure measuring time, the phenomenon that the peak pressure value gradually increases is observed. In prevention of pressure sores, it is important to elucidate the mechanism of bottoming phenomenon. The pressure distribution response characteristics when continuously using various seat cushions were studied in the human body and human body model. Aim It was aimed to investigate whether the bottom was due to a change in the condition in the seat cushion or a change in the internal pressure in the human body. Method Seven seat cushions were prepared on the wheelchair. Subjects were two healthy adult male and a biological model. The biological model was made from plastic bone specimens and silicone materials (170 cm, 32 kg). Each cushion was placed on the plate seating surface of a wheelchair (Netti em, Alu Rehab AS) set at a tilt angle of 0 degrees and a reclining angle of 95 degrees, and a pressure distribution measuring device was laid on top(Xsensor X 3 Pro, Xsensor Technology Corp.). Measurements were carried out, with the human body and human body model sitting still at the pelvis intermediate position, randomly on each seat cushion (3 minutes / 4861 frames). Results In each seat cushion, there was a gradual trend of peak pressure after sitting of the human body. On the other hand, this tendency was not observed in the human body model. The difference between the maximum and the minimum value of the peak pressure was significantly higher for each human body than for the human body model. There was no significant difference between the maximum and minimum values of the contact area between human body and human body model. Discussion and Conclusion Local concentration of pressure can not be said to be caused by sinking of humans in the seat cushion or compression of the material. Rather, it is presumed that biological changes occur over time. If compressive stress affects blood flow, in order to distribute body pressure, wheelchair users are required to improve the movement such as push-up and use the wheelchair posture conversion function. Background We are developing Qolo, a new personal mobility device for those with motor disability in their lower limbs. It assists sit-to-stand and stand-to-sit postural transitions as well as navigation in standing posture with hands-free operation. Its mechanism to assist the postural transition is implemented with passive gas springs without using electric actuators, making it compact, light-weight and low cost. Aim The purpose of this study is to report clinical assessment of the device after modification of its design to realize voluntary sit-to-stand posture transition of people with thoracic level spinal cord injury (SCI). Method In the improved design of the device, reviewing our preceding clinical experiments, the assistive force of the knee springs was doubled and lumbar assist was added. Six participants with SCI (age: 30-52y, 4 males and 3 females, neurological level: T4-L3, AIS: A-C, MMT Hip Ext.: 0-1, Knee Ext.: 0-3) were asked to conduct stand-up and sit-down postural transitions using the improved version of the device. Feasibility of the assisted motions were evaluated. Results Six out of the seven participants were able to smoothly conduct voluntary stand-up and sit-down motions using the device by themselves, without additional assistance. Two of the them (T10A, T6A, MMT Knee<=1) achieved voluntary stand-up motion only with the improved version of the device. One participant (T4A, MMT Knee=0) needed additional manual assistance to achieve voluntary stand-up motion using the device. Discussion and Conclusion The improvement of the device extended its capability to assist sit-to-stand and stand-to-sit posture transition of people with lumbar or thoracic level SCI. At the same time, necessity of stronger support for middle to upper thoracic level SCI was investigated. For the next step, we plan to introduce stronger assistive force, and improve of harnessing and attachment and detachment processes to facilitate its daily use. Background Gait enables human beings to move forward, and most people consider gait to be natural skill. But gait disturbances are very prevalent to the patients with burn injury. A major cause of functional impairment including pain and joint contractures. Contractures at the lower extremities such as the hip, knee and ankle significantly limit gait. Recent attention of the application of artificial intelligence in rehabilitation, in particularly lower limbs robot assisted rehabilitation has become a hot issue of studies. Aim This study is purposed to find the efficacy and study the mechanism of motor recovery after robot assisted gait training on patients with lower extremity burn. Method 7 patients with lower extremity burn were included. All patients received 4 weeks robot assisted training. Functional scores of functional ambulation category (FAC) and 6-minute walking distances, and pain score of visual analog score (VAS) during robot assisted gait training were measured. Results FAC and VAS scores after training were better than the scores before training. 6-min walking distance after training were significantly increased than the measure before training(p<0.05). Lower limbs robot assisted rehabilitation training improves patient's pain, and increases walking speed on patients with lower extremity burn. Discussion and Conclusion Lower limbs robot assisted rehabilitation improves the walking speed, and prolongs their walking distances. The use of robot assisted rehabilitation may facilitate early recovery from burn injury. Background The infant cerebral palsy is one of the most wide-spread reasons of disability at child's age. The success of rehabilitation depends on intensity of kinesitherapy, quality of movements and motivation of the child that is ensured with modern robotized systems with biological feedback. Aim to estimate efficiency of use of robotized systems with biological feedback in rehabilitation of children with infant cerebral palsy. Method The basic and control groups of children (26 persons in each) with spastic paraparesis, flexion positioning of lower extremities, impairment of supportability and walking, matched in functions, age and gender were formed. The course of rehabilitation included: massage, apparatus physiotherapy, therapeutic exercises. The patients of the basic group additionally had mechanotherapy on a robotized system Lokomat Pediatric for training strength of muscle, for increasing of amount of movements in joints. The period of observation - 1 year (3 courses of treatment). Efficiency of the given treatment was evaluated with a method of functional testing (Ashworth, GMFCS, GMFM), program testing of a robotized system (L-FORCE, L-ROM) before and after the course of rehabilitation. Results For the period of observation the spasticity of muscles (Ashworth) of lower extremities in patients of both groups reduced, on the average, for 1 point. The level of limitation of the gross motor functions (GMFCS) in both groups didn't change essentially. Motor possibilities (GMFM) of the patients of the basic group increased, on the average, on 25 +/- 7 %, of the control group - on 12 +/- 7 %. The isometric strength of muscles - flexors of a knee and a hip (L-FORCE) in the basic group increased, on the average, on 3 Nm, the strength of muscles-extensors of a knee and a hip - on 2 Nm, in the control group - didn't change. The amount of active movements in knee and hip joints (L-ROM) achieved physiological norm in the basic group and in 25 % of children of the control group. Discussion and Conclusion The mechanotherapy on a robotized system with biological feedback Lokomat Pediatric in rehabilitation of children with infant cerebral palsy allows to increase the strength of muscles trained, amount of movements in joints, results in improvement of indexes of functional testing, to increase motivation of children for performing active exercises in game. Motor rehabilitation of patients with infant cerebral palsy with the use of mechanotherapy on a robotized system Lokomat Pediatric has shown high efficiency in comparison with traditional methods.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b06f2f11353e2f79354e58c42f872892",
  "timestamp": "2025-05-15T01:26:26.251929"
}