{
  "id": 4159,
  "title": "R&D collaboration in the automotive innovation environment An analysis of co-patenting activities",
  "abstract": "Purpose - The purpose of this paper is twofold: to analyze to what extent innovation output of R&D collaborations, proxied by co-patenting activities in terms of quantity, characteristics and value, differs depending on whether the engaged R&D partners have a certain type of relationship (allies, suppliers and subsidiaries); to identify possible automakers co-patenting patterns taking into account the differences in the innovation output with their R&D partners. Design/methodology/approach - To reach the aims, the authors matched two types of data: co-assigned patent portfolio of four automakers and relationship type between automakers and their co-assignees. Matching the company names of the two data sources allowed the authors to obtain the final data set used to carry out extensive descriptive and regression analysis, both on a firm- and patent-level. Findings - Results show differences in the characteristics and the technological value of patented inventions in relation with the type of collaboration partner; they also support the authors in the identification of four co-patenting patterns (contingent, purposive, watchful and advanced) according to the co-patenting propensity and the presence of a preferred relationship type. Originality/value - The paper contributes to the literature by investigating the presence of differences across the patenting activities of a selection of automakers and their supplier, allied and subsidiary firms. The issue related to patent value represents an emerging area of interest in the field of collaborations for innovation. The methodology constitutes a novelty by matching two different sources and standardizing the company names (name game) through an automated algorithm and a double manual check, by searching company web sites and corporate trees.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b08d381555b0b534e08100d3ec744cad",
  "timestamp": "2025-05-15T01:24:25.353968"
}