{
  "id": 5766,
  "title": "Navigating global markets: The role of enterprise risk management and human resource management in SME international expansions",
  "abstract": "Research background: Since SMEs lack the financial and human resources required for internationalization, they face more obstacles than large firms. In this regard, their internal/controllable risk management capabilities based on the Resource-based View (RBV) theory might help them overcome internationalization barriers. Purpose of the article: This study aims to investigate the positive impact of internal/controllable risk management capabilities, such as strategic, operational, and personnel risk capabilities, on the export intention of SMEs. Moreover, this paper finds out whether the impacts of these risk management capabilities on export intention differ depending on the countries where SMEs operate.Methods: This research uses a random sampling method and shares an online questionnaire with survey respondents. It includes research samples from Czech, Slovakian, and Hungarian SMEs. The researchers analyze the effects of enterprise risk management capabilities on export by performing Binary Logistic Regression analyses.Findings & value added: While personnel risk management does not affect the export intention of SMEs, strategic risk management and operational risk management positively affect the export intention of SMEs, depending on the countries where SMEs are located. For this reason, there are international differences in the impacts of strategic and operational risk management capabilities on the export intention of SMEs. This paper provides a more holistic approach to managing internal/controllable risk factors and investigates this construct's effect on internationalization. A country comparison in this specific effect has been only performed in this study. Moreover, the construct of managing internal/controllable risk factors is also linked with the dynamic capability of RBV only in this paper.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0965eb9c06601724ff90b543e5caeb2",
  "timestamp": "2025-05-15T02:51:29.965923"
}