{
  "id": 1439,
  "title": "Why credit risk markets are predestined for exhibiting log-periodic power law structures",
  "abstract": "Recent research has established the existence of log-periodic power law (LPPL) patterns in financial institutions' credit default swap (CDS) spreads. The main purpose of this paper is to clarify why credit risk markets are predestined for exhibiting LPPL structures. To this end, the credit risk prediction of two variants of logistic regression, i.e. polynomial logistic regression (PLR) and kernel logistic regression (KLR), are firstly compared to the standard logistic regression (SLR). In doing so, the question whether the performances of rating systems based on balance sheet ratios can be improved by nonlinear transformations of the explanatory variables is resolved. Building on the result that nonlinear balance sheet ratio transformations hardly improve the SLR's predictive power in our case, we secondly compare the classification performance of a multivariate SLR to the discriminative powers of probabilities of default derived from three different capital market data, namely bonds, CDSs, and stocks. Benefiting from the prompt inclusion of relevant information, the capital market data in genersal and CDSs in particular increasingly outperform the SLR while approaching the time of the credit event. Due to the higher classification performances, it seems plausible for creditors to align their investment decisions with capital market-based default indicators, i.e., to imitate the aggregate opinion of the market participants. Since imitation is considered to be the source of LPPL structures in financial time series, it is highly plausible to scan CDS spread developments for LPPL patterns. By establishing LPPL patterns in governmental CDS spread trajectories of some European crisis countries, the LPPL's application to credit risk markets is extended. This novel piece of evidence further strengthens the claim that credit risk markets are adequate breeding grounds for LPPL patterns. (C) 2013 Elsevier B.V. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b099dfb8eb379d1b29ea6cf0233611f2",
  "timestamp": "2025-05-15T02:03:00.693081"
}