{
  "id": 2696,
  "title": "The lean and agile purchasing portfolio model",
  "abstract": "Purpose - The aim of this paper is to present a purchasing portfolio model for determining purchasing strategy at the component level of a product to support business strategy, addressing weaknesses in the often cited Kraljic-type models. The work draws on Fisher's model to match supply strategy to product nature. However, Fisher's model was criticised very recently by Lo and Power in this journal because it is unclear how the leagile option should fit into it. This paper addresses this issue. Design/methodology/approach - The new portfolio model is based on the literature, particularly Fisher's seminal work. It is then applied to two case studies; an electric boiler manufacturer and an elevator manufacturer, both in South Korea. The analytic hierarchy process (AHP) is used to position purchased components in the model. Findings - Different purchasing strategies should be assigned to different components according to their impact on the competitive priorities. As the electric boiler is a functional product, while the elevator is an innovative product, the case studies show how this can vary across the two product-types identified by Fisher. Research limitations/implications - The new model has been tested on only two case studies, which limits the ability to generalise the findings. Future work will use the lean and agile purchasing portfolio model in research and knowledge exchange activities with other industrial partners to further develop and test its efficacy. Originality/value - The new model captures the finding of Fisher and others that products should be classified as functional or innovation to determine their suitability for lean or agile supply respectively. However, this classification is extended here to the component level and with the addition of the leagile and non-strategic supply options, and it depends on the impact a component has on the four competitive priorities; cost, quality, time and flexibility.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0b27ddd1cd04a0db32eacb839de448c",
  "timestamp": "2025-05-15T01:09:43.306864"
}