{
  "id": 4129,
  "title": "The delineation of tree crowns in Australian mixed species forests using hyperspectral Compact Airborne Spectrographic Imager (CASI) data",
  "abstract": "In mixed-species forests of complex structure, the delineation of tree crowns is problematic because of their varying dimensions and reflectance characteristics, the existence of several layers of canopy (including understorey), and shadowing within and between crowns. To overcome this problem, an algorithm for delineating tree crowns has been developed using eCognition Expert and hyperspectral Compact Airborne Spectrographic Imager (CASI-2) data acquired over a forested landscape near Injune, central east Queensland, Australia. The algorithm has six components: 1) the differentiation of forest, non-forest and understorey; 2) initial segmentation of the forest area and allocation of segments (objects) to larger objects associated with forest spectral types (FSTs); 3) initial identification of object maxima as seeds within these larger objects and their expansion to the edges of crowns or clusters of crowns; 4) subsequent classification-based separation of the resulting objects into crown or cluster classes; 5) further iterative splitting of the cluster classes to delineate more crowns; and 6) identification and subsequent merging of oversplit objects into crowns or clusters. In forests with a high density of individuals (e.g., regroAqh), objects associated with tree clusters rather than crowns are delineated and local maxima counted to approximate density. With reference to field data, the delineation process provided accuracies > similar to 70% (range 48-88%) for individuals or clusters of trees of the same species with diameter at breast height (DBH) exceeding 10 cm (senescent and dead trees excluded), with lower accuracies associated with dense stands containing several canopy layers, as many trees were obscured from the view of the CASI sensor. Although developed using I-m spatial resolution CASI data acquired over Australian forests, the algorithm has application elsewhere and is currently being considered for integration into the Definiens product portfolio for use by the wider community. (c) 2006 Elsevier Inc. All rights reserved.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0b30e76df6ad00f9d61727c90626976",
  "timestamp": "2025-05-15T01:23:58.148954"
}