{
  "id": 183,
  "title": "Modeling Price and Risk in Chinese Financial Derivative Market with Deep Neural Network Architectures",
  "abstract": "As rapid growth, Chinese financial derivative market is holding increasingly large proportions in entire domestic capital market as well as in global shares. To the nature of derivative instruments, plenty of market data features (such as prices and trading volumes) and off-market factors (such as financial news and policies) can directly impact on the price and risk in Chinese financial derivative markets, which is becoming more and more infeasible to model by using only traditional financial models and hand-crafted features. To alleviate the issue, in this paper we introduce some state-of-art deep neural network architectures and model two significant futures market price and risk indicators that are widely used by Chinese regulators, which are turn-over ratio (ratio of daily trading volumes and daily open interest volumes) and price basis (gap between futures price and corresponding spot product price). The extensive experimental results show that deep learning methods perform better prediction accuracy than traditional methods, among which convolutional LSTM achieves better results in most cases as it can capture local time-variant patterns. In addition, we also propose methods to exploit alternative off-market features (such as social media emotions and Baidu Search Index) with DNN models, which are proven beneficial to the price and risk prediction by rendering extra information than only market data.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0b421a9ee909fa1f2608e1843e85d0a",
  "timestamp": "2025-05-15T01:47:52.997406"
}