{
  "id": 2096,
  "title": "Maritime-Accident-Induced Environmental Pollution and Economic Loss Analysis Using an Interpretable Data-Driven Method",
  "abstract": "In this study, we developed an interpretable machine learning (ML) framework to predict marine pollution and economic losses from accident risk factors. A triple-feature selection process identified key predictors, followed by a comparative analysis of eight ML models. Random forest outperformed other models in forecasting environmental and property damage. The interpretable model was established based on the SHAP value framework, which revealed that onboard personnel count, vessel dimensions (length), and accident/ship types account for the risk factors with the most severe consequences, with environmental conditions like wind speed and air temperature contributing secondary effects. The methodology enables two critical applications: (1) environmental agencies can proactively assess accident impact through the identified risk triggers, optimizing emergency response planning, and (2) insurance providers gain data-driven risk evaluation metrics to refine premium calculations. By quantifying how human/technical factors, including crew members and vessel specifications, dominate over natural variables in accident effects, this data-driven approach provides actionable insights for maritime safety management and financial risk mitigation, achieving high prediction accuracy while maintaining model transparency through Shapley value explanations.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0c838d09924d2db6c8cb31b0653996e",
  "timestamp": "2025-05-15T02:10:59.080840"
}