{
  "id": 6014,
  "title": "Private Long-Term Care Insurance Decision: The Role of Income, Risk Propensity, Personality, and Life Experience",
  "abstract": "The rising aging population contributes to increased caregiver burden and a greater need for long-term care services, thereby posing stronger financial burden. The current study aimed to examine the effect of income, risk-taking propensity, personality traits, and life experience on the ownership of and intention to own private long-term care insurance (LTCI). Primary data were collected from 1373 registered nurses with a minimum of two years of full-time working experience. Multinomial logistic regression was used to examine the relationships between ownership of LTCI and personal discretionary income, risk propensity, openness to experience, and life experience. Personal discretionary income was a crucial positive indicator in predicting ownership of LTCI. Higher risk-taking propensity was found to be negatively related to both currently own and future intention to own private LTCI. Participants who currently live with elders and who agree to caregiving responsibilities with government-provided cash allowance showed future intention to purchase LTCI. Little evidence was found for an association between life experience and future intention to own LTCI. Income, risk-taking propensity, and personality traits differ in their impact on ownership of and future intention to own LTCI. Our results provide policy makers with a better understanding of the forces driving demand in the private LTCI market, as well as the accompanying implications for public LTCI.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0d6e37004af0025e45a098b7e3fe031",
  "timestamp": "2025-05-15T02:54:03.311920"
}