{
  "id": 9085,
  "title": "Socioeconomic risk factors for long-term opioid use: A national registry-linkage study",
  "abstract": "Background: Opioid use has increased substantially as a treatment for chronic pain, although harms from long-term opioid therapy outweigh the benefits. More knowledge about factors associated with long-term opioid use is needed. We aimed to investigate the association between socioeconomic status and long-term opioid use in the period 2010-2019. Methods: This was a nested case-control study in which the cases were all persons >= 18 years with long-term opioid use, that is use of opioids for more than 3 months (N = 215,642). Cases were matched on gender, age and index year (first long-term use period) with four controls who filled at least one opioid prescription, but never developed long-term opioid use in the study period (N = 862,568). We performed a logistic regression analysis adjusted for relevant confounders, stratified on age groups (18-67 years and 68 years and above). Results: In the younger age group, long-term opioid use was associated with low education (adjusted odds ratio, aOR = 1.54; 95% confidence interval, CI [1.51-1.57]), low income (1.33 [1.31-1.36]), being unemployed (1.40 [1.38-1.42]) and receiving disability pension (1.36 [1.33-1.38]). Weaker associations were found for living in a single-person household or in a dense geographical area. Similar associations were found for the older age group. Conclusion: We found that low socioeconomic status was associated with long-term opioid use both among people in working age and older people. These results indicate a need for social and financial support for non-pharmacological treatment of chronic pain among people with lower socioeconomic status. Significance: This study shows that people with low socioeconomic status are at higher risk of developing long-term opioid use. In the clinical setting, physicians should consider socioeconomic status when prescribing opioids for chronic pain. Non-pharmacological treatment options funded by public health services should be prioritized to those with low socioeconomic status as long-term opioid use in chronic pain patients is not recommended.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0d77bc4355373cf2000f50c5d7f6d05",
  "timestamp": "2025-05-15T03:25:27.712482"
}