{
  "id": 8164,
  "title": "Effect of surgical timing on outcomes after cholecystectomy for mild gallstone pancreatitis",
  "abstract": "Background: Retrospective and single-center studies have demonstrated that early cholecystectomy is associated with shorter length of stay in patients with mild gallstone pancreatitis. However, these studies are not powered to detect differences in adverse events. Using a nationally representative cohort, we evaluated the association of timing for cholecystectomy with clinical outcomes and resource use in patients with gallstone pancreatitis.Methods: All adult hospitalizations for gallstone pancreatitis were tabulated from the 2016-2019 Nationwide Readmissions Database. Using International Classification of Disease, 10th Revision codes, patient comorbidities and operative characteristics were determined. Patients with end-organ dysfunction or cholangitis were excluded to isolate those with only mild gallstone pancreatitis. Major adverse events were defined as a composite of 30-day mortality and perioperative (cardiovascular, respiratory, neurologic, infectious, and thromboembolic) complications. Timing of laparoscopic cholecystectomy was divided into Early (within 2 days of admission) and Late (>2 days after admission) cohorts. Multivariable logistic and linear regression were then used to evaluate the association of cholecystectomy timing with major adverse events and secondary outcomes of interest, including postoperative hospital duration of stay, costs, non -home discharge, and readmission rate within 30 days of discharge.Results: Of an estimated 129,451 admissions for acute gallstone pancreatitis, 25.6% comprised the Early cohort. Compared to patients in the Early cohort, Late cohort patients were older (56 [40-69] vs 53 [37 -66] years, P < .001), more likely male (36.6 vs 32.8%, P < .001), and more frequently underwent preop-erative endoscopic retrograde cholangiopancreatography (22.2 vs 10.9%, P < .001). In addition, the Late cohort had higher unadjusted rates of major adverse events and index hospitalization costs, compared to Early. After risk adjustment, late cholecystectomy was associated with higher odds of major adverse events (adjusted odds ratio 1.40, 95% confidence interval 1.29-1.51) and overall adjusted hospitalization costs by $2,700 (95% confidence interval 2,400-2,800). In addition, compared to the Early group, those in the Late cohort had increased odds of 30-day readmission (adjusted odds ratio 1.12, 95% confidence interval 1.03 -1.23) and non-home discharge (adjusted odds ratio 1.42, 95% confidence interval 1.31-1.55).Conclusion: Cholecystectomy >2 days after admission for mild gallstone pancreatitis was independently associated with increased major adverse events, costs, 30-day readmissions, and non-home discharge. Given the significant clinical and financial consequences, reduced timing to surgery should be prioritized in the overall management of this patient population.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0df4bb5d0a7ac29c70b65551ad11024",
  "timestamp": "2025-05-15T03:16:17.261930"
}