{
  "id": 4351,
  "title": "Financial Risk Protection and Hospital Admission for Trauma in Cameroon: An Analysis of the Cameroon National Trauma Registry",
  "abstract": "Background Half of the global population is at risk for catastrophic health expenditure (CHE) in the event that they require surgery. Universal health coverage fundamentally requires protection from CHE, particularly in low- and middle-income countries (LMICs). Financial risk protection reports in LMICs covering surgical care are limited. We explored the relationship between financial risk protection and hospital admission among injured patients in Cameroon to understand the role of health insurance in addressing unmet need for surgery in LMICs. Methods The Cameroon National Trauma Registry, a database of all injured patients presenting to the emergency departments (ED) of three Cameroonian hospitals, was retrospectively reviewed between 2015 and 2017. Multivariate regression analysis identified predictors of hospital admission after injury and of patient report of cost inhibiting their care. Results Of the 7603 injured patients, 95.7% paid out-of-pocket to finance ED care. Less than two percent (1.42%) utilized private insurance, and more than half (54.7%) reported that cost inhibited their care. In multivariate analysis, private insurance coverage was a predictor of hospital admission (OR 2.17, 95% CI: 1.26, 3.74) and decreased likelihood of cost inhibiting care (OR 0.34, 95% CI: 0.20, 0.60) when compared to individuals paying out-of-pocket. Conclusion The prevalence of out-of-pocket spending among injured patients in Cameroon highlights the need for financial risk protection that encompasses surgical care. Patients with private insurance were more likely to be admitted to the hospital, and less likely to report that cost inhibited care, supporting private health insurance as a potential financing strategy.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0dff09cb2eaf2cd590cbe726636f87b",
  "timestamp": "2025-05-15T02:36:05.243149"
}