{
  "id": 6372,
  "title": "Financial impact of health promotion programs: A comprehensive review of the literature",
  "abstract": "Purpose. The purpose of this review is to summarize the literature on the ability of health promotion programs to reduce employee-related health rare expenditures and absenteeism. Search Process. Using hey words in a literature-searching program, a comprehensive search was conducted on the following databases: MEDLINE, Embase, HealthSTAR, SPORTDiscus, PsycINFO, SciSearch, EPIC, and ABI Inform. Study Inclusion and Exclusion Criteria. All data-based studies that appeared in peer reviewed journals in the English language. Theses, dissertations, or presentation abstracts that were not published in peer reviewed journals were excluded. The initial search identified 196 studies, but only 72 met the inclusion criteria and were included in the review. Data Extraction Methods. Summary tables were created that include design classification, subject size, results, and other hey information for each study. Data Synthesis. Both the nature of the findings and the overall quality of the literature were evaluated in an attempt to answer two questions: Do individuals or populations with high health risks have worse financial outcomes than individuals or populations with lore health risks? Do health promotion programs improve financial outcomes? Major Conclusions. There are good correlational data to suggest that high levels of stress, excessive body weight, and multiple risk factors are associated with increased health care costs and illness-related absenteeism. The associations between seat belt use, cholesterol, diet, hypertension, and alcohol abuse and absenteeism and health care expenditures are either mixed or unknown. Health promotion programs are associated with lower levels of absenteeism and health care costs, and fitness programs are associated with reduced health care costs.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0e99b14aea7dd36b33a2f5d10af5019",
  "timestamp": "2025-05-15T02:57:38.699687"
}