{
  "id": 5571,
  "title": "The Impact of Mobile Payment on Household Poverty Vulnerability: A Study Based on CHFS2017 in China",
  "abstract": "Changes in digital technology have brought about new opportunities in the field of financial poverty alleviation in China, and mobile payment as a new digital financial model is important in helping families to lift themselves out of poverty effectively and prevent a return to poverty. This paper examines the impact of mobile payment on household poverty vulnerability and the mechanism of action using the China Household Finance Survey (CHFS) 2017 microsurvey data. After adopting the IVprobit model and a series of robustness tests, we found: (1) mobile payment significantly negatively impacts household poverty vulnerability; (2) the mechanism analysis indicates that promoting entrepreneurship and improving risk management capabilities are the main channels through which mobile payment mitigates household poverty vulnerability; (3) household entrepreneurship and entrepreneurial survival significantly reduce the probability of poverty vulnerability; and (4) the probit regression analysis explores how mobile payment has a greater negative impact on poverty vulnerability among low-income, homeless, and relatively backward households in rural or western areas. This work contributes to the literature on the use of electronic communication technology to eradicate poverty and on inclusive finance, providing vital results for other countries to use as an example.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0ebed18b9d36a495657342d92759c00",
  "timestamp": "2025-05-15T02:49:21.609284"
}