{
  "id": 319,
  "title": "BANKRUPTCY PREDICTION MODELS FOR ROMANIAN RESTAURANTS",
  "abstract": "The bankruptcy problem is an issue of interest for long time. The research in this area is far from being closed. Identifying the bankruptcy risk with some time before the insolvency occur is a goal of many investors, shareholders and managers. In this research, the database is composed by about 1000 restaurants that have over 5 employees, with the financial statements between 2010 and 2015 and with insolvency notifications (at March 2017) at National Trade Register Office. The main objective is to apply machine learning techniques like linear discriminant analysis, logistic regression and decision trees in order to identify bankruptcy risk with 1 or 2 years before insolvency, considering from the start 2 classes (high risk and low risk). Also, another goal of this research is to identify whether the principal components analysis provides better results than original variables, considering that principal components are uncorrelated, but takes less information than original variables. The results of the study is surprisingly because the lost information by synthesize variables into components affect models accuracies. Also, it is expected that the closer the financial results are to the moment of insolvency, the higher the accuracies rates are. Finally, logistic regression outperforms linear discriminant analysis that outperforms decision trees, being a normal performance relation, considering the robustness of methodologies.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0eb54b2a4dbc687b3e2f7a1844c14ac",
  "timestamp": "2025-05-15T01:49:40.957770"
}