{
  "id": 6581,
  "title": "Patient-Reported Outcomes and Long-Term Nonadherence to Aromatase Inhibitors",
  "abstract": "Background: Nonadherence to aromatase inhibitors (AIs) is common and increases risk of breast cancer (BC) recurrence. We analyzed factors associated with nonadherence among patients enrolled in S1105, a randomized trial of text messaging. Methods: At enrollment, patients were required to have been on an adjuvant AI for at least 30 days and were asked about financial, medication, and demographic factors. They completed patient-reported outcomes (PROs) representing pain (Brief Pain Inventory), endocrine symptoms (Functional Assessment of Cancer Therapy-Endocrine Symptoms), and beliefs about medications (Treatment Satisfaction Questionnaire for Medicine; Brief Medication Questionnaire). Our primary endpoint was AI nonadherence at 36 months, defined as urine AI metabolite assay of less than 10 ng/mL or no submitted specimen. We evaluated the association between individual baseline characteristics and nonadherence with logistic regression. A composite risk score reflecting the number of statistically significant baseline characteristics was examined. Results: We analyzed data from 702 patients; median age was 60.9 years. Overall, 35.9% patients were nonadherent at 36 months. Younger patients (younger than age 65 years) were more nonadherent (38.8% vs 28.6%, odds ratio [OR] = 1.51, 95% confidence interval [CI] = 1.05 to 2.16; P = .02). Fourteen baseline PRO scales were each statistically significantly associated with nonadherence. In a composite risk model categorized into quartile levels, each increase in risk level was associated with a 46.5% increase in the odds of nonadherence (OR = 1.47, 95% CI = 1.26 to 1.70; P<.001). The highest-risk patients were more than 3 times more likely to be nonadherent than the lowest-risk patients (OR = 3.14, 95% CI = 1.97 to 5.02; P<.001). Conclusions: The presence of multiple baseline PRO-specified risk factors was statistically significantly associated with AI nonadherence. The use of these assessments can help identify patients for targeted interventions to improve adherence.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b0f01fa9c640e455c45f98828d297e0f",
  "timestamp": "2025-05-15T02:59:36.968279"
}