{
  "id": 8261,
  "title": "What are the key drivers of Fraud reporting in Takaful insurance? Evidence from count data models",
  "abstract": "PurposeThis study aims at investigating the effect of corporate governance attributes on the Fraud disclosure of Takaful insurance companies in Saudi Arabia from 2014 to 2022.Design/methodology/approachThis study uses a self-constructed disclosure index to quantify the level of fraud information using content analysis. The count regression (Poisson and negative binomial) models in panel data modeling are used to check the interdependence relationship between the Fraud disclosure and the corporate governance structure of 26 Takaful insurers.FindingsThe findings confirm the negative effect of ownership structure and the board size on the Fraud disclosure. However, the high proportion of independent board members, the audit board committee and the size of the risk board committee positively affect the extent of Fraud disclosure. Finally, this study provide evidence that large size of Shariah board is associated with a lower level of voluntary Fraud disclosure.Research limitations/implicationsBoth economics-based theories and social exchange theory provide a better basis upon which to understand mechanisms by which board of directors in Takaful insurance provides external stakeholders with valuable information about corporate fraud.Practical implicationsIt seems important to equip audit and Shariah board committee with the tools to give them an operational content that focus systematically on the tone at the top in investigating fraud, including disclosure and discipline.Originality/valueCorporate governance is rapidly changing in Saudi Arabia and it is unclear whether adopting a corporate governance practices in financial institutions is appropriate for Islamic insurance companies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b12bc0e61c5066337bf265c709c38214",
  "timestamp": "2025-05-15T03:16:49.077050"
}