{
  "id": 3954,
  "title": "The Use and Influence of Employee Incentives on Participation and Throughput in a Telephonic Disease Management Program",
  "abstract": "Participation rates are often viewed by vendors and employer-based disease management (DM) services as an important benchmark of successful program implementation. Although participation is commonly understood to vary widely between and within employer groups, little is known about the role of incentives on rates of participation and graduation from DM programs. This study examined the use of incentives, employer characteristics, and perceptions of employee-employer communication on participation and program throughput. The relationship between incentive use and rates of participation and throughput among 87 employer groups from the 2004 company portfolio were assessed using existing account information. Detailed information on the highest and lowest third of the sample was obtained through interviews with account representatives. Wilcoxon, chi square, and regression analyses were used to examine the influence of employer characteristics and incentive factors on enrollee participation rates and program completion. Fifty-two percent of the accounts offered incentives for participation. From 1% to 23% of the eligible employees enrolled and completed the DM program. Incentives had a direct impact on participation, with amounts greater than $50 the most effective. Participation increased with communication tools including e-mail, high-blast (repeated) communications, and health fairs. Results suggest that cash incentives and communication play a significant role in rates of participation and program completion. (Population Health Management. 2008; 11: 197-202)",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b12ccc08afbca29cdb158b7a4545dd2b",
  "timestamp": "2025-05-15T01:22:39.318459"
}