{
  "id": 480,
  "title": "Credit risk evaluation using clustering based fuzzy classification method",
  "abstract": "Credit scoring is a crucial indicator for banks to determine the financial position and the eligibility of a client for credit. In order to assign statistical odds or probabilities to predict the risk of nonpayment in relation to many other factors, the scoring criterion becomes an important issue. The focus of this study is to propose a clustering based fuzzy classification (CBFC) method for credit risk assessment. We aim to illustrate the beneficial use of machine learning (ML) methods whose prediction power is increased by adopting fuzzy theory to calculate the default risk with a better selection of the features contributing to it.An important feature of the CBFC method is that membership values obtained as a result of the fuzzy k-means clustering algorithm are used for the purpose of better capturing the structure of an existing system.An extensive comparison is performed to show how CBFC performs compared to the traditional ones for the datasets having different characteristics in terms of the variable types. Five different real-life datasets are studied to expose the contribution of fuzzy approach on improving the ML use. Our findings show that the proposed CBFC models can produce the promising classification results in credit risk evaluation which aid the practitioners and decision makers for issuance of credit purposes.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b12c537f69597c0e12a373ee15d7ec0a",
  "timestamp": "2025-05-15T01:51:31.240081"
}