{
  "id": 7612,
  "title": "The spatial dynamics of energy efficiency: EPC impact on retail property values",
  "abstract": "This paper systematically analyzes the effect of energy efficiency on transacted rental and capital values of Dutch retail property assets from 2015-2021. Prior research on Energy Performance Certification (EPC) and energy premiums consistently showed a pricing effect, but recent investigations reveal inconclusive results, particularly when considering non-residential properties. Leveraging a unique dataset of 1015 lease transactions and 478 sale transactions, this study provides one of the first estimates of how EPC labels impact retail value. We utilize ordinary least squares (OLS) regression, considering characteristic retail determinants such as footfall, catchment area type, and retail type, among others. This study finds a premium of 11 percent for rental transactions with Label C or higher on a price per square meter basis. Capital premiums for energy- efficient transactions are more marginal and complex, particularly when accounting for data limitations such as geographic distribution. The nexus between sustainability and financial benefits incentivizes investors and policymakers to embrace energy-efficient measures. Pioneering spatial analyses of EPCs in the retail sector, this paper offers insights for informed policy-making amid geographic variations. In the era of transparency, this research provides empirical evidence to drive responsible investments in energy-efficient retail, shifting from risk management to stakeholder benefits and improved capital efficiency.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b12ecaff01415abb6b5c42c4b9a38d47",
  "timestamp": "2025-05-15T03:10:05.710431"
}