{
  "id": 4313,
  "title": "The Effect of Mind Map as a Prewriting Activity in Third Grade Elementary Students' Descriptive Narrative Creative Writing With a Writing E-Portfolio",
  "abstract": "Background StudyThe integration of mind maps as a prewriting activity has shown potential in enhancing students' writing skills, yet there is limited research focusing specifically on third-grade elementary students' descriptive narrative creative writing within technology-enhanced learning environments. The use of digital tools, such as writing e-portfolios, has not been extensively explored in this age group, especially concerning their impact on continuous assessment and collaborative learning.ObjectivesThis study aims to investigate the effectiveness of mind maps as a prewriting activity in improving third-grade students' writing performance. It seeks to measure enhancements in writing fluency, flexibility, originality, elaboration, and sensitivity. Additionally, the study evaluates the role of writing e-portfolios in supporting continuous assessment and collaborative learning among students.MethodsDesign: The study employed a quasi-experimental design with two groups: an experimental group using mind maps and a control group. Instruments: Data collection instruments included pre- and post-tests to assess writing performance, semi-structured interview guides for qualitative data, and a digital platform for writing e-portfolios. Data collection: Quantitative data were gathered through standardised writing assessments, while qualitative insights were collected via interviews and analysis of student writing e-portfolio entries. Data analysis: Quantitative data were analysed using MANOVA and MANCOVA to identify differences between groups and to control for covariates. Linear regression analyses were conducted to determine the specific contributions of mind maps at different writing stages. Qualitative data were analysed to understand student's perspective on how mind map activities by using the Writing for Tomorrow system benefits their writing.ResultsThe results demonstrated significant improvements in the experimental group's writing performance across all measured categories, including fluency, flexibility, originality, elaboration, and sensitivity. The analysis highlighted the substantial benefits of mind maps, particularly during the drafting and revision stages. The study also found that the use of writing e-portfolios provided valuable support for continuous assessment and facilitated collaborative learning among students.ConclusionsThe findings suggest that incorporating mind maps as a prewriting activity can significantly enhance the descriptive narrative creative writing skills of third-grade students. Moreover, the use of writing e-portfolios contributes positively by offering a platform for continuous assessment and collaboration. This research underscores the importance of integrating visual and digital tools into elementary education to foster improved writing outcomes.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b14b42db4201404f7955ca3347ff217e",
  "timestamp": "2025-05-15T01:25:50.525524"
}