{
  "id": 1714,
  "title": "State of the Art in Electric Batteries' State-of-Health (SoH) Estimation with Machine Learning: A Review",
  "abstract": "The sustainable reuse of batteries after their first life in electric vehicles requires accurate state-of-health (SoH) estimation to ensure safe and efficient repurposing. This study applies the systematic ProKnow-C methodology to analyze the state of the art in SoH estimation using machine learning (ML). A bibliographic portfolio of 534 papers (from 2018 onward) was constructed, revealing key research trends. Public datasets are increasingly favored, appearing in 60% of the studies and reaching 76% in 2023. Among 12 identified sources covering 20 datasets from different lithium battery technologies, NASA's Prognostics Center of Excellence contributes 51% of them. Deep learning (DL) dominates the field, comprising 57.5% of the implementations, with LSTM networks used in 22% of the cases. This study also explores hybrid models and the emerging role of transfer learning (TL) in improving SoH prediction accuracy. This study also highlights the potential applications of SoH predictions in energy informatics and smart systems, such as smart grids and Internet-of-Things (IoT) devices. By integrating accurate SoH estimates into real-time monitoring systems and wireless sensor networks, it is possible to enhance energy efficiency, optimize battery management, and promote sustainable energy practices. These applications reinforce the relevance of machine-learning-based SoH predictions in improving the resilience and sustainability of energy systems. Finally, an assessment of implemented algorithms and their performances provides a structured overview of the field, identifying opportunities for future advancements.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b14d5b081b7c8789769a2b27977585b0",
  "timestamp": "2025-05-15T00:58:50.647422"
}