{
  "id": 3087,
  "title": "Health-Related Financial Catastrophe, Inequality and Chronic Illness in Bangladesh",
  "abstract": "Background: Bangladesh has a high proportion of households incurring catastrophic health expenditure, and very limited risk sharing mechanisms. Identifying determinants of out-of-pocket (OOP) payments and catastrophic health expenditure may reveal opportunities to reduce costs and protect households from financial risk. Objective: This study investigates the determinants of high healthcare expenditure and healthcare- related financial catastrophe. Methods: A cross-sectional household survey was conducted in Rajshahi city, Bangladesh, in 2011. Catastrophic health expenditure was estimated separately based on capacity to pay and proportion of non-food expenditure. Determinants of OOP payments and financial catastrophe were estimated using double hurdle and Poisson regression models respectively. Results: On average households spent 11% of their total budgets on health, half the residents spent 7% of the monthly per capita consumption expenditure for one illness, and nearly 9% of households faced financial catastrophe. The poorest households spent less on health but had a four times higher risk of catastrophe than the richest households. The risk of financial catastrophe and the level of OOP payments were higher for users of inpatient, outpatient public and private facilities respectively compared to using self-medication or traditional healers. Other determinants of OOP payments and catastrophic expenses were economic status, presence of chronic illness in the household, and illness among children and adults. Conclusion: Households that received inpatient or outpatient private care experienced the highest burden of health expenditure. The poorest members of the community also face large, often catastrophic expenses. Chronic illness management is crucial to reducing the total burden of disease in a household and its associated increased risk of level of OOP payments and catastrophic expenses. Households can only be protected from these situations by reducing the health system's dependency on OOP payments and providing more financial risk protection.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b154835ac0499f9490160f679f696965",
  "timestamp": "2025-05-15T02:22:25.122140"
}