{
  "id": 8726,
  "title": "Impact of Produce Prescriptions on Diet, Food Security, and Cardiometabolic Health Outcomes: A Multisite Evaluation of 9 Produce Prescription Programs in the United States",
  "abstract": "BACKGROUND:Produce prescriptions may improve cardiometabolic health by increasing fruit and vegetable (F&V) consumption and food insecurity yet impacts on clinical outcomes and health status have not been evaluated in large, multisite evaluations.METHODS:This multisite, pre- and post-evaluation used individual-level data from 22 produce prescription locations in 12 US states from 2014 to 2020. No programs were previously evaluated. The study included 3881 individuals (2064 adults aged 18+ years and 1817 children aged 2-17 years) with, or at risk for, poor cardiometabolic health recruited from clinics serving low-income neighborhoods. Programs provided financial incentives to purchase F&V at grocery stores or farmers markets (median, $63/months; duration, 4-10 months). Surveys assessed F&V intake, food security, and self-reported health; glycated hemoglobin, blood pressure, body mass index (BMI), and BMI z-score were measured at clinics. Adjusted, multilevel mixed models accounted for clustering by program.RESULTS:After a median participation of 6.0 months, F&V intake increased by 0.85 (95% CI, 0.68-1.02) and 0.26 (95% CI, 0.06-0.45) cups per day among adults and children, respectively. The odds of being food insecure dropped by one-third (odds ratio, 0.63 [0.52-0.76]) and odds of improving 1 level in self-reported health status increased for adults (odds ratio, 1.62 [1.30-2.02]) and children (odds ratio, 2.37 [1.70-3.31]). Among adults with glycated hemoglobin >= 6.5%, glycated hemoglobin declined by -0.29% age points (-0.42 to -0.16); among adults with hypertension, systolic and diastolic blood pressures declined by -8.38 mm Hg (-10.13 to -6.62) and -4.94 mm Hg (-5.96 to -3.92); and among adults with overweight or obesity, BMI decreased by -0.36 kg/m2 (-0.64 to -0.09). Child BMI z-score did not change -0.01 (-0.06 to 0.04).CONCLUSIONS:In this large, multisite evaluation, produce prescriptions were associated with significant improvements in F&V intake, food security, and health status for adults and children, and clinically relevant improvements in glycated hemoglobin, blood pressure, and BMI for adults with poor cardiometabolic health.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b15b0e94a2531d2fe3134bca56c84110",
  "timestamp": "2025-05-15T03:21:56.599186"
}