{
  "id": 6147,
  "title": "Frontiers: News Event-Driven Forecasting of Commodity Prices",
  "abstract": "Problem definition: Commodity prices have exhibited significant volatility in recent times, which poses an exogenous risk factor for commodity -processing and commodity -trading firms. Accurate commodity price forecasts can help firms leverage data -driven procurement policies that incorporate the underlying price volatility for financial and operational hedging decisions. However, historical prices alone are insufficient to obtain reasonable forecasts because of the extreme volatility. Methodology/results: Building on the hypothesis that commodity prices are driven by real -world events, we propose a method that automatically extracts events from news articles and combines them with price data using a neural network -based predictive model to forecast prices. In addition to achieving a high prediction accuracy that outperforms several benchmarks (by up to 13%), our proposed model is also interpretable, which allows us to identify meaningful events driving the price fluctuations. We found that the events frequently associated with major fluctuations in the price include natural, hike, policy, and elections, all of which are known drivers of price change. We used a corpus containing about 1.6 million news articles of a major Indian newspaper spanning 15 years and daily prices of four crops (onion, potato, rice, and wheat) in India to perform this study. Our proposed approach is flexible and can be used to predict other time series data, such as disease incidence levels or macroeconomic indicators, that are also influenced by real -world events. Managerial implications: Firms can leverage price forecasts from our system to design inventory and procurement policies in the face of uncertain commodity prices. Commodity merchants can also use the forecasts to design optimal storage policies for physical trading of commodities when prices are volatile. Our findings can also significantly impact policymakers, who can leverage the information of impending price changes and associated events to mitigate the negative effects of price shocks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b15dd1ca5bc185a4fbc27a0c501587f4",
  "timestamp": "2025-05-15T02:55:12.942305"
}