{
  "id": 9405,
  "title": "Explaining the barriers and facilitators of the accreditation process in maternity departments",
  "abstract": "BackgroundAccreditation is an important tool to ensure the quality of health services in health systems. Many studies have been conducted on the quality of accreditation in general and intensive care settings from the perspective of clinical nurses and nursing managers, but the barriers and facilitators of accreditation in maternity departments have not been studied. This study aims to explain the experiences and perspectives of midwives on implementing the accreditation process in the maternity department.MethodsThis qualitative conventional content analysis research was conducted in 2024 in Qom, Iran. Twelve midwives from the maternity departments of two referral hospitals were purposefully chosen. The data were collected through in-depth semi-structured interviews. Data analysis was performed using Graneheim and Lundman's approach.ResultsThree categories were extracted for accreditation barriers: Management barriers with subcategories of The lack of cultural structure, Shortage of personnel, Not entering gynecologists into the accreditation process, Non-effective management, Administrative barriers with subcategories of Paperwork and a lot of incoming information, Time-consuming and consuming tasks of accreditation, The dilemma between accreditation indicators and hospital standards, Imbalance between shift work activities, and participation in the process of accreditation, and Personal barriers with subcategories of  Paperwork and a lot of incoming information, Head midwife's stress and concern for accreditation, Inappropriate staff attitude toward accreditation, Reducing the motivation in the midwife, Midwife feel forced to do accreditation, Resistance to change. Two categories were extracted for accreditation facilitators: Actual facilitators with subcategories of The availability of in-service training courses, Determining the errors and clarification activities with documentation, Clinical midwifes' involvement in decisions of the accreditation, Risk reduction, and job security and Potential facilitators with subcategories of Hope for a better future with the accreditation process, Satisfaction of the accreditation, transparency, Emphasis on efficiency and effectiveness.ConclusionsBarriers to completing accreditation are multidimensional. The lack of proper management to create a cultural structure, to involve members of the treatment team, to solve the lack of staff, conflict between hospital standards and accreditation standards, frequent manual documentation, lack of anxiety control and promotion of motivation are some of the barriers to completing accreditation. Having multiple in-service courses related to accreditation and categorized errors and emphasizing effectiveness is a facilitator of accreditation completion. Considering the importance of the mother and newborn, health managers should adopt short and long-term management policies in the maternity departments to improve the facilitating factors and remove the barriers. To control the erosiveness of the accreditation process, the high-level managers of the hospitals should teach midwives effective management methods, and the active participation of gynecologists, increase motivation with financial and administrative incentives, involve more midwives in committees, and increase the personnel involved in the accreditation process. The middle managers of the hospital should also coordinate and balance the number of clinical shifts with the number of shifts in the accreditation process team. Planning in-service training to explain and inform about how to accurately complete accreditation standards and classification activities to reduce work errors.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b182fe22b4f550c17745e9089c2f3df0",
  "timestamp": "2025-05-15T03:28:17.664846"
}