{
  "id": 3169,
  "title": "Spatio-temporal analysis of land use and land cover change: a systematic model inter-comparison driven by integrated modelling techniques",
  "abstract": "Currently, land use and land cover change (LULCC) is of utmost concern for global environmental change and sustainability. Among the portfolio of techniques, modelling is considered as the best approach to explore LULC dynamics. We have performed a model inter-comparison exercise (including hybrid and non-hybrid models) using multiple performance metrics to identify the best modelling approach for the subsequent projection of future LULC. The methodology is demonstrated on the Subarnarekha basin of Eastern India by utilizing the LANDSAT imagery of 1989, 1994, 2006, and 2011. Before LULC modelling, the cross-tabulation and trend-surface analyses were performed to identify dominant land transitions in post-classification maps. Temporal mapping results over 1989-2011 exhibited a drastic decrease in the area under dense forest (25.7% to 19.0%), a substantial increase in the area under scrubland (21.0% to 26.1%) and a nominal reduction in the coverage of the agricultural land (51.2% to 49.0%). Four integrated models namely Multilayer perceptron-Markov Model (MLP-MC), Logistic Regression-Markov Model (LR-MC), and two hybrid models, i.e. Multilayer perceptron-Cellular automata-Markov model (MLP-CA-MC) and Logistic Regression-Cellular automata-Markov model (LR-CA-MC) were tested for their suitability for predicting future LULC for the basin. Based on the multiple model validation techniques, the MLP-MC model performed the best. MLP-MC model subsequently used a non-stationary relationship between selected explanatory variables and LULC to predict the future LULC for 2020 and 2030. The MLP-MC model projected that relative to the level of 2011, agricultural land, dense forest, and barren land may decrease by 8.3, 28.2 and 23.5%, respectively, and scrubland, built-up area, and water bodies may increase by 22.5, 87.3 and 13.3%, respectively, by 2030. Our findings contradict the prevalent view regarding the nationwide intensification of agriculture over the Indian subcontinent but are consistent with the national decreasing trend in the dense forest. The study provides a transferable methodology for the systematic comparison of LULC models (including hybrid and non-hybrid) against multiple performance metrics. The outcomes of the study may help land-use planners, environmentalist, and policymakers in framing better policies and management .recommendations.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1914011d2d8df90ba03b139c155f51d",
  "timestamp": "2025-05-15T01:14:16.235399"
}