{
  "id": 6541,
  "title": "Analyses of the operating performance of information service companies based on indicators of financial statements",
  "abstract": "This study aims to discuss the operating performance of information service companies based on three major indicators of financial statements, namely, cost and expense, solvency, and operating capacity, in order to provide a basis for management when making operational decisions. This study used the data of financial statements, extracted from the Taiwan Economic Journal (TEJ) database, regarding listed and OTC companies that operated in the information service industry from 2010 to 2019. A total of 328 sets of valid reference data were obtained, including 109 sets of data about listed companies and 219 sets of data about OTC companies. Operating performance was measured by gross profit margin. Operation management capability was measured by the operating expense ratio, labor cost ratio, R&D cost ratio, quick ratio, cash flow ratio, debt to equity ratio, accounts receivable turnover, inventory turnover, and fixed asset turnover. The business scale was used as a control variable. According to the empirical results, the gross profit margin of an information service company was higher if its operating expense ratio, labor cost ratio, R&D cost ratio, quick ratio, cash flow ratio, and accounts receivable turnover were higher, its debt to equity ratio and fixed asset turnover was lower, and its business scale was larger. Moreover, the regression results of principal elements on the operating performance show that the gross profit margin of an information service company was higher if it had better operation management, R&D capabilities, and solvency; while the gross profit margin of an information service company was lower if it had higher fixed asset turnover and inventory turnover (more frequent turnover operations). The empirical results of the principal elements of operating performance are consistent with the regression results. Finally, in order to improve market competitiveness through R&D and innovation, the managers of information service companies were recommended to increase their investments in R&D. In addition, it is suggested that the management of information service companies maintain high solvency liquidity to protect creditors' equity, mitigate the risk of a financial strait, and further stabilize operations to improve operating performance.(c) 2023 The Authors. Published by Elsevier B.V. on behalf of College of Management, National Cheng Kung University. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b19f97cbcfb1a74270a095c08e964085",
  "timestamp": "2025-05-15T02:59:07.527718"
}