{
  "id": 3109,
  "title": "Empirical Study of Performance of Particle Swarm Optimization Algorithms Using Grid Computing",
  "abstract": "This article presents an empirical study of the performance of the Particle Swarm Optimization algorithms catalog. The original Particle Swarm Optimizer has proved to be a very efficient algorithm, being applied in a wide portfolio of optimization problems. Spite of their capacities to find optimal solutions, some drawbacks, such as: the clustering of the particles with the consequent losing of genetic diversity, and the stagnation of the fitness amelioration, are inherent to the nature of the algorithm. Diverse enhancements to avoid these pernicious effects have been proposed during the last two decades. In order to test the improvements proposed. some benchmarks are executed. However, these tests are based on different configurations and benchmark functions, impeding the comparison of the performances. The importance of this study lies in the frequent use of Particle Swarm Optimizer to seek solutions in complex problems in the industry and science. In this work, several improvements of the standard Particle Swarm Optimization algorithm are compared using a identical and extensive catalog of benchmarks functions and configurations, allowing to create a ranking of the performance of the algorithms. A platform of Grid Computing has been used to support the huge computational effort.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1a33ac968bc05ff25736034370f89b3",
  "timestamp": "2025-05-15T01:13:45.183842"
}