{
  "id": 659,
  "title": "Credit scoring using multi-task Siamese neural network for improving prediction performance and stability",
  "abstract": "A credit scoring model serves as a predictive framework for estimating customer credit risk, specifically the probability of default. The model plays a crucial role in determining the approval of financial transactions, credit limits, and interest rates in financial institutions by predicting a customer's credit risk. Numerous studies have been conducted in the credit scoring field using machine learning techniques. Although the stability of a credit score distribution over time is equally important in credit scoring, most studies have focused solely on improving the model's predictive power. Therefore, this study proposes a multitask learning technique based on Siamese neural networks that simultaneously enhances both predictive power and stability in credit scoring models. Specifically, the proposed model uses personal loan execution data to predict customer defaults while ensuring that the score distribution closely aligns with a predefined golden distribution, thereby securing stability. The golden distribution is a hypothetical five-grade scale derived from scores generated by a pretrained deep neural network. Experimental results show that the proposed model outperforms traditional machine learning and stateof-the-art deep learning models in terms of both predictive power and stability. In particular, the proposed model demonstrates robustness by maintaining high predictive power and stability even in an environment where default rates gently decrease over a long period or where default rates change rapidly over a short period, which can lead to high variability in a model's predictive power and stability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1b176a374dac68af927134c65b5a4d5",
  "timestamp": "2025-05-15T01:53:24.989510"
}