{
  "id": 1645,
  "title": "Understanding and predicting lapses in mortgage life insurance using a machine learning approach",
  "abstract": "Mortgage Life Insurance (MLI) offers lucrative opportunities for insurers. However, customer retention has proven to be a daunting challenge, particularly following the regulatory changes of 2009 in Europe. New market entrants strategically employing low-premium tactics have reshaped the competitive landscape, leading established insurers and banks to grapple with retaining their MLI clientele. Consequently, increasing policy lapses hold critical implications for these financial entities. Responding to this intricate landscape, our research presents a predictive model that pinpoints the MLI policies at risk of lapse and disentangles the underlying factors propelling this risk. The objective is to provide insurers with a practical and strategic tool to improve customer retention, enabling them to identify specific actions to reduce customer attrition, improve financial stability, and strengthen customer loyalty. We used a dataset obtained from an insurance company and its partner bank to build the model. The effectiveness of four machine learning models, namely Logistic Regression, Random Forest, Neural Networks, and XGBoost, is investigated, with XGBoost outperforming the others. SHapley Additive exPlanations (SHAP) were utilized to bolster interpretability, thereby facilitating the conception and explication of the predictive model's most influential features. Underpinning the benefits of a nuanced exploration, the study's focus on a solitary insurance protection product and integrating bank data enabled us to apprehend the multifaceted drivers of lapse behavior. The study accentuates the merit of comprehensive data encapsulating a holistic perspective, with the four most influential features originating from bank data. From an insurer's standpoint, this research provides a strategic vantage point to proactively identify and engage with customers at risk of policy lapse and reformulate their policies to mitigate customer attrition.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1b4829c19890957c61e03cab672a38e",
  "timestamp": "2025-05-15T02:05:42.606486"
}