{
  "id": 2514,
  "title": "The stock-bond nexus and investors' behavior in mature and emerging markets Evidence from long-term historical data",
  "abstract": "Purpose Portfolio construction and diversification is a prominent challenge for investors. It reflects market agents' behavior and response to market conditions. This paper aims to investigate the stock-bond nexus in the case of two emerging and two mature markets, India, South Africa, the UK and the USA, using long-term historical monthly data. Design/methodology/approach To address the issue at hand, copula quantile-on-quantile regression (C-QQR) is used to model the correlation structure. Although this technique is driven by copula-based quantile regression model, it retains more flexibility and delivers more robust and accurate estimates. Findings Results suggest that there is substantial heterogeneity in the bond-stock returns correlation across the countries under study point to different investors' behavior in the four markets examined. Additionally, the findings reported herein suggest that using C-QQR in portfolio management can enable the formation of tailored response strategies, adapted to the needs and preferences of investors and traders. Originality/value To the best of the authors' knowledge, no previous study has addressed in a comparative setting the stock-bond nexus for the four countries used here using long-term historical data that cover the periods 1920:08-2017:02, 1910:01-2017:02, 1933:01-2017:02 and 1791:09-2017:02 for India, South Africa, the UK and the USA, respectively.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1b5b59f419c95eab2905d483ff0ec47",
  "timestamp": "2025-05-15T01:07:35.723266"
}