{
  "id": 4379,
  "title": "The optimality of non-additive approaches for portfolio selection",
  "abstract": "The selection of assets in which to invest money is of critical importance in the finance industry, and is rendered very treacherous because of the inherent market fluctuations, and the connections with the Economy, and major world events. Because of the high dimensionality of the problem of selecting an optimal portfolio (in the financial sense of, a portfolio outperforming other portfolios), and the large amount of data available, intelligent systems (e.g. artificial intelligence techniques, machine learning approaches) are a natural approach to tackle this problem, from a computational standpoint. Numerous techniques have been developed to combine the values of return, risk, and other characteristics of an asset. However, the majority of techniques that have been used to construct a portfolio, tend to ignore dependencies among the characteristics of an asset. Moreover, most of the techniques assume that all available data are precise, which is not the case since, for instance, the expected return of an asset is a prediction of future behavior. To address these drawbacks, it was proposed in Magoc, Modave, Ceberio, and Kreinovich (2009) to use non-additive (or fuzzy) methods. Fuzzy methods outperformed other techniques, at least in the case of the Shanghai market, where full disclosure of information is assumed. In this paper, we give an intuition why fuzzy approach performs very well in this particular finance problem. (C) 2011 Elsevier Ltd. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1ca3ea94288644908b74e21dbf8907b",
  "timestamp": "2025-05-15T02:36:38.424952"
}