{
  "id": 7157,
  "title": "Macroeconomic cyclical indicators and bank non-performing loans: does country governance matter in African countries?",
  "abstract": "Purpose - The purpose of this paper is to investigate the influence of macroeconomic cyclical indicators and country governance on bank non-performing loans in African countries. Design/methodology/approach - Data was collected from the 53 African countries covering 2005-2021. The paper develops an empirical model to examine the impact of country governance in reducing macroeconomic cycle-induced adverse effects on bank credit risk. This research estimates Random Effects models and the General Method of Moment to examine the link between microeconomic and governance factors on bank non-performing loans. Stata version 15.1 was used to conduct panel regression analysis. Findings - The findings of the study revealed that the generalized method of moments findings contributes valuable insights into the persistence of NPLs over time and the specific effects of variables on NPL levels. The study findings highlight that the debt-to-GDP ratio, unemployment, regulatory quality, government effectiveness and inflation have significant relationships with NPLs, shedding light on their specific contributions to credit risk dynamics. Research limitations/implications - The focus on a specific set of determinants for NPLs, which may not capture all the factors that influence NPL levels. Thus, the study did not consider the impact of macroeconomic shocks, such as natural disasters or global economic crises, which can have a significant impact on NPLs. Practical implications - Policymakers should prioritize maintaining sustainable debt levels, promoting employment growth and controlling inflation rates to mitigate credit risk and reduce nonperforming loans. Also, enhancing regulatory quality and government effectiveness is crucial in ensuring financial stability and minimizing non-performing loans in Africa. Originality/value - This paper provides a new possible solution to minimise bank non-performing loans risk by examining interactions of country governance regarding the macroeconomic cycle behaviour.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1cbc2f8e72263171d66348d8b17700a",
  "timestamp": "2025-05-15T03:05:32.116504"
}