{
  "id": 6986,
  "title": "Sleep Duration, Snoring Habits, and Cardiovascular Disease Risk Factors in an Ethnically Diverse Population",
  "abstract": "Background: Lack of sleep has been associated with an increased risk for cardiovascular disease (CVD) and all-cause mortality, but the mechanisms are not fully understood. Prior research has often been conducted in select populations and has not consistently adjusted for confounders, especially psychosocial factors. Objective: The aims of this study were to assess the association between sleep habits and established risk factors for CVD and to evaluate potential interactions by race and gender. Methods: Participants were part of a CVD screening and educational outreach program in New York City. Free-living men older than 40 years and women older than 50 years (n = 371, mean age = 60 years, 57% women, 60% racial/ethnic minorities) were systematically assessed for CVD risk (including traditional, lifestyle, and psychosocial risk factors) and completed a standardized questionnaire regarding sleep habits (including sleep duration and snoring). Lipids were analyzed by validated finger-stick technology. Stress at work and at home was assessed using a validated screening tool from the INTERHEART study. Associations between participants' sleep habits and CVD risk factors/demographic factors were assessed using multivariable logistic regression. Results: The proportion of participants who reported sleeping less than 6 hours per night on average was 28%, and 52% of participants reported snoring. Sleeping less than 6 hours per night was significantly (P < .05) associated with female gender, being single, increased stress at home, increased financial stress, and low-density lipoprotein cholesterol (LDL-C) level. Gender modified the association between sleep duration and LDL-C level (P = .04): Sleeping less than 6 hours per night was significantly associated with reduced LDL-C level among women and increased LDL-C level among men. Snoring was significantly associated with low high-density lipoprotein cholesterol (HDL-C) level (<40 mg/dL for men/<50 mg/dL for women), being married, increased stress at work and at home, less than 30 minutes of exercise per day, less than 5 servings of fruits and vegetables per day, and being overweight/obese (body mass index >= 25 kg/m(2)). The association between snoring and low HDL-C level remained significant in logistic regression models adjusted for demographic confounders (odds ratio, 1.83; 95% confidence interval, 1.06-3.19) but not after adjustment for body mass index greater than 25 kg/m(2). Conclusions: Sleeping less than 6 hours per night was associated with several traditional and psychosocial CVD risk factors, and snoring was associated with low HDL-C level, likely mediated through overweight/obesity. These data may have significance for health care providers to identify individuals who may be at increased CVD risk based on sleep habits.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1d8ca75f7aa5176458bcef245982aff",
  "timestamp": "2025-05-15T03:03:55.747838"
}