{
  "id": 906,
  "title": "Robust portfolio strategies based on reference points for personal experience and upward pacesetters",
  "abstract": "This study explores the concept of reference dependence in decision-making behavior, particularly in the realm of investment portfolios. Previous research has established that an individual's own circumstances and societal surroundings play a pivotal role in shaping their perception of risk. However, there has been limited exploration into the dynamic nature of reference points in investment decision-making. To address this gap in the literature, the current study is aimed at investigating the performances of relevant dynamic reference points in investment portfolios. In doing so, the personal experience and upward pacesetter reference points are established, and a comparative robust portfolio model incorporating the CVaR measure is utilized. The impacts of different reference behaviors on the proposed portfolio model's performance are also examined. Furthermore, to enhance the portfolio model's out-of-sample performance, a scenario formation method that leverages clustering techniques is proposed. The performances of several clustering methods, including classic hierarchical and spectral clustering, as well as reciprocal-nearest-neighbors supported clustering, are compared. The empirical results indicate that the positive behavior of the personal experience reference point yields a better expected return, while the negative behavior exhibits a lower level of risk. Moreover, the results suggest that the utilization of spectral clustering can significantly improve the out-of-sample performance of the proposed robust portfolio model.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1e82b9e7a5594e55dfb04db700c5a24",
  "timestamp": "2025-05-15T00:49:36.295911"
}