{
  "id": 3692,
  "title": "Using wavelets in the measurement of multiscale dependence between Saudi and selected foreign stock markets",
  "abstract": "This paper examines the multiscale linkage between one of the main stock markets in the Arab region (Tadawul All Share Index, TASI) and two foreign markets among its major partners (Dow Jones Industrial (DJI) and Financial Times Stock Exchange (FTSE)). A set of wavelet-based multifractal and cross-analysis tools are used to recognize signs of clustering or scattering between these markets in the time-frequency space. The experiment is designed to include a noteworthy period of instability in the financial sector along by a high recession in the global economic system. The results indicate that most cross-correlations corresponding to the highest wavelet detail are statistically significant, especially for central lead-lag coefficients. At the highest frequency bands, significance is rejected for most cross-correlations, thus providing investors with various short-term investment replacements and portfolio diversification openings. Over the crisis period, cross-correlations take a skewed distribution, which proves that foreign indexes have a higher predictive power for TASI's time series. Furthermore, the interdependence TASI-DJI is confirmed through several periods and at various frequencies, whereas the TASI-FTSE nexus was inclined to be slightly less important, particularly in short-run horizons. Another surprising result is that in the midst of the crisis, while high and continuous cross-correlations were expected, on a particular frequency band, we noted a significant dissociation between the Saudi index and the two international indexes. These findings would offer investors in Saudi Arabia new insights and tools for an increasingly globalized investment world.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1ea3afdeb36168a45d9ecb55e5a05a6",
  "timestamp": "2025-05-15T01:20:03.359937"
}