{
  "id": 7452,
  "title": "Moving from routine to risk-based official controls in slaughterhouses: Development of a scoring tool for the risk of non-compliance with animal welfare regulations",
  "abstract": "Slaughter of animals is a necessary step of meat production process that takes place out of public view, but that is a subject of consumers' and civil society organisations' concern. Public policies are progressing constantly to meet social expectations and optimize official controls in slaughterhouses. Regarding animal welfare, the main objective of official controls of food business operators (FBOs) is to ensure that animals are spared any avoidable pain, distress, or suffering during their killing and related operations. In this context of improving the efficiency of public action, the aim of this study was to develop a risk-based approach for the control of compliance with animal welfare regulations in red meat slaughterhouses. After a preliminary phase of data mapping, data qualitative assessment and expert knowledge elicitation, the statistical study was divided into four steps: (i) identification of risk factors associated with FBOs not being compliant with animal welfare requirements; (ii) development of a risk score formula to predict the risk of non-compliance with animal welfare regulations and assignment of a risk score to each process operating in a slaughterhouse; (iii) ranking of processes and slaugh-terhouses into different risk groups according to the score; (iv) validation of the model using data from the year 2020.Among the 16 variables included in the statistical model, five were found statistically associated with a higher risk of non-compliance with animal welfare regulations: (i) total annual slaughter volume (intermediate tonnage slaughterhouses being more at risk), (ii) predominance of the category of animals slaughtered (categories rep-resenting less than 15% of the total volume of the slaughterhouse being more at risk), (iii) stunning method (head only electrical stunning and slaughter without prior stunning being more risky techniques), (iv) economic sit-uation of the slaughterhouse (a worrying financial situation being more at risk), and (v) the overall evaluation of the previous year's animal welfare control (D-ratings being particularly indicative of high risk). A risk score formula was proposed based on the regression coefficients of each modality of these five variables to predict the risk of non-compliance with animal welfare requirements. Risk scores (RS) calculated for each process ranged from 1 to 8.4. Processes and slaughterhouses were classified into three risk groups based on that score: low risk (RS & LE; 2.5), medium risk (2.5 < RS < 4.5), high risk (RS & GE; 4.5). The validation phase finally allowed to validate the risk score developed. This innovative and comprehensive study will support risk management decisions to improve animal welfare in slaughterhouses, by moving from routine to risk-based inspections and adjusting control efforts frequency and nature of official controls to the level of risk of the establishments. Similar ap-proaches could be developed for poultry slaughterhouses and for food hygiene requirements.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b1f9390100b45a2b447d2121b52cf53d",
  "timestamp": "2025-05-15T03:08:37.968448"
}