{
  "id": 7176,
  "title": "Exploring Risk Factors of Recall-Associated Foodborne Disease Outbreaks in the United States, 2009-2019",
  "abstract": "Earlier identification and removal of contaminated food products is crucial in reducing economic burdens of foodborne outbreaks. Recalls are a safety measure that is deployed to prevent foodborne illnesses. However, few studies have examined temporal trends in recalls or compared risk factors between non-recall and recall outbreaks in the United States, due to disparate and often incomplete surveillance records in publicly reported data. We demonstrated the usability of the electronic Foodborne Outbreak Reporting System (eFORS) and National Outbreak Reporting System (NORS) for describing temporal trends and outbreak risk factors of food recalls in 1998-2019. We examined monthly trends between surveillance systems by using segmented time-series analyses. We compared the risk factors (e.g., multistate outbreak, contamination supply chain stage, pathogen etiology, and food products) of recalls and non-recalls by using logistic regression models. Out of 22,972 outbreaks, 305 (1.3%) resulted in recalls and 9378 (41%) had missing recall information. However, outbreaks with missing recall information decreased at an accelerating rate of similar to 25%/month in 2004-2009 and at a decelerating rate of similar to 13%/month after the transition from eFORS to NORS in 2009-2019. Irrespective of the contaminant etiology, multistate outbreaks according to the residence of ill persons had odds 11.00-13.50 times (7.00, 21.60) that of single-state outbreaks resulting in a recall (p < 0.001) when controlling for all risk factors. Electronic reporting has improved the availability of food recall data, yet retrospective investigations of historical records are needed. The investigation of recalls enhances public health professionals' understanding of their annual financial burden and improves outbreak prediction analytics to reduce the likelihood and severity of recalls.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b200e41ff74e5d1ef37103b552b6b86b",
  "timestamp": "2025-05-15T03:06:01.163701"
}