{
  "id": 8911,
  "title": "Economic worry and the presence of safety hazards on farms",
  "abstract": "In recent years the agricultural sector has experienced historical levels of economic challenges. Yet, the effects of these economic conditions on the physical safety of farm work environments remain poorly understood. We studied these possible etiological relationships in a cross-sectional analysis. A baseline survey of 2390 Saskatchewan farm operations was conducted in 2007. A single respondent from each farm provided information about the farm operation, its residents, perceptions of worry surrounding farm economic conditions, and the presence of six types of physical hazards. Binomial regression analyses were used to study the focal relationships between economics and safety while simultaneously adjusting for confounders at the farm level. Farms with high perceived levels of economic worry experienced elevations in risk for: the absence of well maintained buildings (RR 1.52; 95% CI: 1.27-1.87), the absence of safety shields on combines (RR 1.41; 95% Cl: 1.05-1.89), and the absence of safety shields on augers (RR 1.15; 95% Cl: 1.02-1.30). No apparent differences were observed by level of economic worry for the presence of ROPS on tractors, ladder safety cages on grain bins, and barriers around water hazards. We observed that financial conditions on farms appear to contribute to the decisions that farm operators make about safety. These are not innocuous choices as they in turn affect the health and safety of the entire population that works and lives in these occupational environments. Farm operators need to be supported in decisions to invest the physical safety of their farms. They also require evidence that investments in safety are indeed economically sensible and healthy management decisions. (C) 2013 Elsevier Ltd. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b21540e16349e43fd035248efa1fc268",
  "timestamp": "2025-05-15T03:23:27.893877"
}