{
  "id": 8860,
  "title": "Catastrophic health expenditures and its inequality in elderly households with chronic disease patients in China",
  "abstract": "Background: Although numerous studies examine catastrophic health expenditures (CHE) worldwide, most focus on whole populations rather than specific vulnerable groups. This study analyzes the extent, associated factors and inequality of CHE in elderly household with chronic disease patients in China. Methods: Data were obtained from a nationally representative elderly household survey-the China Health and Retirement Longitudinal Study-that was conducted by the National School of Development of Peking University in 2011. An elderly household with chronic disease patients is defined by >= 1 chronic disease patient who is >= 45 years of age. CHE was measured according to the proportion of out-of-pocket health payments to non-food household expenditures. The associated factors of CHE were estimated using ordinary least square and logistic regression modeling. CHE inequality was measured according to the concentration index (CI) and its decomposition. Results: CHE incidence and intensity were relatively high among elderly households with chronic disease patients. The main associated factors of CHE include household size, having members >65 years, having members with >= 2 chronic diseases, per capita income, and elderly household members demonstrating healthcare-seeking behaviors. Healthcare insurance did not significantly affect CHE risk. Disproportionate concentration of CHE was noted among elderly households, and poor elderly households demonstrated a higher probability of experiencing CHE. Factors such as household size, per capita income, having members >65 years, and having members with >= 2 chronic diseases are major and positive contributors to CHE inequality. Some inpatient and outpatient services are negatively contributed to CHE inequality, suggesting that the unequal usage of such services reduces CHE inequality among elderly households with chronic disease patients. Conclusion: Policy efforts should focus on improving financial protection and relieving the economic burden of disease in elderly households. The government should increase income subsidies and optimize social health insurance programs, thereby reducing CHE and alleviating CHE inequality among elderly households in China.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b218d7bd22fb7a95e3adcee629735ab5",
  "timestamp": "2025-05-15T03:22:57.960790"
}