{
  "id": 7607,
  "title": "Inpatient dislocation after primary total hip arthroplasty: incidence and associated patient and hospital factors",
  "abstract": "Introduction: Inpatient dislocation following total hip arthroplasty (THA) may incur substantial financial penalties for hospitals in the United States. However, limited studies report on current incidence and variability of dislocations. We utilised a large national database to evaluate inpatient hip dislocation trends regarding: (1) yearly incidences; (2) lengths of stay (LOS); (3) demographic factors; and (4) hospital metrics. Methods: The National Inpatient Sample was queried from 2012 to2016 for primary THA patients (n = 1,610,155), identifying 2490 inpatient dislocations. Various patient demographics and hospital characteristics were assessed. Multivariate regression analyses were conducted to identify dislocation risk factors. Results: Dislocation rates increased from 0.11% in 2012 to 0.18% in 2016 (p < 0.001). Dislocated patients experienced significantly longer LOS (p < 0.001). Patient demographic factors associated with dislocation were sex, race, Medicaid insurance, alcohol use disorder, psychosis, hemiparesis/hemiplegia, chronic renal failure, and obesity. Spinal fusion was not associated with inpatient dislocation. Dislocations were likeliest in the South and least likely in teaching hospitals. Conclusion: Inpatient dislocation has increased in recent years. Optimised management and recognition of the patient and hospital factors outlined in this study may help decrease inpatient dislocation risks following THA, thus avoiding hospital reimbursement penalties for this preventable complication.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b218c238747def96380d1ba74e9d8bd4",
  "timestamp": "2025-05-15T03:10:05.675889"
}