{
  "id": 8991,
  "title": "Estimating lifetime healthcare costs with morbidity data",
  "abstract": "Background: In many developed countries, the economic crisis started in 2008 producing a serious contraction of the financial resources spent on healthcare. Identifying which individuals will require more resources and the moment in their lives these resources have to be allocated becomes essential. It is well known that a small number of individuals with complex healthcare needs consume a high percentage of health expenditures. Conversely, little is known on how morbidity evolves throughout life. The aim of this study is to introduce a longitudinal perspective to chronic disease management. Methods: Data used relate to the population of the county of Baix Emporda in Catalonia for the period 2004-2007 (average population was N = 88,858). The database included individual information on morbidity, resource consumption, costs and activity records. The population was classified using the Clinical Risk Groups (CRG) model. Future morbidity evolution was simulated under different assumptions using a stationary Markov chain. We obtained morbidity patterns for the lifetime and the distribution function of the random variable lifetime costs. Individual information on acute episodes, chronic conditions and multimorbidity patterns were included in the model. Results: The probability of having a specific health status in the future (healthy, acute process or different combinations of chronic illness) and the distribution function of healthcare costs for the individual lifetime were obtained for the sample population. The mean lifetime cost for women was (sic)111,936, a third higher than for men, at (sic)81,566 (all amounts calculated in 2007 Euros). Healthy life expectancy at birth for females was 46.99, lower than for males (50.22). Females also spent 28.41 years of life suffering from some type of chronic disease, a longer period than men (21.9). Conclusions: Future morbidity and whole population costs can be reasonably predicted, combining stochastic microsimulation with a morbidity classification system. Potential ways of efficiency arose by introducing a time perspective to chronic disease management.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b21e4a087af7d82f892bba2a7dbc2743",
  "timestamp": "2025-05-15T03:24:26.366807"
}