{
  "id": 9193,
  "title": "A regional real-time debris-flow warning system for the District of North Vancouver, Canada",
  "abstract": "Engineered (structural) debris-flow mitigation for all creeks with elements at risk and subject to debris flows is often outside of the financial capability of the regulating government, and heavy task-specific taxation may be politically undesirable. Structural debris-flow mitigation may only be achieved over long (decadal scale) time periods. Where immediate structural mitigation is cost-prohibitive, an interim solution can be identified to manage residual risk. This can be achieved by implementing a debris-flow warning system that enables residents to reduce their personal risk for loss of life through timely evacuation. This paper describes Canada's first real-time debris-flow warning system which has been operated for 2 years for the District of North Vancouver. The system was developed based on discriminant function analyses of 20 hydrometric input variables consisting of antecedent rainfall and storm rainfall intensities for a total of 63 storms. Of these 27 resulted in shallow landslides and subsequent debris flows, while 36 storms were sampled that did not reportedly result in debris flows. The discriminant function analysis identified as the three most significant variables: the 4-week antecedent rainfall, the 2-day antecedent rainfall, and the 48-h rainfall intensity during the landslide-triggering storm. Discriminant functions were developed and tested for robustness against a nearby rain gauge dataset. The resulting classification functions provide a measure for the likelihood of debris-flow initiation. Several system complexities were added to render the classification functions into a usable and defensible warning system. This involved the addition of various functionality criteria such as not skipping warning levels, providing sufficient warning time before debris flows would occur, and hourly adjustment of actual rainfall vs. predicted rainfall since predicted rainfall is not error-free. After numerous iterations that involved warning threshold and cancelation refinements and further model calibrations, an optimal solution was found that best matches the actual debris-flow data record. Back-calculation of the model's 21-year record confirmed that 76% of all debris flows would have occurred during warning or severe warning levels. Adding the past 2 years of system operation, this percentage increases marginally to 77%. With respect to the District of North Vancouver boundaries, all debris flows occur during Warning and Severe Warnings emphasizing the validity of the system to the area for which it was intended. To operate the system, real-time rainfall data are obtained from a rain gauge in the District of North Vancouver. Antecedent rainfall is automatically calculated as a sliding time window for the 4-week and 2-day periods every hour. The predicted 48-h storm rainfall data are provided by the Geophysical Disaster Computational Fluid Dynamics Centre at the Earth and Ocean Science Department at the University of British Columbia and is updated every hour as rainfall is recorded during a given storm. The warning system differentiates five different stages: no watch, watch level 1 (the warning level is unlikely to be reached), watch level 2 (the warning level is likely to be reached), warning, and severe warning. The debris-flow warning system has operated from October 1, 2009 to April 30, 2010 and October 1, 2010 and April 30, 2011. Fortunately, we were able to evaluate model performance because the exact times of debris flows during November 2009 and January 2010 were recorded. In both cases, the debris flows did not only occur during the warning level but coincided with peaks in the warning graphs. Furthermore, four debris flows occurred during a warning period in November 2009 in the Metro Vancouver watershed though their exact time of day is unknown. The warning level was reached 13 times, and in four of these cases, debris flows were recorded in the study area. One debris flow was recorded during watch II level. There was no severe warning during the 2 years of operation. The current warning level during the wet season (October to April) is accessible via District of North Vancouver's homepage (www.dnv.org) and by automated telephone message during the rainy season.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b220d29a3fe388ceddc116fa54c8cc10",
  "timestamp": "2025-05-15T03:26:25.994495"
}