{
  "id": 3236,
  "title": "Categorizing sentiment and its impact on REIT returns",
  "abstract": "Purpose - The purpose of this paper is to reexamine the impact of investor sentiment on real estate investment trust (REIT) returns using direct, survey-based measures of sentiment to categorize sentiment from institutional and individual investors. Design/methodology/approach - The authors provide a framework in which sentiment is classified into individual and institutional investor sentiment under the assumption that investors, depending on sophistication, react differently to the same set of information and will influence REIT prices differently. The authors employ a methodology that uses panel regression analyses and divides the sample of REITs into size and performance portfolios. Findings - The regression results suggest that institutional investor sentiment is positively and significantly related to REIT returns contemporaneously for multiple sample specifications. These results are consistent with high levels of institutional ownership in REITs. Results also suggest that individual investor sentiment only influences small capitalization and low-a portfolios. Originality/value - The findings provide more evidence on the influence of investor sentiment on security pricing even for highly regulated sectors such as the REIT industry. Investors may use changes in sentiment as signals for portfolio rebalancing and capital allocations.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b238b7636aabfa521a34d4dea6aafbbd",
  "timestamp": "2025-05-15T01:14:55.067833"
}