{
  "id": 2936,
  "title": "MCDM-Based R&D Project Selection: A Systematic Literature Review",
  "abstract": "From small spin-offs deploying innovative software to big pharmaceutical complexes making vaccines, Research and Development (R&D) Project Portfolio Selection (PPS) is an essential strategic process for various companies. It was never easy to select a set of projects among many feasible possibilities, even for yesterday's paces. However, the world is rapidly changing, and so is R&D PPS. The portfolio objectives excel profit in the same manner that model constraints go beyond budget limitations. In parallel, project selection approaches and solving algorithms followed the increase of computational power. Despite all those changes, the importance of Multi-Criteria Decision Making (MCDM) methods and the decision criteria used for R&D PPS, there is still room for a systematic literature review (SLR) for the topic. Thus, this paper offers an SLR of the existing literature from the half-century, 1970, and onward MCDM-based R&D PPS performed in Scopus and Web of Science Core Collection. We provide a comprehensive picture of this field, show how it is changing, and highlight standard practices and research opportunities in the area. We perform a broad classification of the MCDM methods, categorized by the nature of alternatives, types of integration approach, the MCDM method itself, and types of uncertainty, by the 66 studies in the SLR database. The portfolios' classification obeys the application domain and the number of projects. We have also explored all the 263 criteria found in the literature by grouping them according to experts from five Brazilian R&D organizations that together manage portfolios valued around US$ 5 billion a year, accounting for 38% of all Brazilian annual expenditure in R&D projects. We also include a bibliometric analysis of the considered papers and research opportunities highlighted or not explored by researchers. Given the increasing number of decision-making approaches and new technologies available, we hope to provide guidance on the topic and promote knowledge production and growth concerning the usage of MCDM methods and decision criteria in R&D PPS.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b24e729c7aacd1156999db9575275386",
  "timestamp": "2025-05-15T01:11:48.490889"
}