{
  "id": 7041,
  "title": "Gambling behaviors and attitudes in adolescent high-school students: Relationships with problem-gambling severity and smoking status",
  "abstract": "Background and aims: Smoking is associated with more severe/extensive gambling in adults. The purpose of this study was to examine relationships between smoking and gambling in adolescents. Methods: Analyses utilized survey data from 1591 Connecticut high-school students. Adolescents were classified by gambling (Low-Risk Gambling [LRG], At Risk/Problem Gambling [ARPG]) and smoking (current smoker, non-smoker). The main effects of smoking and the smoking-by-gambling interactions were examined for gambling behaviors (e.g., type, location), and gambling attitudes. Data were analyzed using chi-square and logistic regression; the latter controlled for gender, race/ethnicity, grade, and family structure. Results: For APRG adolescents, smoking was associated with greater online, school, and casino gambling; gambling due to anxiety and pressure; greater time spent gambling; early gambling onset; perceived parental approval of gambling; and decreased importance of measures to prevent teen gambling. For LRG adolescents, smoking was associated with non-strategic gambling (e.g., lottery gambling); school gambling; gambling in response to anxiety; gambling for financial reasons; greater time spent gambling; and decreased importance of measures to prevent teen gambling. Stronger relationships were found between smoking and casino gambling, gambling due to pressure, earlier onset of gambling, and parental perceptions of gambling for ARPG versus LRG adolescents. Discussion: Smoking is associated with more extensive gambling for both low- and high-risk adolescent gamblers. Conclusion: Smoking may be a marker of more severe gambling behaviors in adolescents and important to consider in gambling prevention and intervention efforts with youth. (C) 2015 Elsevier Ltd. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2752b27979047e95cbcf62b93a2b924",
  "timestamp": "2025-05-15T03:04:23.022871"
}