{
  "id": 3829,
  "title": "Interaction of momentum returns in stock and bond markets in Korea",
  "abstract": "This study examines the profitability of momentum strategies in stock and bond markets in Korea and tests for a momentum spillover between stocks and bonds. Using weekly data on corporate bonds and common stocks of investment grade firms listed at the KSE from 2001 to 2004, we find significant abnormal returns to momentum strategies by 4bp per week (106 bp cumulative abnormal returns over 25 weeks) from the sample of corporate bonds, but not from the sample of common stocks which turns out to exhibit insignificant reversals over a couple of weeks. This result strikingly contrasts to the well-known evidence observed in the U.S., where common stocks exhibit significant momentum and corporate bonds exhibit significant reversals. Given that stocks and bonds are different claims to the same underlying operating cash flows and are affected by the same firm fundamentals, it is intriguing to observe such different results between stocks and bonds as observed in this study in response to the momentum strategies. The result indicates that the momentum is not a general property of asset returns and might be security-specific in both U.S. and Korea. In order to answer the question of which security returns are a better proxy for firm fundamental news, we examine the lead-lag relationship, between stocks and bonds by looking at whether the bond momentum predicts stock returns over 25 weeks, and vice versa. The answer is in the negative for both directions, indicating that the information linkage between stocks and bonds is fairly weak in Korea. In order to see whether the bond momentum discovered in this study is robust to various liquidity and risk adjustments, we first look at the profitability of bond momentum strategies within liquidity-based subsamples of firms based on the total face value of outstanding debt, the average daily won trading volume of the bonds over the prior 4 weeks, and the average daily turnover ratio of the equity over the prior 4 weeks. The profitability remains significant within the subsamples, indicating that the bond momentum cannot be attributable to illiquidity factors. Similarly, we adjust for risks based on default and maturity risks by matching every firm in the bond momentum portfolio with a benchmark portfolio with roughly the same bond ratings and similar time-to-maturity. The risk-adjusted bond return for each firm is then computed as the difference between the firm's raw bond return and the corresponding benchmark return. The bond momentum strategies applied to these risk-adjusted returns produce far smaller returns than those before adjusted for risk, although they are still significant with 27bp cumulative abnormal returns over 25 weeks and thus cannot be completely explainable by these two risk factors. Additional risk factors are then considered in the Fama-MacBeth's cross-sectional regression framework, which shows that the bond momentum returns are closely related to time-varying risk factors such as the contemporaneous maturity-matched Treasury bond returns and the change in the bond rating scores. Finally, in order to see whether the bond momentum is caused by sluggish responses to future rating revisions of winner and loser portfolios, we look at the change in the average bond ratings of winner and loser portfolios over the next 52 weeks, and the percentage of firms that experience upgrades and downgrades in winner and loser portfolios. Because the rating revisions are likely to be accompanied by corresponding changes in bond prices around the announcement date, we expect to observe positive returns to the bond momentum if losers (winners) subsequently experience more downgrades (upgrades) and decreasing (increasing) prices after portfolio formation. The results show that losers experience significantly more downgrades as well as significantly more upgrades than do winners over the first year after portfolio formation. This observation seems to indicate that the bond momentum cannot be attributable to sluggish responses to future rating revisions.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2774be7671b1d033882ded8f1e0876d",
  "timestamp": "2025-05-15T01:21:08.278152"
}