{
  "id": 4366,
  "title": "Internal control, risk and Shari'ah non-compliant income in Islamic financial institutions",
  "abstract": "Purpose - The existence of internal control for Shari. ah-compliance promotes reasonable assurance that the Islamic financial institution's (IFI's) objectives are achieved in the following categories, namely, the effectiveness and efficiency of operations, the reliability of financial reporting and the level of compliance with applicable laws and regulations, as well as accounting and auditing standards. Shari.ah non-compliant income (SNCI) is an important issue in IFIs' operations. Thus, the purpose of this paper is to identify issues related to governance and internal control of SNCI in selected IFIs in Malaysia. Design/methodology/approach - This research uses a case study approach to gather data on the measures of governance and risk management in relation to the internal control for SNCI in IFIs. Interviews were conducted with officers of the Shari.ah and internal audit departments on internal control practices regarding SNCI. Findings - Regulator's guidelines on SNCI are simple and brief, lacking rigour in terms of governance, risk management and audit procedures. The section on SNCI is only a brief statement within the Bank Negara Malaysia's Guidelines on Financial Reporting for Islamic Banking Institutions and also in the Operational Risk Integrated Online Network system operated by IFIs. Most of the respondents in the interviews suggested that there should be a proper guideline in determining the classification of SNCI. Second, although IFIs have established the purification account to manage SNCI, the real practice varies from one IFI to another. Third, although there are supposedly documented procedures established in relation to management and administration of SNCI, the following events still occur in practice, namely, no authorisation from the Shari.ah Committee (SC) on various types of income channelled to the SNCI account; unauthorised use of SNCI for other purposes; SNCI not being reported in the annual financial reports; and distribution of SNCI prior to obtaining the SC's consent. Fourth, there is an absence of Shari.ah risk assessment conducted on operational risk by IFIs to identify any potential Shari.ah noncompliant event. Research limitations/implications - This research contributes to the importance of Islamic corporate governance theory and Shari.ah risk management, as well as strengthening the case for reporting SNCI to shareholders. It also contributes to the body of knowledge on the capability of the management in managing the internal control system of IFIs' SNCI. yOriginality/value - A new internal control assessment matrix is proposed for Shari'ah-compliance in IFIs.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b27b85bdca9fe6b56475020bd95cb648",
  "timestamp": "2025-05-15T02:36:38.373452"
}