{
  "id": 3279,
  "title": "Measuring the connectedness of global health sector stock markets",
  "abstract": "This paper uses the minimum spanning tree model to investigate the dependency structure and integration degree of the global health sector stock markets. It examines the direction, intensity, time-varying characteristics, and asymmetric effects of return connectedness among these stock markets using the directional connectedness network model. It also explores the hedging and diversification analyses of global health sector stock markets. The empirical results suggest that health sector stock markets of the developing and developed countries show obvious group clustering characteristics, forming a low level of integration between the two groups and a high degree of integration within each group. For the return connectedness network, France, the UK, the US, and Germany are net return transmitters. India, Canada, China, Japan, and South Africa are net return recipients. Meanwhile, return spillovers among health sector stocks in these nine countries have obvious time-varying characteristics. In particular, the 2008 global financial crisis increased the integration level among global health sector stock markets. Moreover, there exists a significant asymmetric effect of return spillover among the global health sector stock markets, and the return spillover intensity in a declining market is significantly higher than it is in favourable market conditions. Finally, diversification evidence shows the optimal hedge ratios and portfolio weights across all nine countries changes over time.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b282e3b47f8f3ab9c5ab2fb01d80ea9c",
  "timestamp": "2025-05-15T01:15:26.168679"
}