{
  "id": 2907,
  "title": "Financial hardship and health risk behavior during COVID-19 in a large US national sample of women",
  "abstract": "COVID-19 has caused over 300,000 US deaths thus far, but its long-term health consequences are not clear. Policies to contain the pandemic have led to widespread economic problems, which likely increase stress and resulting health risk behaviors, particularly among women, who have been hardest hit both by job loss and caregiving responsibilities. Further, women with pre-existing disadvantage (e.g., those without health insurance) may be most at risk for stress and consequent health risk behavior. Our objective was to estimate the associations between financial stressors from COVID-19 and health risk behavior changes since COVID-19, with potential effect modification by insurance status. We used multilevel logistic regression to assess the relationships between COVID-19-related financial stressors (job loss, decreases in pay, trouble paying bills) and changes in health risk behavior (less exercise, sleep, and healthy eating; more smoking/vaping and drinking alcohol), controlling for both individual-level and zip code-level confounders, among 90,971 US women who completed an online survey in March-April 2020. Almost 40% of women reported one or more COVID-19-related financial stressors. Each financial stressor was significantly associated with higher odds of each type of health risk behavior change. Overall, reporting one or more financial stressors was associated with 56% higher odds (OR = 1.56; 95% CI: 1.51, 1.60) of reporting two or more health risk behavior changes. This association was even stronger among women with no health insurance (OR = 2.46; 95% CI: 1.97, 3.07). COVID-19-related economic stress is thus linked to shifts in health risk behaviors among women, which may have physical health consequences for years to come. Further, the relationship between financial hardship and health risk behavior among women may be modified by health insurance status, as a marker for broader socioeconomic context and resources. The most socioeconomically vulnerable women are likely at highest risk for long-term health effects of COVID-19 financial consequences.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b285c4e238d06bb1620a5f3420d1fefc",
  "timestamp": "2025-05-15T02:20:16.984163"
}