{
  "id": 7555,
  "title": "The association of maternal psychosocial stress with newborn telomere length",
  "abstract": "Background Telomere length in early life predicts later length, and shortened telomere length among adults and children has been linked to increased risk of chronic disease and mortality. Maternal stress during pregnancy may impact telomere length of the newborn. Methods In a diverse cohort of 355 pregnant women receiving prenatal and delivery care services at two hospitals in San Francisco, California, we investigated the relationship between self-reported maternal psychosocial stressors during the 2(nd) trimester of pregnancy and telomere length (T/S ratio) in newborn umbilical cord blood leukocytes. We examined financial strain, food insecurity, high job strain, poor neighborhood quality, low standing in one's community, experience of stressful/traumatic life events, caregiving for a dependent family member, perceived stress, and unplanned pregnancy. We used linear regression and Targeted Minimum Loss-Based Estimation (TMLE) to evaluate the change in the T/S ratio associated with exposure to each stressor controlling for maternal age, education, parity, race/ethnicity, and delivery hospital. Results In TMLE analyses, low community standing (-0.09; 95% confidence interval [CI]-0.19 to 0.00) and perceived stress (-0.07; 95% CI -0.15 to 0.021 was marginally associated with shorter newborn telomere length, but the associations were not significant after adjusting for multiple comparisons. All linear regression estimates were not statistically significant. Our results also suggest that the association between some maternal stressors and newborn telomere length varies by race/ethnicity and infant sex. Conclusions This study is the first to examine the joint effect of multiple stressors during pregnancy on newborn TL using a flexible modeling approach.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2872289bd0fd0b2573a1e61edf3ca91",
  "timestamp": "2025-05-15T03:09:36.976707"
}