{
  "id": 764,
  "title": "A framework for analyzing financial behavior using machine learning classification of personality through handwriting analysis",
  "abstract": "Rigorous documentation and inspection methods are used by financial institutions to manage the risk due to information asymmetry and moral hazard. Nevertheless, the intent of the borrower of funds is not obvious. The unique nature of handwriting can to an extent be a reflection of intent. Besides the financial services sector has a highly competitive market structure. Selling of financial products is a challenge; quickly understanding financial preferences through handwriting can be used to apply concentrated efforts on 'likely' customers. Handwriting analysis when facilitated through machine learning methods can have wider application to address the challenges of the financial sector. The present study adopts an experimental approach to apply machine learning techniques to handwriting analysis. Identified handwriting correlates helped to map the individual into corresponding personality type. Risk preferences are mapped to the Big Five Personality Traits (Andreas Oehler, 2017). Thus the paper detailed the evaluation of handwriting features for one of the Big Five Personality Traits viz. Extraversion. The results yielded 7 such handwriting features which were evaluated with machine learning techniques on 112 samples collected through personally administered questionnaire. Extraversion is associated with perceived financial behavior as 'risk seeker'. We found that individuals who scored high on extraversion had no risk no reward philosophy, were likely to over spend and were inclined to invest in risky financial products like mutual funds. (C) 2020 Elsevier B.V. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2960ec0ea56853ac17c855371dd58d3",
  "timestamp": "2025-05-15T01:55:07.975203"
}