{
  "id": 741,
  "title": "Abnormal brain structure in youth who commit homicide",
  "abstract": "Background: Violence that leads to homicide results in an extreme financial and emotional burden on society. Juveniles who commit homicide are often tried in adult court and typically spend the majority of their lives in prison. Despite the enormous costs associated with homicidal behavior, there have been no serious neuroscientific studies examining youth who commit homicide. Methods: Here we use neuroimaging and voxel-based morphometry to examine brain gray matter in incarcerated male adolescents who committed homicide (n = 20) compared with incarcerated offenders who did not commit homicide (n = 135). Two additional control groups were used to understand further the nature of gray matter differences: incarcerated offenders who did not commit homicide matched on important demographic and psychometric variables (n = 20) and healthy participants from the community (n = 21). Results: Compared with incarcerated adolescents who did not commit homicide (n = 135), incarcerated homicide offenders had reduced gray matter volumes in the medial and lateral temporal lobes, including the hippocampus and posterior insula. Feature selection and support vector machine learning classified offenders into the homicide and non-homicide groups with 81% overall accuracy. Conclusions: Our results indicate that brain structural differences may help identify those at the highest risk for committing serious violent offenses. (C) 2014 The Authors. Published by Elsevier Inc. This is an open access article under the CC BY-NC-ND license.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b29d0b090379b9dd520ef7b28f93325b",
  "timestamp": "2025-05-15T01:54:34.071637"
}