{
  "id": 8547,
  "title": "Impact of corporate governance on capital structure: mediating role of cost of capital",
  "abstract": "Purpose This paper contributes to the existing literature by extending the empirical work on the relationship between corporate governance and capital structure by analyzing the mediating role of cost of capital in the non-financial firms listed on the Pakistan Stock Exchange (PSX). Design/methodology/approach The sample for this study includes non-financial firms listed on the Pakistan Stock Exchange (formerly Karachi Stock Exchange) for the period of 2004-2016. Based on 1800 firm-year observations, three approaches of panel data analysis are applied for the step-wise analysis of the underlying study. Firstly, Pooled OLS is applied. Secondly, fixed and random effect panel regression followed by the Hausman test to check the unobservable individual heterogeneity of the data. Hausman test indicates that the fixed-effects model is the most appropriate model for the sample panel data. Findings The study's findings are that board size, board composition, CEO/Chair duality, institutional ownership and managerial ownership have statistically significant direct effect on the firm's financing decisions. However, CEO/Chair duality, institutional ownership and managerial ownership have significant indirect effect on firm's capital structure decisions. The interesting finding of the paper is on the evidence of mediating role of cost of capital in the nexus of corporate governance and capital structure. Moreover, some conventional determinants of capital structure, including the firm's size, asset structure of the firm, profitability, business risk and growth, are found as determinants of capital structure decisions of the firms. Research limitations/implications There are a few limitations to our study which could be addressed by upcoming research. We did not include all the four mechanisms of corporate governance including board structure, audit structure, compensation structure and ownership structure. However, we used only five important attributes including board size, board composition and CEO/Chair duality form board structure, managerial ownership and institutional ownership form ownership structure of corporate governance as our explanatory variables to examine their impact on the capital structure choices of the firms. Future studies may fill this research gap by involving some other attributes of corporate governance and analyzing their effectiveness and impact on value relevant capital structure decisions. Further, due to limited time and resources, we only tested the mediating role of cost of capital, hence, future researchers can analyze the mediating and moderating roles of different variables which may influence the relationship between corporate governance and capital structure choices of the firms. Practical implications The study has many valuable guidelines and practical implications for the financial managers of the corporations. Our results will facilitate the policymakers in setting their corporate governance policies and practices and making the value relevant capital structure decisions in compliance with the implications of corporate governance mechanism. In addition, our study provides the empirical evidence in accordance with the argument that good governance practices, particularly the voluntary disclosures by the firm may reduce the information asymmetry which, ultimately, reduces the agency cost and the cost of capital for the firm. However, while deciding the financial policy of the corporations, managers can use our findings in order to assess the effectiveness of corporate governance practices employed by the firm in achieving the optimal capital structure at which the weighted average cost of capital is at its minimum level. Originality/value This paper contributes to the literature by investigating the mediating role of the cost of capital in the relationship between corporate governance and capital structure decisions of the firms. This paper provides empirical evidence that corporate governance indirectly affects capital structure decisions through the mediating role of cost of capital.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2a16ed6a4cb187149949a10388cc491",
  "timestamp": "2025-05-15T03:19:52.165230"
}