{
  "id": 445,
  "title": "Taste and value: Exploring sensory acceptance and willingness-to-pay for convenient farm-raised catfish products through experimental auction",
  "abstract": "Gaining insights into consumer perceptions of newly developed food products is essential for enhancing their success in the marketplace, as it allows for refining products to align with evolving consumer preferences and aids in the formulation of effective marketing and pricing strategies. This study examines consumer insights for four newly developed, convenient, and healthy U.S. farm-raised catfish products using sensory evaluations and consumer willingness to pay (WTP) elicited through Vickrey's second-price experimental auction. Using Elastic Net (EN) regularized regression, we identified key sensory and demographic attributes affecting consumer preference and WTP. Results indicate that consumers favor these catfish products over similar market options, with taste emerging as the most significant sensory attribute driving WTP, followed by texture and smell. Additionally, demographic factors such as age, education, gender, and race significantly impacted WTP. We also evaluated the suitability of the organoleptic attributes for each product, providing recommendations for improvement where needed. This research supports product reformulation and marketing strategies and offers valuable insights for future seafood product development initiatives.",
  "year": 2025,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2a2eb8605d1e44f4dac9ee5b5494354",
  "timestamp": "2025-05-15T01:31:50.800539"
}