{
  "id": 4196,
  "title": "Predicting financial distress through ownership pattern: dynamics of financial resilience of Bangladesh",
  "abstract": "In light of agency and resource dependence theories, we explored the impact of ownership patterns on the likelihood of financial distress using 57 financial institutions (FIs) listed in Dhaka Stock Exchange and 390 firm years from 2016 to 2022. This study observed that 97.94% of the firms are in distress, 1.03% in gray, and 1.03% in the safe zone. Thus, the stability of FIs lags quite behind the expected standards. Multiple linear regression results show that director ownership is inversely associated with corporate failures, suggesting higher stakes of directors lower the risk of financial distress. When directors align their interests with those of firms by owning shares, it enhances firm performance and lowers the likelihood of failures. Also, institutional ownership negatively correlates with financial distress due to their active surveillance and focus on long-term performance. Besides, effective overseeing process of institutional investors works as a deterrent to making freaky decisions. Conversely, foreign ownership showed a positive affinity with financial distress. In Bangladesh, family dominance, lopsided influence, and political connections limit foreign investors' ability to contribute to a firm's long-term success. While most earlier studies in emerging economies showed financial resilience through the Altman Z-score, only a few have examined ownership patterns as a potential cause of firm bankruptcy. Considering ownership patterns as an explanatory variable of financial distress, this study discourses the corporate governance issues and resilience of FIs in an emerging economy.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2a3ccfee0fffb75137615f863393899",
  "timestamp": "2025-05-15T02:34:13.454079"
}