{
  "id": 2933,
  "title": "Predictive data analysis techniques applied to dropping out of university studies",
  "abstract": "Student dropout is a major problem in university studies all around the world. To alleviate this problem, it is important to detect as soon as possible student attrition before he or she becomes a deserter. A student may be considered a deserter when she/he has not completed her academic credits or leave the studies. In this paper we present a study made at a higher education institution, by analyzing the records of 530 higher education students from 52 different careers with application date 2015 to 2018, considering factors such as academic monitoring, financial situation, personal and social information. These are some issues or mix of problems that could affect dropout rates. Analyze student behavior by implementing predictive analytics techniques reduce the gaps between professional demands and applicants' competencies. We applied predictive analytical techniques to identify the relationship of factors characterizing students who leave the university. As a result, we have elaborated a conceptual model to predict the risk of defection and applied machine learning techniques to generate preventive and corrective alerts as a student permanence strategy. This study shows that information is important, but the application of machine learning in the student's prior knowledge and its relationship to a dynamic and pre-established profile of the deserter student is essential to generate early strategies that manage to reduce the gaps between professional demands and applicants' competencies. In addition, a data model has been created to give solution to the issue get generated preventive and corrective alerts.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2b3e46e5af37472c1d1ecd847b5f0e4",
  "timestamp": "2025-05-15T02:20:48.190005"
}