{
  "id": 3448,
  "title": "The role of XBRL adoption on the association between managerial ability and corporate tax outcomes: empirical evidence from Indonesia",
  "abstract": "Purpose This study examines the moderating effect of XBRL mandatory adoption on the association between managerial ability and corporate tax outcomes. Design/methodology/approach This study used a quantitative method with panel data regression models using a sample of listed firms on the Indonesia Stock Exchange from 2010 to 2019. Findings The regression results indicate that XBRL adoption moderates the relationship between managerial ability on tax avoidance and tax risk. Firms with higher managerial ability have relatively greater tax avoidance practices and lower tax risk following XBRL adoption. In this study, the authors document unfavorable and unexpected consequences of XBRL in an emerging country. Research limitations/implications Results are from a sample of firms from one emerging country. Practical implications It becomes important and necessary to develop more and better taxonomies with standardized extensions related to taxes information in the XBRL financial reporting to support the tax administrator's performance in assessing firms' tax avoidance and tax risk. The authors underscore the importance of improving taxes tags, including tags from financial statements and the disclosure section. This study may also inform policymakers in other countries that more adequate tax tags are needed to leverage benefit from XBRL adoption in monitoring and assessing corporate tax avoidance and tax risk. Originality/value This study is among the first to test an explanation for the moderating role of XBRL adoption on the association between managerial ability and corporate tax avoidance and tax risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2bb855d1eca5581e46dc66fc1ef015f",
  "timestamp": "2025-05-15T02:26:09.226472"
}