{
  "id": 4029,
  "title": "Product Assortment With Sustainable Product Attributes: The Case of a Tire Producer",
  "abstract": "Relying on a real-life dataset collected from one of Turkey's top three tire producers, this study investigated a product assortment problem with sustainable product attributes. Since the economic aspect of sustainability predominates the environmental and societal ones, firms struggle to increase their sustainable products' market share in their portfolio. The article aims to identify the impact of sustainable consumer preferences, producer strategy for sustainability, and service level policies (SLP) on the number of assortments, profit, average sale prices, and out-of-stock level of tires. Consumer preferences based on sustainability attributes were calculated by a utility-based multinomial logistic regression. A mixed-integer linear programming model was developed to maximize profit with respect to inventory constraints and demand substitution rates under different producer sustainability targets (PST) and SLP. The results show that the producer's profitability and the number of assortments in the market tend to decrease as PST increases, which means that the producer produces a proportionally higher number of sustainable products. When consumers place their preferences according to only economic attributes, the tire producer has higher profitability and average sale prices than the consumers deciding with all-sustainability attributes. However, suppose the tire producer chooses to act proactively and aggressively launches more sustainable products. In that case, it may achieve higher profit margins than a market requesting more sustainable products in the long run. SLP of the tire producer had no significant impact on the number of assortments and average sale prices.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2bd23e15db255e792f3680bd5dc2c11",
  "timestamp": "2025-05-15T01:23:07.393024"
}