{
  "id": 7389,
  "title": "The moderating role of Shariah supervisory board on the relationship between board effectiveness, operational risk transparency and bank performance",
  "abstract": "Purpose The purpose of this study is to determine the effect of board effectiveness (BE) on financial performance and operational risk (OR) disclosure and the interaction effect of a bank's Sharia Supervisory Board quality (SSB) with religious and ethical principles. Design/methodology/approach The data were collected from the annual financial reports of 25 Islamic banks (IBs) in the Gulf Cooperation Council countries over 2008-2017. The OR disclosure, the SSB quality and BE were measured using self-developed indices. The Tawhidi string relation methodology was used to establish the circular causal model. The moderating effect of the SSB quality on the performance, OR disclosure and board structure relationship was examined using the hierarchical regression analysis. Findings The main finding of this study is related to the positive moderating effect of SSB quality on the relationship between performance, OR disclosure and BE. This result seems to indicate that at a high level of SSB quality, even when the performance increase the IBs engage in complying with OR disclosure to inform the stakeholders on the real situation of the bank. Practical implications The finding of this research would be of great support to stakeholders and policymakers to make more pressure on IBs to improve the quality of their SSB structure and show more compliance with the governance recommendations. As an extension to this research, further study can examine other Islamic governance mechanisms such as Shari?ah-compliant banks. Originality/value The present study provides a new addition to the prior literature by investigating the relationship between performance, BE, OR disclosure and the interaction effect of SSB quality. From an Islamic ethical, this research can also contribute to the growing discussion on SSB quality and performance.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2c578a59ab779d4ab98ccf70df941da",
  "timestamp": "2025-05-15T03:08:00.807843"
}