{
  "id": 9447,
  "title": "INTENSIFICATION OF INVESTMENT IN THE RENOVATION OF RESIDENTIAL REAL ESTATE IN THE CONTEXT OF THE SUSTAINABLE DEVELOPMENT GOALS",
  "abstract": "The subject of the paper. is to study the mechanisms for investing in residential renovation in the context of the Sustainable Development Goals. At the same time, sustainable development is considered both from the point of view of safety and environmental friendliness of residential buildings, and from the social point of view of providing housing to citizens from strategic perspective. It is shown that the current sustainable development goals, the definition of indicators of their achievement do not cover the problem of housing deterioration, which is one of the most acute for national and social security, as well as the financial stability of the state. Therefore, the achievement of SDG-11 in Ukraine is in a high risk zone given the catastrophic state of housing, the scale of the problem, and the high cost of its renovation for insolvent households; this does not solve the problem only at the expense of homeowners as follows from the essence and functions of property owners. The situation in Ukraine differs from European countries in that the state is impossible to further subsidize the owners on a large scale. This requires a combination of public investment in renovation of residential real estate with property reform, transforming part of the housing stock into social housing. As the implementation of housing projects concerns the local level, the general shortcomings of strategic management are shown, where there is no vision of communities to solve the problem. Methodology. Based on the methodological developments of the authors on the insolvency of homeowners in Ukraine (A. Shcherbyna), criticism of unjustified approaches to co-financing by residents and local authorities of renovation projects in Kyiv (O. Popeko), and the need to justify and evaluate investment projects to achieve sustainable development goals (S. Kovalivska), the article forms a comprehensive approach to solving the problem in terms of all three aspects. Therefore, the purpose of the paper is to deepen the formulation and analysis of methods to achieve Sustainable Development Goal 11 Make cities and human settlements inclusive, safe, resilient and sustainable with the help of provisions on sustainable housing for citizens based on a project-oriented approach and mechanisms for financing projects using public-private partnerships of homeowners with local authorities, as well as taking into account sustainable development goals. Practical implications. The main directions of further progress in reforming property relations in the housing sector and creating tools for intensifying partnership mechanisms at the vertical and horizontal levels in the public administration system are identified. Results. The proposed methodology provides for the selection of projects for budget support and development of recommendations for their implementation, taking into account SDG in several stages: pre-selection based on cost-benefit analysis; assessment of the impact of the project on SDG (determination of the SDG identity of the project based on a quantitative assessment of the impact of its objectives on SDG and vice versa); determination of the volume and type of budget support (rating of projects based on a comprehensive analysis of their commercial, budgetary and social efficiency, adjusted for the level of manufacturability, export orientation, and SDG identity); development of recommendations for project implementation, which take into account the approaches to assessing the impact of the project on SDG and, conversely, the achievement of SDGs or the risks of their failure to achieve project objectives (4). Value. To link SDG with budget planning, it is proposed to introduce an additional classification of budget expenditures on SDG, which will help to reconcile strategic and budget planning with investment in order to achieve SDG, including in the process of ensuring state participation in programs and projects for renovation and construction of housing based on the concept of sustainable development.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2d8b2f5eff7f64898ad6b388c0a8c68",
  "timestamp": "2025-05-15T03:28:46.357918"
}