{
  "id": 2783,
  "title": "Mobilizing sorghum genetic diversity: Biochemical and histological-assisted design of a stem ideotype for biomethane production",
  "abstract": "Sorghum currently contributes to the species portfolio that is supporting bioenergy production including anaerobic digestion. Although agro-morphological ideotypes maximizing biogas production have been recently proposed, there is a crucial need to refine our understanding of the impacts of the stem composition and structure on this processing trait in order to ensure genetic gains in the mid to long terms. This study aims to assess the potential of Sorghum bicolor ssp bicolor stem genetic diversity to maximize genetic gains for biogas production and define a biogas stem ideotype. In this context, a panel of 57 genotypes, encompassing most of the stem composition variability available in cultivated sorghum, was characterized over five sites. Simultaneous histological and biochemical characterizations were performed. A high broad sense heritability associated with a moderate genetic variability was detected for stem biogas potential ensuring significant genetic gains in the future. In addition, the development of a stem histological phenotyping pipeline made it possible to describe the genetic diversity available for the internode anatomy and the repartition of key cell wall components. Consistently with previous studies, moderate to high heritability was observed for stem biochemical components. Genetic correlation, hierarchical clustering, and multiple stepwise regression analyses identified soluble sugar content as the first main driver of biogas potential genetic variability. Nevertheless, breeding programs should anticipate that biogas yield improvement will also rely on the monitoring of the cell wall components and their distribution in the stem jointly with the soluble sugar content. According to the assets of sorghum in terms of adaptation to environmental stresses and the present results regarding the identification of stem ideotypes suitable for different value chains, this species will surely play a key role to optimize the economic and environmental sustainability of the agrosystems that are currently facing the effects of climate change.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2e6ec4323b6cb83bb59522c319e8a78",
  "timestamp": "2025-05-15T01:10:16.574760"
}