{
  "id": 3254,
  "title": "Improving the Performance of Public Sector Infrastructure Projects: Role of Project Governance and Stakeholder Management",
  "abstract": "Project governance and stakeholder management have been acknowledged as substantial areas of organizational concern for the successful delivery of projects. However, its full functions are yet to be explored for the performance of government-sponsored infrastructure projects due to the inherent complexities and uncertainties that arise from their unique socioeconomic perspective in developing countries. Therefore, this research investigates the dimensions of project governance (i.e., portfolio direction; sponsorship effectiveness and efficiency; and disclosure and reporting) effects on project performance through the correlation of stakeholder management. Based on the stakeholder theory, a moderation model was proposed and a survey questionnaire was designed to get feedback from the respondents of the government policy and planning departments of Pakistan. Structural equation modeling was the core statistical technique for testing the hypotheses. The findings of moderation analysis show that project governance has a positive relation with project performance at medium and higher regression coefficients values of stakeholder management. Inversely, at low regression values, this relationship is negative and insignificant. This research contributes to the literature as the significant interaction of stakeholder management could amplify the effect of project governance, subsequently enhancing the performance of public infrastructure projects.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b2ea0bf8e67e91a75207de8412370f31",
  "timestamp": "2025-05-15T01:15:26.077526"
}