{
  "id": 3903,
  "title": "Modelling the heterogeneous relationship between the crude oil implied volatility index and African stocks in the coronavirus pandemic",
  "abstract": "This paper revisited the crude oil - stock market nexus to examine how the oil implied volatility index (a forward-looking and more accurate measure for uncertainty in oil prices) affects stock returns in major Africa's oil-importing (South Africa, Kenya, Mauritius, and Botswana) and oil-exporting (Nigeria, Egypt, Tunisia, and Morocco) countries during the COVID-19 pandemic. Quantile regression is employed to examine the heterogeneous relationship at different distributions of stock returns. The study documents evidence to support a negative relationship between the oil implied volatility shocks and stock returns in the selected stock markets, especially in downturns. Findings from this study also reveal that the oil implied volatility shocks can asymmetrically influence Africa's stocks. Specifically, our empirical evidence reveals that positive shocks in the oil implied volatility index play a key role in most of Africa's stock markets in market downturns while negative shocks play a moderate role during benign market conditions in some of Africa's stock markets during the pandemic. More importantly, our findings divulge that investors can find an invaluable shelter with a portfolio of the selected African stocks and oil market securities in the time of the pandemic. The policy implications are further discussed.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b303bfdb260140a2d25192dc8385a361",
  "timestamp": "2025-05-15T01:22:11.819475"
}