{
  "id": 4026,
  "title": "Modeling Spatiotemporal Heterogeneity of Customer Preferences With Small-Scale Aggregated Data: A Spatial Panel Modeling Approach",
  "abstract": "Customer preferences are found to evolve over time and correlate with geographical locations. Studying the spatiotemporal heterogeneity of customer preferences is crucial to engineering design as it provides a dynamic perspective for understanding the trend of customer preferences. However, existing choice models for demand modeling do not take the spatiotemporal heterogeneity of customer preferences into consideration. Learning-based spatiotemporal data modeling methods usually require large-scale datasets for model training, which are not applicable to small aggregated data, such as the sale records of a product in several regions and years. To fill this research gap, we propose a spatial panel modeling approach to investigate the spatiotemporal heterogeneity of customer preferences. Product and regional attributes varying in time are included as model inputs to support demand forecasting in engineering design. With case studies using the dataset of small SUVs and compact sedans in China's automotive market, we demonstrate that the spatial panel modeling approach outperforms other statistical spatiotemporal data models and non-parametric regression methods in goodness of fit and prediction accuracy. We also illustrate a potential design application of the proposed approach in a portfolio optimization of two vehicles from the same producer. While the spatial panel modeling approach exists in econometrics, applying this approach to support engineering decisions by considering spatiotemporal heterogeneity and introducing engineering attributes in demand forecasting is the contribution of this work. Our paper is focused on presenting the approach rather than the results per se.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b308891004203d33094e3691c8a26c0a",
  "timestamp": "2025-05-15T01:23:07.376582"
}