{
  "id": 1694,
  "title": "Dynamic Portfolio Optimization for Distributed Energy Resources in Virtual Power Plants",
  "abstract": "The aggregation of distributed energy resources in virtual power plants (VPPs) is a feasible approach to overcome entry barriers for energy markets like, e.g., the European Power Exchange SE (EPEX SPOT SE). An increasing number of energy supply companies offer the integration of decentralized units in VPPs aiming to achieve the maximum profit by trading the power produced by the VPP at energy markets. However, the coordination of the generation units' operational modes (operation schedule) within a VPP as well as the selection of offered market products (product portfolio) are optimization problems that are mutually dependent. In this contribution a method is proposed that allows automating both the optimized composition of the product portfolio and the determination of the matching operation schedule for the VPP, in terms of profit maximization. Application example of the method is the EPEX SPOT SE day-ahead market. The concept of the approach can be roughly described as follows: First of all, machine learning techniques are used to predict the market prices for the trading day. Then, the market forecast is used in combination with feasible schedule samples from the generation units as input for the optimization process. During the optimization a hybrid approach comprising heuristic algorithms, such as simulated annealing or tabu search, and linear optimization is applied. The approach is evaluated using historical market data and intricate simulation models of generation units.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b30a0d6467a3108df9d568b7d68e75d7",
  "timestamp": "2025-05-15T00:58:50.584540"
}