{
  "id": 1531,
  "title": "A Comprehensive Review on Heart Disease Risk Prediction using Machine Learning and Deep Learning Algorithms",
  "abstract": "Cardiovascular diseases claim approximately 17.9 million lives annually, with heart attacks and strokes accounting for over 80% of these deaths. Key risk factors, including hypertension, hyperglycemia, dyslipidemia, and obesity, are identifiable, offering opportunities for timely intervention and reduced mortality. Early detection of heart disease enables individuals to adopt lifestyle changes or seek medical treatment. However, conventional diagnostic methods, such as electrocardiograms-commonly used in clinics and hospitals to detect abnormal heart rhythms-are not effective in identifying actual heart attacks. Additionally, angiography, while more precise, is an invasive method, financial strain on patients, and high chances of incorrect diagnosis, highlighting the need for alternative approaches. The main goal of this study was to assess the accuracy of machine learning techniques, including both individual and combined classifiers, in early detection of heart diseases. Furthermore, the study aims to highlight areas where additional research is necessary. Our investigation covers a decade period from 2014 to 2024, including a thorough review of pertinent literature from international conferences and top journals from the databases like Springer, ScienceDirect, IEEEXplore, Web of Science, PubMed, MDPI, Hindawi and so on. The following keywords were used to search the articles: heart disease risk, heart disease prediction, data mining, data preprocessing, machine learning algorithms, ensemble classifiers, deep learning algorithms, feature selection, hyperparameter optimization techniques. We examine the methodologies used and evaluate their effectiveness in predicting cardiovascular conditions. Our findings reveal notable progress in applying machine learning and deep learning in cardiology. The study concludes by proposing a framework that incorporates current machine learning techniques to enhance heart disease prediction.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b31fe377771785f51275506ba1c2a6e8",
  "timestamp": "2025-05-15T02:04:20.063592"
}