{
  "id": 4062,
  "title": "Frontline defences against cuckoo parasitism in the large-billed gerygones",
  "abstract": "Coevolutionary arms races between brood parasites and hosts can evolve along several distinct trajectories. To understand why, host-parasite interactions must be examined at every stage of the breeding cycle. While there have been numerous studies of interactions at the egg and nestling stages, studies of preparasitism ?frontline? interactions have received less attention. Frontline defences in hosts should be widespread, both because they can preserve the entire host clutch (while postparasitism defences, such as egg or chick rejection, do not) and because they tend to overlap with defences against nest predation. We investigated whether parasitism by the little bronze-cuckoo, Chalcites minutillus, has selected for frontline defences in large-billed gerygones, Gerygone magnirostris, a host that rejects cuckoo chicks. We considered three possible defences: (1) mobbing of adult cuckoos near the nest, (2) ?decoy nest clustering? of active nests alongside old nests and flood debris, and (3) cryptic nest architecture. Gerygones were more likely to mob a mount of a cuckoo near the nest than that of a hawk or harmless sympatric passerine. The role of nest traits in repelling parasitism was equivocal; gerygones built their nests alongside previously used nests more often than expected by chance. The experimental addition of decoy nests did not reduce parasitism rates but did lead to a significant delay in latency to predation. Although large-billed gerygones build large nests compared to other gerygones species, we found that larger nests were more likely to be parasitized than smaller nests. We conclude that parasitism has selected for a portfolio of defences in large-billed gerygones, comprising both low-cost, but mostly ineffective, frontline defences (mobbing, some nest traits), and a high-cost, but highly effective, chick stage defence (chick rejection). Thus, the relatively low effectiveness of frontline and egg stage defences may explain why some hosts evolve the rare defence of chick rejection. ? 2021 The Association for the Study of Animal Behaviour. Published by Elsevier Ltd. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b32daa49164ee362fa3e03e930e198ff",
  "timestamp": "2025-05-15T01:23:27.331079"
}