{
  "id": 1630,
  "title": "Urban Climate Risk Mitigation via Optimal Spatial Resource Allocation",
  "abstract": "Decision makers (DMs) who are involved in urban planning are often required to allocate finite resources (say, money) to improve outdoor thermal comfort (OTC) levels in a region (e.g., city, canton, country). In this paper, for the first time, we address the following two questions, which are directly related to this requirement: (1) How can the statistical properties of the spatial risk profile of an urban area from an OTC perspective be quantified, no matter which OTC index the DM chooses to use? (2) Given the risk profile, how much and where should the DM allocate the finite resources to improve the OTC levels? We answer these fundamental questions by developing a new and rigorous mathematical framework as well as a new class of models for spatial risk models. Our approach is based on methods from machine learning: first, a surrogate model of the OTC index that provides both accuracy and mathematical tractability is developed via regression analysis. Next, we incorporate the imperfect climate model and derive the statistical properties of the OTC index. We present the concept of spatio-temporal aggregate risk (STAR) measures and derive their statistical properties. Finally, building on our derivations, we develop a new algorithm for spatial resource allocation, which is useful for DMs and is based on modern portfolio theory. We implemented the tool and used it to illustrate its operation on a practical case of the large-scale area of Singapore using a WRF climate model.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b34bfb39c73cf7c2c9cbf1a957004b25",
  "timestamp": "2025-05-15T00:57:46.913588"
}