{
  "id": 9316,
  "title": "Community-based environmental management for malaria control: evidence from a small-scale intervention in Dar es Salaam, Tanzania",
  "abstract": "Background: Historically, environmental management has brought important achievements in malaria control and overall improvements of health conditions. Currently, however, implementation is often considered not to be cost-effective. A community-based environmental management for malaria control was conducted in Dar es Salaam between 2005 and 2007. After community sensitization, two drains were cleaned followed by maintenance. This paper assessed the impact of the intervention on community awareness, prevalence of malaria infection, and Anopheles larval presence in drains. Methods: A survey was conducted in neighbourhoods adjacent to cleaned drains; for comparison, neighbourhoods adjacent to two drains treated with larvicides and two drains under no intervention were also surveyed. Data routinely collected by the Urban Malaria Control Programme were also used. Diverse impacts were evaluated through comparison of means, odds ratios (OR), logistic regression, and time trends calculated by moving averages. Results: Individual awareness of health risks and intervention goals were significantly higher among sensitized neighbourhoods. A reduction in the odds of malaria infection during the post-cleaning period in intervention neighbourhoods was observed when compared to the pre-cleaning period (OR = 0.12, 95% CI 0.05-0.3, p < 0.001). During the post-cleaning period, a higher risk of infection (OR = 1.7, 95% CI 1.1-2.4, p = 0.0069) was observed in neighbourhoods under no intervention compared to intervention ones. Eighteen months after the initial cleaning, one of the drains was still clean due to continued maintenance efforts (it contained no waste materials and the water was flowing at normal velocity). A three-month moving average of the percentage of water habitats in that drain containing pupae and/or Anopheles larvae indicated a decline in larval density. In the other drain, lack of proper resources and local commitment limited success. Conclusion: Although environmental management was historically coordinated by authoritarian/colonial regimes or by industries/corporations, its successful implementation as part of an integrated vector management framework for malaria control under democratic governments can be possible if four conditions are observed: political will and commitment, community sensitization and participation, provision of financial resources for initial cleaning and structural repairs, and inter-sectoral collaboration. Such effort not only is expected to reduce malaria transmission, but has the potential to empower communities, improve health and environmental conditions, and ultimately contribute to poverty alleviation and sustainable development.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b362ace45f6054e3aad4c1d6a131d70d",
  "timestamp": "2025-05-15T03:27:53.294591"
}