{
  "id": 3284,
  "title": "Social Media Usage as a solution for financial problems of European SMEs: International Comparison of Firms in Iron and Mining Industries",
  "abstract": "Due to operating in the mining and iron sectors with fierce competition and encountering more financial obstacles compared to larger enterprises, SMEs (small and medium-sized enterprises) become more likely to face business failures, have lower financial performance and have high financial risk. To overcome those financial impediments and become more competitive against their rivals, social media usage might be a solution. This is because even under the conditions of the covid-19 pandemic, social media has also stimulated online purchasing behaviours of customers and has been used as an effective tool by SMEs for marketing purposes. However, SMEs' usage of these channels might differ depending on the countries where they are located, so their impacts on financial obstacles might be different. In this regard, this research examines whether the impacts of social media usage on the financial problems of SMEs differ depending on their location. To achieve this goal, the researchers employ an online survey and direct it to the executives of 1156 Czech, Slovakian and Hungarian SMEs. The researchers apply Ordinal Logistic Regression with the Logit function in SPSS statistical tool for analyzing purposes. The results confirm the fact that while differences do not exist among countries regarding the impact of social media usage on business failures, the effects of social media usage on financial performance and financial risk differ between Hungarian and Czech-Slovakian SMEs. Czech and Slovakian SMEs show similar attitudes in all of the analyzed variables.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b36604005bb2c145dceff92495e49b0e",
  "timestamp": "2025-05-15T02:24:39.668639"
}