{
  "id": 7146,
  "title": "Exploring food safety knowledge and practices in Lebanon",
  "abstract": "Background: Lebanon's economic and financial crises have affected the quality-of-life, including food safety and food security. Aim: To assess food safety knowledge and practices among a sample Lebanese population and the association with the sociodemographic and economic characteristics of participants. Methods: This cross-sectional study collected data online from 412 Lebanese adults aged >= 18 years [mostly female (77.7%)] between October and December 2021. The data included their sociodemographic characteristics, food safety knowledge and practices, experience of food insecurity, and financial wellbeing. We conducted logistic regression analyses to explore the associations between food safety knowledge and practices, sociodemographic variables, and food security status of participants. Results: A significantly higher proportion of married (vs single) participants said they reheated refrigerated meat or chicken before consumption (74.3% vs 63.1%, P = 0.017). A significantly higher proportion of participants in the higher income category and those with university education (versus lower level of education) knew the characteristics of a contaminated food (34.2% vs 15.0%, P = 0.008). Older participants were significantly more knowledgeable about the management of leftover food (mean 34.54 years vs 31.25 years; P = 0.014). Household food security status did not show any statistically significant association with any of the 5 food safety measures examined. Conclusion: This study confirms the existence of suboptimal food safety knowledge and practices by almost half of the sample. There is therefore a need for evidence-based public health interventions to increase knowledge, and promote better practices, of safe food handling, thereby reducing the risk of foodborne diseases in Lebanon.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b3678afb71a08dbca593a6cac78d0e0c",
  "timestamp": "2025-05-15T03:05:32.078975"
}