{
  "id": 5785,
  "title": "Effect of kangaroo mother care initiated in community settings on financial risk protection of low-income households: a randomised controlled trial in Haryana, India",
  "abstract": "IntroductionMany families in low-income and middle-income countries have high out-of-pocket expenditures (OOPE) for healthcare, and some face impoverishment. We aimed to assess the effect of Kangaroo Mother Care initiated in community setting (ciKMC) on financial risk protection estimated by healthcare OOPE, catastrophic healthcare expenditure (CHE) and impoverishment due to healthcare seeking for low birthweight infants, using a randomised controlled trial design.MethodsWe included 4475 low birthweight infants randomised to a ciKMC (2491 infants) and a control (1984 infants) arm, in a large trial conducted between 2017 and 2018 in Haryana, India. We used generalised linear models of the Gaussian family with an identity link to estimate the mean difference in healthcare OOPE, and Cox regression to estimate the HRs for CHE and impoverishment, between the trial arms.ResultsOverall, in the 8-week observation period, the mean healthcare OOPE per infant was lower (US$20.0) in the ciKMC arm compared with the control arm (US$25.6) that is, difference of -US$5.5, 95% CI -US$11.4 to US$0.3, p=0.06). Among infants who sought care it was US$8.5 (95% CI -US$17.0 to -US$0.03, p=0.03) lower in the ciKMC arm compared with the control arm. The HR for impoverishment due to healthcare seeking was 0.56 (95% CI 0.36 to 0.89, p=0.01) and it was 0.91 (95% CI 0.74 to 1.12, p=0.37) for CHE.ConclusionciKMC can substantially reduce the cost of care seeking and the risk of impoverishment for households. Our findings show that supporting mothers to provide KMC to low birthweight infants at home, in addition to reducing early infant mortality, may provide financial risk protection.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b36a7447b4d8224c7c715255fb7dd7dd",
  "timestamp": "2025-05-15T02:51:30.040123"
}