{
  "id": 4686,
  "title": "Investors' Moral and Financial Concerns-Ethical and Financial Divestment in the Fossil Fuel Industry",
  "abstract": "It is discussed intensively whether divestment decease sales in the fossil fuel industry or whether investors divest from the fossil fuel industry because of stranded assets. Furthermore, it is unclear what the consequences of these activities are for the fossil fuel industry. Therefore, the study explores the direction of causality between cash flow factors, such as production factors and sources of financing and sales of the fossil fuel industry using lagged regression models and applying the Granger causality test. Our sample consists of fossil fuel companies from the Carbon Underground 200 list. Because R-squared values for both lagged financial factors and lagged sales were similar, we suggest a bi-directional causality between the financial flow factors and sales. We conclude that divestment (because of ethical concerns) can cause lower sales and that lower sales can cause divestment because of fear of the risk of stranded assets. Because a third factor usually causes bi-directional causations, we conclude that the need for the fossil fuel industry to reduce greenhouse gas emissions is the third factor that influences both the ethical and financial motivation of divestment. Consequently, the study contributes to theoretical approaches to divestment.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b36c4ba5550515894423dd848a8708a7",
  "timestamp": "2025-05-15T02:39:57.528133"
}