{
  "id": 6314,
  "title": "Risk Factors for Decreased Visual Acuity in Preschool Children The Multi-Ethnic Pediatric Eye Disease and Baltimore Pediatric Eye Disease Studies",
  "abstract": "Objective: To investigate risk factors associated with unilateral or bilateral decreased visual acuity (VA) in preschool children. Design: Population-based, cross-sectional prevalence study. Participants: Population-based samples of 6504 children ages 30 to 72 months from California and Maryland. Methods: Participants were preschool African-American, Hispanic, and non-Hispanic white children from Los Angeles, California, and Baltimore, Maryland. Data were obtained by a parental interview and a detailed ocular examination. Logistic regression models were used to evaluate the independent associations between demographic, behavioral, and clinical risk factors with unilateral and bilateral decreased VA. Main Outcome Measures: Odds ratios (ORs) for various risk factors associated with interocular difference (IOD) in VA of >= 2 lines with <= 20/32 in the worse eye, or bilateral decreased VA <20/40 or <20/50 if <48 months of age. Results: In multivariate logistic regression analysis, 2-line IOD with a VA of <= 20/32 was independently associated with Hispanic ethnicity (OR, 2.05), esotropia (OR, 8.98), spherical equivalent (SE) anisometropia (ORs ranging between 1.5 and 39.7 for SE anisometropia ranging between 0.50 to <1.00 diopters [D] and >= 2.00 D), and aniso-astigmatism in J0 or J45 (ORs ranging between 1.4 and >= 5.3 for J0 or J45 differences ranging between 0.25 to <0.50 D and >= 1.00 D). Bilateral decreased VA was independently associated with lack of health insurance (OR, 2.9), lower primary caregiver education (OR, 1.7), astigmatism (OR, 2.3 and 17.6 for astigmatism 1.00 to <2.00 D and >= 2.00 D), and SE hyperopia >= 4.00 D (OR, 10.8). Conclusions: Anisometropia and esotropia are risk factors for IOD in VA. Astigmatism and high hyperopia are risk factors for bilateral decreased VA. Guidelines for the screening and management of decreased VA in preschool children should be considered in light of these risk associations. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2011;118:2262-2273 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b38afba1ecddbcd046578d75b765f982",
  "timestamp": "2025-05-15T02:57:07.651123"
}