{
  "id": 2585,
  "title": "The role of higher moments in predicting China's oil futures volatility: Evidence from machine learning models",
  "abstract": "This paper expands the emerging literature on volatility forecasting for China's oil market by exploring the predictive ability of higher-order moments (skewness, kurtosis, hyperskewness, and hyperkurtosis) based on high-frequency data. Our investigation is originally based on the heterogeneous autoregressive (HAR) framework, but considering the possible multicollinearity and nonlinearity, it is extended to various machine learning (ML) models and combination forecasting models. The results reveal that higher-order moments, including the two highest moments, always significantly improve predictive performance for the COVID-19 crisis. We further examine the interpretability of ML models and each factor's contribution to the prediction, finding that odd and even moments contain short- and long-term prediction information, respectively. This paper also highlights the effectiveness of ML models for capturing trends in oil futures volatility with higher-order moments and the satisfactory performance of combination forecasting models. Finally, we investigate the predictability of asymmetric risk patterns and obtain identical results. Our study has important implications for financial risk management, asset pricing, and portfolio allocation.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b38d608ded0e108b9161831def68314d",
  "timestamp": "2025-05-15T02:17:01.678742"
}