{
  "id": 2572,
  "title": "Virtual land in the metaverse? Exploring the dynamic correlation with physical real estate",
  "abstract": "PurposeAs blockchain-based virtual worlds gain prominence within the emerging metaverse and Web3, numerous global companies and investors are buying purely virtual land to explore new business potentials and capitalize on digital assets. Given the similarities to physical real estate, this study examines the dynamics of the secondary market for virtual land and relates its returns to those of physical real estate.Design/methodology/approachUsing transaction-level data from a prominent virtual land platform, the authors construct a virtual land market index based on repeat sales index methodology from traditional real estate studies. Wavelet coherence analysis is employed to examine the dynamic correlation between virtual land and various physical real estate market returns. The determinants of this correlation are estimated using stepwise regression analysis. A portfolio analysis explores the implications of adding virtual land to traditional asset portfolios.FindingsThe correlation between virtual and physical real estate market returns is generally low, reaching its lowest during the Covid-19 lockdowns from 2020 to 2022. It spikes during acute economic turmoil such as the initial Covid-19 outbreak or interest rate change announcements. The correlation is primarily driven by consumer and economic climate, the price of the virtual economy token and investor attention. Portfolio analysis indicates that virtual land can enhance risk-adjusted returns within a traditional portfolio, particularly when added to a commercial real estate portfolio.Research limitations/implicationsThis study examines a single virtual land market, despite it being the oldest and one of the largest. Given the rapidly evolving nature of virtual worlds, it is crucial to further test the results and include new virtual land platforms as they emerge.Practical implicationsThe findings provide actionable insights on portfolio implications for investors seeking alternative real-estate-like assets in the digital space. Additionally, this study offers strategic guidance for entering the metaverse, including a comprehensive overview of established virtual presences.Originality/valueWith the advancing digitization of real estate markets, this study is the first to explore the correlation between market returns of virtual land in the metaverse and traditional physical real estate. The findings provide valuable empirical insights for investors, policymakers, entrepreneurs and companies interested in the intersection of digital and traditional property markets.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b3959dcd07d3bca1641c31f147a2a419",
  "timestamp": "2025-05-15T01:08:10.880465"
}