{
  "id": 4032,
  "title": "INFLUENCE OF INTERNAL AND EXTERNAL FACTORS ON THE STRUCTURAL CHANGES OF NATIONAL ECONOMY: AN EXAMPLE OF UKRAINE",
  "abstract": "Purpose - the purpose of our article is to study structural changes in the national economy using a portfolio model of sectors with different returns and, on this basis, processing the methodology for identifying the current state and instrumental factors of economic policy. Research methodology the methodology of empirical research includes methods of grouping, abstraction, comparison, systems analysis, synthesis and generalization, graphical methods and regression analysis. To analyze the nature of the relationship between the index of structural changes and the dynamics of GDP, which determines the comparative profitability of the resource and non-resource sectors and the current position of the current structure relative to the equilibrium value, we used error-corrected models (ECMs). Findings - using regression models with error correction, a favourable long- and short-term relationship between structural changes in favour of non-resource exports and Ukraine's GDP has been empirically confirmed. Using the index of structural changes, considering the ratio of raw materials and non-raw materials exports, the necessity of applying administrative measures is substantiated. Research limitations the study concerned mainly the national economy of Ukraine, but in the future, attention should be paid to the application of the results dour study in other countries of Eastern Europe. In the future, the results obtained can be adapted for other countries of the world. The research was based on the use of specific mathematical methods, and not all mathematical possibilities were used. Practical implications the model can be used in the practical activities of state economic structures In the future, it is possible to change key indicators and further expand the field of use of the model. Originality/Value - the novelty of the study lies in the development of a methodology for identifying the current state and instrumental factors of economic policy that can speed up economic growth based on favourable structural shifts (in favour of the non-resource export sector).",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b398b2434f2e399dc4a0c2c0199e9cfe",
  "timestamp": "2025-05-15T01:23:07.407221"
}