{
  "id": 8130,
  "title": "Financing sources for mitigation of adverse climate change: a systematic review",
  "abstract": "Accelerating climate change has harmed food and water security and affected both terrestrial and aquatic systems, hindering efforts to meet many Sustainable Development Goals [SDGs]. Climate finance can help mobilize financial resources and tackle the effects of climate change. This study analyzes existing literature on climate finance more broadly from its beginning to its current status. It reviewed 311 relevant articles from 2005 to 2023 using qualitative content analysis [QCA] and meta-analysis to identify common themes and their classification based on pre-determined article criteria. We also identify research gaps within each theme and suggest priority finance areas. Our result suggests that the periodic publications have drastically increased in the past few years, especially after the Paris Agreement in 2015. With content analysis of prior research, most of the research used quantitative and econometric approaches. With the review of papers, it can be concluded that climate finance is mostly constrained in vulnerable regions in which the risk of climate change and its adverse impacts are delicate, including low-lying coastal areas, SIDS, deserts, mountains, and Polar Regions. Innovative climate finance funding should focus on renewable energy, energy efficiency, and infrastructure that aids adaptation in vulnerable communities. Emphasis should be placed on initiatives that provide both mitigation and adaptation advantages, ensuring a resilient and sustainable future. While research primarily focuses on adaptation and mitigation, the interplay between these two areas requires further exploration. We highlight the knowledge gap in this research domain examining the financing sources for mitigation of adverse climate change from private and public sectors.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b39ee88efd802fd43379da55a7605918",
  "timestamp": "2025-05-15T03:15:38.381722"
}