{
  "id": 8711,
  "title": "Medicare Capitation Model, Functional Status, and Multiple Comorbidities: Model Accuracy",
  "abstract": "Objective:To examine financial implications of the Centers for Medicare & Medicaid Services Hierarchical Condition Categories (CMS-HCC) risk-adjustment model on Medicare payments for individuals with comorbid chronic conditions. Study Design: The study used 1992-2000 data from the Medicare Current Beneficiary Survey and corresponding Medicare claims. Pairs of comorbidities were formed based,on prior evidence about possible synergy between these conditions and activities of daily living (ADLs) deficiencies, and included heart disease and cancer, lung disease and cancer, stroke and hypertension, stroke and arthritis, congestive heart failure (CHF) and osteoporosis, diabetes and coronary artery disease, and CHF and dementia. Methods: For each beneficiary, we calculated the actual Medicare cost ratio as the ratio of the individual's annualized costs to the mean annual Medicare cost for all people in the study. The actual Medicare cost ratios, by ADLs, were compared with HCC ratios under the CMS-HCC payment model. Using multivariate regression models, we tested whether having the identified pairs of comorbidities affected the accuracy of CMS-HCC model predictions. Results:The CMS-HCC model underpredicted Medicare capitation payments for patients with hypertension, lung disease, CHF, and dementia. The difference between the actual costs and predicted payments was partially explained by beneficiary functional status and less-than-optimal adjustment for these chronic conditions. Conclusion: Information about beneficiary functional status should be incorporated in reimbursement models. Underpaying providers who care for populations with multiple comorbidities may provide severe disincentives for managed care plans to enroll such individuals and to appropriately manage their complex and costly conditions. (Am J Manag Care. 2008;14(10):679-690)",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b39f0344e2ab7298528d57ddc86dd697",
  "timestamp": "2025-05-15T03:21:24.751752"
}