{
  "id": 6550,
  "title": "The household economic costs associated with depression symptoms: A cross-sectional household study conducted in the North West province of South Africa",
  "abstract": "Aim The aim of this study was to assess the association between depression symptom severity and household income, consumption, asset-based wealth, debt and use of distress financing strategies, to understand how depression symptom severity and household economic welfare are related. Methods A household survey was administered to the households of primary health clinic-attenders who were screened for depression symptoms using the 9-item Patient Health Questionnaire in the chronic care units of four primary health clinics in the North West province of South Africa. Univariate and multivariable regression models were used to assess whether a range of household economic measures were significant predictors of depression symptom severity; and whether depression symptom severity significantly predicted changes to household economic welfare, across a number of different economic measures using both multiple linear regression and logistic regression analyses. Results On univariate analysis, certain characteristics were associated with significantly worse (higher) PHQ-9 scores, namely: households in which the household head was younger, female, and unmarried; households in which the indexed patient was younger, and did not receive an education beyond primary school; increasing household size, receipt of a social grant, households living in housing constructed of metal sheet walls and households making use of a public tap as their primary water source. In addition, univariate analysis demonstrated that higher log-transformed food expenditure, lower log-transformed capacity to pay, the presence of household debt and both reducing the size or frequency of meals and drawing up retail shop accounts in response to financial distress over the past three years were associated with significantly worse (higher) PHQ-9 scores. Multivariable analysis demonstrated that larger household sizes (p<0.05), receipt of social grants (p<0.05), higher food expenditure (p<0.01), and drawing up retail shop accounts in response to financial distress (p<0.05) were independently predictive of worse (higher) PHQ-9 scores. Inversely, increasing age of the household head (p<0.05), having piped water directly into the household (as opposed to making use of a public water sources) (p<0.01), and increasing capacity to pay (p<0.01) were independently predictive of better (lower) PHQ-9 scores. Similarly, multivariable analysis demonstrated that worse (higher) PHQ-9 scores were independently predictive of lower household capacity to pay (p<0.10) and higher food expenditure (p<0.01). Conclusions This study is the first of its kind in South Africa, identifying household economic factors associated with increased depression symptom severity on a continuum; and demonstrating that financial risk protection efforts are needed across this continuum. The study demonstrates that the relationship between poverty and mental health extends beyond the individual to affect household economic functioning. These findings must be included in policy considerations to achieve effective protection for vulnerable households facing the interaction of depression and adverse economic circumstances.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b3a9ebc4df93cb8fcddd1a7c22f96b5d",
  "timestamp": "2025-05-15T02:59:07.580501"
}