{
  "id": 459,
  "title": "Return-volatility relationships in cryptocurrency markets: Evidence from asymmetric quantiles and non-linear ARDL approach",
  "abstract": "Implied volatility has consistently demonstrated its reliability as a superior estimator of the expected short-term volatility of underlying assets. In this study, we employ the newly constructed robust model-free implied volatility (MFIV) indices for Bitcoin and Ethereum (BitVol and EthVol) to explore the asymmetric return-volatility relationship of these cryptocurrencies through the lens of behavioral finance theories. Utilizing the asymmetric quantile regression model (QRM) and the Non-linear ARDL (NARDL) approach, our results reveal a notable difference from equities. Both positive and negative return shocks in the cryptocurrency market lead to an increase in volatility. However, during high volatility regimes, positive (negative) return shocks exert a more substantial impact on positive innovations of volatility for Bitcoin (Ethereum) compared to negative (positive) return shocks. The degree of asymmetry steadily intensifies as we progress from medium to uppermost quantiles of the volatility distribution. These observed phenomena can be attributed to behavioral aspects among market participants, including noise trading, behavioral biases, and fear of missing out (FOMO). Our findings hold significant implications for various aspects of cryptocurrency trading, portfolio hedging strategies, volatility derivatives pricing, and risk management.",
  "year": 2023,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b3b0ac4cab1f11dccd3400b0f3b0a034",
  "timestamp": "2025-05-15T01:32:30.144417"
}