{
  "id": 707,
  "title": "Oversampling using Fuzzy Rough Set Theory in Imbalanced Neural based Diabetic patient Readmission Prediction: A hybrid approach",
  "abstract": "Diabetes is a long-term illness and can lead to a variety of other complications health-wise. The growth in the counts of diabetic patients has taken a sharp hike lately which eventually resulted in an increased rate of patient admissions. Readmission rates determine the quality of the service provided by a hospital. Readmissions not only foist a massive financial burden on patients but is also responsible for an inconvenient environment for a patient. This can be avoided if high-risk patients are identified by utilizing robust machine learning approaches like Artificial Neural Network (ANN). The task becomes challenging when the Class Imbalance problem arises during the training phase of the model. The problem is very much evident in re-al-life applications with ANNs and is also prevalent in readmission prediction. In absence of any concrete study focusing on the problem in this domain, our paper proposes a Fuzzy Rough Set Theory based artificial data oversampling approach to mitigate the Class Imbalance problem while predicting high-risk diabetic patient. Two variations of the technique are tested and compared with other existing techniques. The approach is capable of reducing the effects of imbalanced classes and has resulted in enhanced performance of the ANN. The approach has also enhanced the performances of other machine learning models",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b3ceb9293985d840a6ca009256c1d954",
  "timestamp": "2025-05-15T01:53:59.480753"
}