{
  "id": 2278,
  "title": "ESOP Policy, Transparency and Stock Price Crash Risk",
  "abstract": "Issuing ESOP shares causes a lot of The Regression Results of ESOP Policies on Stock Price Crash Riskcontroversy because it not only reduces stock prices due to dilution effects but also reduces agency costs. The purpose of this study is to examine the impact of Employee Stock Ownership Plan (ESOP) policies on the risk of stock price crashes, with a focus on the role of corporate transparency. The study is set in the context of companies listed on the Vietnamese stock exchange from 2010 to 2022. Using a quantitative approach, data were collected and analyzed from financial reports and stock price performance. The findings reveal that companies with ESOP policies face varying risks of stock price crashes depending on the concentration and issuance ratio of the ESOP. Specifically, companies with an ESOP ratio exceeding 1% experience a higher crash risk, while those distributing ESOP shares to over 10% of their employees face lower risks. Corporate transparency plays a crucial role because transparent companies are better positioned to mitigate these risks. Conversely, non-transparent companies are more vulnerable to stock price crashes when issuing ESOPs. These findings have practical implications for both investors and policymakers, suggesting that ESOP issuance should be coupled with transparency to reduce financial risks.JEL Classification Codes: G3; G10; G14; G35",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b3cf05347475bbad5d11d354f10ae361",
  "timestamp": "2025-05-15T02:13:31.774902"
}