{
  "id": 4063,
  "title": "Charter Schools Have Rainy Days Too! But Are They Ready for When It Pours?",
  "abstract": "Nearly 30 years since their inception in the United States, charter schools are now a well-established educational option for parents and students. Although they are an important education provider schooling more than 3.1 million students nationwide, we know little about their ability to accumulate fiscal savings for weathering rainy days and sustaining smooth service. Unlike most other fiscal savings studies focusing on the unrestricted fund balance, we examine both restricted and unrestricted fund balances across Pennsylvania charter schools, this study's unit of analysis. Using a Newey-West regression and data spanning the years 2011-2019, we show that charter schools consider all fund balance classifications when making savings decisions; albeit the unrestricted was their primary savings vehicle. Given their limited revenue portfolio, they are left with only a few options for accumulating fiscal savings. Surplus from tuition payments and additional revenues from private funding sources appear as main fund balance boosters. Surprisingly, special education enrollment significantly increases the unrestricted fund balance, a finding that requires further attention from legislators and policy makers. Concerns are also raised about participation in the state pension system as it absorbs a significant amount of slack that otherwise could be used for other purposes. Overall, most charter schools retain inadequate fiscal savings not capable of insulating their operation from revenue volatility and other contingencies. Statutory fund balance minimums and the adoption of formal fund balance policies articulating how savings are accumulated, used, and replenished should, therefore, be considered.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b3e77308bbaaf9584aac196c489ad487",
  "timestamp": "2025-05-15T01:23:27.337149"
}