{
  "id": 211,
  "title": "Demand response model: A cooperative-competitive multi-agent reinforcement learning approach",
  "abstract": "This study introduces a novel Demand Response (DR) Model based on Multi -agent Reinforcement Learning (MARL -DR), comprised of a pricing and incentives scheme aimed at improving the accuracy of existing demand response strategies. Furthermore, this new approach represents a flexibility solution to prevent sharp price variations caused by the high penetration of unconventional renewable energy, which are directly passed on to end -users. The model employs a cooperative -competitive MARL -DR technique based on Q -learning, with the goal of determining optimal prices and incentives that maximize benefits for both customers and electric Service Provider (SP). In this regard, the model has the capability to offer customers pricing options in both real-time and time -of -use, to actively adjust each user's consumption. Additionally, through demand characterization factors, such as the coincidence factor (CF), the of typical user behavior is improved, and the influence of individual user demand on system peak demand is more accurately detected. It is also demonstrated that the cooperativecompetitive approach offers better performance compared to other approaches. Finally, a sensitivity analysis is presented at various stages of the model to verify its accuracy and efficiency in pricing and incentives formulation.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b3e8bc467faeb08e0e58c42598371909",
  "timestamp": "2025-05-15T01:29:44.159667"
}