{
  "id": 7915,
  "title": "Rainwater harvesting technologies and practises in rural Uganda: a case study",
  "abstract": "Rainwater harvesting (RWH) is practised to mitigate water shortages in both household chores and agricultural use. This paper examines the relationship between adoption of household RWH technologies in rural Uganda (dependant variable), and the influence of independent variables (household characteristics such as age or monthly cash income, household perception including attitude or risk preference, and institutional and policy-assumed variables such as household's contact with extension workers, RWH-subsidy provision, information flow channels and local community financial sources) that potentially influence technological adoption. Logistic regression techniques were used on a random sample of 224 respondents to ascertain the influence of variables on adoption of household RWH technologies. Analyses of hypothesised relationships revealed that subsidy provision was statistically significant for adoption of RWH technologies in rural Uganda. Overall, the paper suggests the consideration of household RWH subsidies in form of hardware when promoting adoption of RWH technologies. Moreover, when subsidies in the form of RWH construction materials are provided, the chances of having a RWH system installed seem more likely than when cash is provided owing to the many options cash can be used to purchase. Furthermore, household subsidy provision will produce immediate improvement in rural water supply, fostering the probability of adoption of rainwater technologies, a choice that can be made with regard to the form or level of public subsidy received depending on institutional and policy interventions.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b3fe226638dbb1215b104e11bc0ac290",
  "timestamp": "2025-05-15T03:13:30.644725"
}