{
  "id": 3963,
  "title": "Financial hardship in breast cancer survivors: a prospective analysis of change in financial concerns over time",
  "abstract": "PurposeMedical financial hardship, encompassing material, behavioral, and psychologic domains, has been shown to impair quality of life during and after cancer therapy. We sought to evaluate the change in financial concerns in breast cancer survivors over time and identify those at risk of worsening financial concerns. MethodsIn Mayo Clinic Breast Disease Registry (MCBDR), a prospective cohort of consenting patients seen at Mayo Clinic Rochester within 1 year of their initial breast cancer diagnosis, consenting participants were asked to complete baseline and annual follow-up surveys that included an item on which respondents were asked to report their financial concerns on a linear analogue scale from 0 ( none ) to 10 ( constant concerns ). We compared patient-reported financial concern at baseline to that on each patient's most recent survey, with worsening concerns defined as a 1+-point increase. Logistic regression analysis evaluated for possible predictors of worsening financial concerns. ResultsOne-thousand nine-hundred fifty-seven participants responded to financial concern questions on the baseline and at least one follow-up survey between 2015 and 2020. Three-hundred fifty-seven (18.2%) reported worsening financial concerns. Only baseline financial situation of enough to pay the bills, but little spare money to buy extra or special things,  was associated with a greater likelihood of worsening financial concerns. ConclusionsMore than one in seven breast cancer survivors develop worsening financial concerns within 5 years of diagnosis, and those with less financial security at baseline appear to be most vulnerable. Implication for cancer survivorsFinancial concerns may worsen over time for breast cancer survivors, and therefore, oncology providers must continue to assess the financial well-being of survivors over time.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b410ee2e87c477240e9cdbbedc742e65",
  "timestamp": "2025-05-15T02:31:58.574685"
}