{
  "id": 9070,
  "title": "Socio-behavioral predictors of changes in dentition status: a prospective analysis of the 1942 Swedish birth cohort",
  "abstract": "Objectives: Using a prospective cohort design, this study assessed loss of natural teeth between ages 50 and 65. Guided by a conceptual framework grouping variables according to the life-course stage at which they would be expected to operate, this study assessed the impacts of socio-behavioral and disease-related factors on tooth loss between ages 50 and 65. Methods: In 1992, all 50-year-olds in two counties of Sweden were invited to participate in a longitudinal questionnaire survey. Of the total population of 8888 subjects, 6346 responded (71.4%). Of the 6346 subjects who completed the 1992 questionnaire, 4143 (65%) completed postal follow-ups at ages 55, 60 and 65. Results: For the total sample, the prevalence of having lost at least some teeth increased from 76% at age 50-85.5% at age 65. A total of 14% women and 13% men changed from having all teeth in 1992 to having tooth loss in 2007. Stepwise logistic regression analyses focused on predictors of tooth loss between 1992 and 2007. The following life-stage predictors achieved or approached statistical significance with respect to overall tooth loss; country of birth and education (early life and young adult life stage), marital status, dental care avoidance because of high cost, smoking and reporting consistent pain (middle-age and early-old-age life stage). Conclusion: Fewer substantial proportions of the 1942 cohort experienced tooth loss between ages 50 and 65. Tooth loss was highly prevalent from age 50 and increased moderately with increasing age. Oral disease-related factors and socio-behavioral characteristics such as refraining from dental care because of financial limitations, acting at earlier and later life-course stages were major risk factors for having tooth loss. Early primary prevention of smoking and increased equitable access to dental care might improve tooth retention throughout the transition from middle age to early-older age.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4100fc72a7eb7062621b55a8c337fe7",
  "timestamp": "2025-05-15T03:25:27.634259"
}