{
  "id": 4001,
  "title": "THE ROLE OF THE BANKS' RATING SYSTEM IN THE ALLOCATION OF LOANS",
  "abstract": "The subject of this paper is the analysis of the application of banking internal credit risk measurement models for the purpose of calculating the minimum regulatory capital. The Basel Committee established proposals for an internal rating-based approach (IRB approach-internal rating-based) to capital requirements for credit risk. Such an approach, which relies on the bank's internal assessment of counterparties and exposures, can ensure two key objectives: the first is additional risk sensitivity, in which capital requirements based on internal ratings can be much more sensitive on the drivers of credit risk of economic losses in the banking portfolio; the second is incentive compatibility, where the appropriate structure of the RBI approach can provide a framework that encourages banks to continue to improve their internal risk management practices. The internal ranking approach aims to improve the safety and soundness of the financial system. The paper defines the terminology and classification of the rating system. The probability of default (PD-probability at default) and the other two risk components LGD (loss given default) and EAD (exposure at default) are key input parameters for the calculation of regulatory capital. The rating system is, therefore, a significant driver of risk management and financial performance measurement. To be in a position to demonstrate to supervisors that an internal rating system should be used for the purposes of determining minimum regulatory capital requirements, banks must first demonstrate that the rating system is an integral part of their ongoing operations and risk management culture.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4188254f9a5504139d8bde12843b7bd",
  "timestamp": "2025-05-15T02:31:58.707724"
}