{
  "id": 9247,
  "title": "Growth curve, blood parameters and carcass traits of grass-fed Angus steers",
  "abstract": "The increasing demand for natural products is currently transforming the meat industry, making grassfed and finished beef a valuable option for improving profits. However, the transformation of conventional operations to grass-fed systems comprises many modifications, such as logistical, technological, and financial that could be very complex and expensive, involving economic risk. Therefore, in this study, we analyzed the growth curve, critical economic traits, and carcass quality and finished characteristics over several consecutive years in closely related grass-fed and finished Angus steers, to reduce the genetic effect on the results. We found that grass-fed steers require around 188 additional days to reach the market weight (approx. 470 kg) and had approximately 70% less average daily gain compared to the grain-fed and finished steers. Regression analysis demonstrated an interaction between feed and age (P < 0.01); thus, individual regressions were fitted for each regimen style, obtaining almost perfect linear curves for both treatments, which could be straightforwardly used in practical situations due to its simplicity. Six of eight carcass traits were different between grain-fed and grass-fed and finished steers. Hotcarcass weight, dressing, back fat, and quality grade were superior in grain-fed individuals, contrarily to yield grade and ribeye area/carcass ratio, which were better in grass-fed and finished steers (P < 0.05). Interestingly, the meat tenderness was certainly low and similar in both treatments (P = 0.25), indicating the feasibility of producing tender meat with animals under a grass-fed diet. Nevertheless, according to the quality grade analysis, grain-fed carcasses were greater ranked compared to grass-fed bodies (P < 0.01), regardless of their same tenderness. The results will provide valuable information for better understanding beef cattle in grass-feeding finishing systems, especially from weaning to harvest. Additionally, the study will expand the knowledge about the quality of meat obtained from animals that received grass exclusively, becoming relevant information for economic evaluation and management decisions for grass-based cattle operations. CO 2021 University of Maryland. Published by Elsevier B.V. on behalf of The Animal Consortium. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b429ff30bbd61ab3af27d10325e7a783",
  "timestamp": "2025-05-15T03:26:54.595591"
}