{
  "id": 171,
  "title": "Financial Risk Early Warning Model for Listed Companies Using BP Neural Network and Rough Set Theory",
  "abstract": "In current financial environment, listed companies are facing increasingly complex markets and ever-changing financial risks. The companies deeply recognize the crucial role of financial risk management in the sustainable development of enterprises. The challenge lies in rapidly changing market conditions, and traditional methods are difficult to predict risks in a timely and accurate manner. Therefore, improving the accuracy and timeliness of financial risk prediction has become an urgent need in the current field to reduce potential losses and maintain the financial health of enterprises. This work aims to enhance the accuracy and timeliness of predicting financial risks for listed companies and reduce potential losses caused by these risks. In the research process, a large volume of data is initially collected, including financial statements, market data, and financial risk event data. Subsequently, the Rough Set Theory (RST) is employed for feature selection to identify financial indicators and market factors highly relevant to financial risk. Finally, a financial risk early warning model on the basis of the Back Propagation Neural Network (BPNN) is built, and then trained and optimized using historical data. Cross-validation analysis is employed to assess the model's performance, and the model is compared with traditional financial risk early warning methods. The findings reveal that the financial risk early warning model based on RST and the BPNN demonstrates high accuracy and reliability in predicting financial risks for listed companies. The model exhibits excellent performance in terms of accuracy, recall, and F1 score, achieving rates of 96%, 95%, and 95.50%, respectively. These research findings are expected to positively impact the financial sector and provide financial decision-makers with more accurate risk early warning and decision support.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4292b0f89cd8c16b26456f400ce08c1",
  "timestamp": "2025-05-15T01:47:52.946458"
}