{
  "id": 7297,
  "title": "Prevalence of malnutrition and associated factors among community-dwelling older persons in Sri Lanka: a cross-sectional study",
  "abstract": "Background: Malnutrition in older persons is a public health concern. This study aimed to estimate the prevalence of malnutrition and its associated factors among community-dwelling older persons in Sri Lanka. Methods: A cross-sectional study was conducted in the Kandy district,Sri Lanka. The nutritional status of older persons was assessed using the Mini Nutritional Assessment - Short Form (MNASF). A standardised questionnaire was used to record factors associated with malnutrition: demographic characteristics, financial characteristics, food and appetite, lifestyle, psychological characteristics, physical characteristics, disease and care, oral health, and social factors. Complex sample multinomial logistic regression analysis was performed. Results: Among the 999 participants included in the study, 748 (69.3%) were females and 251 (25.1%) were males. The mean age was 70.80 years (95% CI: 70.13, 71.47). The prevalence of malnutrition, risk of malnutrition and well-nutrition was 12.5%, 52.4% and 35.1% respectively. In the multivariate model, hypertension (adjusted OR = 1.71; 95% CI: 1.02, 2. 89), alcohol consumption (aOR = 4.06; 95% CI: 1.17, 14.07), and increased age (aOR = 1.06; 95% CI: 1.01, 1.11) were positively associated with malnutrition. An increased number of people living with the older person (aOR: 0.91; 95% CI: 0.85, 0.97) was a protective factor among those at risk for malnutrition. Conclusion: Both the prevalence of malnutrition and risk of malnutrition were commonly observed among community-dwelling older persons in Sri Lanka. The associated factors identified in this study might help public health professionals to implement necessary interventions that improve the nutritional status of this population.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b42d7f50c62e5ad6f93328fac5431695",
  "timestamp": "2025-05-15T03:07:02.673620"
}