{
  "id": 8886,
  "title": "The combined effect of socioeconomic position and C-reactive protein for predicting incident cardiometabolic disease: Findings from a 14-year follow-up study of the English Longitudinal Study of Ageing (ELSA)",
  "abstract": "Cardiovascular disease and diabetes are leading causes of morbidity and mortality worldwide. Social inequalities in the distribution of these diseases across the population exist. The aim of the current study was to examine the additive effect of socioeconomic position and a known biological risk marker (C-reactive protein [CRP]) for future incident cardiometabolic disease. We used data from the English Longitudinal Study of Ageing (N = 5410). Tertiles of net financial wealth and CRP (>3 mg/L) were measured at wave 2 (2004/05) and disease incidence (coronary heart disease [CHD], stroke, diabetes/high blood glucose) was reported across the subsequent 14 years of follow-up (2006-2019). Individual diseases were modelled as well as cardiometabolic multimorbidity which was defined as 2 or more incident cardiometabolic disease diagnoses over follow-up. Participants were free from the disease of interest at baseline. Cox proportional hazard and logistic regression analyses were used controlling for sociodemographic, lifestyle and health-related covariates. After adjusting for all covariates, the combination of low wealth and elevated CRP was an independent predictor of incident diabetes/high blood glucose (Hazard Ratio (HR) = 2.14; 95% Confidence Interval (C.I.) = 1.49-3.07), CHD (HR = 2.48, 95% C.I. = 1.63-3.76), stroke (HR = 1.55; 95% C.I. = 1.18-2.04), relative to high wealth/low CRP. Low wealth and elevated CRP was also an independent predictor of incident cardiometabolic multimorbidity (Odds Ratio = 2.22, 95% C.I. = 1.16-4.28) in age and sex adjusted models. The presence of both low wealth and elevated CRP was implicated in the onset of CHD, stroke, diabetes/high blood glucose, and cardiometabolic multimorbidity up to 14 years later, reflecting the role of psychobiological processes in predicting disease burden. Our results reinforce calls for efforts to tackle structural inequalities to improve healthy ageing trajectories.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b42d10dc5b7948b0a2f5f525f30aaba2",
  "timestamp": "2025-05-15T03:23:27.814472"
}