{
  "id": 7220,
  "title": "Negative fateful life events in midlife and advanced predicted brain aging",
  "abstract": "Negative fateful life events (FLEs) such as interpersonal conflict, death in the family, financial hardship, and serious medical emergencies can act as allostatic stressors that accelerate biological aging. However, the relationship between FLEs and neuroanatomical aging is not well understood. We examined 359 men (mean age 62 years) participating in the Vietnam Era twin study of aging (VETSA) to determine whether negative midlife FLEs are associated with advanced brain aging after controlling for physical, psychological, and lifestyle factors. At two different time points, participants were assessed for negative FLEs, health and well-being, general cognitive ability, socioeconomic status, depression, and ethnicity. Participants underwent a magnetic resonance imaging examination, and T-1-weighted images were processed with FreeSurfer. Subsequent neuroanatomical measurements were entered into the Brain-Age Regression Analysis and Computation Utility software (BARACUS) to predict brain age. Having more midlife FLEs, particularly relating to interpersonal relationships, was associated with advanced predicted brain aging (i.e., higher predicted brain age relative to chronological age). This association remained after controlling for the significant covariates of alcohol consumption, cardiovascular risk, adult socioeconomic status, and ethnicity. (C) 2018 Elsevier Inc. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4441f2ce796b5bdc399638f25ce783f",
  "timestamp": "2025-05-15T03:06:35.266214"
}