{
  "id": 7573,
  "title": "The prevalence and consequences of unmet need - Contrasts between cider and younger adults with disability",
  "abstract": "OBJECTIVES. This article investigates the prevalence, determinants, and consequences of unmet need for assistance with activities of daily living (ADLs), instrumental activities of daily living (IADLs), and transportation in a randomly selected sample of adults with disability residing in Springfield, Massachusetts. METHODS. Respondents were contacted through random digit dialing, and eligibility was determined through a disability screen. Eligible individuals were stratified by age; 632 people were interviewed (78% of contacted eligibles). The prevalence of need and unmet need for ADLs, IADLs, and transportation assistance was calculated separately by age strata, as was the prevalence of selected negative consequences attributed to inadequate help with specific activities. The determinants of unmet need were modeled using logistic regression. RESULTS. The prevalence of unmet need for assistance with individual ADLs ranged from 4.1% (eating) to 22.6% (transferring) of the full sample. Unmet need for IADLs assistance was higher, ranging from 15.9% (cooking) to 34.6% (heavy housekeeping). Respondents younger than age 65 reported higher levels of unmet need for IADLs and transportation help than respondents age 65 or older; members of the younger group also were more likely to report five of the seven negative consequences attributed to inadequate help with IADLs and transportation leg, missing medical appointments). Regression results revealed inability to meet expenses, having few or no reliable helpers, and impairment severity to be key determinants of unmet need. CONCLUSIONS. Financial problems, and not age per se, placed working age adults at elevated risk of unmet need in this study. The consequences of inadequate help can impede management of chronic health conditions, and may compromise individuals' ability to maintain a safe and reasonable quality of community living.",
  "year": 1997,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b454d4eb3180ec78559e4e297adc07a9",
  "timestamp": "2025-05-15T03:10:05.526577"
}