{
  "id": 3130,
  "title": "Financial markets and genetic variation",
  "abstract": "We investigate the extent to which a country's degree of genetic variation contributes to the observed variation in financial market activity across countries. We postulate that genetic variation can affect financial markets through its impact on aggregate investment behavior, innovation in the financial sector, and productivity. Our country-level, cross-sectional analysis reveals a significant hump-shaped relation between a country's predicted genetic variation and the size of its financial markets. This result is consistent with the conjecture that at relatively intermediate degrees of genetic variation, the associated intermediate levels of trust and risk-taking within the country result in the largest investment flows into public financial markets. Our results are robust to different measres of financial market size, several regression specifications, and the inclusion of a broad range of controls such as legal origin, institutional characteristics, culture, natural endowment, and trade openness. Our main findings appear to be restricted specifically to equity markets (vs. debt markets) where there is relatively more uncertainty and, thus, trust and risk-taking are relatively more important. Additional analysis suggests that better overall country-level governance can moderate the role that genetic variation plays in shaping equity market size. (C) 2017 Published by Elsevier B.V.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b468b66c2b90eb9ab781e1903b7a64ca",
  "timestamp": "2025-05-15T02:22:56.704026"
}