{
  "id": 2884,
  "title": "Learning design in science education: perspectives from designing a graduate level course in evidence-based teaching of science",
  "abstract": "Graduate students intending to pursue an academic career in the sciences have much to gain by learning to teach science but often have limited training opportunities. In response to this need, we designed a one-semester course, Learning Design in Science Education (LDSE), in which students receive formal training in pedagogical theory with role model demonstration of current best practices in active learning. Building from previous descriptions of similar courses, we added a practical experience for the students to utilize their new skills to design and teach a mini science course at the end of the semester. Additionally, students developed a teaching portfolio, complete with a personal teaching statement, syllabus, course materials, and evaluations from peers and faculty. Overall, the course was well received by the students and there are early indications that students benefited from their participation in the course. In this manuscript, we present the design and outcomes of the course, faculty and student perceptions, and thoughts on improvements for future semesters and its potential for use by others. NEW & NOTEWORTHY The need for graduate students and other trainees to learn effective methods for teaching science is greater than ever. In this manuscript, we offer a model course for the training of graduate students in learning theory, curriculum design, and technology use in a biomedical sciences environment.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4992dfccffa9f1f9553afc66be1202e",
  "timestamp": "2025-05-15T01:11:17.480421"
}