{
  "id": 1805,
  "title": "Using Digital Tools in Government Procurement Analysis: Detecting Suspicious Purchases with Control Indicators",
  "abstract": "This article presents the results of a study on the use of digital technologies in analyzing government procurement to identify suspicious transactions. The study collected and analyzed data related to government procurement, employing statistical methods and digital tools, including the Marker-Interfax monitoring and procurement analysis system. The authors conducted correlation-regression analysis, including the construction of a linear regression model, as well as multiple regression models, specifically logarithmic, linear-logarithmic, and logarithmic-linear models. Additionally, a classification analysis was performed. The focus was on control indicators to identify potentially suspicious procurements. The study began with an analysis of existing literature and the legislative framework in government procurement, as well as IT and analytical tools used in this field. Data selection involved analyzing procurement data from the past two years in the financial services sector for government customers in St. Petersburg, Russia. Procurement data was analyzed using 140 control indicators, compiling a classification of risk groups and providing comprehensive characteristics for each group. Additionally, analysis was conducted on the number of submitted bids, initial maximum contract price, and contract price reduction for each risk group. A correlation-regression analysis identified the key factor influencing the increase in control indicators signaling potential violations in procurement procedures. In conclusion, this study confirms that utilizing digital technologies and tools can effectively detect suspicious transactions and enhance transparency and efficiency in the procurement process. The findings are valuable to government agencies, researchers, and professionals combating corruption and optimizing budgetary resource utilization.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b49a792e4d64c92fc7ef893e65d1544a",
  "timestamp": "2025-05-15T02:07:25.775226"
}