{
  "id": 313,
  "title": "A new portfolio selection problem in bubble condition under uncertainty: Application of Z-number theory and fuzzy neural network",
  "abstract": "In this paper, a new mathematical formulation for a portfolio selection problem is developed. This model is based on the difference between fundamental value and market value of assets. The proposed model is especially applicable in bubble conditions. Input data of the developed model are subjected to uncertainty. To consider data uncertainty, the Z-number theory is employed. Additionally, a fuzzy neural network is used to predict market value of assets in different economic conditions as input data of the developed model. To show advantages of the proposed model, its results are compared to the mean absolute deviation (MAD), Conditional Value at Risk (CVaR), and Value at Risk (VaR). Results show that the deterministic formulation of proposed model performs better than MAD, CVaR, and VaR in bubble condition. Moreover, fuzzy formulations of all mentioned models perform better than their deterministic formulations in terms of capturing risk of a bubble. Finally, results illustrate that application of the Z-number theory in the proposed model makes the new portfolio selection problem reliable in bubble condition with respect to calculating risk of bubble bursting and proposing the best portfolio among all deterministic and nondeterministic formulations in bubble conditions.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b49f393a743dde933a0584a3f70e6431",
  "timestamp": "2025-05-15T00:42:00.417438"
}