{
  "id": 8987,
  "title": "Sociodemographic associated factors with non-disclosure of HIV sero-status to sexual partners in Maputo, Mozambique",
  "abstract": "The HIV prevalence in Maputo city is 16.2%. There is a lack of data describing associated factors with disclosure or non-disclosure of HIV-positive sero-status to sexual partners. This analysis describes associated factors of non-disclosure of HIV sero-status to sexual partners among people living with HIV (PLHIV) participating in a serostatus disclosure support program at three health facilities in Maputo, Mozambique. We used a cross-sectional design of PLHIV aged over 18 years. Datas were collected between December 2019 and September 2020. Univariate and multivariable logistic regression models were used to evaluate factors associated of non-disclosure of HIV sero-status. A total of 377 patients were enrolled in the HIV sero-status disclosure Program. Of these, nearly two-thirds (61.5%) were women, 52.9% had completed secondary school, 47.7% were 25-34 years old, 50.9% had informal employment with low income, and 73.2% were married. Univariate logistic regression model showed greater odds of non-disclosure among patients who had an employment contract with a maximum wage (Crude Odds Ratio [cOR] 2.02, 95% confidence interval [CI] 1.15-3.55, p = 0.015); were single (cOR 3.85, 95% CI 2.22-6.69, p < 0.001); were living with parents (cOR 2.30, 95% CI 1.07-4.93, p = 0.033); received financial support for their monthly household expenses from parents or a close relative (cOR 7.15, 95% CI 2.19-23.36, p = 0.001); or brought a parent/close relative and/or a friend as a confidant during HIV care(cOR 3.17, 95% CI 1.74-5.76, p < 0.001; and cOR 5.97, 95% CI 1.57-22.66, p = 0.009, respectively). Multivariable logistic regression model showed: from parents/close relative and from partner (Adjusted Odds Ratio [aOR] 8.19, 95% CI 1.44-46.46, p = 0.018; and aOR 4.34, 95% CI 1.05-17.17, p = 0.043), respectively); in those who brought a parent/close relative and/or a friend as a confidant during HIV care (aOR 8.86, 95% CI 2.16-36.31, p = 0.002; and 195 aOR 21.68, 95% CI 3.02-155.87, p = 0.002, respectively). Non-disclosure of serostatus is a critical issue for HIV care and treatment programs, given that non-disclosure of HIV serostatus increases risk of HIV transmission. Understanding the factors associated with non-disclosure is crucial for designing strategies to address these factors and end the HIV epidemic by 2030. Our findings suggest that HIV serostatus disclosure programs might target the sociodemographic factors strongly associated with non-disclosure.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4a40845feaffc96fd387100b3d8ce4e",
  "timestamp": "2025-05-15T03:24:26.349873"
}