{
  "id": 8237,
  "title": "Impression management through minimal narrative disclosure in annual reports",
  "abstract": "The literature on the impression management of discretionary narrative disclosures has largely focused on selectivity in the presentation and content of information. We argue that selectivity involves 'including' or 'omitting' certain items of information 'concealment' (Mend-Davies & Brennan, 2007 Figure 1) which can be achieved either by manipulating the presentation of narrative disclosures (selectivity in the presentation of information), or by omitting narrative disclosure (selectivity in the content of information). In this study, we examine the concealment behaviour of minimal narrative disclosure (MND) in annual reports within the context of impression management. Based on a sample of publicly listed firms in Hong Kong, we first compare narrative disclosure items between MND firms and other sample firms and find that MND is more prominent in the domains of operating review and company overview, objectives and strategies. After controlling for the costs associated with disclosure, demand for external financing, market competition and political cost, our multivariate regression analysis shows that firms with poor performance and a higher risk of financial distress are more likely to engage in MND behaviour. We also find that MND firms exhibit deteriorations in firm performance in the subsequent year. Our findings are consistent with MND in annual reports being a deliberate impression management strategy to conceal information and explanations about persistently poor firm performance and future prospects to distract investors' attention away from a firm's weakness or negative news. (C) 2015 Elsevier Ltd. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4a9a2f1fc06c1e07f0fe6bcbcc2da60",
  "timestamp": "2025-05-15T03:16:48.948803"
}