{
  "id": 5311,
  "title": "Women economic empowerment through digitalization: analyzing social networks, risk and time preferences",
  "abstract": "This study investigates the impact of Digital Financial Services (DFS) on women's economic empowerment (WEE) in Accra-Ghana, against a backdrop of Africa emerging as a technology innovation hotspot. Despite progress, Africa faces challenges like digital illiteracy and limited access to DFS, significantly affecting women's economic empowerment. The research highlights the importance of digital literacy and affordability in making DFS initiatives successful for women, aligning with sustainable development goals aimed at women's economic empowerment and poverty alleviation. It focuses on DFS's effects on women's economic empowerment, bargaining preferences, and ability to act on these preferences. The study reveals that DFS positively impacts WEE, highlighted by a regression coefficient of 5.563 and an odds ratio of 260.542 for digital finance awareness, which emerged as the strongest predictor of economic empowerment. Other significant predictors include educational level and social network use. By examining factors like social networks, risk, and time preferences, the study offers insights into barriers women face in accessing financial services, paving the way for targeted interventions. While digital financial inclusion can empower women economically and benefit their families and communities, challenges like the gender digital divide and the need for gender-sensitive policies remain. This research contributes to understanding the role of digitalization in enhancing WEE in Sub-Saharan Africa, particularly in Accra-Ghana.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4af5df76edccf19d1137090f8bbe1bf",
  "timestamp": "2025-05-15T02:46:16.293689"
}