{
  "id": 1612,
  "title": "Credit risk assessment and decision making by a fusion approach",
  "abstract": "The sub-prime mortgage crisis of 2007 and the global financial tsunami of 2008 have undermined worldwide economic stability. Consequently, the timely analysis of credit risk has become more essential than ever before. The performance of early risk warning mechanisms may vary according to the criteria used and the underlying environment. This study establishes numerous criteria to assess the performance of classifiers and introduces a multiple criteria decision making method to determine suitable warning mechanisms. After undergoing these evaluations, the enhanced decision support model (EDSM), which incorporates the relevance vector machine with decision tree, is proposed. A decision tree is employed to overcome the opaque nature of the relevance vector machine: it yields knowledge as logical statements and aids in the interpretability of the forecasting results. The advantages of the EDSM involve overcoming the timeliness problem, fostering faster credit financing decisions, diminishing possible mistakes and reducing the credit analysis cost. This study also examines the feasibility of corporate transparency and the information disclosure (TD) criterion during an upturn in the economy, and finds that this procedure presents a suitable policy-relevant direction for regulators to design future measurements. Finally, this study shows that the EDSM is a promising way for investors, creditors, bankers and regulators to analyze credit rating domains. (C) 2012 Elsevier B.V. All rights reserved.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4b5f51fcc099ae544d328cfb4d290a7",
  "timestamp": "2025-05-15T02:05:08.309020"
}