{
  "id": 4046,
  "title": "Can Chinese investors manage climate risk domestically and globally?",
  "abstract": "Climate risk is increasing and poses a risk for investors in China's traditional stock market. In this paper, we construct a TVP-VAR-DY model and use benchmark regression and asset portfolio to explore the impact of climate risk on the Chinese stock market and whether assets with risk aversion attributes or green and low-carbon features can effectively manage climate risk. In particular, we compare China's climate risk with global climate risk and explore transition and physical risks separately. The results show that climate risk does affect the Chinese stock market and that Chinese climate risk has a greater impact on the stock market than global climate risk. However, the good news is that the metal assets, as well as the equity-type and bond-type green assets, are effective in reducing cross-market spillovers under China's climate risk, indicating that these assets can provide diversification benefits against climate-driven risks domestically. We also find that the metals and the equity-type assets could dampen the spillover effect against global transition risk, and the bond-type ones serve this function against global physical risk. The results further show that, for China's stock market investors, adding green bonds to their portfolios could reduce the downside risk, regardless of climate risk type or origin. In addition, we can infer that investors are suggested to use traditional safe-haven assets and bond-type green ones to manage climate risk.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4b9859225bc2bedd6cb4c35559bae68",
  "timestamp": "2025-05-15T01:23:27.272098"
}