{
  "id": 8331,
  "title": "The Costs and Adverse Events Associated With Hospitalization of Patients With Spinal Cord Injury in Victoria, Australia",
  "abstract": "Study Design. Analysis of patient-level diagnostic and cost data from an administrative database. Objective. To describe complications and cost differentials for hospitalized patients with traumatic spinal cord injury (T-SCI) and nontraumatic spinal cord injury (NT-SCI). Summary of Background Data. Numerous studies have reported costs for T-SCI, but few have involved NT-SCI. Methods. All patients with SCI admitted between June 1, 2003 and June 30, 2004 were identified using coding from the International Classification of Diseases and Related Health Problems 10th edition, Australian modification (ICD-10-AM). Analysis of database from 45 major acute care public hospitals included in the Victorian Cost Weights Study hospitals (n = 1605 episodes with a SCI). Complications were identified using the Victorian Department of Human Services C-prefix, assigned to hospital-acquired ICD-10-AM diagnoses. Results. Most (85.5%) SCI episodes involved NT-SCI. The ratio of acute to chronic admissions was high for T-SCI (1:0.05), but reversed for NT-SCI (1:1.36). Complications were documented in 38% of SCI episodes. T-SCI showed a higher rate of complications (56%) than NT-SCI (35%). SCI admissions with a complication were significantly more costly (mean, $A43,410) compared with those without a complication (mean, $A10,102). Length of stay was extended by an average of 32 days in the presence of a complication. Conclusions. SCI entails costly hospital care and high risk of hospital-acquired illness. Some of these complications are preventable. Better understanding of the financial costs of these episodes can assist healthcare providers and funders to weigh the benefits of interventions to reduce the rates of complications in these vulnerable patients.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4c19547fe4795a24aa64a495d00e276",
  "timestamp": "2025-05-15T03:17:49.121831"
}