{
  "id": 4018,
  "title": "Financial toxicity and patient experience associated with financial burden of molecular-targeted and immune therapies for cancer: an observational study under public health insurance",
  "abstract": "Background Financial burden of cancer treatment can negatively affect patients and their families. This study aimed to evaluate the financial toxicity of patients treated with molecular-targeted and immune therapies and explore the relationship between financial toxicity and patient experiences associated with the financial burden of cancer treatment. Methods This anonymous, self-administered questionnaire survey conducted across nine hospitals in Japan included patients aged 20-60 years who were receiving molecular-targeted agents or immune checkpoint inhibitors for any type of cancer for >= 2 months. Financial toxicity was evaluated using the COmprehensive Score for Financial Toxicity (COST). Patient experience was examined using 11 items based on previous studies. Independent factors related to financial toxicity were explored using multiple regression analyses. Results The mean COST score was 17.0 +/- 8.4, and 68 (49.3%) participants reported COST scores at or below the cutoff point. The factors contributing to financial toxicity were hesitation regarding continuing treatment based on finances (s beta = - 0.410, p < 0.001), cutting through my deposits and savings (s beta = - 0.253, p = 0.003), and reducing spending on basics like food or clothing (s beta = - 0.205, p = 0.046) along with comorbidities (s beta = - 0.156, p = 0.032). Conclusion Patients receiving molecular-targeted and immune therapies are at risk of experiencing profound financial toxicity and a reduced quality of life. The independently related factors that we identified have the potential to serve as indicators of profound financial toxicity and the need for specialized intervention.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4c503ecb5645556295632098a566032",
  "timestamp": "2025-05-15T02:32:27.432884"
}