{
  "id": 3854,
  "title": "Dynamic connectedness of clean energy markets, green markets, and sustainable markets: The role of climate policy uncertainty",
  "abstract": "This study examines the dynamic connectedness of clean energy, green, and sustainable markets, and determine how climate policy uncertainty affects the level of connectedness in these markets. To this end, we use clean energy and clean technological innovation assets to represent clean energy markets; green bonds and clean cryptocurrency assets to represent green markets; and carbon and sustainability assets to represent sustainable markets. To analyze the connectedness, we apply a novel Quantile Connectedness measure to daily data ranging from January 9th, 2018 to September 11th, 2023. Results reveal a strong interconnectedness of clean energy markets, green markets, and sustainable markets. Results also show that clean energy markets are net transmitters of shocks, green markets are net receivers of shocks, and sustainable markets are both net transmitters and net receivers of shocks. Furthermore, to examine the role of climate policy uncertainty, we employ three different nonlinear methods, namely; the nonparametric causality-in-quantiles, quantile regression, and Kernelbased regularized least squares. Empirical results suggest that climate policy uncertainty has a causal and positive effect on the interconnectedness of clean energy, green, and sustainable markets. These findings are validated by various robustness analyses, and hence, provide vital insights into the risk diversification's goal of investors and portfolio managers.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4c8135640bb870b2a2514f9dee2a59c",
  "timestamp": "2025-05-15T01:21:41.308056"
}