{
  "id": 1508,
  "title": "Impact of Enterprises Relationship on Ml's Ability to Forecast SME's Credit Risk in SCF: A Research Based on Complex Network",
  "abstract": "In this study, we investigate the impact of introducing enterprise relationship to train machine learning (ML) algorithms on improving its ability of forecasting small and medium-sized enterprises' (SMEs) credit risk in supply chain finance (SCF). First, we incorporate attributes of SME node in the CEs-SMEs network, a bipartite network constructed with transaction data in the Chinese automobile industry, into financial indicators to train ML algorithms for improving forecasting performance. Second, we employ the weighted one-mode projection approach to extract a projected-SMEs network that reveals the relationship among SMEs from the CEs-SMEs network and examine whether the ML algorithms' forecasting performances is improved when considering attributes in the projected-SMEs network. Third, we analyze the correlation between SME's credit risk and individual network attribute to specifically understand the impact of enterprise relationship on credit risk. Overall, the empirical results indicate that the forecasting performance is obviously better when enterprise transaction relationship is considered, and it is further enhanced after we apply weighted one-mode projection approach. Meanwhile, the variable importance analysis and the binomial logistic regression demonstrate how significantly each network attribute is correlated with credit risk, and the discussion on partial dependence plot shows that SMEs with large degree are non-risky generally.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4ec49e6c63d98a1a9495b3b7eaa6cce",
  "timestamp": "2025-05-15T02:03:39.852293"
}