{
  "id": 6206,
  "title": "Factors associated with family violence by persons with psychiatric disorders",
  "abstract": "Family violence by persons with psychiatric disorders (PD) is a highly under-researched area. The primary objective of the present analysis was to identify perpetrator, victim, and interaction/relationship factors associated with this phenomenon. The secondary objective was to examine the extent to which the relationship between caregiving and family violence was mediated by limit-setting practices used towards relatives with PD. 573 adults across the U.S. with an adult relative with PD completed an online survey. Multivariate logistic regression was performed examining the association of factors with the occurrence of family violence. Mediation was assessed with Sobel testing. Family violence was significantly associated with the following factors: perpetrator-income, illegal drug use, psychiatric hospitalization, treatment attendance, and use of medications; victim-age, employment status, income, and mental health status; interaction/relationship-parental relationship, co-residence, use of limit-setting practices, representative payeeship, and unofficial money management. Mediation was statistically significant. Increasing access to mental health and/or substance abuse treatment may decrease the risk of family violence. Interventions may benefit from attempting to decrease/modify the use of limit-setting practices. Where family representative payeeship or unofficial money management exists, it is advisable for practitioners to assess and address financial coercion and promote greater collaboration in financial decision-making. Published by Elsevier Ireland Ltd.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4ef168cc28bc3ce92751e388b8d7ad7",
  "timestamp": "2025-05-15T02:55:44.651993"
}