{
  "id": 5381,
  "title": "Asthma diagnosis and learning disabilities among children in the United States",
  "abstract": "Background. This study intends to investigate the impact of socio-economic factors on children with asthma, as well as the impact of these factors on their academic performance. Objectives. This work aims at studying asthma and learning disabilities in the United States during the years 2009-2018 and to find not only statistically significant indicators for asthma but also a possible link between asthma and learning disabilities. Material and methods. The statistical methods used to extract the results of this work are the chi-square test and One-way Analysis of Variance (ANOVA) in order to check the statistical significance of asthma with regard to the socio-economic factors of patients. Additionally, a multiple logistic regression analysis was used with the odds ratio (OR) to find statistically significant prognostic factors for both asthma and learning disabilities. Results. As specified by multiple logistic regression analysis, males who have neither a mother nor father have a higher risk of developing both asthma and learning disabilities, while Black or African Americans are three times more at risk for the occurrence of these types of diseases. In addition, parents' education and family income proved to also be prognostic risks for both asthma and learning disabilities. Conclusions. The results of this work explain the significance of deprivation (of family and financial support) as the main prognostic risk factor for asthma. Moreover, the same factor proved to be the main prognostic risk factor for learning disabilities as for asthma, which implies a possible association between asthma and learning disabilities.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b4f9afd0822e787798564af9550138da",
  "timestamp": "2025-05-15T02:47:13.945546"
}