{
  "id": 2078,
  "title": "A multi-objective instance-based decision support system for investment recommendation in peer-to-peer lending",
  "abstract": "Peer-to-peer (P2P) lending has attracted many investors and borrowers since 2005. This financial market helps investors and borrowers to invest in or get loans without a traditional financial intermediary. Investors in the P2P lending market are allowed to invest in multiple loans instead of financing one loan entirely, so investment decision-making in P2P lending can be challenging for lenders because they are not usually expert in loan investing. The goal of this paper is to propose a data-driven investment decision-making framework for this competitive market. We use the artificial neural network and logistic regression to estimate the return and the probability of default (PD) of each individual loan. The return variable is the internal rate of return (IRR). Moreover, we formulate the investment decision-making in P2P lending as a multi-objective portfolio optimization problem based on the mean-variance theory by the use of the non-dominated sorting genetic algorithm (NSGA2). To validate the proposed model, we use a real-world dataset from one of the most popular P2P lending marketplaces. In addition, our model is compared with a single-objective model and a profit-based approach. Throughout the experiment, the empirical results reveal that our multi-objective model in comparison with the single-objective model can improve a lender's investment decision based on both objectives of investments. It means that while the return increases, the risk decreases, simultaneously. On the other hand, it is concluded that the profit scoring model leads to a more profitable investment but with a high level of risk. Finally, a sensitivity analysis is done to check the sensitivity of our model to the total investment amount. (C) 2020 Elsevier Ltd. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5045da9b32f667363021e3dda7a18ad",
  "timestamp": "2025-05-15T02:10:59.001561"
}