{
  "id": 2459,
  "title": "Factors affecting farm operators' interest in incorporating riparian buffers and forest farming practices in northeast and southeast Missouri",
  "abstract": "Interest in the incorporation of riparian buffers and forest farming were modeled following agricultural conservation and agroforestry adoption studies. Attitudes, individual characteristics, economic diversity of landowners' household portfolio, and physical and ecological conditions were explanatory variables in Logit regression models of interest. Habitus and field, the values and institutions of farm operators, were included in the framework. Knowledge of the practice, perceived problems with the environment and attitude/habitus variables had a positive effect on the probability of being interested in riparian buffers. Knowledge of the practice was the most important factor in explaining interest in the case of forest farming, followed by attitudes about trees and concern for future generations, both habitus variables. Field variables like CRP payments representing familiarity with government programs that support conservation, had no significant effect on interest in riparian buffers. Older farmers were less interested in both practices, consistent with other findings. Existing economic diversification of the household portfolio had no effect on the probability of being interested in either practice.",
  "year": 2009,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b50cb39860fa43156e581661a612737f",
  "timestamp": "2025-05-15T01:07:03.005539"
}