{
  "id": 1010,
  "title": "Risk aware portfolio construction using deep deterministic policy gradients",
  "abstract": "Allocation of liquid capital to the financial instruments in a portfolio is typically done using a two-step process. In the first step, predictive techniques are used to determine the future risk and rewards for the instrument. In the subsequent step, a quadratic optimization problem is solved to obtain the allocation that maximizes a relevant measure of the portfolio performance computed using a combination of the risks and the rewards. Deep Reinforcement Learning (DRL) eliminates the need for a two step process to find the allocation across the instruments that will optimize a measure of portfolio performance obtained from the market. URI, based portfolio construction autonomously adjusts to a change in the environment unlike traditional machine learning algorithms used in prediction. The existing DRL methods suffer from the challenges of stability, and do not lend themselves well to the portfolio construction problem that has a continuous action space. Proposed in 2015, Deep Deterministic Policy Gradients (DDPG) is a type of actor-critic DRL algorithm that provides support for continuous action space which is encountered in portfolio construction. This paper evaluates the use of DDPG to solve the problem of risk aware portfolio construction. Simulations are done on a portfolio of twenty stocks and the use of both Rate of Return and Sortino ratio as a measure of portfolio performance are evaluated. Results are presented that demonstrate the effectiveness of DDPG for risk aware portfolio construction. The simulation results presented in this paper show that having a risk-aware measure of portfolio performance such as Sortino ratio give a portfolio with superior return and lower variance.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5538fa6ac278d1fbb834f7307ec7aea",
  "timestamp": "2025-05-15T01:57:30.017230"
}