{
  "id": 6766,
  "title": "Disease-specific out-of-pocket and catastrophic health expenditure on hospitalization in India: Do Indian households face distress health financing?",
  "abstract": "Background Rising non-communicable diseases (NCDs) coupled with increasing injuries have resulted in a significant increase in health spending in India. While out-of-pocket expenditure remains the major source of health care financing in India (two-thirds of the total health spending), the financial burden varies enormously across diseases and by the economic well-being of the households. Though prior studies have examined the variation in disease pattern, little is known about the financial risk to the families by type of diseases in India. In this context, the present study examines disease-specific out-of-pocket expenditure (OOPE), catastrophic health expenditure (CHE) and distress health financing. Methods and materials Unit data from the 71(st) round of the National Sample Survey Organization (2014) was used for this study. OOPE is defined as health spending on hospitalization net of reimbursement, and CHE is defined as household health spending exceeding 10% of household consumption expenditure. Distress health financing is defined as a situation when a household has to borrow money or sell their property/assets or when it gets contributions from friends/relatives to meet its health care expenses. OOPE was estimated for 16 selected diseases and across three broad categories- communicable diseases, NCDs and injuries. Multivariate logistic regression was used to understand the determinants of distress financing and CHE. Results Mean DOPE on hospitalization was INR 19,210 and was the highest for cancer (INR 57,232) followed by heart diseases (INR 40,947). About 28% of the households incurred CHE and faced distress financing. Among all the diseases, cancer caused the highest CHE (79%) and distress financing (43%). More than one-third of the inpatients reported distressed financing for heart diseases, neurological disorders, genito urinary problems, musculoskeletal diseases, gastro-intestinal problems and injuries. The likelihood of incurring distress financing was 3.2 times higher for those hospitalized for cancer (OR 3.23; 95% CI: 2.62-3.99) and 2.6 times for tuberculosis patients (OR 2.61; 95% CI: 2.06-3.31). A large proportion of households who had reported distress financing also incurred CHE. Recommendations Free treatment for cancer and heart diseases is recommended for the vulnerable sections of the society. Risk-pooling and social security mechanisms based on contributions from both households as well as the central and state governments can reduce the financial burden of diseases and avert households from distress health financing.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b55f1cb7aa644ee3da601bcd3acbaa67",
  "timestamp": "2025-05-15T03:01:31.339621"
}