{
  "id": 6209,
  "title": "Smoke-Free Moms: Financial Rewards for Smoking Cessation by Low-Income Rural Pregnant Women",
  "abstract": "Introduction: Maternal smoking places the child at risk during pregnancy and postpartum. Most women who quit smoking do so early when they first learn of pregnancy. Few low-income women quit once they enter prenatal care. The purpose of this study is to test in a clinical prenatal care setting the effectiveness of the Smoke-Free Moms intervention, which provides pregnant women a series of financial incentives for smoking cessation. Study design: A prospective nonrandomized controlled trial that collected control population data of smoking-cessation rates at each clincal visit during pregnancy and postpartum with usual smoking counseling in 2013-2014. In 2015-2016, the same data were collected during the implementation of the Smoke-Free Moms intervention of financial incentives. Data analysis occurred in 2017. Setting/participants: Women who were smoking at the first prenatal visit at four federally qualified health centers in rural New Hampshire. Intervention: All women received 5A's smoking counseling from clinic staff. At each clinic visit, with point-of-care confirmed negative urinary cotinine, intervention women received gift cards. Main outcome measures: Cotinine confirmed smoking cessation without relapse: (1) during pregnancy and (2) smoking cessation in both pregnancy and postpartum. Results: Of 175 eligible pregnant women enrolled, 134 women were followed to the postpartum visit (Intervention n=66, Control n=68). The quit rates during pregnancy did not differ between groups (Intervention 36.4%, Control 29.4%, p=0.46). However, significantly more intervention mothers quit and continued as nonsmokers postpartum (Intervention 31.8%, Control 16.2%, p=0.04). In a logistic regression model including baseline sociodemographic, depressed mood, stress, and readiness to quit items, confidence in being able to quit predicted both cessation outcomes. The financial incentive intervention was an independent predictor of cessation in pregnancy through postpartum. Conclusions: Financial incentives with existing smoking-cessation counseling by staff in low-income clinical prenatal programs led to cessation that continued during the postpartum period. Further study in larger populations is indicated. (C) 2019 American Journal of Preventive Medicine. Published by Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b562e4e1049887fce08fa40e1604eabf",
  "timestamp": "2025-05-15T02:55:44.670986"
}