{
  "id": 330,
  "title": "Application of Supplemental Sampling and Interpretable AI in Credit Scoring for Canadian Fintechs: Methods and Case Studies",
  "abstract": "Over the last decade, the fintech industry has witnessed fast growth, where online or digital lending has appeared as an alternative and flexible form of financing in addition to popular forms of financing, such as term loans, and expedited the entire lending process. High-tech online platforms have provided better user experiences and attracted more consumers and SMBs (small and medium-sized businesses). Partnerships and collaborations have also been forged between financial startups and incumbents or traditional lending institutions to further differentiate products and services to niche markets and accelerate the way of innovations. With the evolving landscape of the fintech sector, risk management tools such as credit scoring have become essential to assess credit risks such as default or delinquency based on debtor credit history or status. Many fintech companies are relatively young and sometimes serve only a small portfolio with a relatively scarce delinquency history. How can they predict default risk when making financing decisions on new applications? In this paper, we document a framework of leveraging supplemental samples of consumer or business credit information from the credit bureau that can be augmented with fintech applications for credit scoring based on theoretical and empirical studies of credit application data from a Canadian online auto leasing corporation. We also provide and compare credit scoring modeling solutions utilizing interpretable AI and machine learning methods such as logistic regression, decision tree, neural network, and XBGoost.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b565bbe46cf6595a4c0067dffde27e4c",
  "timestamp": "2025-05-15T01:49:40.993163"
}