{
  "id": 9301,
  "title": "Visual Loss in Geographic Atrophy Learnings from the Lampalizumab Trials",
  "abstract": "Purpose: To assess the correlation of lesion growth rate and baseline factors, including foveal involvement and focality, on visual loss as measured by best-corrected visual acuity (BCVA) in patients with geographic atrophy (GA) secondary to age-related macular degeneration (AMD). Design: Retrospective analysis of the lampalizumab phase 3 (NCT02247479 and NCT02247531) and prospective observational (NCT02479386) trials. Participants: Patients with bilateral GA. Methods: Monthly BCVA and fundus autofluorescence (FAF) at baseline and every 6 months for 2 years were analyzed. Baseline GA area from FAF images was correlated to baseline BCVA and change in BCVA. The lesion growth rate was calculated as the slope of a linear fit from all available GA area measurements of a patient. The association between GA growth rate quartiles and BCVA changes was assessed, subgrouped by GA foveal involvement or focality. Time-to-event analysis for BCVA loss of >= 5, >= 10, and >= 15 letters was performed. A Cox regression model adjusted for baseline factors was performed on these outcomes. Kaplane-Meier curves are provided for each baseline factor and GA growth rate. Main Outcome Measures: Correlations of baseline BCVA, GA area, and growth rate with change in BCVA, and time to >= 5, >= 10, and >= 15-letter loss by foveal involvement or focality. Results: Best-corrected visual acuity and GA area at baseline did not correlate with BCVA change at any visit. Geographic atrophy growth rate showed a weak correlation with BCVA loss, which increased overtime. The 2 highest GA growth rate quartiles had accelerated BCVA loss in eyes with subfoveal, unifocal lesions. Approximately 75%, 50%, and 25% of study eyes experienced a >= 5-, >= 10-, and >= 15-letter loss by 2 years, respectively. Conclusions: Best-corrected visual acuity and GA area at baseline did not correlate with BCVA loss, but faster GA growth rates appeared to be associated with faster BCVA loss. Geographic atrophy foveal involvement and focality correlated with the rate of BCVA loss with subfoveal lesions at high risk of vision loss over time, especially when the GA lesion was unifocal. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2025;132:420-430 (c) 2024 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Supplemental material available at www.aaojournal.org.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b56ce74f1f5a0a781144c926ad00135c",
  "timestamp": "2025-05-15T03:27:25.073908"
}