{
  "id": 8267,
  "title": "Revisiting the financial market interdependence during COVID-19 times: a study of green bonds, cryptocurrency, commodities and other financial markets",
  "abstract": "Purpose The purpose of the present study is to contribute to the existing literature by examining the nexus and the connectedness between classes S&P Green Bond Index, S&P GSCI Crude Oil Index, S&P GSCI Gold, MSCI Emerging Markets Index, MSCI World Index and Bitcoin, during the pre-and post-Covid period beginning from August 2011 to July 2021 (10 years). Design/methodology/approach The study employs time-varying parameter vector autoregression and Quantile regression methods to understand the impact of events on traditional and upcoming asset classes. To further understand the connectedness of assets under consideration, the study used Geo-Political Risk Index (GPR) and Global Economic Policy and Uncertainty index (GPEU). Findings Findings show that these markets are strongly linked, which will only expand in the post-pandemic future. Before the pandemic, the MSCI World and Emerging Markets indices contributed the most shocks to the remaining market variables. Green bond index shows a greater correlation and shock transmission with gold. Bitcoin can no longer be used as a good hedging instrument, validating the fact that the 21st-century technology assets. The results further opine that under extreme economic consequences with high GPR and GPEU, even gold cannot be considered a safe investment asset. Originality/value Financial markets and the players who administer and communicate their investment logics are heavily reliant on conventional asset classes such as oil, gas, coal, nuclear and allied groupings, but these emerging asset classes are attempting to diversify.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b57fe6e97b70bd2da06d500499786c8c",
  "timestamp": "2025-05-15T03:17:21.432646"
}