{
  "id": 3565,
  "title": "Modernization of the System of Accounting of Financial Results of Company's Activities on the Basis of New ICT: Problems and Perspectives",
  "abstract": "The purpose of the work is to study the problems and perspectives of modernization of the system of accounting of financial results of company's activities on the basis of new information and communication technologies (ICT). In order to determine the influence of accessibility and intensity of using new ICT on entrepreneurship, the method of regression analysis is used. The information and analytical basis for research includes the materials of the Global competitiveness report of the World Economic Forum for 2017-2018; the authors use for determining regression dependence between 6th pillar: Goods market efficiency, 11th pillar: Business sophistication, and 9th pillar: Technological readiness. It is substantiate that modernization of the system of accounting of financial results of a modern company's activities should be performed on the basis of new ICT. For this, the traditional approach, which envisages preservation of organizational & managerial and production business processes of a company during transfer on business processes, related to preparation of corporate financial accounting, into electronic form, should be replaced by the innovational approach. The authors perform comparative analysis of the traditional and innovational approaches to modernization of the system of accounting of financial results of company's activities on the basis of new ICT and show advantages of the offered approach - simplification and acceleration of accounting of financial results of company's activities, increase of transparency and control over business processes, and reduction of the risk component of accounting of financial results of company's activities, and show the main problems that hinder its practical application.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b57fe73afad1114214d25c502636264e",
  "timestamp": "2025-05-15T02:27:53.937877"
}