{
  "id": 3183,
  "title": "The Determinants of Credit Risk: An Evidence from ASEAN and GCC Islamic Banks",
  "abstract": "In less than a decade, the Islamic Banking (IB) industry has become an essential part of the global financial system. During the last ten years, the IB industry has witnessed changes in economic conditions and proved to be resilient during the periods of financial crisis. This paper aims to examine the important issues related to credit risk in selected Islamic banks in nine countries from Association of South East Asian Nations (ASEAN) and Gulf Cooperation Council (GCC) regions. It employs the generalized least squares panel data regression, to estimate the ratio of non-performance financing to total financing as dependent variables and bank specific variables (BSV) to determine the credit risk. It uses 12 years of unbalanced panel data from 40 different Islamic banks. The overall findings show that financing quality has a significant positive effect on credit risk. It is observed that the larger IBs owned more assets with lower credit risk compared to smaller banks. The bank's age is also an important factor influencing the credit risk level. Moreover, regulatory capital significantly reduces the credit risk exposure adherence to the minimum regulatory capital requirements which help IBs to manage their credit risk exposures. It was also observed that IBs were not affected by the global financial crisis due to less credit risk compared to the conventional banks.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b585f0b60ddec2e8b20f1f6d0612ef64",
  "timestamp": "2025-05-15T02:23:33.526260"
}