{
  "id": 4559,
  "title": "The development of a nomogram to determine the frequency of elevated risk for non-medical opioid use in cancer patients",
  "abstract": "Objective Non-medical opioid use (NMOU) is a growing crisis. Cancer patients at elevated risk of NMOU (+risk) are frequently underdiagnosed. The aim of this paper was to develop a nomogram to predict the probability of +risk among cancer patients receiving outpatient supportive care consultation at a comprehensive cancer center. Method 3,588 consecutive patients referred to a supportive care clinic were reviewed. All patients had a diagnosis of cancer and were on opioids for pain. All patients were assessed using the Edmonton Symptom Assessment Scale (ESAS), Screener and Opioid Assessment for Patients with Pain (SOAPP-14), and CAGE-AID (Cut Down-Annoyed-Guilty-Eye Opener) questionnaires. +risk was defined as an SOAPP-14 score of >= 7. A nomogram was devised based on the risk factors determined by the multivariate logistic regression model to estimate the probability of +risk. Results 731/3,588 consults were +risk. +risk was significantly associated with gender, race, marital status, smoking status, depression, anxiety, financial distress, MEDD (morphine equivalent daily dose), and CAGE-AID score. The C-index was 0.8. A nomogram was developed and can be accessed at https://is.gd/soappnomogram. For example, for a male Hispanic patient, married, never smoked, with ESAS scores for depression = 3, anxiety = 3, financial distress = 7, a CAGE score of 0, and an MEDD score of 20, the total score is 9 + 9+0 + 0+6 + 10 + 23 + 0+1 = 58. A nomogram score of 58 indicates the probability of +risk of 0.1. Significance of results We established a practical nomogram to assess the +risk. The application of a nomogram based on routinely collected clinical data can help clinicians establish patients with +risk and positively impact care planning.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5936de0472d3502ad579aff56a238e0",
  "timestamp": "2025-05-15T02:38:20.512566"
}