{
  "id": 8398,
  "title": "Issues in liquidity management in banking system: An empirical evidence from Indian commercial banks",
  "abstract": "Maintaining the optimal level of liquidity in the banking system has always been a challenge for banks globally. Liquidity deficit Indian Banks turned to liquidity surplus due to the demonetization of higher denomination currencies in November 2016. The liquidity deficit has the potential to trigger systemic risk whereas a surplus can weaken monetary transmission leading to the creation of asset bubbles. This study explores the impact of various interventions of policy-makers to maintain the optimal liquidity by simultaneously insulating the banks' profitability and overall economic growth from the policy's negative impact using Auto-Regressive Distributed Lag (ARDL) regression. The study records and analyses the impacts of Fiscal Deficit, Lending and Deposit Rates, and Credit Growth Rate on Liquidity Deficit, GDP growth and Banks' Profitability levels. It is found that Fiscal deficit is negatively related to Liquidity deficit and GDP growth but increases Banks' profit whereas Lending rates have an insignificant impact on Liquidity Deficit. Increasing Deposit rates have a positive impact on Liquidity deficit, negative on Banks' Profit, and immediate positive relationships with GDP growth which changes to negative at the third lag. Similarly, the Credit growth rate has a positive relationship with the Liquidity deficit, augments GDP growth, and reduces Banks' profit. It is also observed that the profit of Indian Scheduled Commercial banks has reduced after the demonetization. This study, apart from contributing to academic literature, will help the monetary authorities and the financial institutions in their policy decisions for managing the liquidity issues in the market.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b596ec0f08fa0b7bc74f31c6d0e52830",
  "timestamp": "2025-05-15T03:18:19.655420"
}