{
  "id": 547,
  "title": "Forest types outpaced tree species in centroid-based range shifts under global change",
  "abstract": "Introduction Mounting evidence suggests that geographic ranges of tree species worldwide are shifting under global environmental changes. Little is known, however, about if and how these species' range shifts may trigger the range shifts of various types of forests. Markowitz's portfolio theory of investment and its broad application in ecology suggest that the range shift of a forest type could differ substantially from the range shifts of its constituent tree species.Methods Here, we tested this hypothesis by comparing the range shifts of forest types and the mean of their constituent species between 1970-1999 and 2000-2019 across Alaska, Canada, and the contiguous United States using continent-wide forest inventory data. We first identified forest types in each period using autoencoder neural networks and K-means cluster analysis. For each of the 43 forest types that were identified in both periods, we systematically compared historical range shifts of the forest type and the mean of its constituent tree species based on the geographic centroids of interpolated distribution maps.Results We found that forest types shifted at 86.5 km center dot decade-1 on average, more than three times as fast as the average of constituent tree species (28.8 km center dot decade-1). We showed that a predominantly positive covariance of the species range and the change of species relative abundance triggers this marked difference.Discussion Our findings provide an important scientific basis for adaptive forest management and conservation, which primarily depend on individual species assessment, in mitigating the impacts of rapid forest transformation under climate change.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b59bf91784c88547af915a01c43b41e3",
  "timestamp": "2025-05-15T00:37:01.933711"
}