{
  "id": 8220,
  "title": "Social capital and citizen perceptions of coastal management for tackling climate change impacts in Greece",
  "abstract": "There is a growing consensus among researchers that social aspects and the involvement of local communities play a critical role in public decision-making processes in the coastal zone. Social capital is a parameter which has recently gained significant attention in this context. It is regarded that it has a significant influence on the adaptation capacity of local communities to climate change impacts. The present paper aims to contribute to this field through an examination of citizens' perceptions of three coastal zone management policies (hold the line, managed realignment and no active intervention) along with the influence of social capital on the level of social acceptability for these proposed policy options. For this purpose, a quantitative empirical study was conducted for the first time in five coastal areas of Greece that are regarded as high flood-risk areas due to sea-level rise. Respondents demonstrated that they are willing to accept changes in their social and natural environments in order to confront sea-level rise and are more positive towards the managed realignment option, as long as this is accompanied by financial compensation for those whose properties will be affected. Regarding the influence of social capital, through the results of an ordinal regression, it was observed that institutional and social trust influence positively citizens' level of agreement for the managed realignment policy. Furthermore, respondents who believe that a sense of reciprocity exists in their community are also more willing to accept active intervention policies.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b59cc2bb53021c880165bc2d137d3258",
  "timestamp": "2025-05-15T03:16:48.853363"
}