{
  "id": 2476,
  "title": "The problem of outliers in the research on the financial standing of construction enterprises in Poland",
  "abstract": "The analysis of an enterprise's financial standing is an important element of company management, while deterioration of the financial standing may result in the enterprise's bankruptcy. Financial indicators are used for the evaluation of enterprises' financial standing. Thus, the data from financial statements is the basis for the examination of the financial position. The evaluation of the quality of the data includes (inter alia) the identification of outliers. The purpose of the article is to present the results of a pilot empirical study regarding the influence of the selection of the method of detecting and eliminating outliers on the effectiveness of the logit model constructed on the basis of samples including or omitting the detected outliers in the scope of the classification of enterprises into the healthy ones and the ones at a bankruptcy risk. The pilot research has used the one-dimensional (quantiles) and multi-dimensional (depth function) methods of detecting outliers. For the analysis of changes in the distribution of financial indicators, the sign test and Wilcoxon signed-rank test have been applied. The evaluation of classification effectiveness of the logit model was based on sensitivity and specificity measures. The research covered construction enterprises operating in Poland in 2009.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b59f70674c55298b26573ec4cc65b2f9",
  "timestamp": "2025-05-15T02:15:59.819046"
}