{
  "id": 182,
  "title": "Mean-AVaR in credibilistic portfolio management via an artificial neural network scheme",
  "abstract": "This paper focuses on the computation issue of portfolio optimisation with scenario-based mean-Average Value at Risk (AVaR) in credibilistic environment. The portfolio optimisation problem is designed in two cases: risk taker model and risk-averse model. The main idea is to replace the portfolio selection models with linear programming (LP) problems. Since the computing time required for solving LP greatly depends on the dimension and the structure of the problem, the conventional numerical methods are usually less effective in real-time applications. One promising approach to handle online applications is to employ recurrent neural networks based on circuit implementation. Hence, according to the convex optimisation theory and some concepts of ordinary differential equations, a neural network model for solving the LP problems related to portfolio selection problems is presented. The equilibrium point of the proposed model is proved to be equivalent to the optimal solution of the original problem. It is also shown that the proposed neural network model is stable in the sense of Lyapunov and it is globally convergent to an exact optimal solution of the portfolio selection problem with fuzzy returns. Some illustrative examples are provided to show the feasibility and the efficiency of the proposed method in this paper.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5b2d612bacc9676ed380b7594462c35",
  "timestamp": "2025-05-15T00:40:02.133549"
}