{
  "id": 6583,
  "title": "Trend analysis of smoking attributable hospitalizations in Thailand, 2007 2011",
  "abstract": "INTRODUCTION Tobacco use is a major preventable risk factor for many noncommunicable diseases. Smoking-attributable mortality has been well described. However, the prevalence of smoking-attributable hospitalization (SAH) and associated costs have been less documented, especially in low- and middle-income countries. Our objective was to estimate the number of hospital admissions and expenditure attributable to tobacco use during 2007-2014 in Thailand. METHODS Hospitalization data between 2007 and 2014 were used for the analysis. SAHs were derived by applying smoking-attributable fractions, based on Thailand's estimates of smoking prevalence data and relative risks extracted from the published literature, to hospital admissions related to smoking according to the International Classification of Diseases version 10. Age-adjusted SAHs among adults age 35 and older were calculated. Joinpoint regression analysis was used to detect changes in trends among genders and geographical areas, based on annual per cent change (APC) and average annual per cent change (AAPC). Costs related to SAHs were also estimated. RESULTS During 2007-2014, among adults age 35 years and older, smoking accounted for almost 3.6 million hospital admissions, with attributable hospital costs calculated at more than US$572 million annually, which represents 16.8% of the national hospital budget. While the age-adjusted rate of SAHs had been relatively stable (AAPC=1.12), the age-adjusted rate of SAHs due to cancers increased significantly for both sexes (AAPC=2.33). Cardiovascular diseases related to smoking increased significantly among men (AAPC=2.5), whereas, COPD, the most common smoking-related conditions decreased significantly during 2011-2014 (APC= -7.21). Furthermore, more provinces in the northeastern and the southern regions where smoking prevalence was higher than the national average have a significantly higher AAPC of SAH than other parts of the country. CONCLUSIONS Smoking remains a significant health and economic burden in Thailand. Findings from this study pose compelling evidence for Thailand to advance tobacco control efforts to reduce the financial and social burden of diseases attributable to smoking.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5d550ab65d45bbe65a01c196edda001",
  "timestamp": "2025-05-15T02:59:36.979587"
}