{
  "id": 5342,
  "title": "TECHNICAL ASSUMPTIONS OF MODELS PREDICTING CORPORATE FINANCIAL DISTRESS",
  "abstract": "This paper focuses on technical assumptions of models predicting corporate financial distress. A use of the prediction models for evaluating related business units is a part of corporate risk management. Increasing number of insolvency proposals since 2008 has caused an increasing need for a reliable production and it starts a new wave of a prediction models' construction. Availability of statistical programs and friendly use of their packages enables the model's creation. Models' construction is easier than ever before but the models also have to provide reliable and useful results. Approaches used the most nowadays are discriminant analysis and logistic regression. These methods have many similar characteristics but also some differences which appear also in an area of requirements and assumptions. These limitations should be known and respected otherwise the created model is not enough robust and it does not provide good results for the evaluation of out-sample units. The technical statistical requirements of the discriminant analysis and the logistic regression are compared. This paper should not only provide the description, comparison but also a solution if it is more appropriate to use the discriminant analysis or the logistic regression in the model creation phase.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5e1bfc4943c935755f6a2b84b8cb2cf",
  "timestamp": "2025-05-15T02:46:44.923860"
}