{
  "id": 529,
  "title": "Urban-scale power decarbonization using a modified power purchase agreements framework based on Markowitz mean-variance theory",
  "abstract": "Urban power decarbonization is essential in the fight against climate change, yet current research often neglects the financial risks faced by investors and the shifting demands of consumers in liberalized electricity markets. This study addresses these gaps by proposing a modified Markowitz Mean-Variance Portfolio (MVP) theory, integrated with the Low Emissions Analysis Platform (LEAP), and a deep learning model. On this basis, an urban energy transition framework centered on Power Purchase Agreements (PPAs) is proposed and developed. The framework is validated considering a case study in Kitakyushu, Japan, highlighting its potential in accelerating power sector decarbonization and achieving net-zero emissions by 2038. Additionally, the internal rate of return (IRR) remains stable between 14.5 % and 19.6 % across seven other cities. While the framework reduces longterm cash flow volatility, its effectiveness hinges on industrial electrification efficiency and regional energy selfsufficiency. The findings indicate that relying solely on renewable energy for low-carbon transitions is unrealistic. Furthermore, green hydrogen could emerge as a viable alternative to fossil fuels, potentially replacing batteries for long-term energy storage. Future research should explore cross-regional energy trade and establish legal frameworks for long-term energy transactions to bolster urban energy transition resilience across diverse geographic and economic contexts.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5e37b7db2c1aeb975528062d61ddbca",
  "timestamp": "2025-05-15T00:37:01.776567"
}