{
  "id": 7272,
  "title": "Stress and coping in parents of newly born twins",
  "abstract": "Objective: Research indicates that parents of twins have poorer psychosocial outcomes than parents of singletons. Parents who have conceived using assisted reproductive technology (ART) have been found to be at higher risk of negative psychosocial outcomes compared to parents who have conceived spontaneously. The current study aimed to model the factors associated with parenting stress of newly-born twins, using the Transactional Model of Stress.Methods: Data were collected using a cross-sectional survey design with participants identified from delivery records across Northern Ireland. Mothers and fathers (n=104) of twins aged between 1 and 12 months old returned a questionnaire pack containing the Parenting Stress Index, Impact on the Family Scale-Financial Burden, Coping Orientation to Problems Experienced - Brief Version, Multidimensional Scale of Perceived Social Support, General Health Questionnaire and a demographic questionnaire.Results: There were no differences on psychological outcomes between parents who had conceived via ART and those who conceived spontaneously. Regression analyses found that social interaction and support is an important variable in terms of the psychological outcomes experienced by parents of twins.Conclusion: Parents of newly-born twins regardless of the mode of conception should be considered an at risk group for parental distress. Support groups such as the Twins and Multiple Births Association could be important in providing that crucial social interaction and support that seems to be important in the emotional well-being of parents of twins.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5ed5629ced1e160b074bf648d5e92d3",
  "timestamp": "2025-05-15T03:07:02.547143"
}