{
  "id": 582,
  "title": "Knowledge building about performance evaluation in lean production An investigation on international scientific research",
  "abstract": "Purpose The purpose of this paper is to focus on the analysis of the characteristics and gaps of a literature fragment from the international scientific publications on performance evaluation in lean production, aiming to generate new knowledge and suggestions for future scientific research. Design/methodology/approach The authors have adopted ProKnow-C methodology, a qualitative research approach that is used for literature selection, identification, analysis and reflection on the established characteristics. Findings From a bibliographic portfolio of 67 research works, 91 per cent of the works have individual metrics and 84 per cent have sets of metrics. Evaluating the focus of the performance measurement system, 34 per cent of works measure performance, 43 per cent compare performance and only 18 per cent assist in strategic planning. Evaluating the phases of the PMS life cycle, 87 per cent attend to the design, and 66 per cent attend to the activities of data collection, allow diagnosis, evaluate performance and communicate results. However, only 3 per cent of the studies analysed the use of PMS after its implementation and no research evidenced the review of metrics and objectives based on strategic planning. Originality/value This research adds value because its results allow researchers and practitioners to visualise the boundaries of the knowledge from the BP, about performance management in lean production, and what their gaps are in relation to the reference model of performance evaluation. This research is original because it was not observed in the literature review, a research that used the ProKnow-C methodology for analysis of the alignment and gaps between lean production and performance evaluation.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5ede3e55316273808cb1827a05a6b42",
  "timestamp": "2025-05-15T00:37:38.183800"
}