{
  "id": 6674,
  "title": "Ready for Vaccination? COVID-19 Vaccination Willingness of Older People in Austria",
  "abstract": "In spite of findings highlighting higher health risk from infection compared to younger people, a certain percentage of older people in Austria still lack a valid vaccination certificate. The current gaps in vaccination coverage in countries such as Austria are likely to be in large part due to vaccination refusal and pose or will pose problems for the health system and consequently for all of society should the initial findings on Omicron coronavirus infectivity prove true. Surprisingly, only a few studies around the globe explicitly address older people's COVID-19 vaccination willingness. The present work therefore intends to contribute to this field by identifying factors associated with the decision for or against a vaccination among the older population in Austria. Data collected between late 2020 and early 2021 via the cross-national panel study Survey of Health, Aging and Retirement in Europe (SHARE) are used to perform multinomial logistic regression to analyse differences between COVID-19 vaccination supporters, undecided persons and rejectors. The results show that persons exhibiting a low risk assessment toward COVID-19, less health protection behaviors, lower education and belonging to households with financial burdens are significantly more likely to refuse vaccination or be ambivalent. Although multimorbidity reduces risk of vaccination refusal, poor subjective health was significantly related to a higher risk of refusing vaccination. The results point to the importance of addressing the factors related to refusal. Only by understanding these factors will it be possible to increase vaccination rates and thus minimize other restrictive measures.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5f5605e020564d443d8235adbbd9299",
  "timestamp": "2025-05-15T03:00:35.348442"
}