{
  "id": 8556,
  "title": "Corporate Governance in the Football Industry: The Italian Case",
  "abstract": "The management of many companies is pursued in terms of governance, noting, on the one hand, the maximization of profit voluntarily sought by social actors for their own activity; on the other hand, investment as a fundamental element of the business strategy that stimulates the country's economic growth and job creation by increasing national income. All of these concepts are included in the Corporate Governance. It is possible to define two main models of governance that are depending on the different degree of capitalism in which the company operates. The prevailing model, in continental Europe and Japan, recognizes the interests of workers, managers, suppliers, customers and society. Otherwise, the liberal model, typical of the Anglo-Saxon states, gives priority to the interests of the shareholders. One of the sectors where it is applicable the Corporate governance is surely soccer. This sector, in Europe, provides an inimitable business setting to study the governance and the capital structure. Soccer teams could have different approaches as a strategic planning, considering sporting competitiveness slightly than shareholder value as their main area. For these societies the final result is made by three factors: financial aspects, popularity and reputation. Mainly it is possible to identify this bipartite classification also in the sport sector, in fact in one case the power is usually concentrated in a few subjects who also contribute risk capital (Closed Model). In the second case the internal organs are made by a plurality of subjects that can be defined as shareholders (Open Model). For these motivation in this paper, after a theoretical overview related to the main aspects of corporate governance, we have decided to focus our attention on two main Italian football teams to analyze the main aspects of corporate governance to make a comparison between them highlighting similarities and main differences.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5f9f7a489794297f557b9f9defba543",
  "timestamp": "2025-05-15T03:19:52.213532"
}