{
  "id": 5761,
  "title": "Depressive symptoms in inner-city mothers of young children: Who is at risk?",
  "abstract": "Objective. To identify factors associated with depressive symptoms in inner-city mothers of young children. Design. A cross-sectional survey was administered to a convenience sample of English-speaking mothers attending a well-child visit far a child aged 6 months to 3 years in a hospital-based, inner-city, general pediatric clinic. The maternal interview collected data on sociodemographic characteristics, and mothers' health and financial status. Mothers completed the Psychiatric Symptom Index (PSI), a 29-item checklist shown to have very good validity and reliability in a multicultural population A total score of greater than or equal to 20 represents high levels of symptoms; scores greater than or equal to 30 strongly suggest major depression Results, Two hundred seventy-nine mothers completed the PSI. Mothers ranged in age from 14 to 48 years (mean, 27 years). Seventy-one percent were unmarried; 57% received public assistance, Forty-two percent of mothers were Hispanic, 40% black, 9% white, and 10% mixed or other races. Forty-eight percent were foreign-born, Twenty-four percent reported having a medical condition; 6% had activity limitation because of illness. The mean PSI score was 19; 18% of mothers had a PSI score greater than or equal to 30 and 39% scored greater than or equal to 20, PSI scores did not vary by age, race, birthplace, educational level, employment, marital status, or family composition. PSI stares were higher for mothers receiving public assistance (21 vs 17), with self-reports of poor or fair financial status (22 vs 15) and poor health status (52 vs 17). Mothers with activity limitations because of illness had significantly higher PSI scores (34 vs 18), Multiple regression analyses confirmed the independent relationships of these maternal characteristics to high PSI scores. Conclusions. Depressive symptoms in inner-city mothers of young children are common. In this population of women with many risk factors, traditional sociodemographic risk factors did not successfully identify lose who are depressed. However, mothers' self-reports of poor financial status, health status, or activity limitation because of illness were associated with higher levels of depressive symptoms. These findings may assist clinicians in distinguishing which mothers are likely to be depressed when almost all are at high risk.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b5fd8b1c6a93fc4aff97aea44b5fe3a2",
  "timestamp": "2025-05-15T02:50:54.026471"
}