{
  "id": 8934,
  "title": "Cost comparison and determinants of out-of-pocket payments on child delivery care in Bangladesh",
  "abstract": "Objectives The objective of this study is to capture the relevant out-of-pocket (OOP) costs, coping mechanisms, and associated factors that are related to child delivery in Bangladesh through the use of nationwide household level data. Data and methods The study was conducted using a secondary data source of the latest Bangladesh Demographic and Health Survey 2014. A cross-sectional survey was performed for 6 months, from June to November 2014, where closed-ended questions regarding child delivery-related expenditure were included. Log linear regression and descriptive analysis methods were used to analyze these data. Results Analysis indicated that the average self-reported OOP payment per child delivery was US$ 79.23 (SD +/- 128.05). The highest OOP was observed for C-section (US$ 249.89, SD +/- 153.54), followed by institutional normal delivery (US$ 61.62, SD +/- 75.28). The average cost per normal home delivery was US$ 15.89 (SD +/- 25.84). The richest quintile spent significantly more than the poorest quintile regarding C-section (US$ 281 vs US$ 204), normal delivery at an institution (US$ 80 vs US$ 65), and even normal delivery at home (US$ 22 vs US$ 13). Conclusions The study showed that there was a huge variation of OOP, which was dependent on the facility and socioeconomic demographic status of the households. As such, policy efforts need to focus on lowest wealth quintiles to avoid economic burdens during child delivery-related activities, and therefore, financial risk protection should be provided. Social health insurance might be an option for financing during child delivery, which is in line with the core objective of the Healthcare Financing Strategy of Bangladesh, which is to achieve universal health coverage.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b60c3a8496a12371f66b4d3e57c2333c",
  "timestamp": "2025-05-15T03:23:56.075070"
}