{
  "id": 2011,
  "title": "Study on the negative effect of internal-control willingness on enterprise risk-taking",
  "abstract": "In the traditional cognition, the factors that affect the level of internal control are usually based on the objective factors such as corporate characteristics, financial status, and governance structure. However, the internal control defects of many famous companies expose the phenomenon of subjective manipulation, and this leads us to focus on the subjective factor of internal control, which we call internal-control willingness. We define internal-control willingness as the degrees of subjective initiative of the internal-control construction and execution activities. Additionally, we propose a method for measuring internal-control willingness, using text analysis and machine learning. Then, we examine the impact of internal-control willingness on enterprise risk-taking, through the internal-control, financial, and market data of China A-share main board enterprises in 2011-2018. The study found that (1) internal-control willingness has a significant positive impact on internal-control level, which can fairly achieve the measurement of internal-control subjective initiative. (2) It confirms that internal-control willingness lowers corporate risk-taking. (3) Further research finds that state-owned enterprises strengthen internal-control willingness and their risk-taking level is significantly lower than that of non-state-owned enterprises. This paper suggests that the regulatory authorities actively urge the board of directors to strengthen internal-control willingness.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b61d7d9e70b0fcf183fcf572a12f1720",
  "timestamp": "2025-05-15T02:09:48.467250"
}