{
  "id": 6585,
  "title": "Attitudes and stressors related to the SARS-CoV-2 pandemic among emergency medical services workers in Germany: a cross-sectional study",
  "abstract": "Background The aim was to investigate attitudes and stressors related to the SARS-CoV-2 outbreak among emergency medical services (EMS) workers in Germany. We further aimed to detect possible changes within a 5-week period and potential determinants of attitudes and stressors. Methods We conducted two cross-sectional studies using an online questionnaire in early April 2020 (i.e., the first peak of the SARS-CoV-2 outbreak in Germany) and five weeks later. The study instrument comprised sociodemographic items, self-devised items on pandemic-related attitudes, stressors and work outcomes, and established instruments assessing depressive symptoms and symptoms of anxiety. Logistic regression was performed to identify possible determinants. Results Data of 1537 participants was included in the analysis (April: n = 1124, May: n = 413, 83.1% male, median age 32). Most participants agreed that their personal risk of infection was higher compared to the general population (April: 87.0% agreement, May: 78.9%). The greatest stressor was uncertainty about the pandemic's temporal scope (82.0 and 80.9%, respectively). Most participants (69.9, 79.7%) felt sufficiently prepared for the pandemic and only few felt burdened by their financial situation (18.8, 13.3%). Agreement to all stressors decreased from April to May except related to the childcare situation. Regression analysis identified subgroups to be burdened more frequently such as older employees, those with SARS-CoV-2 cases among their colleagues, and those with lower paramedic training levels. Conclusions We identified key SARS-CoV-2-related stressors whose levels generally decreased within a 5-week period. Our results indicate that EMS workers are less affected by existential fears and rather worry about their personal infection risk.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b61f0b50486c7f8752f7778de55ae44d",
  "timestamp": "2025-05-15T02:59:37.002103"
}