{
  "id": 9310,
  "title": "A study on the factors influencing the vulnerability of women of childbearing age to health poverty in rural western China",
  "abstract": "The health of women of childbearing age in rural areas is crucial for the development of individuals, families, and society. Research on the identification and influencing factors of health vulnerability in impoverished and disadvantaged groups is important for adjusting and implementing health poverty alleviation policies. However, there is limited research on the health vulnerability of women of childbearing age in rural Western China. Based on panel data from the Rural Residents' Family Health Status Survey in 2019 and 2022, the vulnerability to health poverty of women of childbearing age in rural areas was constructed using the three-stage feasible generalized least squares method. Variables from four dimensions-physical capital, financial capital, social capital, and human capital-were included in the sustainable livelihood analysis framework for analysis. The Tobit model was used to analyze the influencing factors of vulnerability to health poverty among women of childbearing age in rural Western China, and the contribution rates of various factors were studied using the Shapley value decomposition method. In 2019 and 2022, under the poverty line standards of $1.90 and $2.15, respectively, the vulnerability to health poverty among rural women of childbearing age exceeded 20%. Tobit regression analysis revealed that the type of drinking water being well water significantly increased the vulnerability to health poverty of rural women of childbearing age (P < 0.05), whereas the separation of housing and kitchen, registered poor households, household loans, annual per capita household income, expenditures on social interactions, educational level, self-assessed health status, respondent age, and the utilization of hospital services significantly reduced the vulnerability to health poverty of rural women of childbearing age (P < 0.05). Shapley's decomposition shows that annual per capita household income, expenditures on social interactions, respondent age, and household loans are the factors contributing most to the vulnerability to health poverty of rural women of childbearing age, while other variables have a smaller contribution rate. The health poverty situation of women of childbearing age in rural Western China is not optimistic. Preintervention for health poverty should be strengthened among rural women of childbearing age, early warning mechanisms for the risk of falling back into poverty due to illness should be established, the precise identification of highly vulnerable rural women of childbearing age should be improved, and the medical insurance system for rural women of childbearing age should be enhanced to help improve their current health poverty situation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6327c7fe908d822f15b9a725d991c0e",
  "timestamp": "2025-05-15T03:27:25.139849"
}