{
  "id": 3144,
  "title": "The impact of the global financial crisis on firm-level risk of the S&P 500",
  "abstract": "Purpose - This paper aims to assess the impact of the global financial crisis of 2007-09 on the risk structure of S&P 500 firms by examining their market, active, and residual risks before and during the crisis. Design/methodology/approach - The classic one-factor model is estimated for each firm in the S&P 500 to decompose risk into market, active, and residual components. Five sets of regression estimates based on monthly return data are used: 2002-06, 2003-07, 2004-08, 2005-09, and 2006-10. The estimates provide insight into the risk structure of S&P 500 firms before and during the crisis. Findings - The average correlation coefficient between S&P 500 firms rose during the crisis from 0.20 to 0.35, an increase of 75 percent. Although the results indicate that active and residual risks are significant across the firms and across the periods, the impact of the financial crisis was mostly on market risk. The increase in risks was pronounced for financial firms, especially insurance companies, and industrial firms, especially hard manufacturing. Research limitations/implications - Because the study focuses on the global financial crisis of 2007-09, researchers should be careful about generalizing the results to the post-crisis period. Practical implications - Investors should be aware that equity portfolio risk reduction during major crises can be hard to achieve because the average correlation coefficient between stock returns may rise significantly, crimping the efficacy of diversification. Originality/value - It was very difficult for equity investors to shield themselves from the risk associated with the global financial crisis of 2007-09.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6355dfa931f56d855a4820bcb3a20a9",
  "timestamp": "2025-05-15T02:22:56.762563"
}