{
  "id": 8537,
  "title": "The Prevalence of Depression, Anxiety and Associated Factors among the General Public during COVID-19 Pandemic: a Cross-sectional Study in Korea",
  "abstract": "Background: Since its first case confirmed on January 20, 2020, Korea has been through three waves of the COVID-19 pandemic. Fears of the fourth wave persist as new cases continue to emerge. In such unpredictable times, the mental well-being of people is of crucial importance. This study examined the levels of depression and anxiety and their predictors among the Korean general public in Busan, Korea, during the COVID-19 pandemic. Methods: We conducted a cross-sectional study via a self-reported questionnaire administered to 2,288 adult residents (aged 19-60 years) of Busan, Korea. Participants' depression and anxiety were assessed using the Korean version of the Patient Health Questionnaire-4 (PHQ-4), which consists of PHQ-2 and Generalized Anxiety Disorder-2 (GAD-2), with the cutoff score of 3. Results: The mean age of the participants was 39.71 years. COVID-19 had several psychosocial impacts on people. It was revealed that 80.3% had restrictions in outside activities, 47.3% reported financial difficulties, and 53.6% had a fear of death or fatal outcome when infected with COVID-19. We performed logistic regression analysis to identify the factors associated with depression and anxiety. A total of 30.7% participants were classified as at risk of depression based on cutoff score of 3 on PHQ-2. Logistic regression analysis revealed that changes in sleep pattern due to COVID-19 were most strongly associated with depression, followed by restrictions in outside activities due to social distancing and increased family conflicts due to COVID-19. Also, 22.6% participants were classified as at risk of anxiety based on a cutoff score of 3 on GAD-2. Analysis revealed that changes in sleep pattern due to COVID-19 were most strongly associated with anxiety, followed by spending a lot of time searching for COVID-19-related information and having a fear of death or fatal outcome when infected with COVID-19. Conclusion: The results are alarming; 30.7% had a PHQ-2 score of 3 or higher, indicating depression, and 22.6% had a GAD-2 score of 3 or higher, indicating anxiety. Changes in sleep pattern had the strongest association with both depression and anxiety. Our results can be used to formulate mental health policies tailored to the context of the city. Our findings suggest the high prevalence of depression and anxiety in the society during the COVID-19 pandemic, which places growing importance on early intervention for mental health problems during these times.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b64cd7e1da8251ff4f4bbde165093838",
  "timestamp": "2025-05-15T03:19:52.121376"
}