{
  "id": 8576,
  "title": "Comparison of the Financial Burden of Survivors of Head and Neck Cancer With Other Cancer Survivors",
  "abstract": "IMPORTANCE Head and neck cancer (HNC) is more common among socioeconomically disenfranchised individuals, making financial burden particularly relevant. OBJECTIVE To assess the financial burdens of HNC compared with other cancers. DESIGN, SETTING, AND PARTICIPANTS In this retrospective review of nationally representative, publicly available survey, data from the Medical Expenditure Panel Survey were extracted from January 1, 1998, to December 31, 2015. A total of 444 867 adults were surveyed, which extrapolates to a population of 221 503 108 based on the weighted survey design. Data analysis was performed from April 18, 2018, to August 20, 2018. EXPOSURES Of 16 771 patients with cancer surveyed (weighted count of 10 083 586 patients), 489 reported HNC (weighted count of 261 631). MAIN OUTCOMES AND MEASURES Patients with HNCwere compared with patients with other cancers on demographics, income, employment, and health. Within the HNC group, risk factors for total medical expenses and relative out-of-pocket expenses were assessed with regression modeling. Complex samplingmethods were accounted for with weighting using balanced repeated replication. RESULTS A total of 16 771 patients (mean [SD] age, 62.3 [18.9] years; 9006 [53.7%] female) with cancer were studied. Compared with patients with other cancers, patients with HNC were more often members of a minority race/ethnicity, male, poor, publicly insured, and less educated, with lower general and mental health status. Median annual medical expenses ($ 8384 vs $5978; difference, $2406; 95% CI, $795-$ 4017) and relative out-of-pocket expenses (3.93% vs 3.07%; difference, 0.86%; 95% CI, 0.06%-1.66%) were higher for patients with HNC than for patients with other cancers. Among patients with HNC, median expenses were lower for Asian individuals compared with white individuals ($ 5359 vs $ 10 078; difference, $4719; 95% CI, $1481-$ 7956]), Westerners ($ 8094) and Midwesterners ($ 5656) compared with Northwesterners ($ 10 549), and those with better health status ($ 16 990 for those with poor health vs $6714 for those with excellent health). Higher relative out-of-pocket expenses were associated with unemployment (5.13% for employed patients vs 2.35% for unemployed patients; difference, 2.78%; 95% CI, 0.6%-4.95%), public insurance (5.35% for those with public insurance vs 2.87% for those with private insurance; difference, 2.48%; 95% CI, -0.6% to 5.55%), poverty (13.07% for poor patients vs 2.06% for high-income patients), and lower health status (10.2% for those with poor health vs 1.58% for those with excellent health). CONCLUSIONS AND RELEVANCE According to this study, HNC adds a substantial, additional burden to an already financially strained population in the form of higher total and relative expenses. The financial strain on individuals, assessed as relative out-of-pocket expenses, appears to be driven more by income than by health factors, and health insurance does not appear to be protective.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b65563281e52b8b89e364154f9cb3c70",
  "timestamp": "2025-05-15T03:20:22.188192"
}