{
  "id": 4713,
  "title": "Integrated risk management for construction system providers",
  "abstract": "The research approach Construction System Provider (CSP) has been developed at the Institute for Construction Engineering and Management. A CSP offers lifecycle oriented integrated services for building constructions, i.e. planning, turnkey construction and contracting. The transfer of cost, deadline, quality and functionality risks to the provider requires an Integrated Risk Management (IRM) which comprises project risks as well as general corporate risks. At the Swiss Federal Institute of Technology, Zurich, a research project was started to develop this process. The first phase systematic risk management on project level, completed in December 2002, is focussing on the offer phase and includes the sub-processes risk identification, evaluation, classification, response and estimation of the costs of residual risks and controlling. The second phase covers the cross-project risk aggregation throughout the company and its consideration in financial accounting using a risk pool. The required model is deduced by theoretical support and logical thought processes. Cross-project risk aggregation benefiting of Markowitz's portfolio theory leads to lower project risk premiums (with the same statistical certainty) compared to single project view. IRM contributes to a risk-oriented realization of planned earnings and thus to an increase of entrepreneurial success for the CSP.",
  "year": 2003,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6625040841b7ec16b5bc1dd64b1e43d",
  "timestamp": "2025-05-15T02:40:27.842148"
}