{
  "id": 4277,
  "title": "Decarbonization in Higher Education Institutions as a Way to Achieve a Green Campus: A Literature Review",
  "abstract": "Reducing the carbon footprint (CF) helps to meet the targets of the sustainable development goals (SDGs), with emphasis on SDG 13, which seeks urgent measures to combat climate change and its impacts. Higher Education Institutions (HEIs) or universities, as organizations engaged in education, research, and community service, play an important role in promoting sustainable development. Thus, HEIs are increasingly interested in practices to reduce their CF, in addition to training professionals for this worldwide need. CF reduction is a tool to assess the sustainability and decarbonization of a campus that aligns with Green Campus (GC) initiatives. The objective of this study is to carry out a literature review of the current situation of CF reduction practices in HEIs and the move toward a greener campus, identifying the main sources of emissions according to the GHG Protocol and classification by scope. This article sought to identify the HEIs/universities with already-implemented decarbonization initiatives through the elaboration of a table. This study was based on a portfolio of 33 articles published up to February 2022 that analyze the CFs of HEIs and the implementation of green initiatives. Differences were identified in the methodology and data used by each university. The results show that the main reason for this is the lack of standardization regarding the time metric (year, semester), functional unit (student, employee, area), limitation of data collection (scope 1, 2, 3), and sources of emission and emission factors, mainly about Scope 3 (sometimes not considered in the calculations). However, despite the differences, the search for standardization was observed in the studied articles, as well as the expectation of reduction in the CF of HEIs over time. It also identified the efforts of HEIs in implementing green initiatives aimed at decarbonizing their campuses. It can be concluded that the CF of HEIs requires improvements and solutions to a series of challenges, including the definition of emission sources representative of Scope 3, the creation of a robust database of emission factors, and the development of tools and methodologies-with greater standardization-that cover the needs of the type of institution globally, and that can be used comparatively as an effective model by other HEIs.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b66566c3d9fb8d7c2ba851ac9ddde872",
  "timestamp": "2025-05-15T01:25:23.341214"
}