{
  "id": 6855,
  "title": "Partnership and Cognitive Aging in Europe: Mediating Factors and Social Stratification",
  "abstract": "Objectives: Living in a partnership has been shown to benefit later life health in general and decrease the risk of cognitive impairment. Few studies have, however, examined whether different types of partnership transitions also differ with respect to their impact on cognitive trajectories, and whether financial resources, healthy behaviors, cognitive stimulation, and social integration can explain these differences. Methods: Data came from six waves of the Survey of Health, Ageing and Retirement in Europe, which is a representative panel for the population aged 50 years or older, and were collected between 2004 and 2017 in 20 European countries. Our sample includes 215,989 valid person-year observations from 78,984 persons. The mean age at baseline is 64 years, and individuals were observed on average 2.7 times. Cognitive functioning was assessed with measures of immediate and delayed recall on a memory test and verbal fluency. Fixed effects regression models were employed to exploit individual-level variation in partnership and simultaneous cognitive changes. Results: Partnership status was stable in most respondents (around 90%). Compared to remaining partnered and after controlling for sociodemographic factors, transition to divorce was associated with a steeper decline in immediate and delayed recall. Exploring possible mechanisms, both financial resources and social integration, explained these differences. Additional analyses suggested that effects were mostly driven by individuals with lower education. Discussion: Partnership transitions remain infrequent events in later life, but our findings indicate that they can induce less favorable cognitive trajectories compared to partnered individuals, particularly for those with lower cognitive reserve.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b698334d2f1a338455b06737dcc67b89",
  "timestamp": "2025-05-15T03:02:07.574973"
}