{
  "id": 4629,
  "title": "Financial Incentives, Not Behavioral Nudges, Led to Optimized HIV Testing among Pregnant Women in a High-Burden Urban Population in Ecuador",
  "abstract": "Behavioral economic principles are increasingly being used in the fight against HIV, including improving voluntary testing in sub-Saharan Africa and South America. However, behavioral nudges have not been widely tested as a strategy to optimize HIV testing in pregnant women. Here, we assessed whether behavioral nudges or financial incentives were effective in optimizing HIV testing among pregnant women in a high-HIV burden setting. A randomized clinical trial was conducted between May 21 and Oct 5, 2018, to allocate pregnant women in Ecuador into three study arms: information only, soft commitment (i.e., a behavioral nudge), and financial incentives. All participants received an informational flyer, including the address of a testing location. Participants in the soft-commitment arm signed and kept a form on which they committed to get tested for HIV. Those in the financial incentive arm received a $10 incentive when tested for HIV. A stepwise logistic regression analysis estimated the effect of the study arms on HIV testing rate. Participants in the financial-incentive arm had higher odds of getting an HIV test (adjusted odds ratio 17.06, P , 0.001) as compared with information-only participants. Soft-commitment had the opposite effect (adjusted odds ratio 0.14, P 5 0.014). Financial incentives might be useful in improving HIV testing among pregnant women, especially among those who might be at higher risk but who have not completed an HIV test.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b69fb1cdac68255f0c3da128717eebd9",
  "timestamp": "2025-05-15T02:39:26.957416"
}