{
  "id": 581,
  "title": "Learning just got easier",
  "abstract": "The future looks bright for e-learning according to NOP research commissioned by training film outfit Video Arts 87% of manufacturing and engineering companies say they are likely to use e-learning to train employees, and 39% claim to be doing so already. Research firm IDC forecasts that the European market for e-learning will be worth $4 billion by 2004. While the US currently leads the way, Europe is catching up rapidly, the IT industry having taken online training onboard rather faster than more traditional engineering sectors. E-learning no longer simply means putting a CD-Rom course on the internet. The internet, say companies promoting e-learning, offers a rich, collaborative learning environment, available anytime and anywhere. Web-based training can be tailored to meet the objectives of companies and the pace of employees. Smartforce is one of the largest suppliers of e-learning packages, with 2,500 corporate users including BP and British Gas. The company has 5,000 hours of content covering IT and e-business programmes, business and interpersonal skills. We offer virtual classrooms where students can experience workshops or online training connected to the web, role play simulations, or access a live mentor at any time around the clock, says global programmes manager Laura Overton. BP has a powerful e-learning facility which allows employees to learn at their own pace, at home or in the office. Many oil majors and power companies use the Oxford Princeton Programme, which offers web-based training for upstream and downstream operations. These online courses combine programmes from Energy Studies in Oxford and the Princeton Energy Programme in the US, which merged last July. But some companies are doing their own thing. BAE Systems launched a Virtual University (W) in 1998. Delivering e-learning is a key aspect of BAE's strategy, targeted at 130,000 employees nationwide, says Dr Andrew Pember, VU head of new programmes. The VU offers a learning and development guide on around 300 courses that can be delivered to employees. These focus on IT and business skills and use commercial, off-the-shelf material - such as psychometric tools - to help people identify their learning styles. We aim to build up a more focused engineering course portfolio eventually, but there is a lack of online teaching resources for engineers, says Pember.",
  "year": 2001,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6a87d320128274b5c91c4e7e6df8749",
  "timestamp": "2025-05-15T00:37:38.183300"
}