{
  "id": 7053,
  "title": "Rural-urban disparity in category II vaccination among children under five years of age: evidence from a survey in Shandong, China",
  "abstract": "Background: Compared with the Expanded Program on Immunization (EPI) vaccines, the coverage rate of the non-EPI vaccines is still low. The aim of this study is to explore the rural-urban disparity in category II vaccine and its determinants among children under 5 years old in China. Methods: A cross-sectional study was conducted in 17 cities in Shandong province from August to October, 2013. A total of 1638 children were included in the analysis. Unadjusted and adjusted regression model were used to identify the rural-urban difference in vaccination of category II vaccine. Multivariate logistic regression models were employed to analyze the determinants associated with vaccination of category II vaccine in rural and urban areas respectively. Results: The coverage rates of category II vaccine in rural and urban children were 81.5 and 69.4% respectively. Factors including age and satisfaction with vaccination services were associated with category II vaccination both in rural and urban children (P < 0.05). It was also found that the households with four or less members are more likely to vaccinate category II vaccine in rural children. Conclusions: There was a big difference between rural and urban children in the use of category II vaccine. The government should strengthen financial support and regulation for the category II vaccine. The identified at-risk factors, including age, satisfaction with the vaccination services, and family size should be taken into account when designing targeted vaccination policies for rural and urban children.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6aa04b41a9f2720f65e56dab9c5dd27",
  "timestamp": "2025-05-15T03:04:23.044903"
}