{
  "id": 4017,
  "title": "More capable, more innovative? An empirical inquiry into the effects of dynamic managerial capabilities on digital firms' innovativeness",
  "abstract": "Purpose Managers play a critical role in shaping the development of firms due to the risky and long-term nature of innovation. Although the managerial effect on strategic change has long been factored into organizational theories, scholars still lack a complete understanding of the specific managerial capabilities that drive innovation in today's digital economy. The present study builds on dynamic managerial capabilities theory to close this research gap. The paper proposes managers' dynamic capabilities and their three underlying drivers - managerial human capital, social capital, and cognition - as a direct antecedent to digital firms' innovativeness. Design/methodology/approach The study draws on survey data from German Industry 4.0 manufacturing firms, which were analyzed using regression analysis. Findings The results confirm managers' dynamic capabilities as facilitators of innovation. In contrast to previous research on nondigital industries, the findings demonstrate that only the complete portfolio of managers' dynamic capabilities promotes innovativeness in digital firms. The study provides evidence for the importance of dynamic managerial capabilities in the digital economy yet contradicts previous research on nondigital industries related to the advantageousness of managers' human capital, social capital, and cognition for innovation. Originality/value The study contributes to the literature by being the first to holistically test the effects of dynamic managerial capabilities on innovation in digital firms. The results offer a nuanced account of managers' dynamic capabilities, thereby expanding dynamic managerial capabilities theory to the digital economy.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6ae0a7e97dfe56ef991b8cec68e6bfd",
  "timestamp": "2025-05-15T01:23:07.347992"
}