{
  "id": 9031,
  "title": "Association of Display of Patient Photographs in the Electronic Health Record With Wrong-Patient Order Entry Errors",
  "abstract": "This cohort study evaluates whether noninterruptive display of patient photographs in the banner of the electronic health record is associated with a decreased rate of wrong-patient order entry errors. Question Can wrong-patient order entry errors be reduced with noninterruptive display of patient photographs? Findings In this cohort study involving 2558746 orders that were placed for 71851 patients, displaying a patient's photograph in the banner of the electronic health record was associated with a significant reduction in the rate of wrong-patient order entry errors. Unlike prior interventions, this solution required no added practitioner time burden or risk of alert fatigue. Meaning The results of this study suggest that capturing patient photographs and displaying them in the electronic health record may be a simple and cost-effective strategy for reducing wrong-patient errors. Importance Wrong-patient order entry (WPOE) errors have a high potential for harm; these errors are particularly frequent wherever workflows are complex and multitasking and interruptions are common, such as in the emergency department (ED). Previous research shows that interruptive solutions, such as electronic patient verification forms or alerts, can reduce these types of errors but may be time-consuming and cause alert fatigue. Objective To evaluate whether the use of noninterruptive display of patient photographs in the banner of the electronic health record (EHR) is associated with a decreased rate of WPOE errors. Design, Setting, and Participants In this cohort study, data collected as part of care for patients visiting the ED of a large tertiary academic urban hospital in Boston, Massachusetts, between July 1, 2017, and June 31, 2019, were analyzed. Exposures In a quality improvement initiative, the ED staff encouraged patients to have their photographs taken by informing them of the intended safety impact. Main Outcomes and Measures The rate of WPOE errors (measured using the retract-and-reorder method) for orders placed when the patient's photograph was displayed in the banner of the EHR vs the rate for patients without a photograph displayed. The primary analysis focused on orders placed in the ED; a secondary analysis included orders placed in any care setting. Results A total of 2558746 orders were placed for 71851 unique patients (mean [SD] age, 49.2 [19.1] years; 42677 (59.4%) female; 55109 (76.7%) non-Hispanic). The risk of WPOE errors was significantly lower when the patient's photograph was displayed in the EHR (odds ratio, 0.72; 95% CI, 0.57-0.89). After this risk was adjusted for potential confounders using multivariable logistic regression, the effect size remained essentially the same (odds ratio, 0.57; 95% CI, 0.52-0.61). Risk of error was significantly lower in patients with higher acuity levels and among patients whose race was documented as White. Conclusions and Relevance This cohort study suggests that displaying patient photographs in the EHR provides decision support functionality for enhancing patient identification and reducing WPOE errors while being noninterruptive with minimal risk of alert fatigue. Successful implementation of such a program in an ED setting involves a modest financial investment and requires appropriate engagement of patients and staff.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6bbf281de0293ddcbc49a795b7134fa",
  "timestamp": "2025-05-15T03:24:54.891187"
}