{
  "id": 196,
  "title": "Physical information-guided multidirectional gated recurrent unit network fusing attention to solve the Black-Scholes equation",
  "abstract": "Reasonable option pricing is crucial in the financial derivatives market. Finding analytical solutions for the Black-Scholes (BS) equation, particularly for American options or with fluctuating volatility and interest rates, is challenging. BS equations exhibit strong time-series characteristics, with asset prices typically adhering to geometric Brownian motion. To address the BS equations, we propose a sequence-to-sequence model guided by physical information (PI), called PiMGA. The PiMGA fuses a multidirectional gated recurrent unit (GRU) network with an attention module, where multidirectional GRU enhances the coding performance of the input sequences and the attention module balances the feature weights of the hidden variables. Prior physical knowledge in BS equations is jointly used as a constraint, forming the penalty function for objective optimization. This allows PiMGA to serve as an efficient approximation function in the learning paradigm of physically informed machine learning to solve BS equations. BS equations with various complexities illustrate the accuracy and feasibility of PiMGA for numerical solutions. Furthermore, the out-of-distribution generalization ability of PiMGA is verified by predicting the Nasdaq 100 index.",
  "year": 2025,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6ccaa3b5f8fb48389f88977780d3763",
  "timestamp": "2025-05-15T01:29:09.164032"
}