{
  "id": 2820,
  "title": "The financial risk of real estate combined factor analysis with grey prediction in Liaoning Province",
  "abstract": "The importance of real estate development has been widely accepted by all countries. Through early warning and avoidance of real estate financial risks, it can effectively promote the healthy and healthy development of the real estate industry, avoiding the impact of accidental factors, such as the COVID-19 pandemic, and promoting the overall economic development. Based on multiple regression analysis and grey prediction methods, this article constructs a real estate financial risk estimation model, and the real estate financial risk is estimated using the relevant data of Liaoning Province from 2001 to 2020. Analyzing the research results of financial risks in Liaoning Province, we can find that the real estate financial risks reached the peak in 2013, and then the real estate financial risks gradually showed a slow decline trend. In general, the financial risks in Liaoning Province are controllable. The study of financial risks in Liaoning Province will help to judge the development of the real estate industry and promote the continuous improvement of the overall economy. The article, through the study of real estate financial risks in Liaoning Province, can promote the development of regional real estate in Liaoning Province and promote the overall economic development of Liaoning Province, which has strong practical significance. The study of real estate financial risks, relevant risk research theories can be enriched, the identification of financial risks can be improved, and the study of real estate financial risks can be strengthened. The article uses a combination of multivariate statistics and grey fuzzy theory to complete the study of real estate financial risks. Therefore, through the exploration of multivariate statistics and grey fuzzy theory, its application value can be elevated.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6cec179078ff3e3576788d4b680277a",
  "timestamp": "2025-05-15T02:19:46.595204"
}