{
  "id": 1123,
  "title": "Optimal credit risk model based on metaheuristic particle swarm algorithm and multilayer perceptron neural network",
  "abstract": "The present study aims to develop a credit portfolio optimization model in the banking industry using a multilayer perceptron artificial neural network with a metaheuristic particle swarm algorithm. Risk, having its own complexity, is a basic concept in financial markets. Since there is no clear picture of risk realization, financial markets are in need of risk control and management approaches. With regard to data collection, this is a descriptive study and regarding the nature and purpose of the research, it is a developmental-applied one. The statistical population of the research includes all facility files of the last 10 years and the financial statements of a commercial bank, selected by census method. The risk criteria used in the models include fuzzy Value-at-Risk (VaR), fuzzy conditional Value-at-Risk (CVAR), fuzzy average Value-at-Risk(AVaR), fuzzy lower absolute deviation(LAD), fuzzy Semi-Kurtosis, and fuzzy Semi-Entropy. The research models were implemented using a three-layer perceptron artificial neural network. MATLAB software was used to conduct the research. The results indicate that the performance of the fuzzy average Value-at-Risk model is better than other models in evaluating optimal portfolios due to the lower mean squared error rate in generating more revenue. Therefore, it is recommended that the above model be used to optimize the credit portfolio.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6e031a6aba2f0ff8f36681eb588b623",
  "timestamp": "2025-05-15T01:59:21.586531"
}