{
  "id": 7448,
  "title": "Assessing and mapping human well-being for sustainable development amid drought and flood hazards: Dadu River Basin of China",
  "abstract": "Drought and flood are two of the most destructive natural disasters with the most significant impact and greatest losses in the Dadu River basin (DRB). However, their impacts on people's life have not attracted enough attention from scholars. In this study, the Standardized Precipitation Index (SPI) describing the drought/flood situation and the Composite Index of Human Well-being (CIHW) are calculated, and a framework is further constructed to assess the impacts of drought and flood disasters on human well-being in the DRB. The results show that the annual and seasonal SPI in the DRB generally exhibit an increasing trend in fluctuations during 2000-2009, indicating a wetting climate in this basin. Overall, the upper reaches of the DRB have experienced an evolution of flood-drought-flood state transition, where the variation amplitude of the SPI in the western sub-basin is greater than that in the eastern sub-basin. In addition, the lower reaches of the DRB have suffered more dramatic and periodic changes from the drought/flood disasters in terms of the SPI. For human well-being during 2000-2019, Maerkang City in the upper reaches, Kangding City in the middle reaches, and Shimian County in the lower reaches of the DRB are at a relatively higher level, with the CIHW decreasing from administrative centers to the around. Moreover, the CIHW over the whole basin increases gradually from 2000 to 2019. The SPI has significantly negative effects on different capitals, following a descending order of financial, social, physical, human and natural capitals. The counties of the basin are divided into four groups, namely the group with high disaster risks and high human well-being, the group with high disaster risks and low human well-being, the group with low disaster risks and high human well-being, and the group with low disaster risks and low human well-being. The panel regression results suggest that the construction of water conservancy facilities, the financial inputs in agriculture and meteorology, and the educational level have positive impacts on human well-being, but the impacts differ from different groups. The construction of water conservancy facilities has highly significant impacts on human well-being in all groups; the education level has no significant impact on the group with high disaster risk and high human well-being, which has not passed the significance test; while the financial inputs in agriculture and meteorology have relatively higher impacts on the whole basin and on the group with low disaster risk and low human well-being compared with other groups. Therefore, it is suggested that the negative impacts of drought and flood disasters can be mitigated through strengthening infrastructure construction, responding appropriately to climate change, avoiding disasters at the source of major projects and improving the disaster prevention and mitigation systems.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b6f0d2222fa812a5c0775aee2b4b767c",
  "timestamp": "2025-05-15T03:08:37.917314"
}