{
  "id": 2603,
  "title": "Does financial expertise influence Islamic bank risk-taking?",
  "abstract": "PurposeThis study investigated how the financial expertise of the board of directors, risk management committee (RMC), audit committee (AC) and Shari & aacute; Supervisory Board (SSB) influences the risk-taking of Islamic banks.Design/methodology/approachThe study utilized unbalanced panel data for a sample of 43 full-fledged Islamic banks from 15 countries over 12 years (2010-2021). We employed feasible generalized least squares (FGLS) and heteroskedastic panels corrected standard errors (HPCSE) regression regressions as the primary estimation methods and used a two-step system generalized method of moments (GMM) estimator for robustness checks.FindingsThe results indicate that board financial expertise decreases insolvency and credit risks. Similarly, AC financial expertise and SSB financial expertise reduce insolvency and portfolio risks but increase credit risk. In contrast, RMC financial expertise raises insolvency risk. The remaining relationships are statistically insignificant.Research limitations/implicationsDue to the lack of disclosure regarding the educational and professional background of the board and committee members in the annual reports of some Islamic banks, this research used a sample of only 43 full-fledged Islamic banks operating in fifteen countries from 2010 to 2021.Practical implicationsThe findings can assist both local and international regulators in revising corporate governance codes and risk management guidelines in such a way as to ensure that the financial experts appointed to the board, AC, RMC and SSB, are capable of controlling excessive risk-taking behavior in Islamic banks.Originality/valueThis study contributes to the literature by providing comprehensive empirical evidence that corporate governance financial expertise influences the risk-taking behavior of Islamic banks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7004395c966a25677ec5192dd23e7c4",
  "timestamp": "2025-05-15T02:17:01.800410"
}