{
  "id": 2222,
  "title": "Supplier relationship portfolio management: A social exchange perspective",
  "abstract": "Despite the importance of relationship portfolios, it's unclear how a buying firm's differential investment in its suppliers affects the distribution of its supplier relationships and the supplier-provided benefits that result. Drawing from social exchange theory (SET), we assess the sequential linkages among supply management practices, supplier relationship sets that vary in closeness, and relational benefits. Empirically, we adopt a multi -methodological approach that combines abductive case-based and deductive survey-based research. In our case -based approach, interview responses from 34 professionals within a global Tier 1 automotive manufacturer (MFGR) and four of its suppliers, open-ended survey responses from 56 buyers and 86 engineers within MFGR, documentary evidence, and direct observations facilitate the operationalization of supply management practices and relationship closeness constructs. The survey-based study integrates case-based findings and uses response data from sales managers within 292 suppliers to MFGR and matched supplier performance data from MFGR to test a theoretical model of social exchange. In a multi-step process, we apply cluster analysis, multinomial logistic regression, ANOVA, and multiple regression to this aggregated dataset to (1) identify three distinct sets of supplier relationships that are distributed along a relationship closeness continuum, (2) show how specific supply management practices affect the composition of supplier relationship sets that comprise a buying firm's portfolio, and (3) demonstrate how supplier-provided benefits differ across supplier relationship sets. Our results validate the utility of SET as applied to supplier portfolio management and provide insights into buyers' actions that drive closer relationships, minimize risk, and maximize benefits across a supplier portfolio.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b70fb23ed0abd68154fe20bbcd02377e",
  "timestamp": "2025-05-15T01:04:27.467802"
}