{
  "id": 8969,
  "title": "Predicted costs of iron-chelators in myelodysplastic syndromes: A 10-year analysis based on actual prevalence and red cell transfusion rates",
  "abstract": "Consideration of iron-chelation (IC) in transfusion-dependent patients is recommended in most clinical-practice guidelines on myelodysplastic syndromes (MDS). The financial impact of IC on health-care systems is predicted through economic modeling, but an analysis based on actual prevalence is lacking. Here, we have investigated the potential drug-costs and need for IC in a cohort of 189 United Kingdom-based MDS patients diagnosed from 2000 to 2010. Patients with low or intermediate-1 IPSS scores were identified as eligible for IC if >= 24 red cell units (RCU) had been transfused over 12 consecutive months or the transfusion-intensity averaged >= 2 RCU per month. Drug-costs were calculated from the time patients qualified for IC until death or last follow-up. In 159 patients with low/intermediate-1 MDS, survival was superior with a low IPSS score (P = 0.014), age <70 years (P = 0.043), transfusion-independence at diagnosis (P = 0.0056) and transfusion-intensity of <2 RCU per month (P = 0.009). Reflecting the time elapsed since diagnosis, longer survival was observed with a cumulative red cell load of >= 75 U (P = 0.046). By logistic-regression analysis, transfusion-intensity independently predicted survival (P = 0.0035) in low and intermediate-1 risk MDS patients. Forty-one patients fulfilled criteria for consideration of IC. Of these, 6 patients died within 1 month; 35 patients survived for a median of 16 months (range 1-61). Had patients commenced IC, the anticipated drug-costs alone would have been similar to$526,880-$2,064,800 over 10 years. The lack of association between cumulative transfusion-load and survival calls for a prospective evaluation of the cost-utility of IC in patients surviving long-term, to enable evidence-based recommendations in MDS management. Am. J. Hematol. 86:406-410, 2011. (C) 2011 Wiley-Liss, Inc.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7170f8cedea114cdc60e0ef18d25b19",
  "timestamp": "2025-05-15T03:24:26.261833"
}