{
  "id": 1363,
  "title": "Fuzzy Multinomial Logistic Regression Analysis and Its Applications to Sovereign Credit Ratings",
  "abstract": "In this study, we propose both a multinomial logistic model and a fuzzy multinomial logistic model that utilize the transformation of variable techniques to simplify the expression of the logistic model. For this purpose, least-squares estimation (LSE) and fuzzy least-squares estimation (FLSE) have been employed. Our primary objective is to enhance the predictive capabilities of multi-class classification models, specifically for forecasting sovereign credit ratings. This research is driven by the need for advanced classification methods using multinomial logistic models that offer flexible reference class prediction, addressing the limitations of traditional logistic techniques in achieving consistent accuracy across diverse classes. We introduce four innovative classification methods for the multinomial logistic model and five for the fuzzy multinomial logistic model, applying them to a comprehensive dataset of sovereign credit ratings from 61 countries, spanning 1995 to 2022, sourced from Moody's. Our proposed methods outperform conventional logistic techniques and maintain consistent predictive accuracy across a variety of classes when compared to traditional logistic classification methods and machine learning techniques such as decision trees, random forests, and support vector machines. The significance of our findings lies in the broad applicability of these methods beyond financial data; they can be adapted for any context that requires reliable multi-class classification. This advancement holds potential for improving decision-making processes in fields such as economics, risk management, and policy analysis by providing a more consistent and accurate predictive framework.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7244bb0189275ff62ac343d1289e34e",
  "timestamp": "2025-05-15T02:02:22.622729"
}