{
  "id": 8309,
  "title": "Glaucoma Knowledge and Disease Severity in a Veteran Population",
  "abstract": "Purpose: To assess the relationship between glaucoma knowledge and disease severity.Design: Substudy of a randomized controlled trial at a single Veterans Affairs (VA) eye clinic.Participants: Veterans with medically treated open-angle glaucoma who self-reported poor medication adherence.Methods: Participants completed a glaucoma knowledge assessment using the 10-question National Eye Health Education Program (NEHEP) Eye-Q Test on glaucoma knowledge. Disease severity was determined using visual field criteria. Multiple linear regression was used to assess the association of NEHEP Eye-Q score and disease severity, adjusting for age, number of glaucoma medications, race, sex, and VA Care Assessment Needs (CAN) score. Main Outcome Measures: In this cross-sectional, preintervention analysis, the main outcome was glau-coma knowledge as measured by the NEHEP Eye-Q Test.Results: Among the 200 study participants, glaucoma severity was mild in 53 (27%), moderate in 56 (28%), severe in 74 (37%), and indeterminant in 17 (9%). The NEHEP Eye-Q scores were low across all severity levels. Scored out of 10, the mean (standard deviation) NEHEP Eye-Q scores were 6.06 (1.57) for mild, 6.21 (1.47) for moderate, 6.28 (1.82) for severe, and 5.88 (1.93) for indeterminate stage. There was no evidence of a significant association between NEHEP scores and disease severity categories (P 1/4 0.78). A regression model did not identify a significant estimated association between NEHEP Eye-Q scores and disease severity after adjusting for age, CAN risk score, number of glaucoma medications, race, and sex.Conclusions: There was no difference in level of glaucoma knowledge based on disease severity. Education -based interventions may benefit patients across all glaucoma stages. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology Glaucoma 2023;6:277-282 (c) 2022 by the American Academy of Ophthalmology",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b726c25f047e81a591d3998b3e6ad1e5",
  "timestamp": "2025-05-15T03:17:21.604601"
}