{
  "id": 3851,
  "title": "Factors Associated With Choice of Web or Print Intervention Materials in the Healthy Directions 2 Study",
  "abstract": "Background. Many U.S. adults have multiple behavioral risk factors, and effective, scalable interventions are needed to promote population-level health. In the health care setting, interventions are often provided in print, although accessible to nearly everyone, are brief (e.g., pamphlets), are not interactive, and can require some logistics around distribution. Web-based interventions offer more interactivity but may not be accessible to all. Healthy Directions 2 was a primary care-based cluster randomized controlled trial designed to improve five behavioral cancer risk factors among a diverse sample of adults (n = 2,440) in metropolitan Boston. Intervention materials were available via print or the web. Purpose. To (a) describe the Healthy Directions 2 study design and (b) identify baseline factors associated with whether participants opted for print or web-based materials. Methods. Hierarchical regression models corrected for clustering by physician were built to examine factors associated with choice of intervention modality. Results. At baseline, just 4.0% of participants met all behavioral recommendations. Nearly equivalent numbers of intervention participants opted for print and web-based materials (44.6% vs. 55.4%). Participants choosing web-based materials were younger, and reported having a better financial status, better perceived health, greater computer comfort, and more frequent Internet use (p < .05) than those opting for print. In addition, Whites were more likely to pick web-based material than Black participants. Conclusions. Interventions addressing multiple behaviors are needed in the primary care setting, but they should be available in web and print formats as nearly equal number of participants chose each option, and there are significant differences in the population groups using each modality.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b72864b19c022ab5962d865419e900f1",
  "timestamp": "2025-05-15T02:30:28.770586"
}