{
  "id": 8739,
  "title": "Early and ultra-early surgery in hip fracture patients improves survival",
  "abstract": "Background: Hip fracture is a common injury with associated high mortality. Recent drives by the Department of Health have sought to prioritise these patients' care. In April 2010, the Best Practice Tariff was introduced in England and Wales. This offers financial incentives to institutions that provide holistic care and surgery within 36 h for hip fracture patients. The England and Wales National Institute for Health and Clinical Excellence (NICE) published its first guidance on hip fracture management in June 2011, and emphasised the need for surgery on the day or day after admission. In spite of the emphasis placed on this injury, the predictors of in-hospital mortality remain ill-defined. In particular the effect of the timing of surgery remains contentious. Objective: To address the issues raised by NICE around surgical timing and examine whether surgery before a 36 h watershed improves survival. In addition, to examine survival outcomes for each 12 h watershed following admission. Materials and methods: Prospectively collected data on 2056 patients presenting to our unit with hip fractures between February 2008 and May 2011 were retrospectively reviewed. Multivariate regression analysis was used to correct for confounders, and so determine the effect of various parameters on inpatient mortality. Results: Age (p < 0.0001), male-gender (p < 0.0001), source of admission (p < 0.05), ASA-grade (p < 0.0001) and delay of surgery (p < 0.01) were associated with an increased risk of in-hospital mortality. The adjusted odds of in-hospital mortality were 1.58 (p < 0.05) times higher in those undergoing surgery after 36 h compared to surgery before this time. Early surgery (within 24 h) resulted in reduced in-hospital mortality when compared to the 36 h watershed. Similarly ultra-early surgery (within 12 h) was even better still (adjusted odds ratio 3.9 p < 0.05). Conclusions: Expeditious surgery is associated with improved patient survival. Other predictors of in-hospital mortality include age, gender, in-hospital fracture and ASA-grade. Ultra-early surgery (within 12 h) reduces risk of in-hospital mortality. (C) 2012 Published by Elsevier Ltd.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b72c0dad3d8d1fac625074099adaa89a",
  "timestamp": "2025-05-15T03:21:56.623026"
}