{
  "id": 8940,
  "title": "The impact of for-profit hospital status an the care and outcomes of patients with non-ST-Segment elevation myocardial infarction",
  "abstract": "Objectives We sought to determine whether for-profit status influenced hospitals' care or outcomes among non-ST-segment elevation myocardial infarction (NSTEMI) patients. Background While for-profit hospitals potentially have financial incentives to selectively care for younger, healthier patients, perform highly reimbursed procedures, reduce costs by limiting access to expensive medications, and encourage shorter in-patient length of stay, there are limited data available to investigate these issues objectively. Methods Using data from the CRUSADE (Can Rapid risk stratification of Unstable angina patients Suppress ADverse outcomes with Early implementation of the American College of Cardiology/American Heart Association guidelines) Initiative, we investigated whether for-profit status influenced hospitals' patient case mix, care, or outcomes among 145,357 patients with NSTEMI treated between January 1, 2001, and December 31, 2005, at 532 U.S. hospitals. Impact of for-profit status on care and outcomes was analyzed overall and after adjustment for clinical and facility factors using regression modeling. Results Patients (n = 11,658) treated at 58 for-profit hospitals were of similar age and gender, but were more likely to be nonwhite (black, Asian, Hispanic, and other) and have health maintenance organization/private insurance, diabetes mellitus, congestive heart failure, hypertension, and renal insufficiency compared with 133,699 patients treated at 474 nonprofit hospitals. For-profit hospitals were less likely to use discharge beta-blockers, but all other treatments were similar including the use of interventional procedures (cardiac catheterization and revascularization procedures) compared with nonprofit centers. In-hospital length of stay and mortality were also similar by hospital type. Conclusions We found no evidence that for-profit hospitals selectively treat less sick patients, provide less evidence-based care, limit in-hospital stays, or have patients with worse acute outcomes than nonprofit centers.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b73865191b7ca551ba8b8b01060ce795",
  "timestamp": "2025-05-15T03:23:56.102118"
}