{
  "id": 2964,
  "title": "CSOWC: A Unified Classification Framework for Standardizing Optical Wireless Communications",
  "abstract": "Free space optics (FSO) or optical wireless communication (OWC) technology has regained a great interest over the last decade as an attractive alternative or complementary technology for existing technologies, such as radio frequency (RF), that have been pushed to their limits in order to serve the needs of emerging applications. Accordingly, FSO technology is being widely deployed in various indoor, terrestrial, space, and underwater systems. As the application portfolio of FSO/OWC technology grows, so does the need for a clear classification for FSO/OWC link configurations. An efficient classification can serve as a unified language to link different entities involved in the standardization process. This is particularly important during the early stages of standard development which require discussions and exchange of ideas between different standardization entities, including: academic, industry, and regulatory. Most existing classifications, however, focus on indoor OWC systems. Less attention has been paid to terrestrial, space, and underwater OWC systems. Moreover, most classifications for the indoor OWC are not inclusive enough to accommodate recent and emerging developments of indoor link configurations. In this paper, we present a most-inclusive scenario-oriented (or function-based) classification, CSOWC, that can be used to classify existing and future indoor, terrestrial, space, and underwater OWC links using common and simple unified notation. We believe that, CSOWC can serve as a unified framework for standardization bodies to identify potential needed standards and to deliver efficient standards that meets the emerging market needs. Moreover, we use the proposed classification to briefly review existing standards and recommendations related to OWC.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b748fbf407a2fc2cece76fd853e8e3b8",
  "timestamp": "2025-05-15T01:12:09.183836"
}