{
  "id": 7398,
  "title": "Maternal autonomy is inversely related to child stunting in Andhra Pradesh, India",
  "abstract": "Child stunting, an outcome of chronic undernutrition, contributes to poor quality of life, morbidity and mortality. In South Asia, the low status of women is thought to be one of the primary determinants of undernutrition across the lifespan. Low female status can result in compromised health outcomes for women, which in turn are related to lower infant birthweight and may affect the quality of infant care and nutrition. Maternal autonomy (defined as a woman's personal power in the household and her ability to influence and change her environment) is likely an important factor influencing child care and ultimately infant and child health outcomes. To examine the relationship between maternal autonomy and child stunting in Andhra Pradesh, India, we analysed data from National Family Health Survey (NFHS)-2. We used cross-sectional demographic, health and anthropometric information for mothers and their oldest child <36 months (n = 821) from NFHS-2. The main explanatory variables of autonomy are presented by four dimensions - decision making, permission to travel, attitude towards domestic violence and financial autonomy - constructed using seven binary variables. Logistic regression models were used to test associations between indicators of female autonomy and the risk of having a stunted child. Women with higher autonomy (indicated by access to money [odds ratio (OR) = 0.731; 95% confidence interval (CI) 0.546, 0.981] and freedom to choose to go to the market [OR = 0.593; 95% CI 0.376, 0.933]) were significantly less likely to have a stunted child, after controlling for household socio-economic status and mother's education. In this south Indian state, two dimensions of female autonomy have an independent effect on child growth, suggesting the need for interventions that increase women's financial and physical autonomy.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b760a59425943921e2b302d380559aa7",
  "timestamp": "2025-05-15T03:08:00.856306"
}