{
  "id": 3167,
  "title": "Regional Response of Low Carbon Investments to the COVID-19 Pandemic: The Case of Stock Markets in Seeking Carbon Neutrality Goals",
  "abstract": "Low carbon investments are significant in climate change and sustainable economic growth. The research considers the impact of the COVID-19 pandemic on low carbon investments using environmental, social, and governance (ESG) factors in different regions to find the correlation between various markets and the impact of the pandemic. Our research employs the method of covariance/correlation analysis to investigate the relationship between low carbon investments in different regions. We also check the main parameters of descriptive statistics. We use the method of bivariate regression analysis to assess the impact of the COVID-19 pandemic on the performance of ESG stock indices in Emerging, European, and Global markets. The main findings reveal that the global prevalence and mortality risk of COVID-19 infection have a significant adverse effect on the performance of Emerging, European, and Global ESG stock markets. In contrast, the effect of COVID-19 cases reported deaths caused by COVID-19 infection to appear to be mixed. Our research shows that the correlation between the European ESG stock market and other ESG markets is exceptionally low or negative in the 1-year horizon. In contrast, tendencies in other markets are similar. So it means that the European ESG stock market is a good tool for diversification and risk mitigation during critical moments. Our results can be used in practice for portfolio management purposes. Institutional and other investors can use these results for low carbon portfolio management and risk mitigation.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b764f22ec6fc6dd6a7529dfc9f15e797",
  "timestamp": "2025-05-15T01:14:16.230898"
}