{
  "id": 365,
  "title": "Fast Valuation of Large Portfolios of Variable Annuities via Transfer Learning",
  "abstract": "Variable annuities are important financial products that result in 100 billion sales in 2018. These products contain complex guarantees that are computationally expensive to value, and insurance companies are turning to machine learning for the valuation of large portfolios of variable annuity policies. Although earlier studies, exemplified by the regression modelling approach, have shown promising results, the valuation accuracy is unsatisfying. In this paper, we show that one main cause for the poor valuation accuracy is the inefficient selection of representative policies. To overcome this problem, we propose a novel transferlearning based portfolio valuation framework. The framework first builds a backbone deep neural network using historical Monte Carlo simulation results. The backbone network provides a valuation-driven representation for selecting the policies that best represent a large portfolio. Furthermore, the transferred network provides a way to adaptively extrapolate from these representative policies to the remaining policies in the portfolio. By overcoming a major difficulty faced by the popular Kriging model, the need of matrix inversion, the transferred network can handle a large number of representative policies to sufficiently cover a diverse portfolio.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b76a6b50a57c75bf52880a5232f32a92",
  "timestamp": "2025-05-15T00:42:32.520942"
}