{
  "id": 7217,
  "title": "Dynamic interlinkages between oil price shocks and stock markets: a quantile-on-quantile connectedness analysis in emerging economies",
  "abstract": "This study examines the dynamic interplay between oil price fluctuations and stock markets across 11 emerging economies, encompassing both oil-exporting and oil-importing states. Leveraging quantile-on-quantile (QQ) connectedness and regression frameworks, we focus on the asymmetric spillover effects of oil price shocks on stock returns from 16 February 2006, to 14 June 2024, revealing nuanced insights into risk transmission across varying market conditions. Our findings demonstrate that oil-exporting countries, such as Saudi Arabia and Russia, display heightened sensitivity to oil price changes, while more diversified economies like China show comparatively subdued reactions. We further explore the implications of significant global events - such as the COVID-19 pandemic and geopolitical tensions related to the Russia-Ukraine conflict - on the interconnectedness of oil prices and stock markets. The results underscore the importance of strategic investment diversification for emerging markets to buffer against the adverse effects of oil price volatility. This research contributes to the existing literature on financial interconnectedness, providing valuable implications for policymakers and investors seeking to navigate the complexities of global oil market dynamics and enhance market resilience in the face of external shocks.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7a550768a863be3ce084b6d331aa022",
  "timestamp": "2025-05-15T03:06:35.251039"
}