{
  "id": 7304,
  "title": "Elder Abuse and Social Capital in Older Adults: The Japan Gerontological Evaluation Study",
  "abstract": "Background: Elder abuse is a serious public health issue worldwide, but large-scale epidemiologic studies remain sparse. Although social factors in human relations such as social support and social isolation have been proposed as the factors related to elder abuse, cognitive social capital has not been examined. Objective: This study aims to clarify the prevalence of and the factors associated with elder abuse among independent older adults in Japan. Methods: The study design is a retrospective observational study. The data were derived from the Japan Gerontological Evaluation Study (JAGES). These self-report data were collected from 26,229 people aged 65 years or older living in 28 municipalities in 2013. The types of elder abuse and factors associated with them were examined using logistic regression analysis. Results: The prevalence of elder abuse among the sample was 12.3% (11.1% in males and 13.3 in females). In the entire sample, physical, psychological, and financial abuses were reported to be 1.26, 11.12, and 1.45%, respectively. Factors associated with increased odds of experiencing abuse were being a woman, living with family members, having poor self-rated health, and having mild or severe depression. By contrast, age >= 85 years, being widowed, or unmarried, and having a positive view of community trust were associated with a lower risk of experiencing abuse. Conclusion: While particular demographic factors and health are associated with a greater risk of elder abuse, our findings that trust within the community lessens the risk indicates the importance of social capital. This should be taken into consideration when developing population-based strategies to prevent elder abuse.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7b45a55a099c374cbad3e1fd9216056",
  "timestamp": "2025-05-15T03:07:02.700226"
}