{
  "id": 7883,
  "title": "Linkages between capital, bank financing and economic growth: the case of Islamic and conventional banks from a panel of Muslim countries",
  "abstract": "PurposeThis study aims to examine the triple relationship between capital regulation, banking lending and economic growth in a dual markets. Specifically, the author seeks to explore how changes in capital regulation can impact banking lending practices and subsequently influence economic growth, while also investigating the reciprocal effects of banking lending on economic growth.Design/methodology/approachThe author follows several previous studies such as Shrieves and Dahl (1992), Beck and Levine (2002), Altunbas et al. (2007), Saeed et al. (2020) and Stewart et al. (2021) to identify a system of three equations, regarding economic growth, capital and banking financing growth, respectively. The author estimates the parameters of all equations simultaneously using the seemingly unrelated regression method (Zellner, 1962) for a sample of 46 Islamic banks and 113 conventional banks during 2002-2022. These banks operate in 13 Muslim countries from Middle East and North Africa and Southeast Asia.FindingsThe author's findings demonstrate that in the case of Islamic banking, an increase in loan growth stimulates economic growth, while an increasing capital ratio positively influences economic growth but is accompanied by a reduction in loan growth. This result corroborates the findings of Stewart et al. (2021), which indicate that regulatory capital reduces unstable credit while improving gross domestic product growth. However, in the case of conventional banks, the response to an increase in loan growth on Gross Domestic Product Per Capita Growth (GDPCG) is ambiguous, while the capital ratio improves GDPCG and promotes LOANG, which, in turn, increases risk.Practical implicationsThe Islamic banks can continue to significantly contribute to economic growth by effectively directing their available capital toward viable investment opportunities and supporting sustainable financial practices, even in the presence of potential constraints on loan growth. As for conventional banks, they are invited to increase their capital levels to ensure a strong and resilient financial system that can support lending and facilitate economic growth.Originality/valueTo the best of the author's knowledge, this paper is the first to explore the triple relationship between capital requirements, Islamic bank lending and economic growth.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7b88bf82247bae288b13ffccbcda878",
  "timestamp": "2025-05-15T03:13:04.914785"
}