{
  "id": 5350,
  "title": "Assessing the association between Corporate Financial Influence and implementation of policies to tackle commercial determinants of non-communicable diseases: A cross-sectional analysis of 172 countries",
  "abstract": "Objective: Non-communicable diseases (NCDs) are the leading cause of global death and disability. Tobacco, alcohol, and unhealthy foods are major contributing risk factors. WHO Member States have unanimously endorsed a set of 12 policies designed to constrain the sale of these commodities, however, there are myriad case studies of commercial entities seeking to undermine effective legislation in order to protect their profits. We set out to quantify the association between corporate financial influence and implementation of commercial policies. Methods: We generated policy implementation scores for all 194 WHO Member States using data from the 2015, 2017, and 2020 WHO NCD Progress Monitor Reports. We used publicly available data to create a novel Corporate Financial Influence Index (CFII) that quantifies the opportunity for corporations to use their financial resources to directly influence policymaking in each country. We reported policy implementation trends over time and used random effects multivariate regression to test the association between policy implementation and CFII for each country, while controlling for broad set of economic, cultural, historical, geographic, and demographic factors. Findings: Implementation of the 12 WHO-backed commercial policies has risen over time, but remains low at approximately 40%. Progress is reversing for alcohol policies. CFII explains around a fifth of the variance in global implementation. For every 10% rise in CFII, implementation falls by approximately 2% (95%CI 0.90 to 3.5, p < 0.001). Conclusion: Our quantitative global analysis suggests that financial corporate influence is negatively associated with implementation of policies that seek to restrict the marketing, sale, and consumption of unhealthy (but profitable) commodities. In the context of anemic international progress tackling NCDs, greater attention should be paid to managing regulatory opportunities for overt and covert corporate financial influence as a core plank of the global NCD response.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7b8fc47ae9497fe8f051d811e9aeb7b",
  "timestamp": "2025-05-15T02:46:44.956037"
}