{
  "id": 7998,
  "title": "Connectedness of China's green bond and green stock markets at the low-and high-order moments: The role of economic and climate policy uncertainty",
  "abstract": "Economic policy uncertainty (EPU) and climate policy uncertainty (CPU) may affect green finance (GF) markets not only on lower-order moments (mean and variance) but also on higherorder moments (skewness and kurtosis). This study analyses the impacts of these uncertainties on the high-order moment connectedness in green bond (GB) and green stock (GS) markets in China using the Glosten, Jagannathan, and Runkle GARCH with Skewness and Kurtosis (GJRSK) model, time- and frequency-domain methodologies, and quantile-on-quantile regression. Static analysis shows that spillovers from higher order moments (skewness 63.18 % and kurtosis 68.91 %) are higher than those from lower order moments (return 51.52 % and volatility 61.83 %), and that spillovers from return (48.88 %), skewness (33.8 %), and kurtosis (56.81 %) occur mainly in the short term, whereas spillover from volatility (38.23) occurs mainly in the long term. The dynamic analysis indicates significant time-variation in the dynamic total and net connectedness indices. COVID-19 has a greater impact on the connectedness of volatility, skewness, and kurtosis, and a relatively weaker impact on the connectedness of returns. The dynamic total return and kurtosis spillovers occur mainly in the short term, while the dynamic total volatility and skewness spillovers occur mainly in the long term. In terms of the net-pairwise directional connectedness, GB is the largest shock emitter, while stocks in the environmental protection (EP) sector are the primary receivers of skewness and kurtosis spillovers. In addition, we find that CPU and EPU affect the upside risk of total spillovers in the GF market more than the downside risk, and exhibit significant heterogeneity across time, frequency, and quantiles. The results offer both insights for policymakers to coordinate the GF markets and for investment institutions to design asset allocation and risk management strategies, contributing to the understanding of the complex dynamics of the GF market's response to climate and economic policies, thereby promoting economically sustainable development and financial stability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7bc1dbdd020679ccb9625f3eee78cf9",
  "timestamp": "2025-05-15T03:14:07.292433"
}