{
  "id": 5546,
  "title": "WOMEN ON BOARDS: DOES GENDER COMPOSITION AFFECT FINANCIAL RESULTS OF COMPANIES?",
  "abstract": "Purpose: The paper aims to answer the question on the number of women in the highest organizational bodies in Polish enterprises and whether there is a relationship between the compositions of boards due to gender of their members and financial results achieved by the companies and therefore to tell whether gender and/or gender composition through inter alia a different management style or openness to risk influences the financial condition of organizations. Design/methodology/approach: For the analysis 281 companies listed on the Warsaw Stock Exchange were analysed. Basic financial indicators disclosed in the annual financial reports for 2015 were chosen. The reports for 2015 were analysed from 1 till 10 February 2017. Using statistical analysis the financial indicators were juxtaposed with the number of women on boards. Also the number of women serving as chairman of the board was included into the analysis. Furthermore a regression analyses using dummy explanatory variables (women president of the board, women in management boards and women in supervisory boards) and three different dependent variables (ROA, ROS, ROIC) have been conducted. Findings: The paper provides insight into the composition of boards in Polish companies listed on the Warsaw Stock Exchange due to gender. It shows that boards of these companies are highly masculine. The attempt to show relations between the gender composition and organizations financial performance were not entirely conclusive and need further analysis. Research/practical implications: The paper includes implications for decision - makers. It can be used as a reference by regulatory bodies to further investigate on the means as to how board composition can influence the firm performance. It may also be used for SME's in a very crucial recruitment or succession process, which, due to SMEs limited capability needs to take all the important factors, like gender of the people in question into consideration. Originality/value: The research contributes to the literature on the relationship between women participation on corporate boards and firms' performance. This paper fulfils a gap in the analysis of Polish enterprises with regards to board composition due to gender and the linkage of this composition with the firm's financial performance.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7bff3053b6d1ff9e1e9c192560ff386",
  "timestamp": "2025-05-15T02:48:51.355229"
}