{
  "id": 3687,
  "title": "Overview of research activities associated with the World Health Organization: results of a survey covering 2006/07",
  "abstract": "Background: This paper presents the first comprehensive effort to provide an overview of the research associated with the World Health Organization (WHO) headquarters in 2006/07. Methods: Information was obtained by questionnaire and interviews with senior staff operating at WHO headquarters in Geneva. Research type, purpose and resources (both financial and staff) were defined and compared for each of the 37 departments identified and a comparative analysis was made with the global burden of disease as expressed by Disability Adjusted Life Years (DALY). Results: Research expenditure in 2006/07 was estimated at US$215 million. WHO is involved in more than 60 research networks/partnerships and often WHO itself is the network host. Using the DALY model, 84% of the funding WHO allocates to research goes to DALY Type I diseases (communicable, maternal, perinatal and nutritional diseases) which represents 40% of DALY. 4% is allocated to Daly Type II (non-communicable diseases) which contributes to 48% of DALY. 45% of WHO permanent staff are involved with health research and the WHO's approach to research is predominantly focused on policy, advocacy, health systems and population based research. The Organization principally undertakes secondary research using published data and commissions others to conduct this work through contracts or research grants. This approach is broadly in line with the stated strategy of the Organization. Conclusions: The difficulty in undertaking this survey highlights the complexity of obtaining an Organization-wide assessment of research activity in the absence of common standards for research classification, methods for priority setting and a mechanism across WHO, or within the governance of global health research more generally, for managing a research portfolio. This paper presents a strategic birds-eye view of the WHO research portfolio using methodologies that, with further development, may provide the strategic information required if there is to be balancing of research efforts between communicable disease, non-communicable disease and other pressing public health needs. As the rollout of the WHO strategy on research for health proceeds we would hope to see similar exercises undertaken at the WHO Regional Offices and in support of capacity building of national health research systems within Member States.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7c34d165e10885b8f121f3c65c0f730",
  "timestamp": "2025-05-15T01:19:26.366788"
}