{
  "id": 8174,
  "title": "Drug prescription goals in primary care: a cross-sectional study",
  "abstract": "Background Care goals are often implicit, although their identification is a key element of any prescription process. This study aimed to describe the clinical goals of drug prescriptions in general practice, their determinants and the agreement between physicians and patients. Methods This was a cross-sectional study conducted by 11 resident trainees acting as observers in 23 general practices. The residents recorded the indication and main physician's goal for all drugs prescribed during five consultation days in each practice in December 2015, and the main patient's goal for a sub-sample of consultations. We used an eight-category generic classification of prescription goals, including three specific (mortality, morbidity and cure), three non-specific (symptoms, quality of life, functioning) and two non-specified (other goal, no goal) categories. Analyses were based on a multivariable, multilevel model and on the kappa statistic applied to the sub-sample of consultations. Results The sample encompassed 2141 consultations and 5036 drugs. The main physicians' goal of drug prescriptions was to relieve symptoms (43.3%). The other goals were to decrease the risk of morbidity (22.4%), to cure disease (11.7%), to improve quality of life (10.6%), to decrease the risk of mortality (8.5%) and to improve functioning (1.8%). The choice of a specific goal was more frequent in patients with the following characteristics: over 50 (OR [1.09;1.15]), of male gender (OR [1.09;1.39]), with full financial coverage for a long-term condition (OR [1.47;1.97]), known by the physician (OR [1.19;2.23]), or with a somatic health problem (OR [2.56;4.17]). Cohen's kappa for drug prescription goals between the patients and the physicians was 0.26 (0.23-0.30). Conclusions Physicians' goals are poorly shared with patients. It remains to be assessed whether it is possible to collect and discuss information on prescription goals on a daily basis.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7c934c7b6d859d8e71be65513ea6c14",
  "timestamp": "2025-05-15T03:16:17.364534"
}