{
  "id": 2870,
  "title": "Power Transformer Health Index Using Cost-Sensitive Learning to Consider the Impact of Misclassification",
  "abstract": "Power companies employ comprehensive evaluations to manage facilities, such as transformers, lines, and generators, assessing their status and calculating the probability of failure. Within this asset management framework, a key metric that indicates the condition of facilities is the health index. To develop an optimal investment strategy for facility maintenance and management, a method for accurately calculating the health index is essential. Recent studies have explored the application of machine learning to improve accuracy. However, these studies ignore the risk of misclassification, which can result in significant financial losses when predicting the health index of power transformers. Therefore, this study proposes a health index calculation algorithm that incorporates cost-sensitive learning to assess the impact of each misclassification scenario, construct a cost matrix, and minimize the cost through learning. Input parameters are selected on the basis of the power transformer's structure, failure mode effect analysis, failure diagnosis techniques, and historical failure cases. During the learning process, the relationship between actual and predicted classes is analyzed, and the risk associated with each misclassification scenario is quantified to describe the cost matrix. The effectiveness of the proposed health index calculation algorithm is validated using in-service power transformer inspection data, demonstrating a reduction in the risk of specific misclassification scenarios.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7d28b9dbc525889051276500277eab1",
  "timestamp": "2025-05-15T02:20:16.807309"
}