{
  "id": 7673,
  "title": "The Wisconsin Epidemiologic Study of Diabetic Retinopathy XXIII: The Twenty-five-Year Incidence of Macular Edema in Persons with Type 1 Diabetes",
  "abstract": "Objective: To examine the 25-year cumulative incidence of macular edema (ME) and its relation to various risk factors. Design: Population-based study. Participants: A total of 955 insulin-taking persons living in an 11-county area in southern Wisconsin with type 1 diabetes diagnosed before age 30 years who participated in baseline examinations (1980-1982) and at least 1 of 4 follow-up (4-, 10-, 14-, and 25-year) examinations (n = 891) or died before the first follow-up examination (n = 64). Methods: Stereoscopic color fundus photographs were graded using the modified Airlie House classification and the Early Treatment Diabetic Retinopathy Study retinopathy severity scheme. Competing risk of death was included in statistical models. Main Outcome Measures: Incidence of ME and clinically significant ME (CSME). Results: The 25-year cumulative incidence was 29% for ME and 17% for CSME. Annualized incidences of ME were 2.3%, 2.1%, 2.3%, and 0.9% in the first, second, third, and fourth follow-up periods of the study, respectively. In univariate analyses, the incidence of ME was associated with male sex, more severe diabetic retinopathy, higher glycosylated hemoglobin, proteinuria, higher systolic and diastolic blood pressure, and more pack-years of smoking. Multivariate analyses showed that the incidence of ME was related to higher baseline glycosylated hemoglobin (hazard ratio [HR] per 1% 1.17; 95% confidence interval [CI], 1.10-1.25; P<0.001) and higher systolic blood pressure (HR per 10 mmHg 1.15; 95% CI, 1.04-1.26; P = 0.004) and marginally to proteinuria (HR 1.43; 95% CI, 0.99-2.08; P = 0.06). Conclusions: These data show that relatively high 25-year cumulative rates of incidence of ME were related to glycemia and blood pressure. The lower risk of incident ME in the last period of the study may reflect recent improvement in care. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2009; 116:497-503 (C) 2009 by the American Academy of Ophthalmology.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7eabbf0aec2405edb14eb7f78b993e8",
  "timestamp": "2025-05-15T03:11:04.506584"
}