{
  "id": 3314,
  "title": "Hybrid intelligent decision support systems and applications for risk analysis and discovery of evolving economic clusters in Europe",
  "abstract": "Decision making in a complex, dynamically changing environment is a difficult task that requires new techniques of computational intelligence for building adaptive, hybrid intelligent decision support systems (HIDSS). Here, a new approach is proposed based on evolving agents in a dynamic environment. Neural network and rule-based agents are evolved from incoming data and expert knowledge ifa decision making process requires this. The agents are evolved from methods included in a repository for intelligent connectionist based information systems RICBIS (http://divcom.otago.ac.nz/infosci/kel/CBIIS.html) with the use of financial market data collected in an on-line made, and with the use of macroeconomic data published monthly in the European Central Bank Bulletin. RICBIS includes different types of neural networks, including MLP, SOM, fuzzy neural networks (FuNN), evolving fuzzy neural networks (EFuNN), evolving SOM, rule-based systems, data pre-processing techniques, standard statistical and financial techniques. A case study project on risk analysis of the European Monetary Union (EMU) is considered and a framework of a system EMU-HIDSS is presented, which deals with different levels of information and users, e.g. the whole world, Europe, clusters of nations, a single nation, companies/banks. It combines modules for final decision making, global and national economic development, exchange rate trend prediction, stock index trend prediction, etc. Some experimental results on real data are presented.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b7f81985f3e5ba9072d203fc063e8fab",
  "timestamp": "2025-05-15T02:25:13.616497"
}