{
  "id": 1828,
  "title": "Modifying (M)CoVaR and constructing tail risk networks through analytic higher-order moments: Evidence from the global forex markets",
  "abstract": "In a financial system, entities (e.g., companies or markets) face systemic risk that could lead to financial instability. To prevent this impact, we require quantitative systemic risk management we can carry out using conditional value-at-risk (CoVaR) and a network model. The former measures any targeted entity's tail risk conditional on another entity being financially distressed; the latter represents the financial system through a set of nodes and a set of edges. In this study, we modify CoVaR along with its multivariate extension (MCoVaR) considering the joint conditioning events of multiple entities. We accomplish this by first employing a multivariate Johnson's SU risk model to capture the asymmetry and leptokurticity of the entities' asset returns. We then adopt the Cornish-Fisher expansion to account for the analytic higher-order conditional moments in modifying (M)CoVaR. In addition, we attempt to construct a conditional tail risk network. We identify its edges using a corresponding Delta (M)CoVaR reflecting the systemic risk contribution and further compute the strength and clustering coefficient of its nodes. When applying the financial system to global foreign exchange (forex) markets before and during COVID-19, we revealed that the resulting expanded (M)CoVaR forecast exhibited a better conditional coverage performance than its unexpanded version. Its superior performance appeared to be more evident over the COVID-19 period. Furthermore, our network analysis shows that advanced and emerging forex markets generally play roles as net transmitters and net receivers of systemic risk, respectively. The former (respectively, the latter) also possessed a high tendency to cluster with their neighbors in the network during (respectively, before) COVID-19. Overall, the interconnectedness and clustering tendency of the examined global forex markets substantially increased as the pandemic progressed.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b81282a83792503ae46e93024ab7a831",
  "timestamp": "2025-05-15T02:08:03.923964"
}