{
  "id": 621,
  "title": "Comparative Analysis Of Deep Learning Approaches Used For Stock Price Prediction",
  "abstract": "Stock market analysis is nonlinear, highly volatile and complex. Predicting the stock price is a highly challenging task. The change in stock price is affected by certain factors such as economic situation, political circumstances, sentiments, global pandemic like Covid-19 and global impact of Russo-Ukrainian War. Forecasting the stock market presents a significant difficulty to investors to build a profitable portfolio or to reduce stock risk in the stock market. Artificial Intelligence (AI), Machine Learning (ML) and Deep Learning (DL) have been abundantly used for stock trend and price prediction considering time series data and sentiments. In this paper we consider the stocks of 5 companies (Tata Steel, Tata Motors, Sun Pharmacy, Infosys and HDFC Bank) from National Stock Exchange (NIFTY 50). Convolution Neural Network (CNN), Recurrent Neural Network (RNN), Long Short-Term Memory (LSTM) and Bidirectional Long Short-Term Memory (Bi-LSTM) methods were used for data set of duration 01 January 2014 - 01 February 2024, was evaluated the prediction model using Root Mean Squared Error (RMSE) and Mean Absolute Percentage Error (MAPE). The Bi-LSTM model achieved an RMSE of 6.6 for TATA Steel stock and a MAPE of 0.010 for Sun Pharma stock. The study proves the Bi-LSTM is an effective deep learning algorithm for predicting the future closing price of a stock as compared to CNN, RNN and LSTM.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b81392876badade5002d74311ecb7c6b",
  "timestamp": "2025-05-15T00:45:39.155771"
}