{
  "id": 3135,
  "title": "Prediction of Micro- and Small-Sized Enterprise Default Risk Based on a Logistic Model: Evidence from a Bank of China",
  "abstract": "This study selected factors influencing the default risk of micro- and small-sized enterprises (MSEs) from the perspective of both financial and non-financial indicators and constructed an identification model of the influencing factors for the default risk of MSEs by logistic regression, using the data on loans borrowed by 2492 MSEs from a city commercial bank in Gansu Province as the sample. In addition, the robustness and prediction effect of the model were tested. The empirical results showed that the logistic model has good robustness and high predictive ability. The quick ratio, total asset turnover, return on net assets, sales growth rate and total assets growth rate had significant negative impacts on the default risk for the loans taken out by MSEs; the loan maturity and loan amount had remarkable positive impacts on the default risk; non-financial indicators (e.g., the nature of the enterprise, method of obtaining the loan and educational background of the person in charge) had significant impacts on the default risk. Based on the results, this manuscript provides solutions to address the default risk of MSEs and makes suggestions from the perspectives of database building, full-cycle management and dynamic assessment of guarantee capacity.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b83c94fa09b88ac2a529e769f99a9e31",
  "timestamp": "2025-05-15T02:22:56.725699"
}