{
  "id": 5132,
  "title": "Financial contagion in banking networks with community structure",
  "abstract": "Monitoring and controlling financial contagion in banking systems is a challenging task, and micro-structural network contagion models are becoming fundamental policy tools for supervisors. A large body of literature studies the theoretical properties of the diffusion of financial shocks in banking networks, measuring the spread of different types of shocks in relationship to the structural properties. Recent studies have highlighted the relevance of network communities i.e. groups of banks with connections among them stronger than to the rest of the system. In the European Union, such communities may be related to country divisions, as a result of the progressive integration of national banking systems.In this work we study whether and how the presence of a community structure affects the diffusion of liquidity shocks in a simulated banking systems. As a starting hypothesis communities may influence contagion in two ways: a higher transitivity (or clustering) could generate loops that amplify contagion; on the other hand, shocks could be trappedin a community avoiding the transmission to the entire system. We find that the presence of communities highly affects contagion, increasing the amount of distress transmitted and the number of banks involved. The results are robust across a broad range of network specifications. We also test the potential effects on contagion risk of several stylized policies: the introduction of higher liquidity requirements, the definition of liquidity requirements based on network indicators, and interventions to improve the confidence in the market by individual banks (obtained for instance by policies that enhance transparency). Results can be of interest for regulators willing to study the diffusion of liquidity risk and to set up macro-prudential policy interventions.(c) 2022 Elsevier B.V. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b84944a01665260400410e7a2da59d4c",
  "timestamp": "2025-05-15T02:44:43.846851"
}