{
  "id": 6703,
  "title": "Correlations between Hotspots of Child Maltreatment and Neighborhood-Level Interventions",
  "abstract": "Child maltreatment, which seriously impacts children's well-being, is influenced by characteristics of neighborhood. Notably, previous studies have neglected the role of neighborhood spatial features in child maltreatment. Hence, we aimed to determine the distribution of child maltreatment occurrence by city, county, and district in South Korea; whether high child maltreatment incidence rates are clustered spatially; and the neighborhood factors that affect child maltreatment incidence. We analyzed 26,354 child maltreatment cases from 225 regions for 2020 using data from the National Child Abuse Database System. Data analysis procedures followed a three-tiered approach: ordinary least squares regression, Jarque-Bera and Breusch-Pagan tests, and geographically weighted regression. We identified concentrated hotspots and found that child maltreatment incidences were spatially autocorrelated. Key neighborhood characteristics that increased child maltreatment were the number of child community centers, the number of vacant houses, the number of multicultural households, and the number of single-parent households. Financial independence of local governments, the size of the older-adult population, and population density are the key neighborhood characteristics that decrease child maltreatment. Our findings reveal that prioritizing socioeconomically vulnerable regions is critical to alleviating child maltreatment. This study provides a valuable reference for identifying areas at high risk of child maltreatment and for implementing cost-effective, neighborhood-level interventions to reduce child maltreatment.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b84d344bdcc00a3c34e398bb5f5efde4",
  "timestamp": "2025-05-15T03:00:35.526824"
}