{
  "id": 9343,
  "title": "Development and Progression of Diabetic Retinopathy 12 Months after Phacoemulsification Cataract Surgery",
  "abstract": "Objective: To assess whether phacoemulsification cataract surgery exacerbates the development and progression of diabetic retinopathy (DR) in a cataract surgical cohort. Design: Clinic-based cohort study. Participants: Patients aged 65+ years undergoing cataract surgery at an eye clinic in Sydney, Australia, between 2004 and 2006. Methods: Digital retinal photography was performed after pupil dilation preoperatively and at 1-, 6-, and 12-month postoperative visits. DR was assessed using the modified Early Treatment Diabetic Retinopathy Study (ETDRS) classification. Preoperative and 1-month postoperative (baseline) photographs were compared side-by-side with 12-month postoperative photographs. Odds ratios (ORs) and 95% confidence intervals (CIs) were calculated for DR progression in operated (pseudophakic) compared with nonoperated (phakic) eyes, adjusted for age, sex, diabetes duration, and preoperative glycosylated hemoglobin level. Main Outcome Measures: Incident DR was defined in eyes without DR at baseline in which DR was detected at 12-month postoperative visits. DR progression was defined as an increase of 1 or more ETDRS steps during the same period, including incident cases. Results: Of 1994 surgical patients recruited, 190 (9.53%) with diabetes and complete data and thus were included. There were 56 patients with unilateral surgery performed before baseline (mean postoperative duration 3.3 +/- 3.3 years). The prevalence of DR at baseline was higher in these 56 pseudophakic eyes than in 324 phakic eyes (71.4% vs. 48.2%, respectively, adjusted OR 2.16; 95% CI, 1.16-4.03). Of the 190 patients, 169 were followed for 12+ months postoperatively; 278 eyes were pseudophakic, and 60 eyes remained phakic at 12 months. During the 12-month postoperative period, incident DR developed in 28.2% of pseudophakic eyes and 13.8% of phakic eyes (adjusted OR 2.65; 95% CI, 1.06-6.61). In a paired-eye comparison of 45 patients who remained unilaterally pseudophakic at 12 months and were at risk of DR progression, 35.6% of pseudophakic eyes exhibited DR progression compared with 20.0% of the fellow phakic eyes (adjusted OR 2.21; 95% CI, 0.85-5.71). Conclusions: Diabetic patients undergoing phacoemulsification cataract surgery appear to have a doubling of DR progression rates 12 months after Surgery. This outcome, however, represents less progression than was previously documented with intracapsular and extracapsular cataract surgical techniques. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2009;116:1510-1514 (C) 2009 by the American Academy of Ophthalmology.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b84fadc107fb1616e143c11a19c9bbd1",
  "timestamp": "2025-05-15T03:27:53.377001"
}