{
  "id": 4368,
  "title": "The prevalence of depression and associated risk factors among medical students: An untold story in Vietnam",
  "abstract": "Background Depression is a common mental health problem in medical students worldwide. The association between depression and motivation in Vietnamese medical students is not well-documented. Objectives To estimate the prevalence of self-reported depression and to identify associated risk factors among medical students at Hanoi Medical University (HMU). Method A cross-sectional study was conducted on medical students with clinical experience at HMU from November 2015 to January 2016. We used the multistage cluster random sampling technique to select and invite students to complete a questionnaire including demographic characteristics, Patient Health Questionnaire 9 (PHQ-9), Academic Motivation Scale (AMS), and International Physical Activity Questionnaire Short Form (IPAQ). Results Among 494 participants (78.8% response rate), the prevalence of self-reported depression was 15.2% (95% CI: 12.0%-19.0%), and suicidal ideation was 7.7% (95% CI: 6.2%-9.5%). Self-reported depression was significantly associated with perceived financial burden, physical inactivity, being senior student, perceived negative influence of night shifts, and non-self- determined motivation profile. Suicidal ideation was significantly associated with perceived financial burden and non-self-determined motivation profile. In the multivariable regression models, significant risk factors for self-reported depression were non-self-determined motivation (PR = 2.62, 95% CI: 1.68-4.07), perceived financial burden (PR = 1.95, 95% CI: 1.39-2.73), and vigorous level of physical activity (PR = 0.43, 95% CI: 0.20-0.942). For suicidal ideation, non-self-determined motivation (PR = 2.33, 95% CI: 1.13-4.80) and perceived financial burden (PR = 1.91, 95% CI: 1.16-3.13) were significant risk factors. Strengths and limitations The strengths of our study included a representative sample, a good response rate, and using a good depression screening tool. However, the PHQ-9 only allowed us to screen for depression, and the translation of the AMS and IPAQ into Vietnamese could potentially decrease these tools' validity. Conclusion The prevalence of self-reported depression and suicidal ideation in medical students is notably higher compared to the general population in Vietnam. Non-self-determined motivation and financial burden were the prominent risk factors for both the depression and suicidal ideation in medical students.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b85e075a5fb08c57b657633db75b4730",
  "timestamp": "2025-05-15T02:36:38.376456"
}