{
  "id": 6070,
  "title": "Depression in patients with HIV is under-diagnosed: a cross-sectional study in Denmark",
  "abstract": "Background International studies suggesting that 20-37% of HIV-positive patients have diagnosable depression may underestimate the prevalence of this condition. The aim of this study was to investigate the prevalence of depression among HIV-positive patients in an out-patient clinic in Denmark and to detect factors of importance for the development of depression. Methods In 2005, a population of 205 HIV-positive patients was included in a questionnaire-based study. The Beck Depression Inventory II (BDI-II) was used to assess the prevalence and severity of depressive symptoms. Patients with a BDI score of 20 or above were offered a clinical evaluation by a consultant psychiatrist. Results Symptoms of depression (BDI > 14) were observed in 77 (38%) patients and symptoms of major depression (BDI >= 20) in 53 (26%). Eighteen patients subsequently started treatment with anti-depressants. In a reduced logistic regression model, self-reported stress, loneliness, constant thoughts about HIV and being in a difficult financial situation were associated with risk of depression. Patients at risk of major depression were nearly six times more likely to have missed at least one dose of highly active antiretroviral therapy (HAART) in the 4 days prior to assessment (odds ratio 5.7, 95% confidence interval 1.7-18.6). There was a dose-response trend in relation to unsafe sex (P=0.03). Conclusions The study found that depression was under-diagnosed among HIV-positive patients and was associated with stress, loneliness, a difficult financial situation, low adherence and unsafe sex. Screening for depression should be conducted regularly to provide full evaluation and relevant psychiatric treatment. This is particularly important at the time of diagnosis and before initiating HAART.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b879b48c84d0675ac4fad1e4c9397603",
  "timestamp": "2025-05-15T02:54:38.738372"
}