{
  "id": 7177,
  "title": "Concordance with NCCN treatment guidelines: Relations with health care utilization, cost, and mortality in breast cancer patients with secondary metastasis",
  "abstract": "Background The impact of National Comprehensive Cancer Network (NCCN) treatment guideline concordance on costs, health care utilization, and mortality for patients with breast cancer and secondary metastases is unknown. Methods From 2007 to 2013, women with early-stage breast cancer who received treatment for secondary metastases (n = 5651) were evaluated for first recorded systemic therapy concordance with NCCN guidelines within the Surveillance, Epidemiology, and End Results Program-Medicare linked database. Generalized linear and mixed effects models evaluated factors associated with nonconcordance and the relation between concordance status and health care utilization and costs. Mortality risk was estimated with Cox regression. Results Eighteen percent of the patients received nonconcordant therapy, with the most common being single-agent, human epidermal growth factor receptor 2 (HER2)-targeted therapy (36%), therapy mismatched with the estrogen receptor/HER2 status (11%), unapproved bevacizumab regimens (10%), and adjuvant regimens in a metastatic setting (6%). A younger age, a hormone receptor-negative status, and a HER2-positive status were associated with nonconcordance (P < .05). Nonconcordance was associated with 22% and 21% increased rates of emergency department visits and hospitalizations, respectively, and $1765 higher average monthly Medicare costs. Differences in adjusted mortality risk were noted by the category of nonconcordance; single-agent, HER2-targeted therapy was associated with decreased mortality risk (hazard ratio [HR], 0.66; 95% confidence limit [CL], 0.57-0.76), and increased mortality risk was observed with unapproved bevacizumab use (HR, 1.40; 95% CL, 1.13-1.74). Conclusions Most patients (82%) received treatment consistent with NCCN guidelines. Nonconcordant treatment was associated with higher health care utilization and costs, with mortality differences observed by the type of guideline deviation. Consideration of both patient and financial outcomes will be important as health systems increase the emphasis on guideline-based care.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b87e012aff0b5b69e1254be4d5c1b5b2",
  "timestamp": "2025-05-15T03:06:01.176011"
}