{
  "id": 7790,
  "title": "Sleep disturbance and the older worker: findings from the Health and Employment after Fifty study",
  "abstract": "Objectives The aim of this study was to characterize the descriptive epidemiology of insomnia in midlife and explore the relative importance of different occupational risk factors for insomnia among older workers. Methods A questionnaire was mailed to all adults aged 50-64 years registered with 24 English general practices. Insomnia was defined as having at least one of four problems with sleep severely in the past three months. Subjects were also asked about employment conditions, feelings concerning work, and their health. Associations were assessed by logistic regression and population attributable fractions (PAF) calculated. Results Analysis was based on 8067 respondents (5470 in paid work), 18.8% of whom reported insomnia. It was more common among women, smokers, obese individuals, those living alone, and those in financial hardship, and less prevalent among the educated, those in South-East England, and those with friendships and leisure time pursuits. Occupational risk factors included unemployment, shift working, lack of control and support at work, job insecurity, job dissatisfaction and several of its determinants (lacking a sense of achievement, feeling unappreciated, having difficult work colleagues, feeling unfairly criticized). Population burden of insomnia was associated more strongly with difficulties in coping with work demands, job insecurity, difficult colleagues, and lack of friendships at work [population attributable fraction (PAF)15-33%] than shift work and lack of autonomy or support (PAF 5-7%). It was strongly associated with seven measures of poorer self-assessed health. Conclusions Employment policies aimed at tackling insomnia among older workers may benefit from focusing particularly on job person fit, job security and relationships in the workplace.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b88695c356bb54ed2e0e2939d514c598",
  "timestamp": "2025-05-15T03:12:11.624038"
}