{
  "id": 4022,
  "title": "Design of a conceptual framework for evaluating the performance of Broad-based Black Economic Empowerment laws (B-BBEE) on mutual funds' performance in South Africa",
  "abstract": "Purpose The paper examines the possible existence of systematic performance differences between Broad based Black Economic Empowerment (B-BBEE) affiliated and non-B-BBEE affiliated mutual fund firms in South Africa and see whether the indigenisation laws affect firm performance directly through their effects on firm behaviour. Design/methodology/approach The authors' baseline regression is a model features that varies between the observed groups in Fama-MacBeth regressions. To address the issue of how B-BBEE laws affect mutual funds' performance, the study follows Golec (1988, p. 77) in calculating mutual fund returns and follows Carhart's (1997) four-factor regression model. Findings The paper's results also cannot confirm with statistical significance the expectation motivated by theory that B-BBEE laws influence firm performance negatively, thus, predicting a block for foreign investment. The authors' much longer sample period (from 2004 to 2016) does not lead to significant other results than a prior study published only shortly after the B-BBEE laws coming into force. However, this study's results could not confirm that these laws have effects on firm performance. Research limitations/implications The authors chose all the 3,320 B-BBEE-affiliated mutual fund firms and 3,329 non-B-BBEE-affiliated ones in the Morningstar database that had complete data for the period 2004- 2016. Practical implications The study's results cannot confirm with statistical significance the expectation motivated by theory that B-BBEE laws influence firm performance negatively, thus, predicting a block for foreign investment. Originality/value B-BBEE laws have been topical in the South African mutual fund industry. The unit trust industry in South Africa started with the establishment of the Sage Fund in 1965 in order to cater for the normal investors' needs for an easy product that starts with low investment amounts, but offers professional assets management and wide risk diversification across an extensive shares portfolio, that can be liquidated at short notice.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b8a10967eb389e691e18b8aa94cd86a1",
  "timestamp": "2025-05-15T01:23:07.361545"
}