{
  "id": 3919,
  "title": "Auditor Relational Strategy and Risk of Fraudulent Financial Statements",
  "abstract": "This study examines how auditor relational strategy influences the risks of fraudulent financial statements. The study uses panel data regression on 2,890 year-observations of companies listed in Bursa Malaysia during the period 2013-2017 to evaluate possible relationships between auditor relational strategy and risks of fraudulent financial statements. The results reveal that utilising an auditor relational strategy adds value by assisting auditors in reducing the risks of fraudulent financial statements. This suggests auditors can maintain their scepticism despite close client relationships. The findings propose that even when auditor-client relationships are close, the risk of fraudulent financial statements can be diminished as long as auditors can uphold their independence in auditor relational strategy. Therefore, to ensure that scepticism remains a relevant and consistent practice among auditors, policymakers may need to consider updating the rules and regulations to ensure that auditors provide services with professional conduct. This study makes a valuable contribution to the literature by examining the importance of auditor relational strategy in assisting auditors in minimising risks of fraudulent financial statements from a network theory perspective to ensure that auditors provide services with professional conduct.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b8bde562da4288bd30b6691277dfff21",
  "timestamp": "2025-05-15T02:31:28.338318"
}