{
  "id": 4054,
  "title": "Cash management and performance of index mutual funds",
  "abstract": "Purpose This study aims to assess the relationship between cash management and fund performance in index fund portfolios. Design/methodology/approach Using a sample of 104 index mutual funds that track the Standard and Poor 500 stock market index from January 1999 to December 2016, the authors employ quintile portfolios and different regression models to assess the differences in risk-adjusted monthly returns experienced by index funds managing different cash levels in their portfolios. To ensure the robustness of the results, different sub-periods and market states are considered in the analyses as well as other exogenous factors and fund characteristics affecting the level of portfolio cash holdings and index fund performance. Findings Results show that index funds holding higher levels of cash and cash equivalents performed significantly worse than their low-cash counterparts. This evidence remains even after considering different sub-periods and bullish and bearish market conditions and controlling for fund expenses and other variables that could drive this cash-performance relationship. Originality/value This study expands the extant literature analyzing cash management in the mutual fund industry. More specifically, the analyses focus on index fund portfolios that replicate a specific benchmark, given that their performance differences should not be related to the market evolution but to the factors derived from the fund management and other exogenous issues. These findings are of interest to managers and investors willing to improve their risk-adjusted returns while investing as diversified as a stock market index.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b8beea7fb33b1d9e1c10e85e1966a46f",
  "timestamp": "2025-05-15T01:23:27.303902"
}