{
  "id": 4100,
  "title": "Widowhood and Mortality in India: Household Headship and Filial Expectations and Their Association with Mortality Among Older Widows",
  "abstract": "This study investigates the relationship between 'household headship and filial expectations' and 'risk of mortality' for widowed women aged 45 years and above in India. The study used the India Human Development Survey (IHDS), a nationally representative longitudinal survey. The results indicate no excess mortality risk for widows compared to married women, where widows or their sons were household heads. On the other hand, when the widows were in households headed by others (viz. brothers, sons-in-law, grandsons, and extended family members), widows had a heightened mortality risk compared to married women. Further, the analysis suggests that despite heading households if widows expected financial support from their sons, they had higher mortality than widows who did not expect financial support from their sons. The main results hold in multiple robustness checks. First, even after adjusting for the endogeneity between household headship and economic status using the instrument variable (IV) regression model, the results indicate that older widows in households headed by themselves had almost a 30% increased mortality risk compared to the rest of the widows. Second, the heterogeneity analysis suggests that household headship was linked with increased odds of mortality in widows if they were heading the household and did have financial expectations from their sons, particularly if they belonged to poor households and living in rural India. Given that the share of widows in the total older population is expected to rise considerably in the future, the findings assume importance for both policy and practice.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b8c1a758a8321ae2651eee0f8fec0c81",
  "timestamp": "2025-05-15T02:33:03.525804"
}