{
  "id": 6661,
  "title": "Exposure to Negative Life Events and Post-Traumatic Embitterment Symptoms in Young Adults in Korea: Cumulative and Differential Effects",
  "abstract": "Background: Post-traumatic embitterment disorder (PTED) has recently been introduced as a subgroup of adjustment disorders related to stressful life events. Embitterment is defined as persistent feelings of inadequacy or hoping for revenge after being insulted but feeling helpless after experiencing a life stressor. This study aims to investigate the cumulative and differential effects of negative life events on the risk of developing embitterment among young adults in South Korea. Methods: Data for the present study were collected from a web-based survey of 1,000 young adults aged 18-35 years. All participants completed a list of negative life events, the PTED Self-Rating Scale. Logistic regression analysis was conducted to evaluate the relationships between the number of negative life events and reactive embitterment. Analyses of the relationships between each negative life event and reactive embitterment were performed using co-variates, including childhood trauma, depression, and anxiety symptoms. Results: The total number of participants with reactive embitterment (cut-off scores >2.5) was 452 (45.2%). Greater exposure to negative life events increased the risk of reactive embitterment compared to no negative events. Negative life events, including financial problems, family problems, and being excluded by friends, had significant associations with the risk of reactive embitterment. Conclusions: The present study revealed a substantial number of young adults with a high level of embitterment. Furthermore, cumulative and differential effects of negative events increased the risk for reactive embitterment. Our findings underlined the crucial role of adverse life events in the development of reactive embitterment. (C) 2019 S. Karger AG, Basel",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b8d1cefcb5ac5bcf7fc28cefa0b36783",
  "timestamp": "2025-05-15T03:00:05.107913"
}