{
  "id": 5579,
  "title": "Boardroom dynamics in Indian private banks: how nonexecutive and women directors affect financial performance",
  "abstract": "PurposeThis study aims to investigate the influence of boardroom dynamics, particularly the presence of nonexecutive and women directors, on the financial performance of private banks in India.Design/methodology/approachThrough a mixed-method approach encompassing descriptive analysis, correlation analysis and generalized method of moments regression, data from 21 banks for 10 years, from 2013 to 2023, are meticulously scrutinized for patterns and trends.FindingsThis study reveals that board size, gender diversity and nonexecutive directors affect the financial performance of private-sector banks in India. Larger boards and nonexecutive directors improve return on assets and Tobin's Q, enhancing profitability and market valuation. In addition, the presence of women directors fosters better decision-making, highlighting the importance of governance structures in driving sustainable financial success.Research limitations/implicationsTheoretical implications of this research center on expanding the understanding of how specific corporate governance elements, such as board composition and independence, relate to financial performance, especially within the context of emerging economies like India. This study contributes to the development of corporate governance theory by emphasizing the significance of nonexecutive and women directors in enhancing firm value.Practical implicationsThis study underscores the significance of improved governance practices in private banks, benefiting a substantial portion of the population and stimulating overall economic growth. It supports regulatory initiatives aimed at enhancing board diversity and transparency to fortify market stability. Theoretical contributions validate agency theory and critical mass theory, providing deeper insights into governance's impact on financial performance. Practitioners can leverage these findings to refine decision-making and risk management strategies, ensuring long-term sustainability in the banking sector.Social implicationsSociety stands to benefit from improved governance practices, as transparent and accountable banks are better positioned to serve the needs of their stakeholders and contribute to economic growth and stability.Originality/valueThis study validates agency and critical mass theories, demonstrating that diverse board compositions enhance financial outcomes. Its originality lies in empirically validating these concepts within the Indian banking sector. It emphasizes the importance of both return on assets and Tobin's Q, offering valuable insights for effective governance and sustainable financial performance.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b8d2de2ee12a2cc963891ce2d3965e8c",
  "timestamp": "2025-05-15T02:49:21.635721"
}