{
  "id": 3522,
  "title": "Factors associated with financial toxicity in patients with transthyretin amyloidosis: results from Amyloidosis Research Consortium's treatment affordability patient and caregiver survey",
  "abstract": "Introduction: Transthyretin (ATTR) amyloidosis is an ultimately fatal disease. While approved therapies slow disease progression, the cost of care can be significant for patients. The objective of this survey was to describe the factors associated with financial toxicity of ATTR amyloidosis and the economic burden of care and treatment. Methods: The Amyloidosis Research Consortium (ARC) conducted an online survey in the United States for patients with ATTR amyloidosis and their caregivers. Financial toxicity was assessed using the COmprehensive Score for Financial Toxicity (COST). Multivariate linear regression was used to identify factors associated with financial toxicity controlling for key sociodemographic and patient characteristics. Results: Of 452 respondents, 249 (55%) reported financial toxicity. Respondents who reported financial toxicity predominantly had ATTRv amyloidosis, were younger, non-white, had a household income <$100,000, had multiple sources of insurance, and were less frequently retired. Respondents reported using several ways to offset the cost of treatment. Conclusions: Patients with ATTR amyloidosis experience significant financial distress that is comparable to patients with cancer, and as a result, many patients delay treatment or pay for treatment using savings and/or borrowing money. African American respondents (vs white) were significantly at risk.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b8ed7c3d72fa5567c1fe40ab99f01577",
  "timestamp": "2025-05-15T02:27:19.080987"
}