{
  "id": 5387,
  "title": "Accurate loss modelling in the DCOPF calculation for power markets via static piecewise linear loss approximation based upon line loading classification",
  "abstract": "The objective of this paper is to explore a better curve fitting technique that can improve the power flow accuracy of the piecewise linear loss modelling in the DC optimal power flow (DCOPF) calculation. The refinement of the DCOPF model is carried out in view of a power market that employs the locational marginal pricing principle for market clearing, performs multiple settlements and issues financial transmission rights. The piecewise linear loss modelling exhibits a typical advantage over the conventional purely linearised loss modelling in terms of the risk hedging capability of financial transmission rights. Unlike the available piecewise linear loss models with static parameters, the static curve fitting technique proposed in this paper evaluates loss parameters by means of some weighted error minimisation based upon a binary classification of the line loading level. Detailed mathematical procedure is developed to obtain the solution of the proposed curve fitting optimisation problem. The power flow accuracies of different linear and piecewise linear loss models that are suitable for the specified market framework are assessed and compared. Extensive case studies are performed on a 118-bus, a 1354-bus, and a 2383-bus systems to justify the merit of the proposed piecewise linear loss modelling technique.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9073b8b5c43853a1a17a365baf411f1",
  "timestamp": "2025-05-15T02:47:13.977840"
}