{
  "id": 5616,
  "title": "Refinement of the FCF motive for stock repurchases",
  "abstract": "Purpose The purpose of this paper is to investigate factors that influence the free cash flow (FCF) motive for stock repurchases. Specifically, it examines whether the positive association between FCF and open-market repurchases is partially driven by abnormal cash flows, and whether external analyst monitor and financial crisis influence the association. Design/methodology/approach The study employs a tobit regression model to test the hypotheses. Findings First, the results suggest that the positive association between FCF and stock repurchases is partially driven by abnormal cash flows. Second, the association between pre-managed FCF and stock repurchases is strengthened as more analyst following the firms. Third, firms repurchase less when they report more negative abnormal cash flows, and that tendency is more pronounced during the 2008 financial crisis period. Further analysis shows that during the crisis period, the effect of negative abnormal cash flows on operating performance gets stronger. Originality/value The study makes several contributions to the literature. This paper is the first to show that managers use abnormal cash flows to fulfill the share buy-backs. In addition, it shows that analysts provide effective external monitoring by strengthening the association between pre-managed FCF and repurchases. Furthermore, it finds that firms adjust their strategy in times of financial crisis period in response to the increased risk. Finally, it contributes to the earnings management literature by showing the differential effects of accruals management and cash flow management on earnings performance.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b90929354641e67d93fcd5d8815338e8",
  "timestamp": "2025-05-15T02:49:50.202210"
}