{
  "id": 2436,
  "title": "Financial toxicity among patients undergoing resectional surgery for inflammatory bowel disease in the United States",
  "abstract": "AimFinancial toxicity describes the financial burden and distress that patients experience due to medical treatment. Financial toxicity has yet to be characterized among patients with inflammatory bowel disease (IBD) undergoing surgical management of their disease. This study investigated the risk of financial toxicity associated with undergoing surgery for IBD.MethodsThis study used a retrospective analysis using the National Inpatient Sample from 2015 to 2019. Adult patients who underwent IBD-related surgery were identified using the International Classification of Diseases (10th Revision) diagnostic and procedure codes and stratified into privately insured and uninsured groups. The primary outcome was risk of financial toxicity, defined as hospital admission charges that constituted 40% or more of patient's post-subsistence income. Secondary outcomes included total hospital admission cost and predictors of financial toxicity.ResultsThe analytical cohort consisted of 6412 privately insured and 3694 uninsured patients. Overall median hospital charges were $21 628 (interquartile range $14 758-$35 386). Risk of financial toxicity was 86.5% among uninsured patients and 0% among insured patients. Predictors of financial toxicity included emergency admission, being in the lowest residential income quartile and having ulcerative colitis (compared to Crohn's disease). Additional predictors were being of Black race or male sex.ConclusionFinancial toxicity is a serious consequence of IBD-related surgery among uninsured patients. Given the pervasive nature of this consequence, future steps to support uninsured patients receiving surgery, in particular emergency surgery, related to their IBD are needed to protect this group from financial risk.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b91382c9b2755c48c55d4e07e3921fec",
  "timestamp": "2025-05-15T02:15:27.004527"
}