{
  "id": 1998,
  "title": "Unlocking financial innovation through strategic investments in information management: a systematic review",
  "abstract": "PurposeThe purpose of this study is to explore strategic investment in information management and its crucial role in driving financial innovation. By examining the integration of advanced technologies such as Artificial Intelligence (AI), Machine Learning (ML), Blockchain, Big Data Analytics, Cloud Computing, Large Language Models (LLMs), Robotic Process Automation (RPA), Internet of Things (IoT), Cybersecurity Technologies, and Quantum Computing, this research aims to highlight how these technologies enhance decision-making, operational effectiveness, risk management, and compliance within the financial sector.MethodologyThe study employs a comprehensive literature review of existing research to analyze the impact of strategic investment in information management on financial innovation. Key technologies are identified and their applications in finance are discussed. The methodology includes synthesizing findings from various sources to present a cohesive understanding of the relationship between information management, technology, and financial innovation.ResultsThe results indicate that strategic investment in information management significantly enhances financial innovation by leveraging advanced technologies. AI and ML improve predictive analytics and customer personalization, Blockchain ensures secure transactions and transparency, Big Data Analytics enables data-driven decision-making, and Cloud Computing provides scalable solutions. LLMs enhance natural language processing capabilities, RPA automates repetitive tasks, IoT facilitates real-time monitoring, Cybersecurity Technologies protect financial data, and Quantum Computing offers potential breakthroughs in financial modeling and encryption.ImplicationThe implications of this study suggest that financial institutions should prioritize strategic investments in information management and the adoption of advanced technologies to stay competitive and resilient in the evolving financial landscape. Effective information management practices enable better decision-making, improved operational efficiencies, enhanced risk management, and regulatory compliance, ultimately fostering financial innovation.ContributionThis study contributes to the existing body of knowledge by providing a detailed analysis of the role of strategic investment in information management and its impact on financial innovation. It highlights the importance of integrating advanced technologies in financial practices and offers insights into how these technologies can be leveraged to achieve innovative solutions and improvements in the financial sector. The findings serve as a valuable resource for financial institutions, policymakers, and researchers interested in the intersection of technology and finance. Efficient data management leads to better decision-making and improved operational effectiveness.Technology plays a key role in leveraging data for innovation in finance.Risk management and compliance are enhanced through effective information management practices.Collaboration and partnerships foster financial innovation and the development of innovative solutions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b922977c5554ef3caed1bdf3161fb76a",
  "timestamp": "2025-05-15T02:09:48.413949"
}