{
  "id": 3718,
  "title": "Complementary Variety: When Can Cooperation in Uncertain Environments Outperform Competitive Selection?",
  "abstract": "Evolving biological and socioeconomic populations can sometimes increase their growth rate by cooperatively redistributing resources among their members. In unchanging environments, this simply comes down to reallocating resources to fitter types. In uncertain and fluctuating environments, cooperation cannot always outperform blind competitive selection. When can it? The conditions depend on the particular shape of the fitness landscape. The article derives a single measure that quantifies by how much an intervention in stochastic environments can possibly outperform the blind forces of natural selection. It is a multivariate and multilevel measure that essentially quantifies the amount of complementary variety between different population types and environmental states. The more complementary the fitness of types in different environmental states, the proportionally larger the potential benefit of strategic cooperation over competitive selection. With complementary variety, holding population shares constant will always outperform natural and market selection (including bet-hedging, portfolio management, and stochastic switching). The result can be used both to determine the acceptable cost of learning the details of a fitness landscape and to design multilevel classification systems of population types and environmental states that maximize population growth. Two empirical cases are explored, one from the evolving economy and the other one from migrating birds.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b92842c4c028e772e11b53b909b28d69",
  "timestamp": "2025-05-15T01:20:03.479952"
}