{
  "id": 8926,
  "title": "Socioeconomic and Geographic Correlates of Intimate Partner Violence in Sri Lanka: Analysis of the 2016 Demographic and Health Survey",
  "abstract": "Intimate partner violence (IPV) is a serious public health issue and violation of human rights. The prevalence of IPV in South Asia is especially pronounced. We examined the associations between socioeconomic position (SEP), geographical factors and IPV in Sri Lanka using nationally representative data. Data collected from Sri Lanka's 2016 Demographic and Health Survey were analysed using multilevel logistic regression techniques. A total of 16,390 eligible ever-partnered women aged 15-49 years were included in the analysis. Analyses were also stratified by ethnicity, type of violence, neighbourhood poverty and post-conflict residential status for selected variables. No schooling/primary educational attainment among women (OR 2.46 95% CI 1.83-3.30) and their partners (OR 2.87 95% CI 2.06-4.00), financial insecurity (OR 2.17 95% CI 1.92-2.45) and poor household wealth (OR 2.64 95% CI 2.22-3.13) were the socioeconomic factors that showed the strongest association with any IPV, after adjusting for age and religion. These associations predominately related to physical and/or sexual violence, with weak associations for psychological violence. Women living in a post-conflict environment had a higher risk (OR 2.96 95% CI 2.51-3.49) of IPV compared to other areas. Ethnic minority women (Tamil and Moor) were more likely to reside in post-conflict areas and experience poverty more acutely compared to the majority Sinhala women, which may explain the stronger associations for low SEP, post-conflict residence and IPV found among Tamil and Moor women. Policies and programs to alleviate poverty, as well as community mobilisation and school-based education programs addressing harmful gender norms may be beneficial. Trauma informed approaches are needed in post-conflict settings. Further exploratory studies investigating the complex interplay of individual, household and contextual factors occurring in this setting is required.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b944c421eac97692053c0ab251296234",
  "timestamp": "2025-05-15T03:23:56.051779"
}