{
  "id": 909,
  "title": "The prevalence of diabetes and metabolic syndrome and associated risk factors in Sudanese individuals with gallstones: a cross sectional survey",
  "abstract": "Background: The gallstones are common health problem across the world with huge financial burden on health authorities. Obesity and insulin resistance are associated with risk of gallstones disease (GSD). The aim of this study was to assess the prevalence of metabolic syndrome (MetS) and diabetes and associated risk factors in Sudanese patients with gallstones. Methods: A prospective cross-sectional study, enrolled patients with gallstones attending Ibn Sina Specialized 'leaching Hospital for gastrointestinal and hepatobiliary diseases. A structured questionnaire was applied, anthropometric measures were taken, and blood tested for HbAlc, fasting glucose and lipid profile. Data was analysed using SPSS version 23. Results: A total number of 151 participants were recruited in the study, 71 of them were ultrasound confirmed GSD patients, and the other 80 were controls without GSD over a period of six months. The prevalence of the MetS and diabetes was 30% and 23.9% respectively. Borderline diabetes was 16.9% and overweight and obesity constituted more than half of the sample 59.6%. Using Chi-Square test, a statistically significant association was found between MetS and HDL, TG, LDL level, waist circumference and blood pressure (BP). Absolute predictors and the risk factors for gallstone disease were waist circumference, age, HbAlc and LDL. Conclusions: The prevalence of MetS and diabetes among gallstone patients was 30% and 23.9% respectively. Absolute predictors and the risk factors for gallstone disease were waist circumference, age, HbAlc and LDL.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b95311bad4dd7480aee4cbd44a81bf0e",
  "timestamp": "2025-05-15T01:43:54.721746"
}