{
  "id": 6915,
  "title": "From extraordinary to ordinary: how Moody's acquisition made ESG mainstream in credit ratings",
  "abstract": "PurposeThis study aims to analyse Moody's use of sustainable finance keywords in over 24,000 rating action reports from 2012 to 2024. Prior to Moody's 2019 acquisition of Vigeo Eiris (VE) - a specialist sustainable research firm - sustainable finance keywords were more closely associated with downgrades and conveyed a negative tone. Post-acquisition, the proportion of sustainable finance terminology increased, while its influence on rating outcomes diminished and conveyed a positive tone. These findings reflect broader systemic shifts driven by acquisitions, market forces and regulatory pressures, suggesting a normalization of sustainable finance factors in Moody's credit evaluations and marking their shift from exceptional to routine considerations.Design/methodology/approachThe study analyses over 24,000 Moody's rating action reports (2012-2024) to evaluate changes in the use of sustainable finance keywords before and after Moody's 2019 acquisition of VE. Sentiment analysis and statistical tests identify a significant increase in the use of sustainability terms post-acquisition, reflecting normalization and diminished association with credit downgrades. Pre-acquisition, such terms conveyed heightened credit risk. Post-acquisition, they became routine, positively framed and less correlated with negative outcomes. The methodology includes textual analysis, sentiment scoring using the Loughran-McDonald dictionary, regression models, and Chow tests to assess structural breaks in keyword trends.FindingsThe study finds that Moody's use of sustainable finance keywords increased significantly after its 2019 acquisition of VE, marking a shift toward routine integration of sustainability considerations. Pre-acquisition, such terms were rare, linked with downgrades and carried a negative tone, indicating heightened risk perceptions. Post-acquisition, keyword frequency rose, sentiment became less negative, and their association with downgrades diminished. This reflects a normalization of environmental, social and governance (ESG) factors in credit assessments, driven by Moody's enhanced expertise, market trends and regulatory pressures. The findings highlight the evolving role of ESG in credit evaluations, influencing perceptions of credit risk and capital allocation.Practical implicationsThe study highlights the transformative role of strategic acquisitions in integrating ESG considerations into financial assessments. For credit rating agencies, it underscores the importance of aligning methodologies with evolving market demands and regulatory expectations. Policymakers can leverage these findings to promote standardized ESG reporting and encourage sustainable finance integration. Investors benefit from more nuanced credit assessments that incorporate ESG factors, enabling informed capital allocation aligned with sustainability goals. For corporations, the normalization of ESG considerations incentivizes improved sustainability practices to achieve favourable ratings, influencing access to capital and financial strategies while fostering a more resilient global financial system.Originality/valueThis study provides novel insights into how ESG considerations evolve within credit rating methodologies following strategic acquisitions. By analysing over 24,000 Moody's reports, it is the first to demonstrate a significant shift in the frequency, sentiment and impact of sustainable finance keywords post-acquisition. Unlike prior research, which focuses on ESG's quantitative effects, this study explores narrative changes, revealing how sustainability factors transitioned from exceptional risks to routine considerations. It highlights the broader systemic forces - acquisitions, market demands, and regulation - that drive ESG integration, offering valuable contributions to academic discourse, financial market practices and sustainable investment strategies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9578dbecedf7fd88f7da22d635ed393",
  "timestamp": "2025-05-15T03:03:13.390681"
}