{
  "id": 8718,
  "title": "Association of Stroke and Cerebrovascular Pathologies With Scam Susceptibility in Older Adults",
  "abstract": "IMPORTANCE Scam susceptibility is associated with adverse financial and health outcomes, including an increased risk of cognitive decline and dementia. Very little is known about the role of cerebrovascular pathologies with scam susceptibility. OBJECTIVE To examine the association of diverse cerebrovascular pathologies (globally and regionally) with scam susceptibility. DESIGN, SETTING, AND PARTICIPANTS This clinical-pathological cohort study included participants from 2 ongoing studies of aging that began enrollment in 1994 and 1997. In 2010, participants were enrolled in the decision-making and behavioral economics substudy and were followed up for a mean (SD) of 3.4 (2.6) years prior to death. From 1365 older persons with clinical evaluations, 69 were excluded for having dementia at baseline. From 538 older persons who died, 408 had annual assessments for scam susceptibility, cardiovascular risk burden, and cognitive function and consented to brain donation for detailed neuropathologic examination. Data were analyzed from June 2021 through September 2022. EXPOSURES Neuropathologic examination identified the presence of macroscopic and microscopic infarcts, atherosclerosis, arteriolosclerosis, cerebral amyloid angiopathy, and common neurodegenerative pathologies (Alzheimer disease, limbic-predominant age-related transactive response DNA-binding protein 43 encephalopathy, and Lewy bodies). RESULTS There was a total of 408 participants. The mean (SD) age at death was 91 (6.1) years, the mean (SD) amount of education was 15.6 (3.1) years, and 297 (73%) were women. Participants included 4 Latino individuals (1%), 7 non-Latino Black individuals (2%), and 397 non-Latino White individuals (97%). The frequency of participants with macroscopic infarcts was 38% (n = 154), microinfarcts was 40% (n = 163), and moderate to severe vessel disease; specifically, atherosclerosis was 20% (n = 83), arteriolosclerosis was 25% (n = 100), and cerebral amyloid angiopathy was 35% (n = 143). In linear regression models adjusted for demographics and neurodegenerative pathologies, macroscopic infarcts were associated with greater scam susceptibility (estimate [SE], 0.18 [0.07]; P = .009). This association persisted after adjusting for cardiovascular risk burden and global cognition. Regionally, infarcts localized to the frontal, temporal, and occipital lobes and thalamus were associated with greater scam susceptibility. Neither arteriosclerosis, atherosclerosis, cerebral amyloid angiopathy, nor microinfarcts were associated with scam susceptibility. CONCLUSIONS AND RELEVANCE Cerebrovascular pathologies, specifically cerebral infarcts, is linked with greater scam susceptibility in older adults, independent of common neurodegenerative diseases such as Alzheimer disease. Future studies examining in vivo magnetic resonance imaging markers of cerebrovascular pathologies with scam susceptibility and related decision-making outcomes will be important.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b971f73c6fbc19f673cee28df44b053e",
  "timestamp": "2025-05-15T03:21:56.566118"
}