{
  "id": 8754,
  "title": "Coping with COVID-19: a prospective cohort study on young Australians' anxiety and depression symptoms from 2020-2021",
  "abstract": "BackgroundStudies have shown that the coronavirus (COVID-19) pandemic negatively impacted the mental health of young Australians. However, there is limited longitudinal research exploring how individual factors and COVID-19 related public-health restrictions influenced mental health in young people over the acute phase of the COVID-19 pandemic. This study aimed to identify risk and protective factors associated with changes in individual symptoms of anxiety and depression among young Australians during the COVID-19 pandemic.MethodsThis prospective cohort study collected data on anxiety and depression symptoms of young Australians aged 15-29 years old using the Depression, Anxiety and Stress Scale short form (DASS-21). We delivered four online questionnaires from April 2020 to August 2021 at intervals of 3, 6, and 12 months after the initial survey. We implemented linear mixed-effects regression models to determine the association among demographic, socioeconomic, lifestyle and COVID-19 public health restrictions related factors and the severity of anxiety and depression symptoms over time.ResultsAnalyses included 1936 young Australians eligible at baseline. There was a slight increase in DASS-21 anxiety mean scores from timepoint 3 to timepoint 4. DASS-21 depression scores showed slight fluctuations across timepoints with the highest mean score observed in timepoint 2. Factors associated with increases in anxiety and depression severity symptoms included LGBTQIA + identity, financial insecurity both before and during the pandemic, higher levels of loneliness, withdrawal or deferral of studies, spending more time on social media, and difficulties to sleep. Risk factors for only depression symptoms include unemployment during COVID-19 pandemic and being in lockdown. Living with someone was a protective factor for both anxiety and depression symptoms, pre-COVID-19 unemployment for depression symptoms, and older age and unemployment during the pandemic for anxiety symptoms.ConclusionThese findings indicate that during the first year of the pandemic in Australia, there were significant changes in young people's mental health which were associated with multiple demographic, socioeconomic, lifestyle, and lockdown factors. Hence, in future public health crises, we suggest more inclusive guidelines that involve young people in their development and implementation ensuring that their unique perspectives and needs are adequately considered.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9786b91696fb4a227527d0b38b47d2b",
  "timestamp": "2025-05-15T03:21:56.712233"
}