{
  "id": 3629,
  "title": "Risk connectedness between energy and stock markets: Evidence from oil importing and exporting countries",
  "abstract": "The surmounted environmental and energy challenges have motivated this study to explore the connectedness nexus between oil/renewable energy and stock markets for oil-exporting (importing) countries. We utilize the dynamic conditional correlation (DCC-GARCH) connectedness framework to compare the connectedness of oil/ renewable energy with stock markets. Our results showcase higher total connectedness between renewable energy and stock markets. We find increased connectedness during three major pandemics (Swine Flu, EBOLA, and COVID-19). We performed a regression analysis that highlighted the impact of economic and financial uncertainties on connectedness as an additional analysis. The addition of dummy variables for three major pandemics indicates that COVID-19 significantly impacted the connectedness between oil/renewable energy and stock markets. For the robustness of our results, we employed time-varying vector autoregressions (TVP-VAR) connectedness framework to showcase that our results remain qualitatively similar and robust to different specifications. We draw useful implications for oil exporting and oil importing countries in particular, and we draft ramifications for investors, portfolio managers, policymakers, and macroprudential bodies in general.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b97f8be5d7a05bb7c0ffdeb78dfd3365",
  "timestamp": "2025-05-15T01:19:00.789029"
}