{
  "id": 5889,
  "title": "Mediation of risk factors for high blood pressure in four racial and ethnic populations",
  "abstract": "This study evaluated the extent to which body mass index (BMI) mediates associations between risk factors and incident high blood pressure in American Indians and Alaska Natives (AI/ ANs), Non-Hispanic Whites (NHWs), Non-Hispanic Blacks (NHBs) and Hispanics. There were 7,793 participants from the National Longitudinal Study of Adolescent to Adult Health: 312 AI/ANs, 1,091 Hispanics, 1,567 NHBs and 4,823 NHWs. Risk factors for high blood obesity, parental educational attainment and financial instability. Relative risk regression models stratified by race/ethnicity were used to examine associations between risk factors and incident high blood pressure. Path analysis was used to assess mediation by BMI. Female sex was a protective factor against high blood pressure, and higher BMI was a risk factor in all populations. Smoking increased high blood pressure risk in AI/ANs (Incident Rate Ratio [IRR]: 1.14, 95% CI: 1.02-1.27), but not in other groups. BMI partially mediated the effect of parental obesity on high blood pressure in NHWs and completely mediated the effect of parental obesity in NHBs. In AI/ANs and Hispanics, BMI did not mediate the relationship between incident high blood pressure and any risk factor. This study assessed the extent to which BMI mediates risk factors for high blood pressure in four populations, and showed important differences across populations. Further research is needed to improve knowledge about relationships between BMI, risk factors and incident high blood pressure, and their potential variability by race/ethnicity.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b97f2e6531e82a35ace4a4a4e3c66205",
  "timestamp": "2025-05-15T02:52:31.450415"
}