{
  "id": 7121,
  "title": "A new method for calculating Risk Tolerance in the assessment of threatened flora",
  "abstract": "This paper reports on a proposed method for evaluating threat categories for regional flora, based mainly on phytogeographical data. The method involves the creation of current distribution maps, analysis of threat factors and use of the RAMAS Red List software to facilitate rapid and objective classification of taxa in accordance with 2001 IUCN criteria. In order to ensure a more objective approach by the assessor and reduce the range of uncertainty, an index was created for calculating Risk Tolerance (RT) that enabled adjustment of the results obtained and thus supplemented the software used. For trial purposes, the proposed model was applied to Spanish gypsophilous flora currently protected under Spanish regional legislation. When classified using the new model, the taxa in question were placed in very different categories, ranging from least concern (LC) to endangered (EN), indicating the need to redefine both their current legal status and recommended management measures. Use of this method will enable scientists to optimise available information on the geographical distribution of endangered taxa, and help governments both to optimise their financial investment in conservation and to define their priorities. The authors endorse the use of IUCN categories in legal protection texts, and advocate as essential a greater degree of coordination between scientists and governments. (C) 2013 Elsevier GmbH. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b993050a86feb72fd442a08bbebfbbfe",
  "timestamp": "2025-05-15T03:05:32.011904"
}