{
  "id": 3456,
  "title": "Do residual earnings price ratios explain cross-sectional variations in stock returns?",
  "abstract": "Purpose - Variations in price/earnings (P/E) ratios are explained in a rational expectations framework by a number of fundamental factors, such as differences in growth expectations and risk. The purpose of this paper is to use a regression model and data from four sample periods (1996, 2000, 2001, and 2008) to separate the earnings/price (E/P) ratio into two parts-the portion of E/P that is related to fundamental determinants and a residual portion that cannot be explained by fundamentals. The authors use the residual portion as an indicator of over or undervaluation; a large negative residual is consistent with overvaluation while a large positive residual implies undervaluation. The authors find that stocks with larger negative residuals are associated with lower subsequent returns and reward-to-risk ratio, while stocks with larger positive residuals are associated with higher subsequent returns and reward-to-risk ratio. This pattern persists for both one and two-year holding periods. Design/methodology/approach - This study uses a regression methodology to decompose E/P into two parts-the portion of E/P than is related to fundamental determinants and a residual portion that cannot be explained by fundamentals. Focussing on the second portion allows us to isolate a potential indicator of stock over or undervaluation. Using a sample of stocks from four time periods (1996, 2000, 2001, and 2008, the authors calculate the residuals from a regression model of the fundamental determinants of cross-sectional variation in E/P. These residuals are then ranked and used to divide the stock sample into deciles, with the first decile containing the stocks with the highest negative residuals (indicating overvaluation) and the tenth decile containing stocks with the highest positive residuals (indicating undervaluation). Total returns for subsequent one and two-year holding periods are then calculated for each decile portfolio. Findings - The authors find that high positive residual stocks substantially outperform high negative residual stocks. This is true even after risk adjustments to the portfolio returns. The residual E/P appears to accurately predict relative stock performance with a relatively high degree of accuracy. Research limitations/implications - The findings of this paper provide some important implications for practitioners and investors, particularly for the stock selection, fund allocations, and portfolio strategies. Practitioners can still rely on a valuation measure such as E/P as a useful tool for making successful investment decisions and enhance portfolio performance. Investors can earn abnormal returns by allocating more weights on stocks with high E/P multiples. Portfolios of high E/P multiples or undervalued stocks are found to enjoy higher risk-adjusted returns after controlling for the fundamental factors. The most beneficial performance holding period return will be for a relatively short period of time ranging from one to two years. Relying on the E/P valuation ratios for a long-term investment may add little value. Practical implications - Practitioners and academics have long relied on the P/E ratio as an indicator of relative overvaluation. An increase in the absolute value of P/E, however, does not always indicate overvaluation. Instead, a high P/E ratio can simply reflect changes in the fundamental factors that affect P/E. The authors find that stocks with larger negative residuals are associated with lower subsequent returns and coefficients of variation, while stocks with larger positive residuals are associated with higher subsequent returns and coefficients of variation. This pattern persists for both one and two-year holding periods. Originality/value - The P/E ratio is widely used, particularly by practitioners, as a measure of relative stock valuation. The ratio has been used in both cross-sectional and time series comparisons as a metric for determining whether stocks are under or overvalued. An increase in the absolute value of P/E, however, does not always indicate overvaluation. Instead, a high P/E ratio can simply reflect changes in the fundamental factors that affect P/E. If interest rates are relatively low, for example, the time series P/E should be correspondingly higher. Similarly, if the risk of a stock is low, that stock's P/E ratio should be higher than the P/E ratios of less risky stocks. The authors examine the cross-sectional behavior of the P/E (the authors actually use the E/P ratio for reasons explained below) after controlling for factors that are likely to fundamentally affect this ratio. These factors include the dividend payout ratio, risk measures, growth measures, and factors such as size and book to market that have been identified by Fama and French (1993) and others as important in explaining the cross-sectional variation in common stock returns. To control for changes in these primary determinants of E/P, the authors use a simple regression model. The residuals from this model represent the unexplained cross-sectional variation in E/P. The authors argue that this unexplained variation is a more reliable indicator than the raw E/P ratio of the relative under or overvaluation of stocks.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b99cb936468c4ed800897247fd401678",
  "timestamp": "2025-05-15T01:17:25.451820"
}