{
  "id": 7286,
  "title": "High Prevalence of Elder Abuse During the COVID-19 Pandemic: Risk and Resilience Factors",
  "abstract": "Objective: Before the COVID-19 pandemic, elder abuse affected one in 10 American older adults annually. It has been assumed that the pandemic has brought with it a surge in elder abuse due to individuals ordered to stay at home combined with increased interpersonal stressors. However, empirical evidence is lacking. This study aims to estimate the prevalence of, and risk and resilience factors of elder abuse during the pandemic. Methods: The survey was conducted via two online platforms during April 23 and May 5, 2020, when all states had stay-at-home orders. The final cohort consisted of a sociodemographically diverse sample of 897 older persons in the United States. The prevalence of elder abuse was evaluated by a validated measure previously used in a population-based study of elder abuse. Pandemic-related factors were examined at the community, relational, and individual contexts. We conducted multivariate logistic regression analyses to examine determinants of elder abuse. Results: One in five older persons in the study sample (n = 191; 21.3%) reported elder abuse, an increase of 83.6% from prevalence estimates before the pandemic. In the final models, sense of community emerged as a persistent protective factor for elder abuse (odds ratio [OR]: 0.89, 95% confidence interval [CI]: 0.85-0.93). At the relational level, physical distancing was associated with reduced risk of elder abuse (OR: 0.94, 95% CI: 0.90-0.98). At the individual level, financial strain was associated with increased risk of abuse (OR: 1.08, 95% CI: 1.02-1.14). Conclusion: Health care professionals and policy makers must be prepared to address the increase in elder abuse associated with the evolving pandemic.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9b038fb40d546d87f0f5bb7db614e69",
  "timestamp": "2025-05-15T03:07:02.622711"
}