{
  "id": 9267,
  "title": "A mixed-methods investigation of incident Hemodialysis access in a safety-net population",
  "abstract": "Background: Despite improved health outcomes associated with arteriovenous fistulas, 80% of Americans initiate hemodialysis using a catheter, influenced by low socioeconomic status among other factors. Risk factors for incident catheter use in safety-net populations are unknown. Our objective was to identify factors associated with incident catheter use among hemodialysis patients at one safety-net hospital, with a goal of informing fistula placement initiatives targeted at safety-net populations more generally. Methods: We performed a retrospective review of all incident hemodialysis patients at a single urban safety-net hospital from January 1, 2010 - December 31, 2015 (n = 241), as well as semi-structured interviews with a multi-lingual convenience sample of patients (n = 10) from this cohort. The primary outcome was incident vascular access modality. Multivariable logistic regression was used to identify factors associated with incident catheter use. Interview transcripts were coded using a directed content analysis framework based on a model describing barriers to healthcare access. Results: Subjects were 61.8% male, racially/ethnically diverse (19.5% white, 29.5% black, 28.6% Hispanic, 17.4% Asian), with a mean age of 52.4 years. Eighty-eight percent initiated hemodialysis using a catheter. In multivariable analysis, longer duration of nephrology care was associated with decreased catheter use (> 12 months vs. 0-6 months: adjusted Odds Ratio [aOR] 0.07, 95% CI 0.02-0.23, p < 0.001), whereas uninsured status increased odds of catheter use (aOR 3.96, 1.23-12.76, p = 0.02). There was a decrease in catheter use after vascular surgery services became available in-hospital (OR 0.40, 95% CI 0.16-0.98, p = 0.04), however this association was not significant in multivariable analysis (aOR 0.48, 0.17-1.36, p = 0.17). During interviews, patients cited emotional responses to disease, lack of social and financial resources, and limited health knowledge as barriers to obtaining fistula surgery. Conclusions: The rate of catheter use in this urban safety-net population is above the national average. Access to health insurance, early referrals to nephrology, and provision of in-hospital vascular surgery should be prioritized in the safety-net. Additionally, services that support patients' emotional and learning needs may decrease delays in fistula placement.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9bd8d209252eaab3ac4b93f7618e1d5",
  "timestamp": "2025-05-15T03:27:24.923648"
}