{
  "id": 2591,
  "title": "RISK ASSESSMENT OF FINANCIAL FAILURE FOR ROMANIAN QUOTED COMPANIES BASED ON THE SURVIVAL ANALYSIS",
  "abstract": "The impact and the negative consequences of financial failure recorded by the company on the interests of all stakeholders requires a thorough analysis of these phenomena, by reconsidering the methods and the statistical models that can provide guidance on different kind of failure risk prediction, especially on bankruptcy risk prediction. The main criticism of the statistical models aimed at predicting risk is that they ignore the changes that may occur over time in the characteristics of a company's financial situation. The present study aims to analyze the ability of a company to continue its activity without being in financial failure, like going into bankruptcy or recognizing the occurrence of adverse financial conditions. In order to analyze the influence over time of financial factors on the financial failure, the study estimated the parameters of econometric models using the survival analysis. The research results were obtained using the SPSS 20.0 statistical software, based on the survival analysis and the Cox regression models. The analyzed sample contains a total of 119 industrial companies, listed on the Bucharest Stock Exchange, RASDAQ section, that have met financial difficulties between 2006 and 2011. The research results revealed the influence of the global leverage and the return on assets on the probability of financial failure occurrence over time.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9c2fa88ace16a6a4b40d80f7af26d31",
  "timestamp": "2025-05-15T02:17:01.730032"
}