{
  "id": 3124,
  "title": "Examining drivers and deterrents of individuals' investment intentions: a qualitative multistage analysis",
  "abstract": "Purpose Even after appreciating multi-faceted merits of retail participation in stock markets and extensive efforts by policymakers and financial service industry to increase it, the present low retail participation in Indian stock markets is cause of grave concern. The purpose of this paper is to identify plausible drivers and deterrents of prospective and current household individuals through a multi-stage qualitative enquiry. Design/methodology/approach Two qualitative studies are conducted. In Study 1, scholarship of stakeholders is engaged through participative diamond model to propose behavioural classification of retail investors based on two-parameter framework. In Study 2, behavioural substructures of retail investors that drive or deter investment intentions and actions are identified through in-depth interviews. Findings Financial self-efficacy, past experience (own or peer group), financial eco-system, operational literacy, higher charges by financial experts and low liquidity in the hands of the investors are some key factors that influence investment intension and action of individual investors. Though digital platforms have helped to overcome hurdles faced by an investor but its availability, awareness and ease of use still remain a concern. Practical implications The inductive findings of this study uncover some important take-aways for the financial service industry - improve operational literacy, digital awareness, ease of use and incorporate risk assessments in client portfolios - and for the policymakers - improve investment eco-system through digital availability, financial literacy workshops focussed on operations. Originality/value To the best of the authors' knowledge, this study is one of the initial attempts to adopt a multi-stage qualitative enquiry to propose behavioural classification of retail investors and uncover reasons that drive or deter individual investors' intentions and actions in the context of Indian stock market. Moreover, this study provides necessary impetus to analyse and improve operational literacy (instead of financial literacy) and financial eco-system for higher retail participation.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9cbf3e1fd678e6110f183b5691823de",
  "timestamp": "2025-05-15T02:22:56.681033"
}