{
  "id": 8007,
  "title": "A healthy lifestyle pattern and the risk of symptomatic gallstone disease: results from 2 prospective cohort studies",
  "abstract": "Background: Symptomatic gallstones cause high financial and disease burden for public health systems. The combined role of diet and other lifestyle factors has not been studied so far. Objectives: We aimed to investigate the association between an a priori defined healthy lifestyle score (HLS, including healthy diet, moderate alcohol and regular coffee intakes, never smoking, physical activity, and normal weight) and the risk of symptomatic gallstone disease, and to estimate the proportion of cases potentially preventable by lifestyle modification. Methods: We followed 60,768 women from the Nurses' Health Study (NHS) and 40,744 men from the Health Professionals Followup Study (HPFS), both ongoing prospective cohort studies, from baseline (1986) until 2012. Symptomatic gallstone disease was self-reported and validated by review of medical records. The association between the HLS and the risk of symptomatic gallstone disease was investigated using Cox proportional hazards regression. Results: During 1,156,079 and 769,287 person-years of follow-up, respectively, 6946 women and 2513 men reported symptomatic gallstone disease. Comparing 6 with 0 points of the HLS, the multivariable HR of symptomatic gallstone disease was 0.26 (95% CI: 0.15, 0.45) for women, and 0.17 (95% CI: 0.07, 0.43) for men. For individual lifestyle factors, multivariable and mutually adjusted partial population attributable risks (women and men) were 33% and 23% for BMI <25 kg/m(2), 10% and 18% for >= 2 cups of coffee per day, 13% and 7% for moderate alcohol intake, 8% and 11% for a high Alternate Healthy Eating Index 2010, 9% and 5% for being physically active, and 1% and 5% for never smoking. The full population attributable risk percentage for all factors combined was 62% and 74%, respectively. Conclusions: Findings from these large prospective studies indicate that adopting a healthy lifestyle, especially maintaining a healthy weight, can help to prevent a considerable proportion of symptomatic gallstone diseases.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9d0bda58ffd0c57c6fca69ab830f838",
  "timestamp": "2025-05-15T03:14:07.323598"
}