{
  "id": 9449,
  "title": "Association of environmental and socioeconomic indicators with serious mental illness diagnoses identified from general practitioner practice data in England: A spatial Bayesian modelling study",
  "abstract": "Background The evidence is sparse regarding the associations between serious mental illnesses (SMIs) prevalence and environmental factors in adulthood as well as the geographic distribution and variability of these associations. In this study, we evaluated the association between availability and proximity of green and blue space with SMI prevalence in England as a whole and in its major conurbations (Greater London, Birmingham, Liverpool and Manchester, Leeds, and Newcastle). Methods and findings We carried out a retrospective analysis of routinely collected adult population (>= 18 years) data at General Practitioner Practice (GPP) level. We used data from the Quality and Outcomes Framework (QOF) on the prevalence of a diagnosis of SMI (schizophrenia, bipolar affective disorder and other psychoses, and other patients on lithium therapy) at the level of GPP over the financial year April 2014 to March 2018. The number of GPPs included ranged between 7,492 (April 2017 to March 2018) to 7,997 (April 2014 to March 2015) and the number of patients ranged from 56,413,719 (April 2014 to March 2015) to 58,270,354 (April 2017 to March 2018). Data at GPP level were converted to the geographic hierarchy unit Lower Layer Super Output Area (LSOA) level for analysis. LSOAs are a geographic unit for reporting small area statistics and have an average population of around 1,500 people. We employed a Bayesian spatial regression model to explore the association of SMI prevalence in England and its major conurbations (greater London, Birmingham, Liverpool and Manchester, Leeds, and Newcastle) with environmental characteristics (green and blue space, flood risk areas, and air and noise pollution) and socioeconomic characteristics (age, ethnicity, and index of multiple deprivation (IMD)). We incorporated spatial random effects in our modelling to account for variation at multiple scales. Across England, the environmental characteristics associated with higher SMI prevalence at LSOA level were distance to public green space with a lake (prevalence ratio [95% credible interval]): 1.002 [1.001 to 1.003]), annual mean concentration of PM2.5 (1.014 [1.01 to 1.019]), and closeness to roads with noise levels above 75 dB (0.993 [0.992 to 0.995]). Higher SMI prevalence was also associated with a higher percentage of people above 24 years old (1.002 [1.002 to 1.003]), a higher percentage of ethnic minorities (1.002 [1.001 to 1.002]), and more deprived areas. Mean SMI prevalence at LSOA level in major conurbations mirrored the national associations with a few exceptions. In Birmingham, higher average SMI prevalence at LSOA level was positively associated with proximity to an urban green space with a lake (0.992 [0.99 to 0.998]). In Liverpool and Manchester, lower SMI prevalence was positively associated with road traffic noise >= 75 dB (1.012 [1.003 to 1.022]). In Birmingham, Liverpool, and Manchester, there was a positive association of SMI prevalence with distance to flood zone 3 (land within flood zone 3 has >= 1% chance of flooding annually from rivers or >= 0.5% chance of flooding annually from the sea, when flood defences are ignored): Birmingham: 1.012 [1.000 to 1.023]; Liverpool and Manchester: 1.016 [1.006 to 1.026]. In contrast, in Leeds, there was a negative association between SMI prevalence and distance to flood zone 3 (0.959 [0.944 to 0.975]). A limitation of this study was because we used a cross-sectional approach, we are unable to make causal inferences about our findings or investigate the temporal relationship between outcome and risk factors. Another limitation was that individuals who are exclusively treated under specialist mental health care and not seen in primary care at all were not included in this analysis. Conclusions Our study provides further evidence on the significance of socioeconomic associations in patterns of SMI but emphasises the additional importance of considering environmental characteristics alongside socioeconomic variables in understanding these patterns. In this study, we did not observe a significant association between green space and SMI prevalence, but we did identify an apparent association between green spaces with a lake and SMI prevalence. Deprivation, higher concentrations of air pollution, and higher proportion of ethnic minorities were associated with higher SMI prevalence, supporting a social-ecological approach to public health prevention. It also provides evidence of the significance of spatial analysis in revealing the importance of place and context in influencing area-based patterns of SMI.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9d1aa79f2b7f79175e2a6e7827dc21f",
  "timestamp": "2025-05-15T03:28:46.363978"
}