{
  "id": 1137,
  "title": "Understanding the Offline Criminal Behavior of Individuals Who Live Stream Child Sexual Abuse",
  "abstract": "Live streaming of child sexual abuse (CSA) involves the procurement and viewing of sexual abuse of children across the internet in real time, in exchange for money. These offenses leave little tangible evidence of the offense beyond a financial transaction, and metadata relating to the live-streaming session. This research analyzed the demographic, criminal history, and financial transaction characteristics of 209 individuals who live streamed child sexual abuse. A machine learning clustering technique was implemented to consider whether there were sub-groups present among these offenders, and in particular the prevalence of contact sexual offending among any detected sub-groups. Findings revealed that offenders tend to engage in live streaming around the same age, before making regular transactions with facilitators at brief intervals, with the majority of offenders featuring limited criminal history. This analysis identified a notable sub-group of live-streaming offenders that also engaged in contact sexual offending. This is the first study to empirically demonstrate an intersection between live streaming of CSA, and contact sexual offenses against children and adults. This research highlighted the importance of financial transactions data in detecting, and disrupting this crime type. Further, the identification of an intersection between live-streaming CSA offenders, and contact sexual offenders suggests that these individuals may pose a risk to both local and international communities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9d984e9719c264f42fff3204ddabc14",
  "timestamp": "2025-05-15T01:59:21.628339"
}