{
  "id": 8009,
  "title": "Risk indicators of edentulism, partial tooth loss and prosthetic status among black and white middle-aged and older adults",
  "abstract": "Objectives: To describe the prevalence and risk indicators of edentulism; to describe the frequencies of wearing removable dentures; to describe the prevalence and risk indicators of fixed prosthetic restorations; to test the hypothesis that fixed prosthetic restorations are most likely to have been placed in persons at lower risk for dental and periodontal diseases, and to test the hypothesis that, with dental disease, dental behaviors, dental attitudes and ability to afford crowns taken into account, blacks are less likely than whites to have received crowns. Methods: The Florida Dental Care Study is a cohort study of subjects 45 years old or older. A telephone screening interview was done as a first stage to identify 5254 subjects who met eligibility requirements and who self-reported whether they were edentulous. In a second stage, a subsample of dentate subjects was contacted after they completed their telephone screening interview. Of these, 873 subjects completed a baseline in-person inter-view and dental examination. Results: A total of 19% of first-stage subjects were edentulous. In a single multiple logistic regression, having a poorer self-rated level of general health was significantly associated with edentulism, as were being poor, older and white. Among the second-stage participants (all of whom were dentate), several prosthetic Patterns were observed. For example, a total of 64% of maxillary full denture wearers reported wearing their denture all the time. Participants had also received numerous fixed prosthodontic services. The proportion of subjects with at least one crown varied widely by subject characteristics. Conclusions: A substantial percentage of non-ideal frequencies of wearing removable prostheses was reported, as were prosthesis-related soreness and broken prostheses. Although we expected and observed an association between having a fixed prosthetic crown and periodontal status, dental fillings, dental attitudes and financial resources, a residual association with race suggests that blacks are much less likely to receive prosthetic crowns. The several possible reasons for this circumstance warrant further investigation.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "b9efed909d7f79876264f948067ba69b",
  "timestamp": "2025-05-15T03:14:07.337676"
}