{
  "id": 1174,
  "title": "Portfolio Optimization for Pension Purposes: Literature Review",
  "abstract": "This systematic review identifies persistent challenges and gaps in the literature on pension portfolio optimization models. We searched, selected, and critically analyzed 82 articles from three major academic databases published over the past decade to investigate the barriers to the effective implementation of these models. Most studies primarily focus on traditional portfolio optimization approaches, often overlooking recent innovations and the unique structural characteristics of pension systems. While the number of publications has grown steadily over the past 10 years, reflecting increasing academic interest in the topic, our analysis reveals a continued need for substantive research advances to bridge existing gaps. Key challenges include the lack of models tailored to the specific features of pension funds, limited attention to longevity and sustainability constraints, and insufficient application of innovative methods to address sector-specific demands. This study highlights the importance of future research that incorporates advanced machine learning techniques, develops ESG-aligned and sustainability-oriented optimization frameworks, and more effectively models regulatory and demographic constraints. These directions are essential for enhancing the robustness and relevance of pension portfolio models and to support more effective, long-term pension fund management.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ba1c5a80c72496db13838907d09e3804",
  "timestamp": "2025-05-15T00:52:33.881315"
}