{
  "id": 3395,
  "title": "DOES ADOPTION OF MULTIPLE CLIMATE-SMART PRACTICES IMPROVE FARMERS' CLIMATE RESILIENCE? EMPIRICAL EVIDENCE FROM THE NILE BASIN OF ETHIOPIA",
  "abstract": "There is a paucity of information on conditioning factors that hinder or promote adoption of multiple climate-smart practices and on the synergies among such practices in increasing household resilience by improving agricultural income. This study analyzes how heat, rainfall, and rainfall variability affect farmers' choices of a portfolio of potential climate smart practices - agricultural water management, improved crop seeds, and fertilizer - and the impact of these practices on farm income in the Nile Basin of Ethiopia. We apply a multinomial endogenous switching regression approach by modeling combinations of practices and net farm income for each combination as depending on household and farm characteristics and on a set of climatic variables based on geo-referenced historical precipitation and temperature data. A primary result of this study is that farmers are less likely to adopt fertilizer (either alone or in combination with improved varieties) in areas of greater rainfall variability. However, even when there is high variability in rainfall, farmers are more likely to adopt these two yield-increasing inputs when they choose to (and are able to) include the third part of the portfolio: agricultural water management. Net farm income responds positively to agricultural water management, improved crop variety or fertilizer when they are adopted in isolation as well as in combination. But this effect is greater when these practices are combined. Simulation results suggest that a warming temperature and decreased precipitation in future decades will make it less likely that farmers will adopt practices in isolation but more likely that they will adopt a combination of practices. Hence, a package approach rather than a piecemeal approach is needed to maximize the synergies implicit in various climate smart practices.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ba2a165f8b1c410a5ea7cfd04a220a46",
  "timestamp": "2025-05-15T01:16:55.393174"
}