{
  "id": 8612,
  "title": "Determinants of Direct Medical Costs in Primary and Revision Total Knee Arthroplasty",
  "abstract": "TKA procedures are increasing rapidly, with substantial cost implications. Determining cost drivers in TKA is essential for care improvement and informing future payment models. We determined the components of hospitalization and 90-day costs in primary and revision TKA and the role of demographics, operative indications, comorbidities, and complications as potential determinants of costs. We studied 6475 primary and 1654 revision TKA procedures performed between January 1, 2000, and September 31, 2008, at a single center. Direct medical costs were measured by using standardized, inflation-adjusted costs for services and procedures billed during the 90-day period. We used linear regression models to determine the cost impact associated with individual patient characteristics. The largest proportion of costs in both primary and revision TKA, respectively, were for room and board (28% and 23%), operating room (22% and 17%), and prostheses (13% and 24%). Prosthesis costs were almost threefold higher in revision TKA than in primary TKA. Revision TKA procedures for infections and bone and/or prosthesis fractures were approximately 25% more costly than revisions for instability and loosening. Several common comorbidities were associated with higher costs. Patients with vascular and infectious complications had longer hospital stays and at least 80% higher 90-day costs as compared to patients without complications. High prosthesis costs in revision TKA represent a factor potentially amenable to cost containment efforts. Increased costs associated with demographic factors and comorbidities may put providers at financial risk and may jeopardize healthcare access for those patients in greatest need. Level IV, economic and decision analyses. See Instructions for Authors for a complete description of levels of evidence.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ba2fd3ab7a0d2bf7cfb3d30517e54010",
  "timestamp": "2025-05-15T03:20:22.411898"
}