{
  "id": 8821,
  "title": "Insurance-Based Disparities in Congenital Cardiac Operations in the Era of the Affordable Care Act",
  "abstract": "A body of literature has previously highlighted the impact of health insurance on observed disparities in congenital cardiac operations. With aims of improving access to healthcare for all patients, the Affordable Care Act (ACA) expanded Medicaid coverage to nearly all eligible children in 2010. Therefore, the present population-based study aimed to examine the association of Medicaid coverage with clinical and financial outcomes in the era the ACA. Records for pediatric patients (<= 18 years) who underwent congenital cardiac operations were abstracted from the 2010-2018 Nationwide Readmissions Database. Operations were stratified using the Society of Thoracic Surgeons-European Association for Cardio-Thoracic Surgery (STAT) Category. Multivariable regression models were developed to evaluate the association of insurance status on index mortality, 30-day readmissions, care fragmentation, and cumulative costs. Of an estimated 132,745 hospitalizations for congenital cardiac surgery from 2010 to 2018, 74,925 (56.4%) were insured by Medicaid. The proportion of Medicaid patients increased from 57.6 to 60.8% during the study period. On adjusted analysis, patients with Medicaid insurance were at an increased odds of mortality (1.35, 95%CI: 1.13-1.60) and 30-day unplanned readmission (1.12, 95%CI: 1.01-1.25), experienced longer lengths of stay (+ 6.5 days, 95%CI 3.7-9.3), and exhibited higher cumulative hospitalization costs (+ $21,600, 95%CI: $11,500-31,700). The total hospitalization cost-burden for patients with Medicaid and private insurance were $12.6 billion and $8.06 billion, respectively. Medicaid patients exhibited increased mortality, readmissions, care fragmentation, and costs compared to those with private insurance. Our results of outcome variation by insurance status indicate the necessity of policy changes to attempt to approach equality in surgical out comes for this high-risk cohort. [GRAPHICS] .",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ba39166da8c74661b8822810a8c98b81",
  "timestamp": "2025-05-15T03:22:57.872883"
}