{
  "id": 8686,
  "title": "Gender Inequality in Out-of-pocket Expenditure on Healthcare Among Persons with Disabilities in India",
  "abstract": "Background: People with disabilities (PWDs) often face higher risk of financial burden towards healthcare. Higher out-of-pocket expenditure (OOPE) is a barrier towards accessing medical services, resulting in healthcare inequities between men and women. There is a lack of studies on gender disparities in healthcare burden among PWD in India. The present study examines gender inequality towards healthcare expenditure among PWDs in India.Methods: Unit level data from the Persons with Disabilities in India Survey under the National Sample Survey, 76th round that covered 118,152 households involving 576,569 individuals of whom 106,894 had at least one disability was used. We performed secondary analysis using descriptive statistics, bivariate estimates, Blinder-Oaxaca decomposition and multilevel log-linear regression to meet the objective of the study.Results: OOPE as a percent of monthly per capita expenditure was higher among males across all states of India except in Puducherry, Dadra and Nagar Haveli, Lakshadweep and Mizoram. This varied from 0.6% in Jammu and Kashmir to 20% in Nagaland. Multilevel analysis confirms that OOPE was significantly lesser among females (beta = -0.070, 95% confidence interval = - 0.129 to 0.01) compared to males after controlling demographic and disability-related predictors. PWDs reported higher healthcare burden as a percent of total household expenditure in India, and relatively less amount was spent on female healthcare compared to male healthcare.Conclusion: A substantial gender inequality for healthcare expenditure is found among PWDs in India. This makes for an urgent call to health researchers and policymakers towards gender-sensitive research, policy formulation and program implementation for PWDs in India.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ba639839a9aad3278361a8438df5d50f",
  "timestamp": "2025-05-15T03:21:24.678509"
}