{
  "id": 8841,
  "title": "Social inequality in cancer survivorship: Educational differences in health-related quality of life among 27,857 cancer survivors in Denmark",
  "abstract": "BackgroundWith a growing population of cancer survivors in Denmark, the evaluation of health-related quality of life (HRQoL) has become increasingly important. We describe variations in HRQoL between educational groups in a national population of cancer survivors.MethodsWe conducted a cross-sectional questionnaire study among breast, prostate, lung, and colon cancer survivors diagnosed in 2010-2019 in Denmark. We used the EORTC QLQ-C30 to assess HRQoL including physical, role, emotional, cognitive, social functioning, and symptoms (fatigue, nausea and vomiting, pain, dyspnea, insomnia, appetite loss, constipation, diarrhea, and financial difficulties). Information on educational level and clinical data were extracted from national registers and clinical databases. Levels of impaired functioning and severe symptoms were identified using newly established thresholds for clinical importance. Multivariate logistic regression was used to examine associations between education and HRQoL. All statistical tests were 2-sided.ResultsIn total, 27,857 (42%) participated in the study. Up to 72% and 75% of cancer survivors with short education (<= 9 years) reported impaired functioning and severe symptoms, respectively. Cancer survivors with short compared to long education (>12 years) were more likely to report impaired functioning and severe symptoms, with for example significantly higher odds ratios (ORs) for impaired physical function (breast OR = 2.41, 99% CI = 2.01-2.89; prostate OR = 1.81, 99% CI = 1.48-2.21; lung OR = 2.97, 99% CI = 1.95-4.57; and colon cancer OR = 1.69, 99% CI = 1.28-2.24).ConclusionsCancer survivors with short education are at greater risk of impaired HRQoL than survivors with long education 2-12 years after diagnosis. This underscores the need for systematic screening and symptom management in cancer aftercare, in order to reach all cancer survivors, also cancer survivors with short education.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ba6304c005928c1799af018ce56d98ba",
  "timestamp": "2025-05-15T03:22:57.919015"
}