{
  "id": 714,
  "title": "Enhancing Portfolio Returns by Identifying High Growth Companies in Indian Stock Market Using Artificial Intelligence",
  "abstract": "The Indian Stock market, with over 5000 listed companies, where sorting of companies requires analysis of numerous financial parameters and ratios, is an example of a database from which single sub set or group of companies need to be found out for investing. With growing popularity of artificial intelligence in stock trading, it has been applied heavily into stock market for picking stocks. We apply K-means clustering algorithm, which uses unsupervised learning for clustering a dataset, to the listed Indian companies in an attempt to isolate businesses showing exceptionally high growth. The results show that, it is possible to achieve such grouping in an efficient and timely manner by K-means clustering. Testing of results is done by comparing absolute price returns and risk-adjusted returns of the obtained cluster and that of the popular and relevant market indices and top performing funds. The returns obtained from the cluster obtained using K-means clustering algorithm are found to outperform the indices and mutual funds by a comprehensive margin. These results emphasizes the role played by growth in stock performance in emerging markets along with subsequent conclusions arrived at therein, have important implications in the field of stock selection and portfolio management.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ba67ac3dc50a528856b3811dd10d1976",
  "timestamp": "2025-05-15T01:54:33.981542"
}