{
  "id": 420,
  "title": "RISK, RETURN AND INTERNATIONAL PORTFOLIO DIVERSIFICATION: K-MEANS CLUSTERING DATA",
  "abstract": "The work is devoted to the study of the international investment portfolio, its features such as risk, profitability and the level of international diversification, as well as global flows of portfolio investments. The methodology of the work is as follows. The paper develops k-means clustering model to study the patterns of global portfolio investment flows and equity markets. The model groups 30 developed and emerging stock markets according to three variables: return, risk and the level of international diversification. Thus, the main purpose of this paper is to investigate different stock markets on a global scale through an in-depth analysis of the respective market portfolios and their measures of risk, return and international diversification, as well as their interrelationships. The researcher develops and builds the model in such a way as to either confirm or refute the hypotheses put forward. The results of the study demonstrate the following results, which present opportunities for further research. The study supports the hypothesis that portfolios of investors from developed stock markets have a better level of international diversification than portfolios of investors from emerging stock markets. However, there is high within -group variation in the levels of international diversification among developed markets. There are three groups of developed markets based on the level of international diversification of investors in their respective markets: low-level markets (ca. 22%); mid-level markets (43%); and high-level markets (ca. 61%), while emerging markets are generally more heterogeneous. The hypothesis that stock markets that are domestic to investors with higher levels of international diversification have higher rates of return and lower rates of risk has not been confirmed. In general, developed stock markets are characterized by higher returns and international diversification with lower risk ratios. Nevertheless, the higher level of international diversification in developed market portfolios is not always accompanied by better stock performance. The best risk-return ratio (return - 0.46%, risk - 5.56%) is observed for markets from the cluster with an average level of international diversification. While the markets in the cluster with the highest level of international diversification have unreasonably high-risk ratios, which are not compensated by better returns. Markets in the cluster with lower levels of international diversification have unreasonably low rates of return that are not accompanied by correspondingly lower risks.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ba6fc2f0171e9310f3c060f3f6641f63",
  "timestamp": "2025-05-15T00:43:10.554682"
}