{
  "id": 5853,
  "title": "Association Between Cardiothoracic Fellows and Clinical and Financial Outcomes in Coronary Surgery",
  "abstract": "Introduction: Mounting financial pressures on academic institutions highlight the need to understand the effect on outcomes from trainee involvement in cardiac surgery. The purpose of this study is to examine the association between cardiothoracic fellows and clinical and financial outcomes in coronary artery bypass grafting (CABG). Methods: Data for all patients from 2017 to 2022 at a single institution who underwent nonemergent, isolated, open CABG were included in the study, with patients grouped by whether there was fellow operative participation. Financial and clinical outcomes were compared between the two groups using multivariable regression and generalized estimating equations to control for variation in patient characteristics and attending cardiac surgeon practices. Results: A total of 1997 patients met criteria for study inclusion, with 632 (31.5%) cases that had fellow participation and 1365 (68.4%) that did not. Patients in the fellow participation group had a 0.8% higher median preoperative risk score than those that did not have fellow participation. Fellow participation was associated with significantly longer total case length (61 mins) but no differences in postoperative clinical outcomes. There was an increased median total hospitalization cost of approximately $2200 in cases with fellow participation, likely attributable to increased intraoperative costs from longer case times. Conclusions: While CT surgery fellow participation was associated with longer operative times and a small increase in hospitalization cost in CABG, there were no significant differences in clinical outcomes. Continuing to train cardiothoracic surgery fellows in this procedure is safe and would not be expected to significantly impact reimbursement under bundled payment models.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ba8289fefea22d2d9247099fd1f09853",
  "timestamp": "2025-05-15T02:51:58.705698"
}