{
  "id": 8725,
  "title": "Identifying Factors Associated With Heightened Anxiety During Breast Cancer Diagnosis Through the Analysis of Social Media Data on Reddit: Mixed Methods Study",
  "abstract": "Background: More than 85% of patients report heightened levels of anxiety following breast cancer diagnosis. Anxiety may become amplified during the early stages of breast cancer diagnosis when ambiguity is high. High levels of anxiety can negatively impact patients by reducing their ability to function physically, make decisions, and adhere to treatment plans, with all these elements combined serving to diminish the quality of life. Objective: This study aimed to use individual social media posts about breast cancer experiences from Reddit (r/breastcancer) to understand the factors associated with breast cancer-related anxiety as individuals move from suspecting to confirming cancer diagnosis. Methods: We used a mixed method approach by combining natural language processing-based computational methods with descriptive analysis. Our team coded the entire corpus of 2170 unique posts from the r/breastcancer subreddit with respect to key variables, including whether the post was related to prediagnosis, diagnosis, or postdiagnosis concerns. We then used Linguistic Inquiry and Word Count (LIWC) to rank-order the codified posts as low, neutral, or high anxiety. High-anxiety posts were then retained for deep descriptive analysis to identify key themes relativeto diagnostic progression. Results: After several iterations of data analysis and classification through both descriptive and computational methods, we identified a total of 448 high-anxiety posts across the 3 diagnostic categories. Our analyses revealed that individuals experience higher anxiety before a confirmed cancer diagnosis. Analysis of the high-anxiety posts revealed that the factors associated with anxiety differed depending on an individual's stage in the diagnostic process. Prediagnosis anxiety was associated with physical symptoms, cancer-related risk factors, communication, and interpreting medical information. During the diagnosis period, high anxiety was associated with physical symptoms, cancer-related risk factors, communication, and difficulty navigating the health care system. Following diagnosis, high-anxiety posts generally discussed topics related to treatment options, physical symptoms, emotional distress, family, and financial issues. Conclusions:This study has practical, theoretical, and methodological implications for cancer research. Content analysis reveals several possible drivers of anxiety at each stage (prediagnosis, during diagnosis, and postdiagnosis) and provides key insights into how clinicians can help to alleviate anxiety at all stages of diagnosis. Findings provide insights into cancer-related anxiety as a process beginning before engagement with the health care system: when an individual first notices possible cancer symptoms. Uncertainty around physical symptoms and risk factors suggests the need for increased education and improved access to trained medical staff who can assist patients with questions and concerns during the diagnostic process. Assistance in understanding technical reports, scheduling, and patient-centric clinician behavior may pinpoint opportunities for improved communication between patients and providers.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ba8b5b41b53d6ce143b33572548816aa",
  "timestamp": "2025-05-15T03:21:56.597524"
}