{
  "id": 7318,
  "title": "Evaluating Outcomes for Women with Metastatic Breast Cancer: Palliative Care Consultations, Hospital Charges, and Length of Stay",
  "abstract": "Introduction: Women with late-stage metastatic breast cancer are at an increased risk of pain and distress from symptoms and often struggle with associated emotional and financial burden of their disease. Palliative care is known to alleviate symptom burden in patients with end-stage, terminal diseases but is often underutilized in both inpatient and outpatient settings. The current study aims to investigate the prevalence of palliative care consultation on inpatients with metastatic breast cancer and examine the association between palliative care consultation and length of hospital stay and total hospital charges. Methods: Patients diagnosed with metastatic breast cancer between 1998-2017 were abstracted from the Healthcare Cost and Utilization Project (HCUP) Nationwide Inpatient Database (NIS). The primary outcome was the presence of a palliative care consultation (PCC) during the inpatient stay. Secondary outcomes were hospital length of stay and total hospital charges. Multivariable logistic regression was used to examine factors associated with the presence of a PCC. The relationship between PCC and hospital length of stay and total hospital charges were investigated using linear regression. Results: 513,509 cases of metastatic breast cancer were identified, 5.7% had a documented in-hospital palliative care encounter. Of those who received PCC, total hospital charges were about USD 5452 less than those who did not receive consultation. Women who received PCC had higher odds of a longer hospital stay. Predictors of PCC were older age, non-White race, and residing in a lower-income ZIP code. Conclusions: Palliative care remains to be an underutilized resource among patients with end-stage metastatic breast cancer.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "baa765e22287cc6513606f8dd594cb37",
  "timestamp": "2025-05-15T03:07:31.849628"
}