{
  "id": 4245,
  "title": "The single and joint effects of financial intervention policies introduced by governments and power distance culture on returns of equity markets during the COVID-19",
  "abstract": "Purpose This paper uniquely aims to triangulate the effects of the COVID-19 pandemic, government financial intervention (GFI) policies and power distance (PD) culture on returns of equity indices during the COVID-19 epidemic in the world's equity markets. Design/methodology/approach The research employs panel data regression analysis using 1,937 observations from 19 developed and 42 developing countries. The data employed contain daily registered COVID-19 cases, global equity market index prices, financial intervention policies introduced by governments and Hofstede's cultural dimension measure of PD. Findings The authors find that investors certainly react negatively to the number of confirmed COVID-19 cases reported, that GFI policies indeed reinforce investors' expectations of policymakers' dedication to stabilize the economy during the COVID-19 pandemic and that equity investors in high PD cultures overreact to GFI news, resulting in more positive stock returns. The authors discover a difference between developed and developing countries in terms of the effect of GFI policies and PD on equity returns. Research limitations/implications Results suggest that investors react negatively to the daily registered COVID-19 cases. The authors find that financial intervention policies introduced by governments reinforce investors' outlooks of policymakers' commitment to stabilize local stock markets during the coronavirus pandemic. The results confirm that equity market investors in PD cultures overreact to financial intervention news, thus resulting in more positive stock returns. Practical implications The paper provides three original contributions. First, it helps us to understand the single effect of the COVID-19 and financial intervention policies introduced by governments on returns of the global equity market. Second, it examines the possibility of a two-way joint effect between the COVID-19 and financial intervention policies introduced by governments and the COVID-19 and differences in countries characterized by a PD culture concerning stock market returns. Third, it investigates the possibility of a three-way interaction effect between the COVID-19 contagion, financial intervention policies introduced by governments and culture on returns of equity markets. Originality/value The authors' findings are valuable to researchers, investors and policymakers. Culture and finance scholars can now observe the role of Brown et al.'s (1988) uncertain-information hypothesis with reference to the effect of the COVID-19 and financial interventions policies introduced by governments on returns of equity markets. This is because the authors' findings underline that since investors' uncertainty declines with daily registered numbers of COVID-19 cases, the introduction of GFI policies function as a neutralizing device to re-establish investors' expectations to equilibrium. Consequently, stock market returns follow a random walk that is free from the negative effect of the COVID-19. The authors' work is likely to advise equity investors and portfolio managers about the extent to which major exogenous economic events such the outbreak of global diseases, financial interventions policies introduced by governments and differences in countries' PD culture can individually and jointly influence the return of the world's equity markets. Investors and portfolio managers can employ the authors' results as a guideline to adjust their investment strategy based on their investment decision strategy during global pandemics. Policymakers aiming to introduce financial intervention policies to stabilize their stock market returns during global pandemics can benefit from our results. They can observe the full effect of such policies during the current COVID-19, and subsequently be better prepared to choose the most effective form of financial intervention policies when the next pandemic strikes, hopefully never.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bab96a08c8145d95df9cc015f265719b",
  "timestamp": "2025-05-15T01:25:23.221029"
}