{
  "id": 2553,
  "title": "Antecedents to responsible financial management behavior among young adults: moderating role of financial risk tolerance",
  "abstract": "Purpose - The study examines the antecedents of responsible financial management behavior among young adults in India and explores the role of financial risk tolerance as a moderating variable. Design/methodology/approach - The sample includes young adults in the age group of 18-35. The analysis uses a two-step approach via standard partial least squares structural modeling (PLS-SEM) and ordinary least square (OLS) regression. Findings - Structural modeling results show that financial attitude fully mediates the relationship between financial knowledge and responsible financial management behavior, and locus of control influences responsible financial management behavior. Financial risk tolerance moderates the relationship. Among demographic factors, age and occupation influence responsible financial management behavior. Research limitations/implications - The financial knowledge used in the survey are based on self-reported responses. The future study can include participants from both developed and emerging countries to assess similarities and differences. Practical implications - Despite the growing focus on improving financial literacy, there are growing concerns regarding responsible financial behavior. Since financial services is related to fiduciary responsibility, managers and policymakers need to ensure that financial knowledge results in improving financial attitude, which further leads to responsible financial behavior. Originality/value - The present study from an emerging country will add value to the literature.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "babdac1bdc97bf551a5c6088a7e5aecc",
  "timestamp": "2025-05-15T02:16:32.720123"
}