{
  "id": 6126,
  "title": "Cross-sectional Study of Colorectal Cancer Screening Barriers in a Latino-Serving Federally Qualified Health Center",
  "abstract": "Compared to other races/ethnicities, the Latino population has a lower rate of adherence to colorectal cancer (CRC) screening guidelines. Previous studies have identified a variety of barriers to CRC screening in Latino populations but have not explored factors associated with barriers. The purpose of this study was to identify barriers to CRC screening and associated factors in a Midwest Latino population visiting an urban Federally Qualified Health Center (FQHC). We conducted a cross-sectional investigation of 68 Latinos at a FQHC from June to October 2017. We examined factors associated with scheduling, psychological, and financial barriers using t-test, ANOVA, and multiple linear regression analyses. Our participants reported low educational level, low income, and limited access to insurance or a primary care provider. Scheduling barriers are the highest barrier compared with psychological and financial barriers. Being married or coupled was the only predictor of higher scheduling barriers (P < .05). Being married or coupled was associated with higher psychological barriers in both univariate and multivariate analysis (P < .05). Higher education level was associated with higher psychological barriers in univariate (P < .05) but not multivariate analysis. Participants with lower vs. higher English proficiency had a higher financial barrier score in univariate (P < .05) but not multivariate analysis. Despite interventions targeting CRC screening barriers, including the provision of free at-home testing, perceived barriers persist. Bilingual patient navigators may help address needs for those with limited English proficiency to find and schedule free or reduced-fee colonoscopy services. People who are well educated are also at high risk of psychological barriers and should be targeted and given more education on the importance of CRC screening.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "babf91d737ff4b81235caff6921e0159",
  "timestamp": "2025-05-15T02:55:12.854948"
}