{
  "id": 6571,
  "title": "The impact of applying internal auditing standards on banking risk management during crises: a field study on banks operating in Palestine",
  "abstract": "PurposeThis study aims to examine the impact of the 2017 Institute of Internal Auditors (IIA) Standards on risk management within Palestinian banks, a sector operating amidst persistent economic instability and conflict since 2020. Focusing on the Attributes and Performance standards, the research investigates their influence on risk management practices in this challenging environment to understand their effectiveness in mitigating and managing risks.Design/methodology/approachUsing an explanatory sequential mixed-methods design, this research investigates the influence of IIA Standards on risk management in Palestinian banks. A purposive sample of 160 professionals from internal audit, risk management and related committees participated in the study. Quantitative data were collected through a questionnaire, followed by semistructured interviews with selected participants to provide deeper insights and interpret the quantitative findings. Multiple linear regression analysis was used to test the study's hypotheses, specifically examining the relationship between the implementation of IIA Attributes and Performance standards and risk management effectiveness.FindingsThis study reveals a significant positive correlation between adherence to IIA Standards and enhanced risk management effectiveness in Palestinian banks during periods of crisis. Adherence to the Attributes and Performance standards strengthens the internal audit function's ability to proactively manage risk. Notably, the findings highlight the crucial role of Performance standards in enabling risk-based auditing, facilitating proactive risk identification and mitigation, and thereby mitigating the negative impacts of crises on financial stability and organizational performance.Research limitations/implicationsThis study is subject to several methodological limitations, including its cross-sectional design restricted to Palestine, which limits the generalizability of findings across time and geographic contexts. The selection of variables was based on a specific body of literature, and the sensitive nature of certain questions may have influenced participant responses. The study did not explicitly isolate the impact of the COVID-19 pandemic, despite being conducted in a crisis-affected environment. Furthermore, it relied on the 2017 internal auditing standards without incorporating the 2024 updates, highlighting the need for future research to assess the implications of the revised framework on audit practices and risk management.Practical implicationsThis study underscores the vital role of adherence to internal auditing standards in promoting the long-term sustainability of banking operations, particularly during times of crisis. Compliance is not simply a matter of regulatory adherence but a strategic investment in robust risk management capabilities. By facilitating improved risk identification, measurement, monitoring and mitigation, adherence strengthens banks' ability to maintain financial stability, foster transparency and accountability and achieve operational efficiency, ultimately benefiting stakeholders across the board.Originality/valueThis research makes a novel contribution to the existing literature by examining the impact of implementing IIA Standards on risk management within Palestinian banks, a context often overlooked in prior studies. The study's findings, derived from an analysis of the challenges within Palestine's volatile political and economic landscape, provide valuable insights into the effectiveness of these standards in mitigating risks within other similar crisis-prone environments.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bac962e37cf20c1994725f3cbefbc963",
  "timestamp": "2025-05-15T02:59:36.882035"
}