{
  "id": 5645,
  "title": "Criteria for definition of a complex abdominal wall hernia",
  "abstract": "A clear definition of complex (abdominal wall) hernia is missing, though the term is often used. Practically all complex hernia literature is retrospective and lacks proper description of the population. There is need for clarification and classification to improve patient care and allow comparison of different surgical approaches. The aim of this study was to reach consensus on criteria used to define a patient with complex hernia. Three consensus meetings were convened by surgeons with expertise in complex abdominal wall hernias, aimed at laying down criteria that can be used to define complex hernia patients, and to divide patients in severity classes. To aid discussion, literature review was performed to identify hernia classification systems, and to find evidence for patient and hernia variables that influence treatment and/or prognosis. Consensus was reached on 22 patient and hernia variables for complex hernia criteria inclusion which were grouped under four categories: Size and location, Contamination/soft tissue condition, Patient history/risk factors, and Clinical scenario. These variables were further divided in three patient severity classes ('Minor', 'Moderate', and 'Major') to provide guidance for peri-operative planning and measures, the risk of a complicated post-operative course, and the extent of financial costs associated with treatment of these hernia patients. Common criteria that can be used in defining and describing complex (abdominal wall) hernia patients have been identified and divided under four categories and three severity classes. Next step would be to create and validate treatment algorithms to guide the choice of surgical technique including mesh type for the various complex hernias.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bad17600235f7c4a080eee30a09cd660",
  "timestamp": "2025-05-15T02:49:50.349508"
}