{
  "id": 7228,
  "title": "Structural Inequity and Socioeconomic Status Link to Osteoporosis Diagnosis in a Population-Based Cohort of Middle-Older-Age Americans",
  "abstract": "Socioeconomic status (SES) is an important social determinant of health inequities that has been linked to chronic conditions, including osteoporosis, but research tends to focus on socioeconomic disadvantage rather than how socioeconomic advantage may facilitate these inequities. This study accounts for structural inequities and assesses the relationship between early-life and later-life SES, and risk of osteoporosis diagnosis. Data come from the nationally representative, population-based cohort Health and Retirement Study and include individuals ages 50 to 90. The outcome variable is osteoporosis diagnosis. Logistic regression models of the relationship between SES and osteoporosis diagnosis are estimated, accounting for demographic, health, and childhood variables. Higher levels of childhood and adult SES link to lower odds of osteoporosis diagnosis. Structural inequities in income and underdiagnosis of osteoporosis among persons identifying as Black/African American were detected. Accounting for bone density scan access, inequities in osteoporosis diagnosis appear to stem from barriers to accessing health care due to financial constraints. The important role of SES and evidence of structural inequities leading to underdiagnosis suggest the critical importance of clinicians receiving Diversity, Equity, and Inclusion training to reduce health inequities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "badd6e1f77974e40921aefd1b36c190f",
  "timestamp": "2025-05-15T03:06:35.355956"
}