{
  "id": 5272,
  "title": "The impact of business conditions and commodity market on US stock returns: An asset pricing modelling experiment",
  "abstract": "In this paper, two comprehensive mathematical approaches: cubic piecewise polynomial function (CPPF) model and the Fourier Flexible Form (FFF) model are built into asset pricing models to explore the stock market risk, commodity market risk and overall business conditions in relation to US stock returns as a modelling experiment. A selection of knots and orders are applied on the models to determine the best fit coefficients, respectively, based on Akaike Information Criteria (AIC). The classic risk coefficient along with downside and upside counterparts are estimated in a non-linear time-weighted fashion and are subsequently adopted as risk factors to investigate the explanatory and predictive power to stock returns. It is found that time-weighted classic, downside and upside risk coefficients of all three domains provide significant explanatory power to current stock returns, while the predictive power appears to be weak. The findings fill the gap in literature, specifically on both investigating and pricing the time-weighted risk. This paper innovatively employs the Aruoba-Diebold-Scotti (ADS) real business index to measure the business conditions in macroeconomics context. The methodology proposed in this paper embeds advanced mathematical approaches to provide robust regression estimation. The application of proposed models enriches the dimension in pricing risk in stock market and wider financial market.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "baf95cd0dc75fbdb2295b1549d7fa7dc",
  "timestamp": "2025-05-15T02:46:16.137462"
}