{
  "id": 446,
  "title": "Differences among OECD countries' GHG emissions: Causes and policy implications",
  "abstract": "This article assesses the reasons for observed differences in greenhouse gas (GHG) emissions among high-income OECD countries. Nine factors were tested: climate, population pressure (measured as both growth and density), economic output per capita, technological development, industrial structure, energy prices, environmental governance, pollution abatement and control expenditures, and environmental pricing. Based on a series of regression analyses, three factors - energy prices, economic output per capita, and environmental governance - were identified as the most important factors for explaining differences in OECD per capita GHG emissions. Combined, these three factors explain about 81% of the variation observed in OECD per capita GHG emissions. Individually, energy prices explains about 55% of the variation in per capita GHG emissions, while economic output per capita explains about 19%, and environmental governance about 7%. These findings show that behavioural choices based on existing technologies, rather than exogenous factors such as climate, determine differences in GHG emissions and, therefore, policy options to change behaviour such as increasing energy prices and other regulatory changes have the potential to significantly reduce GHG emissions. (c) 2013 Elsevier Ltd. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bb07cc5bc0e0540f5650ae27c153bb54",
  "timestamp": "2025-05-15T01:31:50.802259"
}