{
  "id": 6587,
  "title": "The comparison of health status and health services utilisation between Indigenous and non-Indigenous infants in Australia",
  "abstract": "Objective: To examine the differences in health services utilisation and the associated risk factors between Indigenous and non-Indigenous infants at a national level in Australia. Methods: We analysed data from a national representative longitudinal study, the Longitudinal Study for Australian Children (LSAC) starting in 2004. We used survey logistic regression and survey multiple linear regression to examine the factors associated with health services utilisation. Results: Health status of Indigenous infants was poorer than that of non-Indigenous. In comparison to non-Indigenous infants, in the previous 12-month period, the Indigenous infants were significantly less likely to use the following health services: maternal and child health centre or help lines (OR=0.35, 95% CI: 0.24-0.49); maternal and child health nurse visits (OR=0.45, 95% CI: 0.32-0.63); general practitioners (GPs) (OR=0.45, 95% CI: 0.31-0.64); and paediatrician (OR=0.52, 95% CI: 0.35-0.77). In contrast, they were more likely to visit a hospital outpatient clinic (OR=1.82, 95% CI: 1.16-2.85). Mothers' age, education and marital status were associated with certain health services use. Financial status and residential location were the important predictors of the use of health services. Conclusion: The rates of health services utilisation by Indigenous infants were lower and were associated with mothers' characteristics and socio-economic status. Implications: The gaps in health services utilisation between Indigenous and non-Indigenous infant requires immediate policy initiatives. Further research is needed to explore the causal pathways between health status, health services utilisation and multiple risk factors at different levels.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bb1d74dfe375c499ad39c5deedcf3f2b",
  "timestamp": "2025-05-15T02:59:37.020079"
}