{
  "id": 9456,
  "title": "Trifocal intraocular lenses versus bifocal intraocular lenses after cataract extraction among participants with presbyopia",
  "abstract": "Background Presbyopia occurs when the lens of the eyes loses its elasticity leading to loss of accommodation. The lens may also progress to develop cataract, affecting visual acuity and contrast sensitivity. One option of care for individuals with presbyopia and cataract is the use of multifocal or extended depth of focus intraocular lens (IOL) after cataract surgery. Although trifocal and bifocal IOLs are designed to restore three and two focal points respectively, trifocal lens may be preferable because it restores near, intermediate, and far vision, and may also provide a greater range of useful vision and allow for greater spectacle independence in individuals with presbyopia. Objectives To assess the effectiveness and safety of implantation with trifocal versus bifocal IOLs during cataract surgery among people with presbyopia. Search methods We searched the Cochrane Central Register of Controlled Trials (CENTRAL) (which contains the Cochrane Eyes and Vision Trials Register) (2022, Issue 3); Ovid MEDLINE; Embase.com; PubMed; ClinicalTrials.gov; and the World Health Organization (WHO) International Clinical Trials Registry Platform (ICTRP). We did not use any date or language restrictions in the electronic search for trials. We last searched the electronic databases on 31 March 2022. Selection criteria We included randomized controlled trials that compared trifocal and bifocal IOLs among participants 30 years of age or older with presbyopia undergoing cataract surgery. Data collection and analysis We used standard Cochrane methodology and graded the certainty of the body of evidence according to the GRADE classification. Main results We identified seven studies conducted in Europe and Turkey with a total of 331 participants. All included studies assessed visual acuity using a logarithm of the minimum angle of resolution (LogMAR chart). Of them, six (86%) studies assessed uncorrected distance visual acuity (the primary outcome of this review). Some studies also examined our secondary outcomes including uncorrected near, intermediate, and best-corrected distance visual acuity, as well as contrast sensitivity. Study characteristics All participants had bilateral cataracts with no pre-existing ocular pathologies or ocular surgery. Participants' mean age ranged from 55 to 74 years. Three studies reported on gender of participants, and they were mostly women. We assessed all of the included studies as being at unclear risk of bias for most domains. Two studies received financial support from manufacturers of lenses evaluated in this review, and at least one author of another study reported receiving payments for delivering lectures with lens manufacturers. Findings All studies compared trifocal versus bifocal IOL implantation on visual acuity outcomes measured on a LogMAR scale. At one year, trifocal IOL showed no evidence of effect on uncorrected distance visual acuity (mean difference (MD) 0.00, 95% confidence interval (CI) -0.04 to 0.04; I-2 = 0%; 2 studies, 107 participants; low-certainty evidence) and uncorrected near visual acuity (MD 0.01, 95% CI -0.04 to 0.06; I-2 = 0%; 2 studies, 107 participants; low-certainty evidence). Trifocal IOL implantation may improve uncorrected intermediate visual acuity at one year (MD -0.16, 95% CI -0.22 to -0.10; I-2 = 0%; 2 studies, 107 participants; low-certainty evidence), but showed no evidence of eLect on best-corrected distance visual acuity at one year (MD 0.00, 95% CI -0.03 to 0.04; I-2 = 0%; 2 studies, 107 participants; low-certainty evidence). No study reported on contrast sensitivity or quality of life at one-year follow-up. Data from one study at three months suggest that contrast sensitivity did not differ between groups under photopic conditions, but may be worse in the trifocal group in one of the four frequencies under mesopic conditions (MD -0.19, 95% CI -0.33 to -0.05; 1 study; I-2 = 0%, 25 participants; low-certainty evidence). One study examined vision-related quality of life using the 25-item National Eye Institute Visual Function Questionnaire (NEI-VFQ-25) at six months, and suggested no evidence of a difference between trifocal and bifocal IOLs (MD 1.41, 95% CI -1.78 to 4.60; 1 study, 40 participants; low-certainty evidence). Adverse events Adverse events reporting varied among studies. Of five studies reporting information on adverse events, two studies observed no intraoperative and postoperative complications or no posterior capsular opacification at six months. One study reported that glare and halos were similar to the preoperative measurements. One study reported that 4 (20%) and 10 (50%) participants had glare complaints at 6 months in trifocal and bifocal group, respectively (risk ratio 0.40, 95% CI 0.15 to 1.07; 40 participants). One study reported that four eyes (11.4%) in the bifocal group and three eyes (7.5%) in the trifocal group developed significant posterior capsular opacification requiring YAG capsulotomy at one year. The certainty of the evidence for adverse events was low. Authors' conclusions We found low-certainty of evidence that compared with bifocal IOL, implantation of trifocal IOL may improve uncorrected intermediate visual acuity at one year. However, there was no evidence of a difference between trifocal and bifocal IOL for uncorrected distance visual acuity, uncorrected near visual acuity, and best-corrected visual acuity at one year. Future research should include the comparison of both trifocal IOL and specific bifocal IOLs that correct intermediate visual acuity to evaluate important outcomes such as contrast sensitivity, quality of life, and vision-related adverse effects.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bb2550a30dccc7e229eebd16ae85b80f",
  "timestamp": "2025-05-15T03:28:46.406172"
}