{
  "id": 8360,
  "title": "Socio-economic impacts of the COVID-19 pandemic on new mothers and associations with psychosocial wellbeing: Findings from the UK COVID-19 New Mum online observational study (May 2020-June 2021)",
  "abstract": "Studies have reported unequal socio-economic impacts of the COVID-19 pandemic and associated restrictions in the UK, despite support packages. It is unclear how women with young children, a vulnerable group economically and psychosocially, havebeen impacted by income and employment pandemic changes, and how this is associated with psychosocial wellbeing. Using the UK COVID-19 New Mum online survey of women with children <12 months (28(th) May 2020-26(th) June 2021; N = 3430), which asked about pandemic impact on their i.ability to pay for rent, food, and essentials expenses separately, ii. employment (and/or partner's), and iii.past week mood, feelings and activities, we explored associations of i. & maternal age, household structure and income, i. & ii., and i. & iii. using logistic (odd ratios), multivariate (relative risk ratios/RRR), and linear (coefficients) regression respectively, and associated p-values. Overall, 30-40% of women reported any impact on ability to pay for expenses. Household earning <20,000 pound/yr had 6/4/7 times the odds of reporting an impact on food/rent/essentials (vs. > = 45,000 pound/yr; p<0.001). Expenses impacts were associated with greater risk of partner business stopped/shut down (RRR:27.6/9.8/14.5 for rent/food/essentials [p<0.001 vs. no impact on employment]) or being made unemployed (RRR:15.2/9.5/13.5 [p<0.001]). A greater expenses impact was associated with higher (unhealthy) maternal psychosocial wellbeing score (coef:0.9/1.4/1.3 for moderate-major impact on rent/food/essentials vs. no impact [p<0.001]). The pandemic increased financial insecurity and associated poorer psychosocial wellbeing in new mothers. This is concerning given their pre-existing greater risk of poorer mental health and the implications for breastfeeding and child health and development. These findings reflect highlight the need for the UK government to assess shortfalls of implemented pandemic support policies and the provision of catch-up and better support for vulnerable groups such as new mothers, to avoid increasing socio-economic inequalities and the burden of poor maternal mental health and subsequent negative impacts on child wellbeing.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bb276128cc4770ae6b293e7ec504faf7",
  "timestamp": "2025-05-15T03:17:49.209632"
}