{
  "id": 4560,
  "title": "THE RELATIONSHIP BETWEEN EFFICIENCY, CAPITAL AND RISK FROM THE BANKING ACTIVITY PERSPECTIVE",
  "abstract": "In a previous research we analysed the risk-performance correlation at two banks in Romania by the quantification of the influence of the indicators of the banking risks on the banking performance indicator - financial profitability rate. Within this article, we propose to expand the research and identify the possible correlations between the levels of the efficiency, capital and banking risk on a sample of 11 representative banks of Romania. Surprisingly, there is a limited number of studies which evaluate the inter-temporal relations between the banking risk, capital and efficiency. The recent financial crisis underlined the need of a subsequent understanding of the determinants of the banking risk in an increased banking efficiency and decreased banking capital environment. For the study of the risk-efficiency-capital study we will estimate a panel model in Eviews. The panel data models consist in the estimation of regression equation in which one uses time series for the evolution on a certain period of the shares of more companies and we wish to determine how certain macroeconomic variables influence the yield of those shares, a solution is the use of panel data models. In order to point out the correlations between the capital, the efficiency and the banking risk we estimate an equation that will identify the correlations between the chosen variables. In our opinion, this analysis is important because it offers important findings regarding the influence of risk on banking profitability and on banking efficiency. Moreover, over the analyzed period the risks faced by banks increased significantly. Therefore, it is important to know exactly the relationship between efficiency, capital and risk in order to better understand the behavior of bank management.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bb371155d92320ec35c695098743b5c9",
  "timestamp": "2025-05-15T02:38:20.515119"
}