{
  "id": 4543,
  "title": "Occupational and geographical differentials in financial protection against healthcare out-of-pocket payments in Nepal: Evidence for universal health coverage",
  "abstract": "BackgroundThe low-and middle-income countries, including Nepal, aim to address the financial hardship against healthcare out-of-pocket (OOP) payments through various health financing reforms, for example, risk-pooling arrangements that cover different occupations. World Health Organization (WHO) has recommended member states to establish pooling arrangements so that the financial risks owing to health uncertainty can be spread across population. This study aims to analyse the situation of financial protection across occupations and geography using nationally representative annual household survey (AHS) in Nepal. MethodsWe measured catastrophic health expenditure (CHE) due to OOP using two popular approaches-budget share and capacity-to-pay, and impoverishment impact at absolute and relative poverty lines. This study is the first of its kind from south-east Asia to analyse disaggregated estimates of financial protection across occupations and geography. The inequality in financial risk protection was measured using concentration index. Data were extracted from AHS 2014-15 -a cross-sectional survey that used standard consumption measurement tool (COICOP) and International Standard Classification of Occupations (ISCO). ResultsWe found a CHE of 10.7% at 10% threshold and 5.2% at 40% threshold among households belonging to agricultural workers. The corresponding figures were 10% and 4.8% among 'plant operators and craft workers'. Impoverishment impact was also higher among these households at all poverty lines. In addition, CHE was higher among unemployed households. A negative concentration index was observed for CHE and impoverishment impact among agricultural workers and 'plant operators and craft workers'. In rural areas, we found a CHE of 11.5% at 10% threshold and a high impoverishment impact. Across provinces, CHE was 12% in Madhesh and 14.3% in Lumbini at 10% threshold, and impoverishment impact was 1.9% in Madhesh, Karnali and Sudurpachim at US $1.90 a day poverty line. ConclusionHouseholds belonging to informal occupations were more prone to CHE and impoverishment impact due to healthcare OOP payments. Impoverishment impact was disproportionately higher among elementary occupations, agricultural workers, and 'plant operators and craft workers'. Similarly, the study found a wide urban/rural and provincial gap in financial protection. The results can be useful to policymakers engaged in designing health-financing reforms to make progress toward UHC.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bb3e6bc617192fb906b1a9e7ab8d711e",
  "timestamp": "2025-05-15T02:38:20.410576"
}