{
  "id": 2794,
  "title": "Time and frequency spillovers and drivers between rare earth and energy, metals, green, and agricultural markets",
  "abstract": "This study investigates the time and frequency return and volatility spillover relationship between rare earth markets and oil, clean energy, gold, base metal, green bond, ESG, and agricultural markets by adopting the spillover indices introduced by Diebold and Yilmaz (2014) and Barunik and Krehlik (2018). As a more comprehensive view of the spillover relationship between rare earth and these industries, this study fills the gap in the existing literature on the relationship between rare earth and energy, metals, or green-related markets. Moreover, we conduct a regression analysis to reveal the drivers of the connectedness network. The empirical results suggest that the rare earth metals (REM) market is a net spillover receiver from the base metal, clean energy, and ESG markets, which are the top three net risk emitters. The network connectedness results shed light on the connections and strengths at different time horizons throughout the sample. The regression results indicate that financial condition and investor sentiment play the most significant roles in driving connectedness and have different effects at different frequencies. Furthermore, severe financial stress may increase short-term risk spillover, which indicates that investors sell out risky assets in stressful times. However, financial stress decreases long-term spillover, which implies that it damages the long-term operation of the financial market. The results could guide investors holding REM assets to balance risk and return and also provide references for policymakers to monitor market conditions and adopt policies to foster the health of the REM market.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bb59967e738f10899e71c3a4663d4f38",
  "timestamp": "2025-05-15T02:19:08.468222"
}