{
  "id": 8555,
  "title": "High magnesium waters and soils: Emerging environmental and food security constraints",
  "abstract": "Food insecurity and declining availability of freshwater and new productive land in water-scarce areas and countries necessitate effective use of marginal-quality waters and underperforming soils. High magnesium waters and soils are emerging examples of water quality deterioration and land degradation leading to environmental and food security constraints in several irrigation schemes. A ratio of magnesium-to-calcium > 1 in irrigation waters and an exchangeable magnesium percentage > 25% in soils are considered high enough to result in soil degradation and impact crop yields negatively. These soil and water resources occur in the Aral Sea Basin in Central Asian countries, the Cauca River Valley in Colombia, the Central Plateau Basin in Iran, the Indus Basin in Pakistan, the Indo-Gangetic Plains in India, the Murray-Darling Basin in Australia, and the Coastal Mountain Range in California, among others. With limited and scattered information, their occurrence remains hidden or unnoticed in many cases due to the lack of criteria in water quality assessment and soil classification systems. Managing high magnesium waters and soils requires a source of calcium to mitigate magnesium effects, in addition to an effective drainage system for safe disposal of excess magnesium salts. There is a need to put high magnesium waters and soils on the public policy agenda. Pertinent policies can catalyze stakeholders' involvement in supporting water and land quality monitoring systems and introducing innovative financial mechanisms to facilitate provision of calcium-supplying amendments in affected areas. Equally important would be strengthening institutional and professionals' capacity, enhancing institutional collaboration, encouraging private sector involvement in at-risk areas, and engaging local communities and farmers. These efforts will support the 2030 Sustainable Development Agenda. Eradicating extreme poverty and meeting the Sustainable Development Goals in water-scarce areas without adequately addressing underperforming land and water resources is highly unlikely. (C) 2018 Elsevier B.V. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bb87e68320adb9b2f21d74a549654a31",
  "timestamp": "2025-05-15T03:19:52.201793"
}