{
  "id": 3596,
  "title": "PROFITABILITY ANALYSIS OF SELECTED CZECH BANKS AND THEIR FOREIGN OWNERS",
  "abstract": "The aim of this paper is to make a comparison of selected indicators of profitability of selected Czech banks and their foreign owners in the years 2001 until 2013. The key methods of scientific research are methods of classification analysis, comparison and abstraction in the formation theoretical-methodological framework in addressing the issue. Ceska sporitelna and its German owner Erste Bank has been selected, CSOB and the Belgian owner KBC Bank NV and Komercni banka with the French owner of the Societe Generale have been selected. A comparison is performed based on measurable indicators (ROE, ROA, interest margin, credit risk - the risk of loans/assets). When comparisons were taken into three time periods: 2001 - 2007 represent the period before the financial crisis, the years 2008 - 2011 period the financial crisis and the years 2012 and 2013 period after the financial crisis. The main difference in the trend of indicators can be found mainly in the years 2001-2007 compared to following years. The Czech banks were the worst results in 2001. This year, however, was still their transformation relating to their sale to foreign owners. In other years, but Czech banks already reached very good results. Their profitability indicators showed even more than double profitability compared to their foreign owners. The comparison showed that the foreign owners of Czech banks hit by the financial crisis more than Czech banks. The worst results achieved KBC Bank NV in 2009, which showed ROE - 23%. One of the reasons is undoubtedly higher credit risk for foreign banks.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bbad56dffe299bb38935cb954f3ce5dd",
  "timestamp": "2025-05-15T02:27:54.090907"
}