{
  "id": 6606,
  "title": "Should annual cost of the drug inform reimbursement decisions? A perspective from China's healthcare security system",
  "abstract": "Background An increasing number of countries worldwide, including China, have adopted Health Technology Assessment (HTA) and pharmacoeconomic (PE) principles, either comprehensively or partially, to inform drug reimbursement decisions. While China has integrated the annual cost of the drug (ACD) as a key economic factor considered in decision-making, implicitly establishing a price ceiling for medical insurance coverage. However, the current approach lacks a robust theoretical foundation and quantitative evidence. Objective This study aims to explore the rationale for incorporating ACD as a constraint in reimbursement decision-making framework, and to estimate a practical ACD threshold for China's basic medical insurance (BMI) system. Methods Binary logistic regression was employed to analyze the impact of ACD on patients' financial burden. The outcome variable was the occurrence of financial barriers, with ACD serving as the primary independent variable. Covariates are factors of reimbursement benefits, including reimbursement caps and reimbursement rates. Average marginal effect analysis was performed to quantify the relationship between ACD and the likelihood of encountering barriers, suggesting a ACD threshold with practical implications for reimbursement decisions. Multicollinearity among variables was assessed using the Variance Inflation Factor (VIF). The model's goodness of fit was assessed using the likelihood-ratio test and the Hosmer-Lemeshow test. Additionally, model performance was evaluated using the Receiver Operating Characteristic (ROC) curve. Findings In China, patients face significant challenges in affording high-priced medications under BMI system. Failure to consider the payment capacity of the general population in drug reimbursement decision-making can result in an inequitable allocation of basic medical insurance funds. Logistic regression analysis revealed that for each 10,000 CNY (approximately 1,431 USD) increase in the ACD, the odds of outcome occurring increased by a factor of 1.1681 (95% CI: 1.1365-1.2006, p < 0.001). The highest average marginal effect was observed at a ACD value of 400,000 CNY (0.0228; 95% CI: 0.0199-0.0256, p < 0.0001). Furthermore, when ACD exceeded 440,000-450,000 CNY, the predicted probability of financial barriers surpassed 50% (p < 0.001). Conclusion Incorporating the evaluation of ACD into the appraisal process is crucial for informing reimbursement decisions, especially in health insurance systems without robust safety net mechanisms for patients. This study innovatively estimated the value of ACD threshold, addressing the research gap and providing a methodological reference for quantitative research. Despite adopting maximized reimbursement benefits of BMI, the estimated ACD threshold appears unable to support innovative medications priced comparably to those in global markets. In the future, China should establish a risk-sharing mechanism and improve the level of medical reimbursement benefits to mitigate financial barriers for patients' access to high-value medications.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bbb25aa873832f8020531b12be5d123f",
  "timestamp": "2025-05-15T02:59:37.092268"
}