{
  "id": 4802,
  "title": "Dynamic currency hedging with non-Gaussianity and ambiguity",
  "abstract": "This paper introduces a non-Gaussian dynamic currency hedging strategy for globally diversified investors with ambiguity. It provides theoretical and empirical evidence that, under the stylized fact of non-Gaussianity of financial returns and for a given optimal portfolio, the investor-specific ambiguity can be estimated from historical asset returns without the need for additional exogenous information. Acknowledging non-Gaussianity, we compute an optimal ambiguity-adjusted mean-variance (dynamic) currency allocation. Next, we propose an extended filtered historical simulation that combines Monte Carlo simulation based on volatility clustering patterns with the semi-parametric non-normal return distribution from historical data. This simulation allows us to incorporate investor's ambiguity into a dynamic currency hedging strategy algorithm that can numerically optimize an arbitrary risk measure, such as the expected shortfall. The out-of-sample backtest demonstrates that, for globally diversified investors, the derived non-Gaussian dynamic currency hedging strategy is stable, robust, and highly risk reductive. It outperforms the benchmarks of constant hedging as well as static/dynamic hedging approaches with Gaussianity in terms of lower maximum drawdown and higher Sharpe and Sortino ratios, net of transaction costs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bbb669fb6e2ab4c42620f81f3ee002b1",
  "timestamp": "2025-05-15T02:41:00.904109"
}