{
  "id": 8832,
  "title": "Benchmarking asset pricing models in emerging markets: evidence from Borsa Istanbul",
  "abstract": "PurposeInvestors who can transfer their savings to investments in a well-regulated market benefit not only themselves but also economic development. Hence, it is crucial for fund owners to evaluate their stock market investment decisions. The goal of the study is to understand which model determines the asset returns most efficiently. In this regard, the validity of single and multi-index asset pricing models (capital asset pricing model-CAPM and Fama-French models) has been examined in the Turkish Stock Exchange for 2009-2020, with the quantile regression (QR) approach.Design/methodology/approachOn 18 portfolios comprised of quoted stocks in the Istanbul Stock Exchange 100 (ISE-100/BIST-100), we test the CAPM, the Fama and French three factor model (FF3) and the Fama and French five factor model (FF5). Empirical analyses have been carried out via QR approach regressing the portfolios' average weekly excess returns on risk premium/market factor (Rm-Rf), firm size, book value/market value (B/M), profitability and investments factors. QR estimation has been employed since QR is more effective and provides a better definition of the distribution's tails.FindingsOur empirical findings have revealed that the average excess weekly returns can be explained more strongly via CAPM. Moreover, Fama and French models are expected to give more reliable result with more data, whereas the market premium would give robust results for the Turkish Capital Market.Practical implicationsIndividuals investing in financial assets must find the price model that best fits the market. The return can be approximated in the most appropriate manner using the right variables.Originality/valueThe study differs from other research by comparing the asset pricing models via examining the assets' weekly returns with QR in the Istanbul Stock Exchange 100 (ISE-100).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bbc85dfa92f6bb03a7247d2e77922d37",
  "timestamp": "2025-05-15T03:22:57.898366"
}