{
  "id": 7602,
  "title": "Internal control and real earnings management in the French context",
  "abstract": "Purpose This study aims to examine whether the internal control system quality in the French context improve the information quality having been reflected by the level of real earnings management (REM) measured by inventory overproduction, discretionary expenses reduction and sales manipulation. Design/methodology/approach The research uses a multiple regression analysis to examine the association between internal control and REM. The years 2010-2015 are used as analysis period by focusing on the French context. Three panel data are applied to the companies belonging to the Cotation Assistee en Continu (CAC) 40 index for the entire study period. Findings The results show that high internal control index has a negative impact on the REM and that better internal control indeed makes financial reporting more credible to investors. Further, the results demonstrate that control environment, risk assessment, control activities and monitor are the components that mainly affect REM. Originality/value The results contribute to the literature dealing with the relationship between internal control quality and REM by shedding light on the importance of internal control quality in improving information quality in the French context. Moreover, this study is using a quantitative measure of the internal control quality while much of the prior literature uses material weaknesses to estimate the effectiveness of internal control system.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bbca923862f857ba5462b3c30b1879f6",
  "timestamp": "2025-05-15T03:10:05.656850"
}