{
  "id": 8511,
  "title": "Unintended Consequences of Urban Expansion and Gold Mining: Elevated Indoor Radon Levels in Gauteng Communities' Neighboring Gold Mine Tailings",
  "abstract": "The province of Gauteng in South Africa has a rich history of gold mining, which has driven economic growth and urbanization. Gold mining has also created over 270 gold mine tailings (GMT), now surrounded by human settlements due to a housing shortage. These GMT pose a health risk as they harbor elevated uranium, which over time undergoes radioactive decay to produce radon, a known lung carcinogen. This study aimed to investigate the potential correlation between the proximity to gold mine tailings (GMT) and indoor radon concentrations in Gauteng's residential dwellings. Volume activity of radon (VAR) inside 330 residential dwellings was measured in residential dwellings located proximally (<2 km) and distally (>2 km) to gold mine tailings using AlphaE radon monitors during winter. An interviewer-administered questionnaire was utilized to obtain data on factors that may influence indoor radon activities. Descriptive statistics and bivariate logistic regression analyzed the influence of proximity to gold mine tailings and dwelling characteristics on VAR. Furthermore, VAR was compared to the World Health Organization (WHO) radon reference level of 100 Bq/m(3). Residential dwellings near gold mine tailings had significantly higher average indoor radon concentrations (103.30 Bq/m(3)) compared to the control group (65.19 Bq/m(3)). Residential dwellings proximal to gold mine tailings were three times more likely to have VAR beyond the WHO reference level of 100 Bq/m(3). Furthermore, they had estimated annual effective doses of 2.60 mSv/y compared to 1.64 mSv/y for the control group. This study highlighted a concerning association between proximity to gold mine tailings and elevated indoor radon levels. Public health interventions prioritizing residential dwellings near gold mine tailings are crucial. Educational campaigns and financial assistance for radon mitigation systems in high-risk dwellings are recommended. Residents near gold mine tailings are encouraged to ensure continuous natural ventilation through frequent opening of windows and doors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bbcb22193464b910fbb605e2d6e8ddfe",
  "timestamp": "2025-05-15T03:19:21.396016"
}