{
  "id": 9365,
  "title": "Enlarging the Role of CEM Professionals in Corporate Sustainability: ESG Programs and the Built Environment",
  "abstract": "Corporations develop, own, operate, and direct a majority of all assets in the built environment (BE), and the development and operation of these assets is a significant component of global sustainability. In recent years corporate sustainability action for large companies has trended toward becoming embedded within corporate environmental, social, and governance (ESG) programs. However, ESG strategies and their impacts are only beginning to be understood by large corporations, with little definition for how to apply, measure, and assess the effectiveness of ESG practices. Every industry sector has some connection to the BE, and construction engineering, and management (CEM) professionals contribute to all phases of the BE life cycle, including development, design, construction, and operations. As such, CEM professionals are vital in developing and implementing sustainability practices specifically for corporations with large footprints in the BE. The purpose of this research was to assess the extent to which the BE is impacted by corporate sustainability practice through ESG programs. The research utilized a grounded theory approach to explore sustainability practices directly associated with the BE from companies within all 11 Global Industry Classification Standard (GICS) sectors. It presents a representative model that encapsulates current organizational ESG strategy, through the development of ESG action categories. A total of 24 different ESG action categories are presented and defined. The research further identifies those ESG actions commonly applied by large corporations and how these actions differ by GICS sector. This research indicates that over half of corporate ESG actions are related to the BE. Ultimately, this paper demonstrates the necessary role that CEM professionals should play in influencing sustainability practice through ESG strategy and action within the BE. ESG is a rising topic in corporate sustainability and is becoming increasingly tied to financial instruments such as sustainable investment indexes or green bonds. The rise of ESG presents both a challenge and an opportunity for CEM professionals. Large entities are expected to publish ESG reports sharing their sustainability progress, including entities in which CEM professionals are key figures, such as power utilities. The advent of ESG reporting presents a challenge to CEM professionals because they need to learn to navigate ESG reporting or risk losing access to valuable funding opportunities when subject to ESG measurement and evaluation. It also presents an opportunity for CEM professionals because they are uniquely qualified to lead ESG efforts as BE experts. ESG and the BE are strongly related, with most ESG work being environmental in nature. CEM professionals have been actively involved in improving the sustainability of BE assets as they relate to the environment for many years. To leverage this experience, CEM professionals need to take an active part in recommending improvements to corporate ESG strategy. Corporations themselves must also actively seek to engage CEM professionals in their ESG decision making processes and advisory boards.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bbd5be9e7b5e7f7b2f3c5d2f6d0745ac",
  "timestamp": "2025-05-15T03:28:17.504292"
}