{
  "id": 2333,
  "title": "Do Indian firms engage in classification shifting to report inflated core earnings?",
  "abstract": "Purpose The authors aim at investigating different forms of classification shifting (CS). CS is a novel form of earnings management under which managers misclassify income statement line items and cash flow statement line items with an intent to report favorable operating performance of firms. In particular, the authors check the existence of revenue misclassification, expense misclassification and cash flows misclassification among Indian firms by taking the uniform sample of firms over a single period. Design/methodology/approach Operating revenue model (Malikov et al., 2018), core earnings expectation model (McVay, 2006) and operating cash flows model (Roychowdhury, 2006) are employed for measuring revenue misclassification, expense misclassification and cash flows misclassification, respectively. The panel data regression models are used to analyze the data for this study. Findings Based on the sample of 12,870 Bombay Stock Exchange (BSE) listed firm-years observations between 2010 and 2018, we find that, on average, Indian firms are engaged in revenue misclassification rather than expense misclassification to report inflated core earnings. Firms are found to be engaged in cash flows misclassification too. Besides, we find that magnitude of shifting is greater among larger firms. Results also establish that adoption of Ind AS increases the scope of shifting practices. These results are based on several robustness checks. Practical implications The results suggest that investors conduct a comprehensive review of the items of financial statements before using them in their portfolio valuation. It suggests auditors check the basis of revenue classification and standard-setting authorities, like ICAI in India, to make more mandatory disclosure requirements for classification of revenues and cash flows. It suggests lenders not to make lending decisions by looking at the operating performance metrics, as CS is the most preferred tool to positively influence the perception of lenders toward operating performance. Originality/value It is the first study that investigates different forms of classification shifting jointly for a sample of firms. Most of the earlier studies have examined one kind of classification shifting at a time. This study adds to the existing literature on earnings management by documenting that some firm-specific factors pressurize firms to prefer one form of shifting over another to report inflated core earnings.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bbe1bb07afa774de93c171d11722928c",
  "timestamp": "2025-05-15T01:05:39.711494"
}