{
  "id": 4160,
  "title": "Association of financial toxicity with quality of life in testicular cancer survivors",
  "abstract": "Objectives Most testicular cancer (TC) survivors have long-term survival. However, the association between financial toxicity (FT), which is an economic side effect of cancer treatment, and the quality of life (QOL) of TC survivors is still unclear. Thus, the impact of FT on the QOL of TC survivors was examined in a multi-institutional cross-sectional study. Methods We recruited TC survivors from eight high-volume institutions in Japan between January 2018 and March 2019. A total of 562 participants completed the EORTC QLQ-C30, EORTC QLQ-TC26 and the questionnaires on demographics, including annual income. Financial difficulty in the EORTC QLQ-C30 and low income were used to assess financial distress (FD) and financial burden (FB), respectively. FT was defined as FD and FB. The QOL scores were compared, and a multivariate logistic regression analysis for FT was performed. Results With severe FD, TC survivors had more treatment side effects, physical limitations, and anxiety concerning employment and future. The TC survivors who reported low income were worried about their jobs and the future. The QOL of the survivors with FT exhibited high impairment, except for sexual activity. In particular, the TC survivors with FT were physically limited and anxious concerning the future. The multivariate logistic regression analysis revealed that four or more chemotherapy cycles were substantial risk factors for FT (4 cycles, odds ratio (OR) = 4.17; >= 5 cycles, OR = 6.96). Conclusions TC survivors who received multi-cycle chemotherapy were prone to experience FT, resulting in a decline in their health-related QOL.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bbf4d67d5a9e3072a5f3284ea673f8bd",
  "timestamp": "2025-05-15T02:33:42.169002"
}