{
  "id": 3486,
  "title": "An Artificial Intelligence-Based Model for Prediction of Parameters Affecting Sustainable Growth of Mobile Banking Apps",
  "abstract": "Nowadays, mobile banking apps are becoming an integral part of people lives due to its suppleness and convenience. Despite these benefits, yet its growth in evolving states is beyond expectations. However, using mobiles devices to conduct financial transactions involved a lot of risk. This paper aims to investigate customers' reasons for non-usage of the new conduits in developing countries with distinct interest in Nigeria. The study adopts two methods of analysis, artificial intelligence-based methods (AI), and structural equations modeling (SEM). A feed-forward neural network (FFNN) sensitivity examination technique was used to choose the most dominant parameters of mobile banking data collected from 823 respondents. Four algebraic directories were used to corroborate the study AI-based model. The study AI results found risk, trust, facilitating conditions, and inadequate digital laws to be the most dominant parameters that affect mobile banking growth in Nigeria, and discovered social influence and service quality to have no influence on Nigerians' resolve to use moveable banking apps. Moreover, the results proved the superiority of AI-based models above the classical models. Government and pecuniary institutes can use the study outcomes to ensure secured services offering, and improve growth. Finally, the study suggests some areas for future studies.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bbf43a50083250b8006e57e145b1bcfd",
  "timestamp": "2025-05-15T02:26:48.526429"
}