{
  "id": 1176,
  "title": "The volatility of Bitcoin returns and its correlation to financial markets",
  "abstract": "The 2008 financial crisis had scattered incredulity around the globe regarding traditional financial systems, which made investors and non-financial customers turn to other alternative such as digital banking systems. The existence and development of blockchain technology make cryptocurrency in recent years believably become a complete alternative to traditional ones. Bitcoin is the world's first peer-to-peer and decentralized digital cash system initiated by Nakamoto [1]. Though being the most prominent cryptocurrency, Bitcoin has not been a legal trading currency in various countries. Its exchange rate has appeared to be an exceptionally high-risk portfolio with extreme volatility, which requires a more detailed evaluation before making any decision. This paper utilizes knowledge of statistics for financial time series and machine learning to (i) fit the parametric distribution and (ii) model and forecast the volatility of Bitcoin returns, and (iii) analyze its correlation to other financial market indicators. The fitted parametric time series model significantly outperforms other standard models in explaining the stylized facts and statistical variances in the behavior of Bitcoin returns. The model forecast also outperforms some machine learning methodologies, which would benefit policy makers, banks and financial investors in trading activities for both long-term and short-term strategies.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc083cb826053dfd6939aca6c2ad0c54",
  "timestamp": "2025-05-15T01:59:56.259824"
}