{
  "id": 1126,
  "title": "The GSO-Deep Learning-based Financial Risk Management System for Rural Economic Development Organization",
  "abstract": "Financial risk management has always been a key concern for major enterprises. At the same time, with the continuous attention to impoverished rural areas worldwide, financial risk management tools have become an important component of rural economic development organizations to avoid financial risks. With the rapid development of artificial intelligence technologies such as neural networks and deep learning, and due to their strong learning ability, high adaptability, and good portability, some financial risk management tools are gradually adopting technologies such as neural networks and machine learning. However, existing financial risk management tools based on neural networks are mostly developed for large enterprises such as banks or power grid companies, and cannot guarantee their full applicability to rural economic development organizations. Therefore, this study focuses on the financial risk management system used for rural economic development organizations. In order to improve the accuracy of deep learning algorithms in predicting financial risks, this paper designs an improved Glowworm Swarm Optimization (IGSO) algorithm to optimize Deep Neural Networks (DNN). Finally, the effectiveness of the financial risk management tool based on IGSO-DNN proposed in this article was fully validated using data from 45 rural economic development organizations as a test set.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc086f0c51ca112c16810d2958a798d4",
  "timestamp": "2025-05-15T01:59:21.592819"
}