{
  "id": 2943,
  "title": "Material hardship and child neglect risk amidst COVID-19 in grandparent-headed kinship families: The role of financial assistance",
  "abstract": "Background: COVID-19 has exacerbated material hardship among grandparent-headed kinship families. Grandparent-headed kinship families receive financial assistance, which may mitigate material hardship and reduce child neglect risk. Objective: This study aims to examine (1) the association between material hardship and child neglect risk; and (2) whether financial assistance moderates this association in a sample of kinship grandparent-headed families during COVID-19. Participants and setting: Cross-sectional survey data were collected from a convenience sample of grandparent-headed kinship families (not necessarily child welfare involved) (N = 362) in the United States via Qualtrics Panels online survey. Methods: Descriptive, bivariate, and negative binomial regression were conducted using STATA 15.0. Results: Experiencing material hardship was found to be associated with an increased risk of child neglect, and receiving financial assistance was associated with a decreased risk of child neglect in the full sample and a subsample with household income > $30,000. Receiving financial assistance buffered the negative effect of material hardship on child neglect risk across analytic samples, and receiving SNAP was a significant moderator in the full sample. Among families with a household income <= $30,000, receiving SNAP and foster care payments was associated with a decreased risk of child neglect, while receiving TANF and unemployment insurance was associated with an increased risk of child neglect. Among families with household income > $30,000, only receiving SNAP was associated with a decreased risk of child neglect. Conclusions: This study suggests the potential importance of providing concrete financial assistance, particularly SNAP and foster care payments, to grandparent-headed kinship families in efforts to decrease child neglect risk during COVID-19.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc1517918bb5d8f2183d9a7a02bd5807",
  "timestamp": "2025-05-15T02:20:48.244601"
}