{
  "id": 1025,
  "title": "Enhancing decisions with life cycle analysis for risk management",
  "abstract": "Although corporate financial distress is an infrequent occurrence, it has an extremely debilitating effect on the stability of a firm when it does occur. For this reason, an accurate risk assessment mechanism is needed in numerous industry sectors, particularly in financial institutions and banking. Based on corporation life cycle theory and risk management, this study develops a risk pre-warning model, namely the RSVMDT model, to eliminate serious financial punching and to examine the effectiveness of transparency and the full disclosure index (TFDI) during each life cycle stage. The RSVMDT model includes three techniques: random forest (RF), support vector machines (SVMs), and decision trees (DTs). The RF is used to determine the essential attributes of firms and therefore decrease the computational complexity of financial analysis and improve the classification accuracy. The SVM is employed as a classifier to identify corporations in financial distress. Finally, the DT is utilized as a rule generator that allows decision makers to adjust the financial structures of firms at specific life cycle stages. Together, these three techniques can increase the probability of corporate survival in a highly competitive environment. Additionally, the study further evaluates the importance of the TFDI during a turbulent economy. The public sectors can benefit from this evaluation by formulating future policies based on the rules derived from the developed RSVMDT model.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc1ffa4b0a3b27cfb60a5079a75328f4",
  "timestamp": "2025-05-15T01:58:08.456973"
}