{
  "id": 4507,
  "title": "EVALUATION OF MORTALITY AND MORBIDITY ASSOCIATED WITH OSTEOPOROTIC HIP FRACTURE",
  "abstract": "Introduction: Hip fractures in older adults are associated with significant morbidity, mortality, loss of independence, and financial burdens. In this study, we assessed how factors influenced these effects in elderly patients presenting with hip fractures. Materials and Method: A prospective observational study was conducted over six months on all patients with fall and hip fractures above 50 years of age who presented to the orthopedics and traumatology clinic of our university hospital. Ambulation status, time until operation, vitamin D level, vertebral fractures, Charlson comorbidity index, and Fracture Risk Assessment Tool score were recorded. The patients' re-evaluated in the sixth month after the fracture. The relationship between death and risk factors was examined by regression analysis. Results:105 patients were included in the study. The mortality rate was 23.8%. The immobility rate also increased from before the operation to after 1.9% to 31.4%. Univariate regression analysis showed that mortality is related to age, Charlson comorbidity index, smoking history, and Fracture Risk Assessment Tool hip score. At the same time, multivariate regression analysis revealed an association between body mass index, smoking history, and mortality. Conclusion :Osteoporosis is a widespread disease that may remain hidden until complications, such as fractures, present themselves. Functional loss and mortality risk are high in patients with fractures. Age, Charlson comorbidity index, body mass index, smoking, Fracture Risk Assessment Tool hip score, and pre-fracture ambulation status affect mortality. A decrease in mortality can be achieved by monitoring risky individuals in fracture liaison services.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc1f49a43bef0d5df417160e5edf562c",
  "timestamp": "2025-05-15T02:37:47.596219"
}