{
  "id": 2816,
  "title": "Typology and correlates of parental stress among caregivers of children with DBDs in low-resourced communities in Uganda",
  "abstract": "Disruptive Behavior Disorders (DBDs) is one of the most common mental health problems among children in Uganda and SSA. Yet, to our knowledge no research has studied parenting stress (PS) among caregivers of children with DBDs, or investigated which risk factors originate from the child, parent, and contextual environment. Using a rigorous analytical approach, we aimed to: 1) identify different types and; 2) examine factors associated with PS and how correlates differ according to the type of stress experienced among caregivers of children with DBDs in low-resourced Ugandan communities. We used data from 633 caregivers of children with DBDs from SMART-Africa Uganda study. PS, was measured using the 36-item Parenting Stress Index-Short Form (PSI-SF). To identify focal correlates related to child/parent/contextual environment, we performed variable importance screening using the Stata command -gvselect- and specified mixed/melogit multilevel modeling with random effects. Secondly, focal correlates were included in the cross-fit partialing out lasso linear/logistic regression (double machine-learning) model. Caregivers mostly experienced stress from parental distress and caring for a child with difficult behavior. As scores increased by one unit on: caregiver mental health distress, PSI-SF increased by 0.23(95% CI = 0.15, 0.32) (reflecting higher stress levels); Child difficulties, PSI-SF increased by 0.77 (95% CI = 0.52, 1.02). Contrastingly, for every one unit increase in family cohesion scores, PSI-SF decreased by 0.54 (95% CI = -0.84, -0.23). Caregivers with college/diploma/undergraduate/graduate education had less stress than those completing primary only or never attended school [Coefficient = -8.06 (95% CI = -12.56, -3.56)]. Family financial supporters had significantly higher Parental distress than caregivers who were not [Coefficient = 2.68 (95% CI = 1.20, 4.16)]. In low-resource settings nomic empowerment interventions that improve community support systems and address financial barriers can reduce stress levels of caregivers of children with DBDs.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc25929d6fc4161c95edc5eaaa35c9cb",
  "timestamp": "2025-05-15T02:19:46.582716"
}