{
  "id": 2902,
  "title": "Network topology of the Argentine interbank money market",
  "abstract": "This article provides the first empirical network analysis of the Argentine interbank money market. Its main topological features are examined applying graph theory, focusing on the unsecured overnight loans settled from 2003 to 2017. The network, where banks are the nodes and the operations between them represent the links, exhibits lowdensity, a higher reciprocity than comparable random graphs, short average distances and its clustering coefficient remains above that of a random network of equal size. Furthermore, the network is prominently disassortative. Its structural metrics experienced significant volatility, in correlation with the economic activity fluctuations and regulatory shifts. Signs of nodes' random-like behaviour are detected during contractions. The degree distributions fit better to a Lognormal distribution than to a Poisson or a Power Law. Additionally, different node centrality measures are computed. It is found that a higher centrality enables a node to settle more convenient bilateral interest rates compared to the average market rate, identifying a statistical and economically significant effect by means of a regression analysis. These results constitute a relevant input for systemic risk assessment and provide solid empirical foundations for future theoretical modelling and shock simulations, especially in the context of underdeveloped financial systems.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc2deca95a3116e3c7922395c83536aa",
  "timestamp": "2025-05-15T02:20:16.963697"
}