{
  "id": 2146,
  "title": "Investor attention and its impact on portfolio volatility and sectoral risk spillovers in Borsa Istanbul",
  "abstract": "This study examines the impact of investor attention on portfolio volatility and sectoral risk spillovers in Borsa Istanbul. We use advanced econometric models, including E-GARCH-X, GJR-GARCH-X, and multivariate BEKKGARCH-X, and analyze daily data from January 2004 to June 2024. We find that abnormal investor attention, measured through the abnormal search volume index (ASVI) derived from the Google Search Volume Index (GSVI), significantly and positively predicts stock volatility. This relationship remains robust in long-short portfolios, even after controlling for risk factors in the capital asset pricing model (CAPM), Fama-French three-factor, and Carhart four-factor models. Sectoral analysis reveals that investor attention intensifies asymmetric conditional volatility in the finance, technology, banking, and mining sectors, indicating heightened sensitivity to investor attention and negative market news in these sectors. The BEKK-GARCH-X model results highlight that increased investor attention amplifies both intra-sector and inter-sector risk spillovers, particularly in the finance, industrial, and technology sectors, contributing to volatility clustering. These findings underscore the predictive power of GSVI data in capturing investor attention, challenging traditional market efficiency assumptions. The results emphasize the crucial role of behavioral factors in portfolio risk management and risk transmission dynamics within emerging markets, given their influence on investor decision-making. Furthermore, these findings suggest that monitoring investor attention levels can be valuable for predicting volatility and managing portfolio risk. Additionally, the findings suggest that policymakers must consider behavioral factors when crafting regulations to effectively mitigate volatility risks in emerging markets.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc40f656362938903e78bd5fdf6ee1de",
  "timestamp": "2025-05-15T01:03:36.614552"
}