{
  "id": 7605,
  "title": "An Investigation of the Relationship Between Banks' Use of Derivative Products and Sectoral and Macroeconomic Factors: An Application on the Turkish Banking Sector",
  "abstract": "This study aims to identify the factors determining the use of derivatives in the banking sector. The study sample consists of 23 deposit banks operating continuously in the Turkish banking sector between 2009 and 2022. Derivative products classified as forward foreign exchange transactions, swap currency transactions, swap interest rate transactions, futures transactions, and option transactions are analyzed in terms of selected financial indicators of banks, their characteristics, and their relationship with macroeconomic variables such as inflation. In the study, the random effect panel Tobit regression model is used as a method. The study's findings demonstrate that banks' derivative activities are significantly influenced by their on-balance sheet FX position. Size, capital, credit risk pressure, inflation, and foreign ownership strongly influence banks' use of derivatives. According to the study's findings, banks primarily use derivatives for hedging in over-the-counter market transactions and for speculation in organized market transactions. However, it has been observed that the drive for speculative trading is dominant in large banks. To counteract this trend, regulators could impose limits on how much banks can use derivative products, with the limits varying based on the bank's size, thereby reducing the incentives for large banks to engage in such practices.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc42743c1c391ae97627c37e506135a1",
  "timestamp": "2025-05-15T03:10:05.666517"
}