{
  "id": 545,
  "title": "A global analysis of the progress and failure of electric utilities to adapt their portfolios of power-generation assets to the energy transition",
  "abstract": "The penetration of low-carbon technologies in power generation has challenged fossil-fuel-focused electric utilities. While the extant, predominantly qualitative, literature highlights diversification into renewables among possible adaptation strategies, comprehensive quantitative understanding of utilities' portfolio decarbonization has been missing. This study bridges this gap, systematically quantifying the transitions of over 3,000 utilities worldwide from fossil-fuelled capacity to renewables over the past two decades. It applies a machine-learning-based clustering algorithm to a historical global asset-level dataset, distilling four macro-behaviours and sub-patterns within them. Three-quarters of the utilities did not expand their portfolios. Of the remaining companies, a handful grew coal ahead of other assets, while half favoured gas and the rest prioritized renewables growth. Strikingly, 60% of the renewables-prioritizing utilities had not ceased concurrently expanding their fossil-fuel portfolio, compared to 15% reducing it. These findings point to electricity system inertia and the utility-driven risk of carbon lock-in and asset stranding. To meet climate goals, electric utilities should be decarbonizing their power production, but historical analyses of this process are scarce. Using machine learning and data from more than 3,000 utilities globally, Galina Alova shows that even utilities that prioritize renewable energy continue to grow their fossil fuelled generation capacity.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc4891800e714ed7ff0eec54e4913b2c",
  "timestamp": "2025-05-15T00:45:01.251100"
}