{
  "id": 6741,
  "title": "ARMS2 Increases the Risk of Early and Late Age-related Macular Degeneration in the European Eye Study",
  "abstract": "Objective: To study associations between severity stages of early and late age-related macular degeneration (AMD) and genetic variations in age-related maculopathy susceptibility 2 (ARMS2) and complement factor H (CFH) and to investigate potential interactions between smoking and ARMS2. Design: Population-based, cross-sectional European Eye Study in 7 countries in Europe. Participants: Four thousand seven hundred fifty participants, 65 years of age and older, recruited through random sampling. Methods: Participants were classified on the basis of the more severely affected eye into 5 mutually exclusive AMD severity stages ranging from no AMD, 3 categories of early AMD, and late AMD. History of cigarette smoking was available and allowed classification into never, former, and current smokers, with the latter 2 groups combined into a single category of ever smokers for analysis. Genotyping was performed for single nucleotide polymorphisms rs10490924 and rs4146894 in ARMS2 and rs1061170 in CFH. Associations were analyzed by logistic regression. Main Outcome Measures: Odds ratios (ORs) for stage of AMD associated with genetic variations in ARMS2 and CFH and interactions between ARMS2 and smoking status. Results: Early AMD was present in 36.4% and late AMD was present in 3.3% of participants. Data on both genotype and AMD were available for 4276 people. The ORs for associations between AMD stage and ARMS2 increased monotonically with more severe stages of early AMD and were altered little by adjustment for potential confounders. Compared with persons with no AMD, carriers of the TT genotype for rs10490924 in ARMS2 had a 10-fold increase in risk of late AMD (P<3x10(-20)). The ORs for associations with CFH were similar for stage 3 early AMD and late AMD. Interactions between rs10490924 in ARMS2 and smoking status were significant in both unadjusted and adjusted models (P = 0.001). The highest risk was observed in those doubly homozygous for rs10490924 and rs1061170 in CFH (OR, 62.3; 95% confidence interval, 16-242), with P values for trend ranging from 0.03 (early AMD, stage 1) to 1 x 10(-26) (late AMD). Conclusions: A strong association was demonstrated between all stages of AMD and genetic variation in ARMS2, and a significant gene-environment interaction with cigarette smoking was confirmed. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2013;120:342-348 (C) 2013 by the American Academy of Ophthalmology.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc4f938bd8258d4a3650e2213e9483ff",
  "timestamp": "2025-05-15T03:01:03.623698"
}