{
  "id": 4242,
  "title": "Environmental, Social, Governance Risk and Corporate Sustainable Growth Nexus: Quantile Regression Approach",
  "abstract": "Despite a huge body of literature revealing that the effect of environmental, social and governance (ESG) scores on a firms' financial performance and value, it lacks the empirical research on the nexus between corporate sustainable growth and ESG risk in the existing research. The paper aims to examine the nexus between ESG risk and corporate sustainable growth. This study utilizes a quantile regression approach to explore how ESG risk affects corporate sustainable growth (proxied by sustainable growth rate, SGR). The ordinary least squares estimation results confirm that ESG significantly negatively affects corporate sustainable growth. The quantile regression results reveal ESG risk has a significant negative effect on corporate sustainable growth in the upper quantiles of SGR, but not in the lower and median quantiles. The results show that the impact of ESG risk on the corporate sustainable growth is asymmetric and affected by the distribution of SGR. Furthermore, the research results identify that the negative relationship between ESG risk and corporate sustainable growth is particularly apparent for firms in environmentally sensitive industries. This study greatly contributes to existing literature, as with this detailed knowledge, managers can make decisions based on these associations and identify the most lucrative course of action.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc58c1aacc61c47e5a6fc1c17c603347",
  "timestamp": "2025-05-15T02:34:48.922670"
}