{
  "id": 3412,
  "title": "A riskmeasurement study evaluating the impact of COVID-19 on China's financialmarket using the QR-SGED-EGARCH model",
  "abstract": "Due to the significant impact of COVID-19, financial markets in various countries have undergone drastic fluctuations. Accurately measuring risk in the financial market and mastering the changing rules of the stock market are of great importance to macro-control and financial market management of the government. This paper focuses on the return rate of the Shanghai Composite Index. Using the SGED-EGARCH(1,1) model as a foundation, a quantile regression is introduced to establish the QR-SGED-EGARCH(1,1) model. Further, the corresponding value at risk (VaR) is calculated for a crisis and stable period within each model. To better compare the models, the Cornish-Fisher expansion model is included for comparison. According to the Kupiec test, VaR values calculated by the QR-SGED-EGARCH(1,1) model are superior to other models at different confidence levels most of the time. In addition, to account for the VaR method's inability to effectively measure tail extreme risk, the expected shortfall (ES) method is introduced. The constructed model is used to calculate the corresponding ES values during different periods. According to the evaluation index, the ES values calculated by the QR-SGED-EGARCH(1,1) model have a better effect during a crisis period with the model showing higher accuracy and robustness. It is of great significance for China to better measure financial risk under the impact of a sudden crisis.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc63cce0c778f475b2e7eb77989b61f1",
  "timestamp": "2025-05-15T02:25:40.252833"
}