{
  "id": 6371,
  "title": "Women's income and risk of intimate partner violence: secondary findings from the MAISHA cluster randomised trial in North-Western Tanzania",
  "abstract": "Background Intimate partner violence (IPV) is pervasive throughout the world, with profound consequences for women's health. While women's 'economic empowerment' is touted as a potential means to reduce IPV, evidence is mixed as to the role of different economic factors in determining women's risk. This paper explores associations and potential pathways between women's income and experience of IPV, in Mwanza city, Tanzania. Methods We use data from married/cohabiting women (N = 740) enrolled in the MAISHA study, a cluster randomised trial of an IPV prevention intervention. Women were interviewed at baseline and 29-months later. We use logistic regression to model cross-sectional (baseline) and longitudinal associations between: a woman's monthly income (quartiles) and her past year risk of physical IPV, sexual IPV and economic abuse; and a woman's relative financial contribution to the household (same/less than partner; more than partner) and past year physical IPV and sexual IPV. Results At baseline, 96% of respondents reported earning an income and 28% contributed more financially to the household than their partner did. Higher income was associated with lower past-year physical IPV risk at baseline and longitudinally, and lower sexual IPV at baseline only. No clear associations were seen between income and economic abuse. Higher relative financial contribution was associated with increased physical IPV and sexual IPV among all women at baseline, though only among control women longitudinally. Higher income was associated with several potential pathways to reduced IPV, including reduced household hardship, fewer arguments over the partner's inability to provide for the family, improved relationship dynamics, and increased relationship dissolution. Those contributing more than their partner tended to come from more disadvantaged households, argue more over their partner's inability to provide, and have worse relationship dynamics. Conclusions While women's income was protective against IPV, women who contributed more financially than their partners had greater IPV risk. Poverty and tensions over men's inability to provide emerge as potentially important drivers of this association. Interventions to empower women should not only broaden women's access to economic resources and opportunities, but also work with women and men to address men's livelihoods, male gender roles and masculinity norms.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc63d4103ce898711c9c05676aec1055",
  "timestamp": "2025-05-15T02:57:38.697688"
}