{
  "id": 3288,
  "title": "The influence of reflection on portfolio learning in undergraduate dental education",
  "abstract": "Introduction Disparity exists between the growing consensus about the positive effects of reflection on performance and the scarcity of empirical evidence demonstrating this effect. Portfolios are considered a useful instrument to assess and supervise competence-based education and to stimulate reflection. The present study describes the introduction of a portfolio in a social dentistry and oral health promotion course and investigates student reflection as a predictor for the acquisition of the other competences in the course. Methods Fourth year undergraduate dental students (n similar to=similar to 110) in the course Society and Health between 2008 and 2011 collected evidence in their portfolios, demonstrating the acquisition of five competences: the ability to (1) assess the oral health profile of a target group; (2) integrate theoretical models in health promotion; (3) search for and apply scientific evidence; (4) work trans-, multi- and/or trans-disciplinarily; (5) reflect on personal development. Linear regression analysis was used to investigate the predictive value of reflection on the other course related competences. Results Reflection scores proved to significantly predict other course-related competences, when analysing all students between 2008 and 2011 and for each year separately, explaining between 10.7% and 25.5% of the variance in the other competences. Conclusion Undergraduate dental students' competences related to social dentistry and oral health promotion were significantly predicted by the reflection scores obtained in a portfolio-based context. In line with the growing consensus about the benefits of reflection for dental students and professionals, results suggest the value to further develop the integration of reflection in dental education and practice.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc6c0b63e188aa41ea23a6404c2658ee",
  "timestamp": "2025-05-15T01:15:26.204689"
}