{
  "id": 4051,
  "title": "The Impact of Livelihood Risk on Farmers of Different Poverty Types: Based on the Study of Typical Areas in Sichuan Province",
  "abstract": "After the completion of China's poverty alleviation task in 2020, the poverty situation will undergo major changes, and the focus of poverty alleviation work will shift to solving relative poverty. This can provide useful inspiration for the government to formulate and implement relevant policies that explore the differences in livelihood risk impacts of different types of farmers in areas where disasters and poverty are intertwined. This study used survey data of 327 households in four districts and counties in the hardest-hit areas of the Wenchuan Earthquake and Lushan Earthquake in China's Sichuan Province in 2018. This study measured farmers' livelihood risks from four aspects: health risks, environmental risks, financial risks, and social risks, and measured farmers' poverty types from three aspects: absolutely poor farmers, relatively poor farmers, and non-poor farmers. It systematically analyzed the four types of livelihood risks faced by farmers and the three types of poverty they were in, and constructed a multinomial logistic regression to explore the correlation between livelihood risks and poverty types. This study is the first to compare the relatively poor type with other poverty types. The second innovation is that it uses the entropy method and multinomial logistic regression. The results showed that: (1) Among the four livelihood risks faced by farmers, the biggest was the environmental risk, the next was financial risk, the third was health risk, and the last was social risk. (2) Among the three poverty types, farmers in absolute poverty were the most populated, with non-poor farmers next, and relatively poor farmers at the bottom. (3) Farmers of different poverty types were affected by livelihood risks to different degrees. Specifically, when compared with the impacts on farmers in absolute poverty, the impacts social risks could bring to farmers in relative poverty were more severe while the impacts of health risks, environmental risks and financial were not that strong. Impacted by social risks, relatively poor farmers are more seriously impacted by public affairs and social security status. When compared with the impacts on non-poor farmers, the impacts of all these four risks on relatively poor farmers were not notable.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc6d891c116740162aa712fbf81ff168",
  "timestamp": "2025-05-15T02:32:27.617910"
}