{
  "id": 6825,
  "title": "Incremental Hospital Cost and Length-of-stay Associated With Treating Adverse Events Among Medicare Beneficiaries Undergoing Cervical Spinal Fusion During Fiscal Year 2013 and 2014",
  "abstract": "Study Design. A retrospective study. Objective. To report the incremental hospital resources consumed with treating adverse events experienced by Medicare beneficiaries undergoing a two or three vertebrae level cervical spinal fusion. Summary of Background Data. Hospitals are increasingly at financial risk for patients experiencing adverse events due pay for performance.'' Little is known about incremental resources consumed when treating patients who experienced an adverse event after cervical spinal fusions. Methods. Fiscal years 2013 and 2014 Medicare Provider Analysis and Review file was used to identify 86,265 beneficiaries who underwent 2 or 3 vertebrae level cervical spinal fusion. International Classification of Diseases 9th Clinical Modification diagnostic and procedure codes were used to identify 10 adverse events. This study estimated both the observed and risk-adjusted incremental hospital resources consumed (cost [ 2014 US $] and length-of-stay) in treating beneficiaries experiencing each adverse event. Results. Overall, 6.2% of beneficiaries undergoing cervical spinal fusion experienced at least one of the study's adverse events. Beneficiaries experiencing any complication consumed significantly more hospital resources (incremental cost of $ 28,638) and had longer length-of-stay (incremental stays of 9.1 days). After adjusting for patient demographics and comorbid conditions, incremental cost of treating adverse events ranged from $ 42,358 (infection) to $ 10,100 (dural tear). Conclusion. Adverse events frequently occur and add substantially to the hospital costs of patients undergoing cervical spinal fusion. Shared decision-making instruments should clearly provide these risk estimates to the patient before surgical consideration. Investment in activities that have been shown to reduce specific adverse events is warranted, and this study may allow health systems to prioritize performance improvement areas.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc71e3a5cb11a75043bb4cc13ce064c9",
  "timestamp": "2025-05-15T03:02:07.455342"
}