{
  "id": 3812,
  "title": "Dynamic expansion planning of a commercial virtual power plant through coalition with distributed energy resources considering rival competitors",
  "abstract": "We consider a virtual power plant (VPP) that expands its capacity by forming a coalition with decentralized energy resources (DERs) such as controllable and renewable power plants, as well as with energy storage systems and flexible demands. The VPP competes with rival VPPs to aggregate the DERs to its own portfolio. This problem is formulated as a three-stage stochastic bi-level model, where the expected profit of the VPP is maximized in the upper-level problem, while the lower-level problems deal with the decisions of each DER regarding the selection of VPP. In the first stage, the VPP manager places bids to secure each DER auction. The second stage involves decisions to determine the DER auctions, forming the VPP coalition and the procurement of power from the day-ahead market. Uncertainties in this stage include bid prices of rival VPPs and the minimum selling price of DERs. Finally, in the third stage, the expanded VPP determines its optimal operation and manages uncertainties related to renewable energy production levels and market prices. The conditional value-at-risk (CVaR) is incorporated into the model as a risk metric to deal with the profit risk associated with the decisions of the VPP manager. The duration of the coalition forming is mid-term, spanning one month. To reduce the computational burden of the problem, the variability of parameters such as market prices and renewable energy production levels (both solar and wind) is modeled using representative days generated by a clustering K-medoids method. Through a case study using data from the Spanish electricity market, it is demonstrated that weather conditions and electricity demand significantly influence the coalition formation.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc781bfe5d94aa57a18917602d1fb968",
  "timestamp": "2025-05-15T01:21:08.217340"
}