{
  "id": 6880,
  "title": "Improving risk factor management for patients with poorly controlled type 2 diabetes: a systematic review of healthcare interventions in primary care and community settings",
  "abstract": "Objectives Poorly controlled type 2 diabetes mellitus (T2DM) is a major international health problem. Our aim was to assess the effectiveness of healthcare interventions, specifically targeting patients with poorly controlled T2DM, which seek to improve glycaemic control and cardiovascular risk in primary care settings. Design Systematic review. Setting Primary care and community settings. Included studies Randomised controlled trials (RCTs) targeting patients with poor glycaemic control were identified from Pubmed, Embase, Web of Science, Cochrane Library and SCOPUS. Poor glycaemic control was defined as HbA1c over 59 mmol/mol (7.5%). Interventions Interventions were classified as organisational, patient-oriented, professional, financial or regulatory. Outcomes Primary outcomes were HbA1c, blood pressure and lipid control. Two reviewers independently assessed studies for eligibility, extracted data and assessed study quality. Meta-analyses were undertaken where appropriate using random-effects models. Subgroup analysis explored the effects of intervention type, baseline HbA1c, study quality and study duration. Meta-regression analyses were undertaken to investigate identified heterogeneity. Results Forty-two RCTs were identified, including 11 250 patients, with most undertaken in USA. In general, studies had low risk of bias. The main intervention types were patient-directed (48%) and organisational (48%). Overall, interventions reduced HbA1c by -0.34% (95% CI -0.46% to -0.22%), but meta-analyses had high statistical heterogeneity. Subgroup analyses suggested that organisational interventions and interventions on those with baseline HbA1c over 9.5% had better improvements in HbA1c. Meta-regression analyses suggested that only interventions on those with population HbA1c over 9.5% were more effective. Interventions had a modest improvement of blood pressure and lipids, although baseline levels of control were generally good. Conclusions This review suggests that interventions for T2DM, in primary care, are better targeted at individuals with very poor glycaemic control and that organisational interventions may be more effective.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc7fc74f006ab60597e7088f72f3515c",
  "timestamp": "2025-05-15T03:02:41.231159"
}