{
  "id": 3817,
  "title": "A mechanics-based method towards risk assessment of RC buildings under tsunami and flow-type hazards",
  "abstract": "The study presents a simple mechanics-based method to develop analytical fragility functions for the risk assessment of Reinforced Concrete (RC) frame buildings subjected to tsunami or other flow-type hazards (i.e., flood, mud flows, flow-type landslides, etc.). A harmonized framework for the analysis of building portfolios to flow-type hazards is first illustrated. The mechanics-based method for the performance assessment of RC frames with breakaway infill walls subjected to tsunami and flow-type loads, called SAFETI (Structural Assessment to Flows and Extreme Tsunami Inundation), is then presented. For the large-scale risk analysis, a damage levels classification is adopted for both structural and non-structural (i.e., infill walls) components, based on the HAZUS approach. The flow depth is assumed as Intensity Measure. Damage levels computed through SAFETI are validated with ones obtained from a refined finite-element modelling in OpenSees for three case-study RC frames subjected to tsunami. Finally, an application of the SAFETI method is presented to show the feasibility of the mechanics-based procedure to derive analytical fragility curves for a simulated case-study building portfolio subjected to tsunami, flow-type landslides, and flood. The SAFETI method appears a robust solution to perform a consistent fragility assessment at regional scale for tsunami and flow-type hazards, explicitly accounting for the building-to-building variability with limited modelling and computational efforts.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc8211966605d4de5e6e8596bb929662",
  "timestamp": "2025-05-15T01:21:08.228848"
}