{
  "id": 1111,
  "title": "Systemic risk measurement: A Quantile Long Short-Term Memory network approach",
  "abstract": "In finance, systemic risk is the risk that the crisis of an institution could trigger instability or bring down an entire system or market. The Delta Conditional Value-at-Risk is a market-based measure proposed by the recent literature to quantify the systematicity of some financial institutions. Several methods have been proposed to estimate this measure, and the choice of the best method is still an open question. The bivariate constant conditional correlation GARCH model represents one of the most preferred approaches since it allows the computation of the Delta Conditional Value-at-Risk in a closed form. Nevertheless, it requires strong distributional assumptions that are often considered unrealistic. We develop a Quantile Long Short-Term Memory network approach that allows the estimation of the Delta Conditional Value-at-Risk of several financial institutions simultaneously. The model consists of a multi -output neural network able to provide, at the same time, the log-return quantiles of different institutions useful to measure the systemic risk. Furthermore, the proposed model does not need any particular assumption, and it is specifically designed to avoid quantile crossing issues affecting the traditional quantile regression-based approach. Numerical experiments on data of some global systemically important banks reported in the Financial Stability Board validated our approach. We obtain Delta Conditional Value-at-Risk estimates that accurately capture market dynamics and produce a ranking of systemic banks that meets the desired properties of stability and persistence.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bc98864e4d50953715fa1e08a81b4b1c",
  "timestamp": "2025-05-15T01:58:43.532102"
}