{
  "id": 7979,
  "title": "Determinants of capital buffer in Islamic banks: the lesson from Indonesia",
  "abstract": "Our research explores the determinants of capital buffers in Indonesian Islamic banking, which is ranked 10th in the world. The explanatory variables consist of competition, profit loss sharing (PLS) financing, and bank-specific variables such as bank size, stability, total financing, efficiency and financing risk. All Islamic banks, 34 banks, are selected for the purpose of this study, covering from 2014 to 2020 and using quarterly data. The dynamic panel regression is employed and estimated using the bias-corrected least-squares dummy variable (LSDVC) that generates a more robust estimator than the widely used GMM method for the case of the small cross-section unit with the unbalanced panel. The findings evidently show that low competition discourages banks from having a high capital buffer. Stability, bank size and high financing default encourage banks to build up a high capital buffer. By contrast, PLS financing, total financing and operating inefficiency lower capital buffers. Interestingly, being a full-fledged Islamic bank gives more benefits than an Islamic bank window in building up a capital buffer. Our study has important implications for the Indonesian Financial Service Authority as a policymaker. Converting an Islamic bank window to a full-fledged Islamic bank through a spin-off policy must be implemented immediately according to Indonesian Islamic bank law no 23/2008 to encourage strong and sound Islamic banking in Indonesia.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bcac0f7048fa8adcb9acaa8ca55a2330",
  "timestamp": "2025-05-15T03:14:07.183935"
}