{
  "id": 6845,
  "title": "Socio-economic inequalities in social network, loneliness and mental health during the COVID-19 pandemic",
  "abstract": "Background: During the COVID-19 pandemic, a focus on isolation and loneliness is important, especially as social distancing policies (which for some groups involve self-isolation or quarantine) are likely to accentuate these experiences and affect mental health. Aims: This study focuses on socio-economic inequalities in social network, loneliness and mental health during the COVID-19 pandemic. Methods: Two-hundred and fourteen residents of Wandsworth, a South West London Borough in the United Kingdom completed an online cross-sectional survey on the impact of COVID-19 on mental health. Data were analysed using independent samples t-tests and multiple regression. Results: Middle-aged people reported a less strong social network and more loneliness, anxiety and depression than younger people. People with a long-term health condition reported a less strong social network, more loneliness, more general practitioner (GP) and hospital visits, and poorer mental health than those with no long-term health conditions. People receiving State financial benefits reported less use of public spaces, a less strong social network, more loneliness, more GP and hospital visits and poorer mental health than those not receiving benefits. Greater neighbourhood identification was associated with a stronger social network and better mental health outcomes. Multiple regression analyses showed that, over and above loneliness, perceived personal risk of COVID-19 constitutes an additional precipitant for both depression and anxiety when controlling for other variables. Conclusion: As a novel stressor associated with the pandemic, the situational and involuntary perception of being at risk of COVID-19 may be stimulating anxiety and depressive symptomatology, which will need to be managed effectively as resurgences of the disease are predicted and communicated to the general public under growing mistrust and uncertainty.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bce6710086ee8bfab3113959b69f9bf7",
  "timestamp": "2025-05-15T03:02:07.517085"
}