{
  "id": 8590,
  "title": "ICF-based prediction of return to work after trauma rehabilitation: Results of the icfPROreha study in patients with severe musculoskeletal injuries",
  "abstract": "Background: Physical aspects such as the type and severity of an injury are not the only factors contributing to whether or not a person can return to work (RTW) after a serious injury. A more comprehensive, biopsychosocial approach is needed to understand the complexity of RTW fully. The study aims to identify predictors of RTW 78 weeks after discharge from initial inpatient trauma rehabilitation in patients with severe musculoskeletal injuries using a biopsychosocial perspective.Methods: This is a prospective multicenter longitudinal study with a follow-up of up to 78 weeks after discharge from trauma rehabilitation. Data on potential predictors were collected at admission to rehabilitation using a comprehensive assessment tool. The status of RTW (yes vs. no) was assessed 78 weeks after discharge from rehabilitation. The data were randomly divided into a training and a validation data set in a ratio of 9:1. On the training data, we performed bivariate and multiple logistic regression analyses on the association of RTW and potential predictors. The final logit model was selected via stepwise variable selection based on the Akaike information criterion. The final model was validated for the training and the validation data.Results: Data from 761 patients (n = 561 male, 73.7%; mean age: 47.5 years, SD 12.3), primarily suffering from severe injuries to large joints and complex fractures of the large tubular bones, could be considered for analyses. At 78 weeks after discharge, 618 patients (81.2%) had returned to work. Eleven predictors remained in the final logit model: general health, current state of health, sensation of pain, limitations and restrictions in activities and participation (disability), professional sector, ongoing legal disputes, financial concerns (assets), personality traits, life satisfaction preaccident, attitude to life, and demand for pension claim. A predicted probability for RTW based on the multiple logistic regression model of 76.3% was revealed as the optimal cut-off score based on the ROC curve.Conclusion: A holistic biopsychosocial approach is needed to address RTW and strengthen person-centered treatment and rehabilitation. Patients at risk for no RTW in the long term can already be identified at the onset of rehabilitation.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bcf57f82a96a4dd0f3ea208d65b10c02",
  "timestamp": "2025-05-15T03:20:22.255560"
}