{
  "id": 2105,
  "title": "Exchange Traded Fund Clustering via Metric Learning",
  "abstract": "Asset allocation is one of the key elements in financial market. The rationale is to invest on various assets that are different from each other. Lots of methods have been proposed to classify assets into different sub groups. But most of the ideas are either too macroscopic or too mathematical. These methods use lots of financial ideas that may contain human biases such as Merrill Lynch investment clock, or use some close-formed mathematical measurement that cannot easily incorporate financial insights. In this paper, we create diversified portfolios using clustering analysis. We use a nonlinear metric learning algorithm called ITML, which combines financial knowledge with mathematical metrics. It controls the amount of prior information used in the model and can be customized based on different scenarios. Back-testing results show that portfolios generated by our algorithm significantly outperform portfolios from random-selected ETF. ETF is Exchange Traded Fund, which can be traded easily like stocks. The indicators we used to evaluate the portfolios include return, correlation, volatility, Sharpe Ratio and maximum drawdown. The tests are based on Monte Carlo simulations and we allocate the assets based on risk parity. We use 149 most typical ETFs from global market including high/low risk bond ETFs, stock ETFs on Chinese, HK, Germany and US markets in different industry sectors, silver/gold ETFs and energy commodity ETFs. Moreover, features observation gives satisfying explanation for clustering results and shows our model offers good interpretability.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bcf8337ca545545c896f8b8c23435da6",
  "timestamp": "2025-05-15T02:10:59.108834"
}