{
  "id": 6110,
  "title": "A novel model for predicting mortality in the management of deep neck infections",
  "abstract": "Objectives Deep neck infections (DNIs) are a common and intractable disease encountered in ENT clinics that impose a significant medical and financial burden on affected individuals and their families. However, insufficient data are currently available for predicting outcomes in cases of DNI. The present study thus sought to develop a novel model capable of predicting treatment outcomes of DNI patients just using indicators at the visit. Methods Patients with DNIs treated from 2010 to 2022 were included in the present study. Patient data were retrospectively collected from medical records. Risk factors associated with mortality were identified using logistic regression models. A predictive model was constructed based on odds ratios for factors calculated using a multivariate regression model. Results In total, 153 patients were enrolled in the present study. Risk factors associated with mortality included age >50 years, residence in a rural area, dyspnea at visit, the involvement of multiple infected sites, serum albumin<34 g/L, renal insufficiency, mediastinitis, pulmonary infection, and septic shock. A multivariate regression model revealed that mediastinitis (OR: 7.308, P < 0.001), serum creatinine>95 mu mol/L (OR: 23.363, P < 0.05), and serum albumin<34 g/L (OR: 13.837, P < 0.05) were independent predictors of mortality in deep neck infection patients, with serum creatinine>95 mu mol/L being particularly critical to the outcomes. Diabetes was not the predictor of mortality but was associated with long-term hospitalization (P < 0.001). Conclusions In summary, the model constructed in the present study was capable of estimating the potential for poor outcomes in DNI patients before the initiation of treatment. These findings may help improve doctor-patient communication, especially for those struggling financially.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bcfe0b2a792fa390497fe4a70905c35b",
  "timestamp": "2025-05-15T02:54:39.161645"
}