{
  "id": 5480,
  "title": "Portfolio optimisation under changing risk via time-varying beta",
  "abstract": "Purpose - The paper is aimed at modelling time varying betas via a state space representation in order to decompose the marginal contribution to risk of downside and upside deviations of asset returns in portfolio optimisation. Design/methodology/approach - The approach enables to take into account the relationship between risk and excess returns in up-side and down-side markets and to arrange a flexible asset allocation model which directly incorporates the investor risk tolerance to positive or negative expected market moves. The model volatility through state space models and the Kalman filter, widely used to recursively and optimally estimate time varying betas. Findings - The study shows that the application of an asset allocation model which splits beta in two parts, one related to Bear and the other to Bull markets, and reconciles them with a non negative risk aversion parameter may produce interesting financial results if compared with typical passive portfolios. The proposed model was tested by conducting extensive empirical evaluations on a set securities belonging to eight different markets. The outcomes show that active strategies can be developed and can lead to better performances. Research implications - The research affects optimisation models in particular considering the volatility indicators usually estimated not only by researchers but also by practitioners. Originality/value - In financial literature we find empirical evidence that the constant beta model may be inaccurate and hazardous to use in asset allocation decisions and many statistical techniques have been developed to estimate time dependent betas. Rolling regression procedures allow to capture beta dynamics but require the definition of the estimation period. The paper provides an empirical analysis referred both to European and American market data which let us to allocate assets avoiding the usual limits of standard volatility indicators.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd0866042968c6df8985620092c9f19d",
  "timestamp": "2025-05-15T02:48:23.658342"
}