{
  "id": 6641,
  "title": "Factors Affecting Corporate Investment Decision: Evidence from Vietnamese Economic Groups",
  "abstract": "This paper analyzes factors affecting corporate investment decisions in economic groups listed on the Vietnam stock market. The panel data of the research sample includes 39 economic groups listed on the Vietnam stock market from 2009 to 2019. The Generalized Least Square (GLS) is employed to address econometric issues and to improve the accuracy of the regression coefficients. In this research, the investment rate is a dependent variable. Cash-flow (CF), Investment opportunities (ROA), Fixed capital intensity (FCI), Leverage (LEV), Sales growth (GR), Size (M), Business risk (RISK) are independent variables in the study. The model results show that cash flow and sales growth have the same impact on investment decisions of economic groups in Vietnam. In addition, investment opportunities have a negative impact on the capital investment decisions of economic groups. The remaining factors include fixed capital intensity, leverage, firm size, and business risks that have a weak and insignificant impact on capital investment decisions of economic groups in Vietnam. The findings of this article are useful for business administrators, and helping business managers make the right financial decisions. Besides, the research results are also meaningful to money management agencies. The authors recommend that the State Bank of Vietnam should maintain a sustainable monetary policy.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd0c03e4313669adb288677b107e5164",
  "timestamp": "2025-05-15T03:00:05.015350"
}