{
  "id": 3983,
  "title": "Dynamic risk spillovers from oil to stock markets: Fresh evidence from GARCH copula quantile regression-based CoVaR model",
  "abstract": "This study proposes a GARCH copula quantile regression model to capture the downside and upside tail dependence between oil price change and stock market returns at different risk levels. In the model, ten copulas are provided to measure the nonlinearity of the tail dependence with the marginal distribution built on the GARCH family models. Using daily price data of stock markets in ten important countries and Brent oil market, we estimate the downward and upward risk spillovers from oil to stock markets. The empirical results suggest strong evidence of risk spillover effects from oil to stock markets. Furthermore, downside and upside risk spillovers from oil to the Italian and German stock markets, and the Brazilian and Russian stock markets are the largest for developed countries and emerging market countries, respectively. The US and Mexican stock markets display the smallest downside and upside risk spillovers for two types of countries. We also find evidence that the downside risk spillovers are larger than upside risk spillovers, a finding which is consistent with the flight-to-quality phenomenon. Finally, the dynamic risk spillover effects show heterogeneity over time and are compar-atively different for each country. Our results provide significant implications for portfolio managers and in-ternational regulators who want to optimize their investment portfolios and maintain stock market stability.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd1864ce801e71d86dc4d488ff9fd718",
  "timestamp": "2025-05-15T01:22:39.425529"
}