{
  "id": 8359,
  "title": "Discharge against medical advice in trauma patients: Trends, risk factors, and implications for health care management strategies",
  "abstract": "Objective: Given the nonelective nature of most trauma admissions, patients who experience trauma are at a particular risk of discharge against medical advice. Despite the risk of unplanned readmission and financial burden on the health care system, discharge against medical advice among hospitalized patients continues to rise. The present study aimed to assess evolving trends and outcomes associated in patients with discharge against medical advice among patients hospitalized for traumatic injury. Methods: The 2016-2020 Nationwide Readmissions Database was queried to identify all hospitalizations for traumatic injuries. The patient cohort was stratified into those who had discharge against medical advice and those who did not. Temporal trends of discharge against medical advice and associated costs over time were evaluated using nonparametric tests. Multivariable regression models were developed to assess factors associated with discharge against medical advice. Associations of discharge against medical advice with length of stay, hospitalization costs, and unplanned 30-day readmission were subsequently evaluated. Results: Of an estimated 4,969,717 patients, 65,354 (1.3%) had discharge against medical advice after hospitalization for traumatic injury. Over the study period, the incidence of discharge against medical advice increased (nptrend <0.001). After risk adjustment, older age (adjusted odds ratio, 0.98/per year; 95% confidence interval, 0.97-0.98), female sex (adjusted odds ratio, 0.65; 95% confidence interval, 0.64-0.67), and management at high-volume trauma center (adjusted odds ratio, 0.71; 95% confidence interval, 0.69-0.74) were associated with lower odds of discharge against medical advice. Compared with others, discharge against medical advice was associated with decrements in length of stay by 1.3 days (95% confidence interval, 1.1-1.5 days) and index hospitalization costs by $2,200 (5% confidence interval, $1,600-2,900), while having a greater risk of unplanned 30-day readmission (adjusted odds ratio, 2.21; 95% confidence interval, 2.06-2.36). Conclusion: The incidence of discharge against medical advice and its associated cost burden have increased in recent years. Community-level interventions and institutional efforts to mitigate discharge against medical advice may improve the quality of care and resource allocation for patients with traumatic injuries. (c) 2024 The Authors. Published by Elsevier Inc. This is an open access article under the CC BY-NC license (http://creativecommons.org/licenses/by-nc/4.0/).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd2846a9f1ff2ecc931880b53ba7f2d1",
  "timestamp": "2025-05-15T03:17:49.208644"
}