{
  "id": 3886,
  "title": "Hedge and safe-haven attributes of faith-based stocks vis-a-vis cryptocurrency environmental attention: a multi-scale quantile regression analysis",
  "abstract": "The attractiveness of the equities of the Islamic faith-compliant companies as a hedge or possible diversifier has been underscored; however, there is a lack of empirical research on their safe-haven and hedge attributes against changes in the level of cryptocurrency environmental attention (ICEA). We examine whether various distributions of the ICEA possess a significant predictive power on various quantiles of Islamic sectoral stock returns by employing weekly data on the ICEA and Shariah-compliant stocks from 10 sectors of economic activity and base their multi-scale analysis on the complete ensemble empirical mode decomposition (CEEMDAN) approach. We present the asymmetric causality-in-means and quantile-on-quantile regression between the ICEA and Islamic stocks. The empirical results show a significant predictive power of the ICEA on various quantiles of Islamic sectoral stocks in the medium- and long term. We find that the safe-haven and hedging attributes of investments in Islamic stocks are sector-dependent across the medium- and long-term scales. Hence, our findings emphasize that based on market states, possible safe-haven attributes, diversification opportunities, and hedges for cross-sectoral investments with Islamic stocks are viable along various investment horizons for diverse levels of cryptocurrency environmental attention. These findings provide original valuable insights for portfolio management and improving financial stability.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd2b85b5d1db835e1b56e7bee33c0b09",
  "timestamp": "2025-05-15T01:21:41.424984"
}