{
  "id": 3818,
  "title": "University-Industry partnerships in the smart specialisation era",
  "abstract": "The effect of diversification versus specialisation, as well as the technological proximity of R&D partners have been at the heart of innovation studies. Articles in this field either take a regional or company point of view. During the last few decades, studies on the relatedness of knowledge and its importance for innovation and commercialisation have pushed policy makers towards clustering strategies such as smart specialisation in the EU and the Innovation Supercluster Initiative in Canada. Interestingly, universities as the source of new knowledge and technologies have been absent from this literature as the focal point. This paper aims at filling one of the missing links between the literature on technological relatedness and university research commercialisation. We use patent and licence data from the USPTO and the AUTM survey to study the effect of patent portfolio composition on university research commercialisation. We use Shannon's entropy index to differentiate between the effects of related and unrelated diversification on the number of licences generating income. Our results show a positive association of related diversification with the number of licences, but none for unrelated diversification. Furthermore, technological proximity follows an inverted-U shaped association with the number of licences generating income. However, the effect is observed only for smaller universities. We conclude that the curvilinear association is the result of cognitive distance and the absence of boundary spanners. Our findings indicate that regional policy makers intending to use universities as an engine for innovation and regional economic growth should consider policies and initiatives aimed at bridging the cognitive gap between university and industry by either increasing technological proximity or reducing cognitive distances by financing boundary spanning organisations.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd3bb87ae774343dd95eed637fc8bb8e",
  "timestamp": "2025-05-15T01:21:08.230352"
}