{
  "id": 9012,
  "title": "Association between Semaglutide and Nonarteritic Anterior Ischemic Optic Neuropathy A Multinational Population-Based Study",
  "abstract": "Purpose: To investigate whether semaglutide increases the risk of nonarteritic anterior ischemic optic neuropathy (NAION) in the general population. Design: This retrospective cohort study used a deidentified global electronic medical records database. The enrollment period was extended from January 2017 to August 2023, with observations concluding in August 2024. Participants: This study included individuals with type 2 diabetes mellitus (T2DM) or obesity. They were further categorized into T2DM-only, obesity-only, and T2DM with obesity groups to assess the differences among these subgroups. The effects of semaglutide were compared with those of glucose-lowering or weight-loss medications other than glucagon-like peptide receptor agonists. Methods: Patient data were obtained from 160 health care organizations across 21 countries. Outcomes were evaluated at 1, 2, and 3 years of follow-up. A 1:1 propensity score matching was performed to balance age, sex, body mass index, hemoglobin A1C, medications, and underlying comorbidities. Cox regression models were used to compute hazard ratios (HRs) and 95% confidence intervals (CIs). Main Outcome Measures: The occurrence of NAION. Results: The final analysis included 37 314 participants with T2DM only, 129 690 participants with obesity only, and 130 216 participants with both T2DM and obesity. The results indicated that the administration of semaglutide was not associated with the development of NAION in the T2DM-only group (1-year follow-up: HR, 2.32; 95% CI, 0.60-8.97; 2 years: HR, 2.31; 95% CI, 0.86-6.17; 3 years: HR, 1.51; 95% CI, 0.71-3.25), the obesity-only group (1-year follow-up: HR, 0.41; 95% CI, 0.08-2.09; 2 years: HR, 0.67; 95% CI, 0.20-2.24; 3 years: HR, 0.72; 95% CI, 0.24-2.16), and the T2DM with obesity group (1 year follow-up: HR, 0.81; 95% CI, 0.42-1.57; 2 years: HR, 1.2; 95% CI, 0.74-1.94; 3 years: HR, 1.19; 95% CI, 0.78-1.82). Conclusions: The findings suggest that semaglutide may not be associated with an increased risk of NAION in the general population. Therefore, avoidance of semaglutide based solely on concerns regarding the risk of NAION may not be warranted because its potential benefits for blood glucose control and cardiovascular health likely outweigh its potential risks. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2025;132:381-388 (c) 2024 by the American Academy of Ophthalmology",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd43a7ed2178ebd0c77afaa6a7a0c664",
  "timestamp": "2025-05-15T03:24:26.424574"
}