{
  "id": 8664,
  "title": "Catastrophic Out-of-Pocket Health Expenditure Among Rural Households in the Semi-Pastoral Community, Western Ethiopia: A Community-Based Cross-Sectional Study",
  "abstract": "Background: Every year, 808 million people face catastrophic health expenditure (CHE), and 122 million people were pushed into poverty. It aggravates healthcare inequalities, incurs double burden opportunity costs, and pushes households to sit in a deep poverty trap. A few studies have been done so far; however, it is not enough to inform policy decisions. Therefore, this study aimed to assess the catastrophic out-of-pocket health expenditure and associated factors among rural households in Mandura District, Western Ethiopia. Methods: We conducted a community-based cross-sectional study among the Mandura district's 488 rural households from April to May 2017. We used a multistage systematic sampling technique to select the participants. We fitted a binary logistic regression model to identify the factors associated with catastrophic out-of-pocket health expenditure. We used the adjusted odds ratio (AOR) with 95% CI and the p-value <0.05 to determine the variables associated with catastrophic out-of-pocket health expenditure. Results: Catastrophic health expenditure (CHE) with a 40% capacity to pay (CTP) households in the study area was 22.5%. Female household head (AOR = 2.92; 95% CI: 1.44, 5.93) and household with chronic illnesses (AOR = 3.93; 95% CI: 1.78, 9.14) were positively associated with CHE and, while households who had adult household members (AOR = 0.32; 95% CI: 0.16, 0.63) were negatively associated. Conclusion: The overall CHE, with a 40% CTP threshold, was high. Prevention of chronic illness might help to reduce the burden of the expenditure. Strengthening financial risk protection mechanisms, such as community-based health insurance, could help bring healthcare services equity.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd433487a4e3b773ad752c219cce944c",
  "timestamp": "2025-05-15T03:21:24.603972"
}