{
  "id": 701,
  "title": "Financial credit risk measurement prediction using innovative soft-computing techniques",
  "abstract": "Correct default risk classification of an issuer is a critical factor. Practitioners and academics alike agree on this. Thus, under the supervision of financial experts, significant resources of investment advisory companies are used for this task. Researchers, both theoretical and empirical ones, are not the exception either. Nowadays, many methodological and technical advances allow support for the work of classification of issuers. Learning algorithms based on Kernel Machines, particularly Support Vector Machines (SVM), have provided good results in classification problems when data are not linearly separable or noise patterns are employed for training. Moreover, on using kernel structures it is possible to deal with any data space, metric space not being necessary. The study presented in this paper is oriented towards credit risk modelling and measurement through qualitative kernel techniques. In particular, the process followed by the agencies that analyze and value the credit risk of companies, assigning a rating to them, is replicated. Results are expounded for the credit risk forecast of a group of companies that supply the market with public information. Companies' economic and financial variables and their risk classification, issued by a well-known assessor of the financial market, are used for this purpose.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd56e40b591fd78192945c9a141b4876",
  "timestamp": "2025-05-15T01:53:59.447047"
}