{
  "id": 2986,
  "title": "Efficient management of nanomaterial hazards in a large number of research laboratories in an academic environment",
  "abstract": "As the number of engineered nanomaterials (ENM) used in research increases with an incredible speed, health and safety specialists are continuously faced with the challenge of evaluating the risks involved with these materials. Nowadays there is not enough information about their toxicology and new materials are continuously being developed. Preliminary scientific results indicate that ENM might have a damaging impact on human health, which makes it even more important to have the right mitigation measures in place. To address this challenge a methodology of iterative nature has been developed, and this paper demonstrates how the iterative cycle is applied in practice and the added value this adds to the university in terms of economic value, protection of researcher health and identifying knowledge-gaps. The methodology is adaptive and learning based, and it takes into account both the hazard level of the ENM and the exposure. The usefulness and completeness of the methodology is demonstrated with an extensive classification of the activities involving ENM at the EPFL research campus. This classification allowed for a complete hazard portfolio and a simplified risk mapping, which facilitates resource allocation decision-making.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd61b45dd9cb1795e0c897f6160290e2",
  "timestamp": "2025-05-15T01:12:09.277863"
}