{
  "id": 8999,
  "title": "Identification of Market Gap as a Chance for Enterprise Development-Example of Polish Raw Materials Industry",
  "abstract": "The raw materials sector plays a key role in the Polish economy. The mineral raw material industry encompasses many different, sometimes highly specialized activities, such as exploration, mining, hauling, mineral processing, metallurgy and metal refining, as well as risk assessment, management (environmental, financial, legal) and marketing. The purpose of the article is to identify the market gap for business for entities or individuals in the mineral resources sector in Poland. Taking into account the European Union regulations which enforce the closure of hard coal mines in Poland by 2050, it is reasonable to identify such a gap in the raw materials area, especially since the current situation may turn out to be a new revival of the raw materials market after the pandemic period. Based on the NACE classification, a key area was identified, which is dedicated to potential entrepreneurs in the mineral resources area. Based on an internal analysis, the sectors directly related to the RM field in Poland were distinguished. Narrowing down the analyzed sections, leading areas were indicated that offer significant employment opportunities for hundreds of thousands of people who will be made redundant (often in groups) as a result of the phasing out of hard coal mining in Poland. As part of the article, the identification and analysis of key trends that have a significant impact on the functioning of companies, the industry, the region or the country, as well as threats, challenges and opportunities that may arise in the near future, was carried out. What is more, a number of scientific, research or development projects implemented in the area of mineral raw materials in the years 2010-2019 were analyzed. The authors present an innovative approach to defining the gap in the mineral raw materials sector in Poland in what regards conducting business activity, as well as an in-depth analysis of the sector in terms of enterprise development opportunities (creation of new start-up companies) and its directions. It should be mentioned that the presented research is the first attempt to analyze this issue in Poland.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd671a121c63a6a6d64b32fb72716a68",
  "timestamp": "2025-05-15T03:24:26.398526"
}