{
  "id": 5594,
  "title": "Financial toxicity of patients with lung cancer in China: Results from a National Survey Study",
  "abstract": "Objective To develop a comprehensive understanding of financial toxicity (FT) among patients with lung cancer in China and the major factors affecting FT. Methods Drawing from a national cross-sectional survey, which used the validated comprehensive score for financial toxicity (COST) questionnaire, we estimated the prevalence and degree of FT. Patient coping actions were investigated. Pearson's chi tests and multinomial logistic regression were used to evaluate the predictors of FT in patients with lung cancer. Results The median score of FT was 20 (scored on a range of 0-44, with lower scores indicating more severe toxicity). Altogether, 77% of the sample patients had FT (COST <26), 54.5% had mild FT (COST 14-25), and 22.5% had moderate and severe FT (COST 0-13). Living in the less-developed western region of China, being male, having a lower educational level, lower annual family income, and advanced stage or worse self-reported health status were significantly related to higher FT than their counterparts (p < 0.05). Patients with higher FT tended to have a lower level of medical compliance, a higher risk of incurring debts, and reduced living expenditures relative to those with lower FT. Conclusion Despite China's remarkable progress in the past two decades with regard to Universal Healthcare Coverage, FT still presents a serious challenge for patients with lung cancer. Keen attention must be paid to reducing the disproportionate high financial risks of patients with low socioeconomic status.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd6a59a6e241cf0fb33133bf166d0427",
  "timestamp": "2025-05-15T02:49:21.719202"
}