{
  "id": 3462,
  "title": "A simulation-optimisation genetic algorithm approach to product allocation in vending machine systems",
  "abstract": "In recent years, vending machines have seen increasing levels of popularity. In a fast-paced world where convenience and accessibility of products is highly sought after the vending industry has provided a suitable solution. Although the economic impact of the vending industry is indisputable, it is not without challenges, especially when it comes to the efficiency of the vending logistics operations. The optimisation of logistic vending machine systems is decidedly complex. Product allocation to columns in a vending machine, replenishment points of products, product thresholds at vending machines, and vehicle routes for inventory replenishments are all essential challenges in vending machine system management and operation. If all facets of the problem were to be addressed, it would require techniques such as forecasting, machine learning, data mining, combinatorial optimization and vehicle routing, among others. In the past, these approaches have been explored individually despite their intrinsic interdependence within the problem. This paper aims to help to fill in this gap and proposes a model for the optimisation of product allocation within a vending machine under the constraint of fixed restocking instances. The optimal product allocation is based on the definition of product profitability which accounts for the net revenue earned after the cost of restock, as opposed to the revenue earned until first stock-out to prevent arbitrary extension of the stock-out period. The whole approach is encompassed in the simulation optimisation framework that utilises a Genetic Algorithm, with fitness evaluated as simulated revenue, to determine the optimal product allocation. The acceptable threshold of missed sales for a machine is also determined as a means to make intelligent restocking decisions. Overall, the proposed approach allows the strengths of mathematically robust optimization algorithms and the implementation of analytic solutions to be combined and applied to realistic scenarios where uncertainty may rule out some high quality analytic solutions. It respects problem intricacies proper to vending and addresses the interdependence between routing and portfolio optimisation. The proposal is application-driven and stems from a collaboration with an industry partner. The model is validated against an authentic data set supplied by the partner. The case study results revealed a network-wide improvement in net revenue of approximately 3.4%, with varied efficacy based on machine popularity. The method of optimisation was found to be significantly more effective for higher performing machines, with median improvements as high as 6%. Our framework based on the optimization-simulation model yields clear benefits to vending logistics operations management. The simulation component provides the decision maker with a more comprehensive view on the actual implementation of the solution. Effectively, the joint use of simulation and optimization methods provides managers with enhanced information to help decide on both: (i) the most beneficial product portfolio, and (ii) the quality of the proposed restocking schedules. Simulation-optimisation based approach is a powerful technique used to address stochastic problems. However, it was yet to be applied specifically to logistic vending machine systems. (C) 2019 Elsevier Ltd. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd70cec0d6f36d6aea9428eb3ceb97d0",
  "timestamp": "2025-05-15T01:17:25.489924"
}