{
  "id": 2066,
  "title": "Determinants and Outcomes of Financial Derivatives: Empirical Evidence from Pakistani Banks",
  "abstract": "The increased risk in financial firms, due to Global Financial Crises and high international trade activities, has encouraged banks to use derivatives for both managing their financial risk and earning non-operating income simultaneously. The present study brings new evidence in the existing literature by determining the drivers behind financial derivative usage in Pakistani banks for 2011 till 2016. Moreover, the paper examines how risk plays a moderating role in determining the relationship between derivative usage and bank value. While assessing the determinants, a two-stage test has conducted, first, the logit regression was used to test the drivers behind the derivative usage in banks. Second, Tobit regression was run to analyze the factors leading to determine the extent of derivative usage. The findings demonstrate that Pakistani banks are using derivatives for both risk management and speculative motive as they are customers and users of derivatives at the same time. Empirical results, regarding moderating role of risk on the value implications of derivative usage, provide mixed findings as derivative usage gives value premium in case of non-systematic risk and foreign exchange risk. Whereas value discounts have been observed for cases where systematic risk is high and managers try to earn non-operating income from speculative activities.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd74c3116f061e941ee37b071afa4aad",
  "timestamp": "2025-05-15T02:10:58.938564"
}