{
  "id": 232,
  "title": "Improved accuracy of an analytical approximation for option pricing under stochastic volatility models using deep learning techniques",
  "abstract": "This paper addresses the challenge of pricing options under stochastic volatility (SV) models, where explicit formulae are often unavailable and parameter estimation requires extensive numerical simulations. Traditional approaches typically either rely on large volumes of historical (option) data (data-driven methods) or generate synthetic prices across wide parameter (model-driven methods). In both cases, the scale of data demands can be prohibitively We propose an alternative strategy that trains a neural network on the residuals between but approximate pricing formula and numerically generated option prices, rather than learning the full pricing function directly. Focusing on these smaller, smoother residuals notably reduces the complexity of the learning task and lowers data requirements. We further demonstrate theoretically that the Rademacher complexity of the residual function class is significantly smaller, thereby improving generalization with fewer samples. Numerical experiments on fast mean reverting SV models show that our residual-learning framework achieves accuracy comparable to baseline networks but uses only about one-tenth the training data. These findings highlight potential of residual-based neural approaches to deliver efficient, accurate pricing and facilitate practical calibration of advanced SV models.",
  "year": 2025,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd812aec08ab0120856140e464b58df6",
  "timestamp": "2025-05-15T01:29:44.204534"
}