{
  "id": 6266,
  "title": "Post-migration Stressors and Subjective Well-Being in Adult Syrian Refugees Resettled in Sweden: A Gender Perspective",
  "abstract": "A number of post-migration stressors have been shown to adversely affect mental health in refugees resettled in high-income countries, including poor social integration, financial difficulties and discrimination, and recent evidence suggests that these effects are gender specific. Social support has been found to buffer against post-migration stress in some studies on refugee populations, though the evidence on this is mixed. The present study used cross-sectional survey data from a nationwide, randomly sampled group of adult refugees from Syria resettled in Sweden between 2008 and 2013 (N-sample = 4,000, n(respondents) = 1,215, response rate 30.4%) to investigate gender-specific associations between post-migration stressors and subjective well-being (SWB) and whether these associations were modified by social support. SWB was measured with the WHO-5 Well-being Index (scaled 0-100), dichotomized into high (>= 50) and low (<50) SWB. Main analyses were stratified by gender, and regressed SWB on four domains of post-migration stress (financial strain, social strain, competency strain and discrimination) using logistic regression, adjusting for sociodemographic variables and traumatic experiences. Social support was tested as an effect modifier. In fully adjusted models, main risk factors for low SWB were high financial strain, especially in males (ORhigh vs. low strain, males = 10.30 [4.91-21.6], p < 0.001 vs. ORhigh vs. low strain, females= 3.84 [1.68-8.79], p = 0.002), and high social strain, only in males (ORhigh vs. low strain, males = 9.21 [3.96-21.4], p < 0.001 vs. ORhigh vs. low strain, females = 1.03 [0.40-2.64], p = ns). There was some evidence that social support buffered the adverse association of financial strain with SWB. In conclusion, the present study found clear support of gender-specific effects of post-migration stressors on SWB. Mitigation strategies and interventions should be aware of and sensitive to these potential gendered effects, and future research exploring mental health in the context of resettlement stress should have a heightened focus on the important role of gender.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd8c7ec2522d3b56fc3d84eeff3d8f90",
  "timestamp": "2025-05-15T02:56:37.260046"
}