{
  "id": 8533,
  "title": "Tobacco use and health insurance literacy among vulnerable populations: implications for health reform",
  "abstract": "Background: Under the Affordable Care Act (ACA), millions of Americans have been enrolling in the health insurance marketplaces. Nearly 20% of them are tobacco users. As part of the ACA, tobacco users may face up to 50% higher premiums that are not eligible for tax credits. Tobacco users, along with the uninsured and racial/ethnic minorities targeted by ACA coverage expansions, are among those most likely to suffer from low health literacy - a key ingredient in the ability to understand, compare, choose, and use coverage, referred to as health insurance literacy. Whether tobacco users choose enough coverage in the marketplaces given their expected health care needs and are able to access health care services effectively is fundamentally related to understanding health insurance. However, no studies to date have examined this important relationship. Methods: Data were collected from 631 lower-income, minority, rural residents of Virginia. Health insurance literacy was assessed by asking four factual questions about the coverage options presented to them. Adjusted associations between tobacco use and health insurance literacy were tested using multivariate linear regression, controlling for numeracy, risk taking, discount rates, health status, experiences with the health care system, and demographics. Results: Nearly one third (31%) of participants were current tobacco users, 80% were African American and 27% were uninsured. Average health insurance literacy across all participants was 2.0 (SD 1.1) out of a total possible score of 4. Current tobacco users had significantly lower HIL compared to non-users (-0.22, p < 0.05) after adjustment. Participants who were less educated, African American, and less numerate reported more difficulty understanding health insurance (p < 0.05 each.) Conclusions: Tobacco users face higher premiums for health coverage than non-users in the individual insurance marketplace. Our results suggest they may be less equipped to shop for plans that provide them with adequate out-of-pocket risk protection, thus placing greater financial burdens on them and potentially limiting access to tobacco cessation and treatment programs and other needed health services.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bd90c58a79cabd7a5f8d1961c2366a0e",
  "timestamp": "2025-05-15T03:19:52.105637"
}