{
  "id": 8524,
  "title": "Ocean Based Statistical Forecasts for Seasonal Irrigation Allocations",
  "abstract": "The initial general security water allocation announcements for water users in the New South Wales (NSW) part of the Murray Valley are made during July. The initial water allocation announcement is very conservative as the allocations are based on storage levels and historical minimum inflows statistics to dams during the irrigation seasons. There is a good chance that the water allocations will be increased as the season proceeds. Water availability during the cropping season is a major factor influencing planting decisions made by irrigators and can have a major bearing on the financial viability and irrigation efficiency of irrigation areas. Therefore, increased knowledge on the likely end-of-season allocation by advance predictions can assist in minimising cropping risk and can help optimise farm returns and achieve better irrigation efficiencies. Seasonal river flow forecasts are used for determining anticipated water allocations; however, this paper presents a more direct approach that forecasts water allocation instead of river flow. The study is based on the hypothesis that the sea-surface temperature (SST) and ocean based climate variability indices (CVIs) are statistically related to water allocation forecasts in a river catchment. Over 100-years data on a global two degree grid SST, CVIs, and water allocations in the Murray Irrigation Area (MIA) were analysed. Statistical techniques including probability analysis and multiple linear regression (MLR) were used to determine the underlying relationships among predictor variables and the end-of-irrigation-season water allocation (February allocation) in the MIA. The SST at three locations around the continent; one lying in the equatorial Pacific, second in the Indian Ocean and third in the Tasmanian Sea, were found highly correlated (Pearson Correlation Coefficient up to -0.83) with February allocation levels in the MIA based on analysis using the CSIRO's SSTman software. The significant variables identified by the MLR analyses include; SST, SOI, mean sea level pressure, start-of-season (August) and mid-of-season (October) announced allocations and the risk factor. The risk factor can be varied from 0 to 100% and relates the probability of February allocation to announced August allocation and translates degree of risk farmer may take based on known August allocation. The value of the risk factor must be chosen with care because if user/farmer decides a higher value of risk factor, the model will forecast higher allocation suggesting farmer to grow more crops but at the same time involve a higher degree of risk of actually not getting that level of allocation. The model was validated against actual announced allocations for the month of February for ten years (1996/97 to 2005/06). The validation results are presented in Figure 1A. The model underestimated allocations for the years 2001 and 2002. This may be due to borrowing water from future years despite exceptionally low rainfalls during the season and not taking into account then emerging drought conditions. [GRAPHICS] A simple software tool developed based on the findings of this study will provide farmers with risk based crop management options.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bda284961a0fd28cc0d96a187f564093",
  "timestamp": "2025-05-15T03:19:52.010934"
}