{
  "id": 1371,
  "title": "Financial model construction of a cross-border e-commerce platform based on machine learning",
  "abstract": "With the development of informatization, traditional industries have been seriously impacted by cross-border e-commerce (CBEC), and the financial management mode no longer meets the needs of CBEC users. As cross-border electronic trading platforms face enormous financial data challenges, they need financial supervision and effective network risk protection. Artificial intelligence (AI) can effectively improve the financial accounting ability and resource integration of platforms. However, at present, the underdeveloped financial management system of CBEC platforms and problems, such as the running records of platform funds have seriously hindered the development of the financial standardization of platforms because the financial management system affects managers' statistical analysis of financial data. Therefore, this paper analyzes the financial risks, the management problems and the causes of these problems of CBEC platforms and then uses AI to study the financial operation of CBEC platforms. Subsequently, this paper uses a machine learning (ML) algorithm to analyze the financial data clustering center and the security factor of the financial model. Finally, this paper proposes some corresponding strategies for financial model optimization and construction that can improve the information security and capital management of CBEC finance and promote the long-term development of CBEC platforms. The experimental results show that the classifier value and the safety factor of the financial model of CBEC platforms gradually increase under the ML algorithm. The mean value of the classifier value is approximately 1.14, and the mean value of the safety factor is approximately 1.37. Overall, the initial value of the classifier value of the platform financial model is 0.85, which increases to 1.41 on the seventh day, while the whole process increases by 0.56. The initial value of the safety factor of the platform financial model is 1.10, which increases to 1.64 on the seventh day, while the whole process increases by 0.54. The transaction information security and financial accounting accuracy of the CBEC platform financial model is better than that of the original financial model. The transaction information security is 10.4% higher than that of the original financial model, and the financial accounting accuracy is 10% higher than that of the original financial model. In other words, both AI and ML can promote the financial accounting standards and long-term development of CBEC platforms.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bdb904c975209116530acf201481bb01",
  "timestamp": "2025-05-15T02:02:22.656874"
}