{
  "id": 7548,
  "title": "Prevalence of Bovine Trematodiases and Associated Risk Factors in Nyagatare District, Rwanda",
  "abstract": "Introduction: Trematodiases cause significant financial losses to livestock worldwide and some of which are zoonotic, raising public health concerns. In Rwanda, information on the prevalence of bovine trematodiases is scanty, and this hampers efforts to control and prevent them in the country.Methods: This cross-sectional study aimed to determine the prevalence of bovine trematodiases in Nyagatare district and associated risk factors. One hundred cattle were randomly selected for this study and faecal samples were collected directly from the rectum to identify trematode eggs using a simple sedimentation technique. To analyze the data, frequencies, chi-square test, and binary logistic regression were computed. Results: Overall, the prevalence of bovine trematodiases was 69%, and Paramphistomum spp. predominated (69%), followed by Dicrocoelium spp. (23%), Fasciola spp. (20%), and Echinostoma spp. (1.0%). The study also recorded mixed paramphistomiasis, fascioliasis and dicrocoeliasis (11.6%), paramphistomiasis and fascioliasis (15.9%) as well as paramphistomiasis and dicrocoeliasis (20.3%). The odds of having trematodiasis (mono or mixed fascioliasis and dicrocoeliasis) for the cow located in Barija cell (AOR = 0.143; 95% C.I. 0.026-0.793) were 14% lower compared to those of developing such parasitosis for the cow located in Bushoga cell. Conclusion: Taken together, the study shows that trematodes are a significant contributor to lowering livestock production and productivity and pose a threat to human health. Different approaches should be applied to prevent and control the trematodiases in cows and other livestock (sheep and goats) and reduce the risk of contracting fascioliasis and echinostomiasis in humans in Nyagatare district, Rwanda.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bddc5cdfcec680a553d5c5f0c43f184f",
  "timestamp": "2025-05-15T03:09:36.942179"
}