{
  "id": 2749,
  "title": "A Comparative Analysis on Probability of Volatility Clusters on Cryptocurrencies, and FOREX Currencies",
  "abstract": "In recent years, the attention of investors, practitioners and academics has grown in cryptocurrency. Initially, the cryptocurrency was designed as a viable digital currency implementation, and subsequently, numerous derivatives were produced in a range of sectors, including nonmonetary activities, financial transactions, and even capital management. The high volatility of exchange rates is one of the main features of cryptocurrencies. The article presents an interesting way to estimate the probability of cryptocurrency volatility clusters. In this regard, the paper explores exponential hybrid methodologies GARCH (or EGARCH) and through its portrayal as a financial asset, ANN models will provide analytical insight into bitcoin. Meanwhile, more scalable modelling is needed to fit financial variable characteristics such as ANN models because of the dynamic, nonlinear association structure between financial variables. For financial forecasting, BP is contained in the most popular methods of neural network training. The backpropagation method is employed to train the two models to determine which one performs the best in terms of predicting. This architecture consists of one hidden layer and one input layer with N neurons. Recent theoretical work on crypto-asset return behavior and risk management is supported by this research. In comparison with other traditional asset classes, these results give appropriate data on the behavior, allowing them to adopt the suitable investment decision. The study conclusions are based on a comparison between the dynamic features of cryptocurrencies and FOREX Currency's traditional mass financial asset. Thus, the result illustrates how well the probability clusters show the impact on cryptocurrency and currencies. This research covers the sample period between August 2017 and August 2020, as cryptocurrency became popular around that period. The following methodology was implemented and simulated using Eviews and SPSS software. The performance evaluation of the cryptocurrencies is compared with FOREX currencies for better comparative study respectively.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bde0a0992039ce28083665203f279d5a",
  "timestamp": "2025-05-15T02:18:37.207880"
}