{
  "id": 7167,
  "title": "Predictors for 1-year mortality following hip fracture: a retrospective review of 465 consecutive patients",
  "abstract": "In Europe, trauma admissions and in particular hip fractures are on the rise. In recent years, health care systems have placed particular emphasis, including financial incentives, on delivering patients quickly and safely to surgery. At our unit, we have observed that hip fracture patients appear to be at significant risk of mortality even up to a year following injury. This study reviews a consecutive population of hip fracture patients to identify predictors of excess risk. Four hundred and sixty-five consecutive patients were treated over a 2-year period at our district general hospital with no ward-based orthogeriatricians. Follow-up was for 1 year following hip fracture admission. Statistical analysis of variables and their influence on 1-year mortality were performed by calculating odd's ratio (OR) using a logistic regression model and a p value < 0.05 was considered statistically significant. Four patients were lost to follow-up, 18 patients (4.1 %) were managed conservatively, 16 were too unwell for surgery and their mortality rate at 1 year was 50 %. Following hip fracture, we found an overall 1-year mortality rate of 15.1 %. Patients with a time to surgery 36 h were at significantly increased risk of mortality even up to 1 year. We did not identify a further reduction in mortality in those operated on within 24 h. Raised ORs (p > 0.05) were found with increasing comorbidity, surgery type, independence on discharge, alcohol ingestion, history of smoking, readmission and several biochemical markers. Minimising mortality risk, even over the longer term, should begin on admission with prompt optimisation of any acute medical or biochemical abnormalities, followed by early surgery and intensive rehabilitation to maintain patients' functional independence.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bdeffffc0d4a007d4da0454adeaa78e0",
  "timestamp": "2025-05-15T03:06:01.098894"
}