{
  "id": 1352,
  "title": "Tailored Approach to the Treatment of Vernal Keratoconjunctivitis",
  "abstract": "Purpose: To develop a standardized clinical grading system for the management of patients with vernal keratoconjunctivitis (VKC) and to identify the risk factors associated with a worsened outcome of the disease, including decrease of visual acuity and ocular complications development. Design: Retrospective cohort study. Participants: A total of 207 consecutive patients with VKC, referred to our Cornea and External Diseases Center from 1997 to 2007, were included in the study. A total of 110 of those patients were included in the follow-up study (range 1-10 years). Methods: Classification and regression tree (CART) analysis was performed to separate the patients into 5 subgroups by therapeutic approach. Regression tree and multivariate logistic regression analyses were performed during follow-up to identify predictors of worse visual outcome. Main Outcome Measures: Age, gender, duration and course of disease, signs, symptoms, overall symptoms score, history of atopy, markers of allergy, best-corrected visual acuity, and therapy were collected at baseline and during follow-up. The number of relapses and number of patients with decreased visual acuity were also evaluated in the follow-up. Results: A decision tree for VKC treatment was developed by CART analysis, and a new clinical grading system was proposed accordingly. Sixteen patients were classified as grade 0 (absence of symptoms and no therapy); 59 patients were classified as grade 1 (presence of symptoms without photophobia, occasional use of anti-allergic eye drop); 74 patients were classified as grade 2 (presence of symptoms including photophobia, daily anti-allergic treatment); 22 patients with superficial punctuate keratopathy (SPK) were classified as grade 3 (daily anti-allergic treatment associated with occasional topical steroid); and 36 patients were classified as grade 4 (diffuse SPK or corneal ulcer; pulsed high-dose topical steroid). A higher number of relapses and a higher baseline grade of VKC were the main predictor factors for worse visual outcome. Conclusions: This grading system allows for identifying the more severe forms of VKC that are at higher risk of recurrences, corneal ulceration, and worse final visual outcome. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2010; 117: 1294-1299 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bdf181531d77a19c8649310322d840c9",
  "timestamp": "2025-05-15T02:01:44.858164"
}