{
  "id": 2427,
  "title": "Nonmedical Social Determinants, Syndemic Conditions, and Suicidal Thoughts and Behaviors in a Treatment-seeking Community Sample: A Latent Class Analysis",
  "abstract": "Objective Knowledge gaps remain regarding whether syndemic conditions identify treatment-seeking individuals most at risk for suicidal thoughts and behaviors (STB). We employed latent class analysis to: (1) model treatment-seeking individuals' syndemic conditions, (2) examine latent classes across nonmedical social determinants, and (3) assess associations between class membership and STB. Method Participants were 982 individuals presenting at a community mental health clinic between October 2014 and February 2020. The three-step latent class analytic approach was used. Regression analyses were employed to examine nonmedical social determinants and STB outcomes associated with class membership. Results Participants were aged 18 to >72 (75.8% White; 76.7% heterosexual; 53.7% cisgender woman; 73.8% earned >=$20,000 annually). Latent class analysis resulted in a three-class solution. Participants in Class 1 were characterized by low probabilities across syndemic conditions. Class 2 was characterized by high probabilities of anxiety and depression. Class 3 was characterized by high probabilities of eating disorders, anxiety, and depression. Participants of color, sexual minority participants, cisgender women, and those experiencing financial distress were more likely to be in classes characterized by syndemic conditions. Classes characterized by syndemic conditions, relative to no syndemic conditions, were associated with greater risk of STB. Conclusion Findings confirm the concentrated clustering of co-occurring syndemic conditions among marginalized groups and highlight differing risks for those considering suicide or who have attempted suicide vs. those engaging in self-harm. Results underscore the need for resource allocation and multilevel interventions targeting syndemic conditions and suicidality for minority populations and those experiencing financial distress.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bdfcbff977ff39ec7b598039550e2f49",
  "timestamp": "2025-05-15T02:15:26.975047"
}