{
  "id": 3944,
  "title": "Introducing an Innovative Approach to Mitigate Investment Risk in Financial Markets: A Case Study of Nikkei 225",
  "abstract": "When the value of an investor's stock portfolio rises during a period of great market performance, investors often experience a gain in wealth. Spending may increase when people feel more at ease and confident about their financial circumstances. On the other hand, during a market crisis, a fall in wealth could lead to lower consumer spending, which could impede economic growth. Stock market trend prediction is thought to be a more important and fruitful endeavor. Stock prices will, therefore, provide significant returns from prudent investing decisions. Because of the outdated and erratic data, stock market forecasts pose a serious challenge to investors. As a result, stock market forecasting is among the main challenges faced by investors trying to optimize their return on investment. The goal of this research is to provide an accurate hybrid stock price forecasting model using Nikkei 225 index data from 2013 to 2022. The construction of the support vector regression involves the integration of multiple optimization approaches, including moth flame optimization, artificial bee colony, and genetic algorithms. Moth flame optimization is proven to produce the best results out of all of these optimization techniques. The evaluation criteria used in this research are MAE, MAPE, MSE, and RMSE. The results obtained for MFO-SVR, which is 0.70 for criterion MAPE, show the high accuracy of this model for estimating the price of Nikkei 225.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be0c73c673dd0b95d633639c837e768f",
  "timestamp": "2025-05-15T01:22:39.301374"
}