{
  "id": 3988,
  "title": "Incorporation of implicit decision-maker preferences in multi-objective evolutionary optimization using a multi-criteria classification method",
  "abstract": "Nowadays, most Multi-Objective Evolutionary Algorithms (MOEA) concentrate mainly on searching for an approximation of the Pareto frontier to solve a multi-objective optimization problem. However, finding this set does not completely solve the problem. The decision-maker (DM) still has to choose the best compromise solution from that set. But as the number of criteria increases, several important difficulties arise in performing this task. Identifying the Region of Interest (ROI), according to the DM's preferences, is a promising alternative that would facilitate the selection process. This paper approaches the incorporation of preferences into a MOEA in order to characterize the ROI by a multi-criteria classification method. This approach is called Hybrid Multi-Criteria Sorting Genetic Algorithm and is composed of two phases. First, a metaheuristic is used to generate a small set of solutions that are classified in ordered categories by the DM. Thus, the DM's preferences will be reflected indirectly in this set. In the second phase, a multi criteria sorting method is combined with an evolutionary algorithm. The first one is used to classify new solutions. Those classified as 'satisfactory' are used for creating a selective pressure towards the ROI. The effectiveness of our method was proved in nine instances of a public project portfolio problem. The obtained results indicate that our approach achieves a good characterization of the ROI, and outperforms the standard NSGA-II in simple and complex problems. Also, these results confirm that our approach is able to deal with many-objective problems. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be1102c1c1065b20c0e66c71e37bf446",
  "timestamp": "2025-05-15T01:22:39.435553"
}