{
  "id": 8839,
  "title": "Life, limb and bumper trade-offs calculable from road accident models: An empirical multimoment portfolio analysis and Life Asset Pricing Model (LAPM)",
  "abstract": "The paper provides an empirical trade-off analysis among the first three moments of road accident frequencies, and it is demonstrated that road drivers can be understood as behaving with respect to road accidents as investors trading among the various moments of the return of a financial asset, as they attach utility to at least three moments of the accident probability in conformity with Allais's view. The method effectively proposes an empirical Life Asset Pricing Model (LAPM), i.e. a revealed preference alternative, derived directly from driver behaviour on the road itself, to the less direct human capital and willingness-to-pay approaches to the valuation of human life, termed 'value of a statistical life', in road risk analyses. The analysis, which is applicable in principle to any accident regression model, but performed here with two Demand for Road Use, Accidents and their Gravity (DRAG)-type aggregate time series models, respectively, for Quebec, Canada, and western Germany, shows amazing similarities in the estimated rates of substitution among accidents of various severity levels within each region, as well as amazing dissimilarities between the regions in the asymmetry of the sample distributions pertaining to bodily injury accidents. For Quebec, where the fully documented model in official use has a long history of successful explanation and forecasting of the number and severity of road accidents, the rates of substitution among the accident frequencies of different categories imply that official Canadian human live valuations used in network accounts are too low (and the computed social cost recovery of roads too high), and that there exists a market for drivers willing to pay more for reduced driving risks than is assumed by road authorities on their behalf.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be17d7997c224dc501103f9bb98c8a62",
  "timestamp": "2025-05-15T03:22:57.915392"
}