{
  "id": 8053,
  "title": "The Role of VASOGRADE as a Simple Grading Scale to Predict Delayed Cerebral Ischemia and Functional Outcome After Aneurysmal Subarachnoid Hemorrhage",
  "abstract": "Background The VASOGRADE is a simple aneurysmal subarachnoid hemorrhage (aSAH) grading scale that combines the modified Fisher scale (mFisher) and the World Federation of Neurological Societies (WFNS) grading system, allowing the stratification of delayed cerebral ischemia (DCI) risk. However, the VASOGRADE accuracy in predicting functional outcomes is still to be determined. Methods We retrospectively evaluated a multiethnic cohort of consecutive patients with aSAH admitted to a high-volume center in Brazil from January 2016 to January 2019. Patients were classified according to the severity of the clinical presentation (WFNS), the amount of blood in the initial head computerized tomography (mFisher) scan, and the VASOGRADE (green, yellow, red). The primary outcome was to detect DCI-related cerebral infarction, and the secondary outcome was the functional outcome at hospital discharge according to the modified Rankin scale (mRs). Univariate and multivariate logistic regression models were employed. Results A total of 212 patients (71.7% female, mean age 52.7 +/- 12.8) were included. Sixty-nine patients were classified as VASOGRADE-Green (32.5%), 98 patients as VASOGRADE-Yellow (46.9%), and 45 patients as VASOGRADE-Red (20.6%). DCI-related infarction was present in 39 patients (18.9%). The proportions of patients in the VASOGRADE-Green, VASOGRADE-Yellow, and VASOGRADE-Red categories with DCI-related infarction were 7.7, 61.5, and 30.8%, respectively. After a multivariable analysis including age, sex, aneurysm location, and the VASOGRADE classification as variables, both VASOGRADE-Yellow and VASOGRADE-Red were independently associated with DCI-related infarction (odds ratio [OR] 7.69, 95% confidence interval [CI] 2.13-27.8, and OR 8.07, 95% CI 2.03-32.11, respectively) and unfavorable outcome (OR 4.16, 95% CI 1.33-13.03, and OR 25.57, 95% CI 4.45-147.1, respectively). The VASOGRADE discrimination performance for DCI-related infarction (area under the receiver operating characteristic curve) was 0.67 +/- 0.04 (95% CI 0.58-0.75; p = 0.001). VASOGRADE-Red had 97.5% specificity for predicting an unfavorable mRs score at discharge (95% CI 92.8-99.5%). Conversely, VASOGRADE-Green had an excellent specificity for predicting favorable outcome at discharge (mRs score 0-2, 95% CI 82.6-95.5%). Conclusions In conclusion, in a multiethnic cohort of patients with aSAH, VASOGRADE-Green predicted the absence of DCI and good clinical outcome at discharge with very high specificity, and patients in this category might be selected for early intensive care unit (ICU) discharge, minimizing costs and medical complications associated with prolonged hospital stay. On the other hand, patients categorized as VASOGRADE-Yellow and VASOGRADE-Red were at the highest risk for DCI. They should, therefore, be selected as a priority for care in high-volume aSAH centers, being aggressively monitored for DCI at the ICU. Such stratification methods are crucial, especially in countries with low financial resources and high health care services demand.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be1760a4f7e8050b62ddf9dbfcdbc225",
  "timestamp": "2025-05-15T03:14:37.401397"
}