{
  "id": 4256,
  "title": "How Formal Control Influences Decision-Making Clarity and Innovation Performance",
  "abstract": "Implementing formal planning instruments such as the stage-and-gate-type system (SGS) and project management (PM) have long been seen as the key to new product development (NPD) success. They create the structure needed for managing NPD activities, supporting coordination among functional groups, reducing uncertainty and error, and assuring time and cost efficiency. But recent research presents ambiguous results, suggesting that SGS and PM as formal controls can also have a negative effect. Integrating ideas from three literaturesi.e., NPD management, organization control theory, and technical control theorythe present study assesses NPD programs in terms of three perspectives: (1) the formal control mechanisms used for managing NPD programsspecifically SGS, which is mainly seen as a higher organizational level approach used for guiding and implementing a portfolio of NPD projects, and PM, which is a precise formal control mechanism relevant for managing specific problems at a single project level; (2) the immediate outcome of the application of formal controls, i.e. decision-making clarity (DMC); and (3) degree of NPD innovativeness, a key contingency hypothesized to impact the efficacy of formal controls. For the empirical analysis, data are collected through a survey of 162 corporate NPD programs (Austria and Denmark, manufactured goods and services) where a total of 1274 respondents provide information relevant to their position. Hierarchical regression analysis is used to test the relationships. Results indicate that the performance effect of NPD formal control is fully mediated by DMC. Further, of the six hypothesized outcome relationships, four are fully supported. Both SGS and PM are effective systems for managing NPD when degree of innovativeness is not taken into account. PM, however, loses its efficacy at higher degrees of NPD program innovativeness while SGS continues to work at achieving positive DMC at the radical end of the innovativeness spectrum. Analysis of interaction effects indicates that for more innovative NPD programs, best results are achieved when companies implement an interactive system of both SGS and PM, where the two systems complement each other.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be28b957366d534f6ef1e607fbb330a6",
  "timestamp": "2025-05-15T01:25:23.249687"
}