{
  "id": 5560,
  "title": "Factors Affecting Risk Attitude of Rice Farmers: Evidence from Vietnam's Mekong Delta",
  "abstract": "Agricultural production accounts for 64.2% of the Vietnam's Mekong Delta. However, this sector has to face damage risks, especially from the natural disasters, such as flood, drought, severe soil salinity, pests, and erosion, which might factor into the farmers' risk attitude and their decision-making relative to investment in production activities. This study analyzes the factors influencing the risk attitudes of the rice farmers, based on evidence from the Vietnamese Mekong Delta. The data were collected through face-to-face interviews and experimental games with 145 rice farmers. An ordered probit regression model was applied to estimate how the factors affected the rice farmers' risk attitudes. The risk-neutral farmers comprised 53.72% of farmers in the survey, while 31.72% and 15.15% were risk-preferred and risk-averse farmers. The study results indicated that age, number of rice crops per year, household assets, income from rice production, and credit accessibility were the main factors affecting the farmers' risk attitudes. The results suggest that the financial incentives' policies to compensate for losses in uncertain conditions and increase the household income, diversification of income sources, and improving the accessibility of formal credit might be useful to increase farmers' willingness to accept the risks of investing in better profitability projects and gaining a higher income.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be2d749e59d638245a541b6ee687afe6",
  "timestamp": "2025-05-15T02:48:51.414114"
}