{
  "id": 7135,
  "title": "Impact of R&D, patents and innovations disclosure on market capitalization: Russian evidence",
  "abstract": "Purpose The paper examines whether, along with the financial performance, the disclosure of research and development (R&D) expenses, patent portfolios, patent citations and innovation activities affect the market capitalization of Russian companies. Design/methodology/approach The paper opted for a set of techniques including bag-of-words (BoW) to retrieve additional innovation-related data from companies' annual reports, self-organizing maps (SOM) to perform visual exploratory analysis and panel data regression (PDR) to conduct confirmatory analysis using data on 74 Russian publicly traded companies for the period 2013-2019. Findings The paper observes that the disclosure of nonfinancial data on R&D, patents and primarily product and marketing innovations positively affects the market capitalization of the largest Russian companies, which are mainly focused on energy, raw materials and utilities and are operating on international markets. The study suggests that these companies are financially well-resourced to innovate at risk and thus to provide positive signals to stakeholders and external agents. Research limitations/implications Our findings are important to management, investors, financial analysts, regulators and various agencies providing guidance on corporate governance and sustainability reporting. However, the authors acknowledge that the research results may lack generalizability due to the sample covering a single national context. Researchers are encouraged to test the proposed approach further on other countries' data by using the compiled lexicons. Originality/value The study aims to expand the domains of signaling theory and market valuation by providing new insights into the impact that companies' reporting on R&D, patents and innovation activities has on market capitalization. New nonfinancial factors that previous research does not investigate - innovation disclosure indicators (IDI) - are tested.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be36aa7845f53bf09cccc475cc4c09fa",
  "timestamp": "2025-05-15T03:05:32.044124"
}