{
  "id": 9150,
  "title": "Asthma control and its predictors in Ethiopia: Systematic review and meta-analysis",
  "abstract": "Background Determining the status of asthma control and identifying risk factors for poor asthma control is a key strategy for curbing the negative health impacts and the financial burden of the disease. Therefore, this review was aimed to determine the rate of asthma control and assess the predictors of uncontrolled asthma in Ethiopia. Methods PubMed, Web of Science, and Google Scholar searches were performed using key terms; asthma, bronchial asthma, control, controlled, uncontrolled and Ethiopia up to October 16, 2020. University repositories were also searched to retrieve gray literature. The results were presented as a prevalence rate with a 95% confidence interval (CI). Subgroup analysis and meta-regression were performed to identify the sources of heterogeneity in the outcomes. Results From 1,388 patients, based on the Global Initiative for Asthma (GINA) symptom control, the rate of the uncontrolled asthma was 45.0% (95% CI 34.0% - 56.0%) with a considerable heterogeneity between the studies; (I-2: 94.55, p< 0.001). About 19.0% (95% CI 10.0% - 29.0%); (I-2: 96.04, p< 0.001) of the asthma patients had a well-controlled asthma. Moreover, 36.0% (95% CI 22.0% - 50.0%), (I-2: 97.11, p< 0.001) of patients had a partly controlled asthma. Similarly, based on the asthma control test (ACT), the rate of well-controlled asthma was 22.0% (95% CI 3% - 42.0%), with considerable heterogeneity between the studies; (I-2: 97.75, p< 0.001). The most frequent predictors of uncontrolled asthma were incorrect inhalation techniques, frequent SABA use, moderate/severe persistent asthma, history of exacerbations, presence of comorbidities, use of oral corticosteroids, and irregular follow-up. Conclusion The rate of uncontrolled asthma in Ethiopia was high. Several factors are associated with uncontrolled asthma. Comprehensive asthma educations at each follow-up visit should be strengthened to minimize the morbidity and the cost of uncontrolled asthma.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be3f86133468151384133f4619d99f40",
  "timestamp": "2025-05-15T03:25:54.664917"
}