{
  "id": 5504,
  "title": "Managerial ownership and stock price crash risk: a case of Iranian firms",
  "abstract": "Purpose - Increasing managerial ownership gives rise to the managerial opportunistic behaviors, among which bad news hoarding has attracted a lot of attention. Nevertheless, there always exists a threshold level at which the accumulated bad news releases abruptly, thereby resulting in corporate stock price crash risk. On the above arguments, this study aims to investigate the impact of managerial ownership on stock price crash risk of the firms listed on the Tehran Stock Exchange (TSE). Design/methodology/approach - Sample includes the 485 firm-year observations from companies listed on the TSE during the years 2012-2016 and the research hypothesis was tested using multivariate regression model based on panel data. Findings - The results reveal that managerial ownership increases the corporate stock price crash risk. These findings are robust to an alternative measure of stock price crash risk, individual analysis of the research hypothesis for each year and endogeneity concern. Originality/value - The current study is almost the first study, which has been conducted in emerging capital markets, so the findings of the study not only extend the extant theoretical literature concerning the stock price crash risk in developing countries including emerging capital market of Iran but also help policymakers, regulators, investors and users of financial reports to make informed decisions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be4d115c696794c60a8cc12349cada87",
  "timestamp": "2025-05-15T02:48:23.805593"
}