{
  "id": 1541,
  "title": "Design of Risk Management Decision-making Framework for Tourism Enterprises Based on Artificial Intelligence",
  "abstract": "As a global industry, tourism not only faces increasingly fierce competition, but also bears the threat of many internal and external risks. In this complex and changeable environment, tourism enterprises urgently need effective risk management decision-making mechanism to ensure business sustainability and profitability. This paper is devoted to designing a risk management decision-making framework based on Artificial Intelligence(AI) to help tourism enterprises better understand, identify and deal with various risk factors. The framework integrates key elements such as data acquisition, machine learning, real-time monitoring and decision support, and provides a comprehensive tool for enterprises to better manage risks and formulate corresponding risk coping strategies. The model can effectively control the risk factors of enterprise financial informatization, and the control has good convergence. The error rate of this method in controlling the risk factors of enterprise financial informatization is small, and the analysis results are accurate and reliable. Through the application of this framework, tourism enterprises can improve their ability to resist risks, reduce potential losses and improve the stability of their business, thus providing strong support for sustainable development.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be5295ca9ff1490febb39a0900558056",
  "timestamp": "2025-05-15T02:04:20.099757"
}