{
  "id": 3016,
  "title": "Epidemiology and risk factors for sleep disturbances in children and youth with cerebral palsy: An ICF-based approach",
  "abstract": "Objectives and background: Children with cerebral palsy are at risk for sleep disorders, and there is a complex relationship between sleep and physical, environmental and functional factors in such children. The WHO International Classification of Functioning, Disability and Health model serves as a universal framework for describing and organizing functioning and disability. This study aimed to describe sleep disturbances in Singaporean children and youth with cerebral palsy, and develop a holistic framework for evaluating risk factors and potential management strategies for poor sleep. Methods: A cross-sectional analysis was conducted on 151 children and youth in a nationwide registry for cerebral palsy. The WHO International Classification of Functioning, Disability and Health for Cerebral Palsy Questionnaire was used to identify sleep disturbances. Risk factors analyzed were age, gender, ethnic background, financial assistance, the dominant motor feature of cerebral palsy, functional status, and comorbidities such as active epilepsy, hearing and visual impairments, generalized pain, muscle tone and involuntary contractions. Results: 46% had difficulty with sleep, with similar proportions having difficulty with amount, onset, maintenance and quality of sleep. On multivariate regression analysis, higher functional gross motor impairment as indicated by a GMFCS level of V (adjusted OR 4.24; 95% CI 1.09-19.0) and difficulty with involuntary contractions (aOR 2.80; 1.20-6.71) were significant factors for sleep difficulties. Conclusion: An ICF-based framework was useful in identifying possible contributory factors and strategies for managing poor sleep. Further studies with objective sleep measures would allow for better characterization of sleep disturbances in children and youth with cerebral palsy, and guide management. (C) 2022 Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be74d8a54e0d6042d613215440646d37",
  "timestamp": "2025-05-15T02:21:52.148183"
}