{
  "id": 7321,
  "title": "MRI-based scoring model to predict massive hemorrhage during dilatation and curettage in patients with cesarean scar pregnancy",
  "abstract": "Objective To construct a scoring model based on MRI signs to predict massive hemorrhage during dilatation and curettage in cesarean scar pregnancy (CSP) patients. Materials and methods The MRIs of CSP patients admitted to a tertiary referral hospital between February 2020 and July 2022 were retrospectively reviewed. The included patients were randomly assigned to the training and validation cohorts. The univariate and multivariate logistic regression analyses were adopted to identify the independent risk factors for massive hemorrhage (the amount of bleeding >= 200 ml) during the dilatation and curettage. A scoring model predicting intraoperative massive hemorrhage was established where each positive independent risk factor was assigned 1 point, and the predictive power of this model was evaluated both in the training and validation cohorts via the receiver operating characteristic curve. Results A total of 187 CSP patients were enrolled, who were divided into the training cohort (31 in 131 patients had massive hemorrhage) and validation cohort (10 in 56 patients had massive hemorrhage). The independent risk factors for intraoperative massive hemorrhage included cesarean section diverticulum area (OR = 6.957, 95% CI 1.993-21.887; P = 0.001), uterine scar thickness (OR = 5.113, 95% CI 2.086-23.829; P = 0.025) and gestational sac diameter (OR = 3.853, 95% CI 1.103-13.530; P = 0.025). A scoring model with a total point of 3 was developed and the CSP patients were divided into low-risk (Total points < 2) and high-risk groups (Total points = 2) for intraoperative massive hemorrhage accordingly. This model possessed high prediction performance both in the training cohort (area under the curve [AUC] = 0.896, 95% CI 0.830-0.942) and validation cohort (AUC = 0.915, 95% CI 0.785-1.000). Conclusion We first constructed a MRI-based scoring model for predicting intraoperative massive hemorrhage in CSP patients, which could help the decision-making of the patients' therapy strategies. Low-risk patients can be cured by D&C alone to reduce the financial burden, while high-risk patients require more adequate preoperative preparation or consideration of changing surgical approaches to reduce bleeding risk. [GRAPHICS] .",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be7d67c64d8cbdff66848c19f071fdc1",
  "timestamp": "2025-05-15T03:07:31.854522"
}