{
  "id": 7561,
  "title": "Factors Associated with Entering the Prescription Drug Coverage Gap Among Medicare Beneficiaries with Chronic Obstructive Pulmonary Disease",
  "abstract": "Patients with chronic obstructive pulmonary disease (COPD) need long-term use of COPD medications to manage their conditions. However, COPD patients enrolling in Medicare Advantage plans (MAPs) may enter the coverage gap, resulting in increasing financial burden. The purpose of this study was to identify characteristics of COPD patients who enter the Medicare coverage gap and the factors associated with time to enter the coverage gap. A retrospective cross-sectional study was conducted using a Texas MAP database between 2011 and 2014. Patients aged >= 65 years with a diagnosis of COPD and taking medication to treat COPD were included. Patients were divided into mainly 2 groups: no gap versus gap, based on their pharmacy outpatient spending. Within gap, patients were further categorized into coverage gap and gap with catastrophic coverage. Multinomial logistic regression was conducted to identify characteristics associated with reaching coverage gap and catastrophic coverage. Cox proportional hazards were performed to evaluate factors associated with time to reaching coverage gap. A total of 3142 COPD patients were identified: no gap (79%) and gap (21%). Among patients in gap, 51% fell into catastrophic coverage. Age, low-income subsidy (LIS) level, and Centers for Medicare & Medicaid (CMS) risk score were significant factors associated with entering both coverage gap and catastrophic coverage. Younger age, greater CMS risk score, and higher LIS benefit were associated with a higher hazard ratio of reaching the coverage gap. These characteristics may assist health maintenance organizations to identify beneficiaries who can potentially be provided with services with or without counseling on drug utilization.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be7e5e3715be96ef0bd44a3bb7c85bd5",
  "timestamp": "2025-05-15T03:09:36.986262"
}