{
  "id": 6111,
  "title": "Agricultural value chain participation and farmers' access to credit in northern Ghana",
  "abstract": "PurposePromoted for its inclusivity, agricultural value chain (AVC) financing leverages social capital and mechanisms such as off-take agreements and forward contracts to reduce borrowing and lending costs and risks for both farmers and lending institutions. AVC financing has been defined as the flow of financial products and services to and among the various actors within the AVC to address constraints of production and distribution and fulfill the needs of those involved in the chain by reducing risk and improving efficiency. This paper investigates how farmers' involvement in AVC affects their access to credit.Design/methodology/approachThe authors collected primary data from 400 crop farmers in northern Ghana through a semi-structured questionnaire and analyzed the data, using the multinomial endogenous switching regression model.FindingsJoint participation in AVC increased the amount of formal and informal credit received by 64 and 78%, respectively, compared to nonparticipation. Similarly, participation in AVC horizontal linkage and AVC vertical linkage increased the amount of formal and informal credit received by 40 and 47% and 46 and 74%, respectively, compared to nonparticipation. Irrigation farming, extension visits, knowledge of AVC in the community, access to a storage facility and trust in contract farming significantly influenced farmers' participation in AVC.Originality/valueThe authors' work offers valuable insights into how different dimensions of value chain participation can impact smallholder farmers' access to credit. This work also underscores the importance of considering both formal and informal credit sources when analyzing the outcomes of value chain participation. The findings could enable formal financial providers to identify, liaise and/or resource informal financial players such as value chain actors to supply both formal and informal credit to farmers in AVCs.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be91e13be7bb272c88da7bc1ff573ad8",
  "timestamp": "2025-05-15T02:54:39.173200"
}