{
  "id": 4935,
  "title": "Application of Clustering Algorithm in Corporate Strategy and Risk",
  "abstract": "With the increasing rise of market mechanism and corporate strategic management theory, many companies, especially listed companies, take diversification as their basic strategy. As the main source of power to promote the rapid development of China's economy, listed companies have also changed the way of China's economic development. It increases the speed of economic development, improves the level of economic technology, and accelerates the process of economic internationalization. Any economic behavior of an enterprise involves risks. As the development plan to mobilize the overall interests of the enterprise, the strategy will definitely involve the long-term development direction of the enterprise. Enterprise strategic deployments to strategic managements are affected by risk control elements. Strategic risk, as an unavoidable practical problem for enterprises, must be managed. Managing strategic risk is the key to effectively evaluate the management and control system. In order to solve this problem, this paper introduces a clustering algorithm, classifies the strategic risk of diversification, and analyzes its causes. For an in-depth analysis of the risks that diversification will face, this paper selects the case of the enterprise's diversification development to carry out the research. It conducts in-depth analysis and research on its basic situation, diversification strategy, dilemma, and behavior. The experimental results show that the financial leverage coefficients of the company in the four quarters are 24.64, 3.93, 104.71, and 6.59 respectively. From the numerical value, it can be concluded that the enterprise is in a high-risk state and the strategic risk status of the company can be accurately judged.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "be9b2e549eb7932f6616319da960ca7a",
  "timestamp": "2025-05-15T02:42:36.164811"
}