{
  "id": 4114,
  "title": "Student Hunger on Campus: Food Insecurity Among College Students and Implications for Academic Institutions",
  "abstract": "Purpose: To estimate the prevalence of food insecurity among students at a large mid-Atlantic publicly funded university; examine the association between food insecurity, demographic characteristics, potential financial risk factors, and self-reported physical and mental health and academic performance; and identify possible risk factors for food insecurity. Design: Cross-sectional survey. Setting: Large, public mid-Atlantic university. Participants: Two hundred thirty-seven undergraduate students. Measures: US Department of Agriculture (USDA) 18-item Household Food Security Survey Module (HFSSM) and questions on demographics, student status, economic factors, housing stability, living arrangements, academic performance, and self-rated physical health and depression symptoms. Analysis: Multivariate logistic regression analysis. Results: Among students surveyed, 15% were food insecure; an additional 16% were at risk of food insecurity. Students who were African American, other race/ethnicity, receiving multiple forms of financial aid, or experiencing housing problems were more likely to be food insecure or at the risk of food insecurity (Adjusted Odds Ratio [AOR] =4.00, 95% confidence interval [CI] =1.83-8.71, P value <.0001; AOR =5.26, 95% CI =1.85-14.98, P value =002; AOR =3.43, 95% CI <1/4> 1.85-6.37, P value <. 001; AOR =8.00, 95% CI =.57-17.93, P value <.0001, respectively). Food secure students were less likely to report depression symptoms than at-risk or food insecure students. Conclusion: Food insecurity among college students is an important public health concern that might have implications for academic performance, retention, and graduation rates. Universities that measure food insecurity among their students will be better positioned to advocate for policy changes at state and federal levels regarding college affordability and student financial assistance.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "beb4b3f594b8b076039d3cb3209aed42",
  "timestamp": "2025-05-15T02:33:41.990573"
}