{
  "id": 7882,
  "title": "Race, Socioeconomic Status, and Sex Hormones among Male and Female American Adolescents",
  "abstract": "Although early sexual initiation and childbearing are major barriers against the upward social mobility of American adolescents, particularly those who belong to a low socioeconomic status (SES) and racial minorities such as Blacks, less is known on how SES and race correlate with adolescents' sex hormones. An understanding of the associations between race and SES with adolescents' sex hormones may help better understand why racial, and SES gaps exist in sexual risk behaviors and teen pregnancies. To extend the existing knowledge on social patterning of adolescents' sex hormones, in the current study, we studied social patterning of sex hormones in a national sample of male and female American adolescents, with a particular interest in the role of race and SES. For this cross-sectional study, data came from the baseline data (wave 1) of the Adolescent Brain Cognitive Development (ABCD) study, a national longitudinal prospective study of American adolescents. This analysis included 717 male and 576 female non-Hispanic White or Black adolescents ages 9-10. The dependent variables were sex hormones (testosterone for males and estradiol for females). Independent variables were age, race, family marital status, parental education, and financial difficulties. For data analysis, linear regression models were used. Age, race, parental education, and financial difficulties were associated with estradiol in female and testosterone levels in male adolescents. Associations were not identical for males and females, but the patterns were mainly similar. Low SES explained why race is associated with higher estradiol in female adolescents. Marital status of the family did not correlate with any of the sex hormones. Being Black and low SES were associated with a higher level of sex hormones in male and female adolescents. This information may help us understand the social patterning of sexual initiation and childbearing. Addressing racial and economic inequalities in early puberty, sexual initiation, and childbearing is an essential part of closing the racial and economic gaps in the US.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "beb5073dd44a9461a5df4beb874d3479",
  "timestamp": "2025-05-15T03:13:04.908986"
}