{
  "id": 6756,
  "title": "The effects of relationship quality on export performance A classification of small and medium-sized Turkish exporting firms operating in single export-market ventures",
  "abstract": "Purpose - The purpose of this paper was to empirically examine the effects of relationship quality between exporter and importer on export performance in Turkish firms, and further, how small and medium-sized exporting firms are segmented based on quality of their relationship with importers. Design/methodology/approach - The paper includes Structural Equation Modeling and Cluster Analysis. Findings - The findings demonstrate that there is the positive impact of: information sharing on financial export performance and satisfaction with the export venture; long-term orientation on financial export performance, strategic export performance and satisfaction with the export venture; and satisfaction with the relationship on financial performance, strategic performance and satisfaction with export venture. Three segments of firm are profiled such as long-term thinkers, dissatisfactioners and information keepers. Research limitations/implications - The data incorporate only the view of one player (the exporter) around the exporter-importer relationship and do not take into account views from the other side of the dyad. However, since this study focused on first, the measuring relationship quality from the exporter's perspective and, second, the formation of exporter relationships as perceived by the exporter, ideal participants to be examined in this study are exporters. Future researches should be encouraged to test similar hypotheses in other international settings and compare their findings. Practical implications - Information exchange between exporter and importer fosters the export performance of small and medium sized firms. If exporters openly enter into contact with importers and share confidential information and strategic issues, satisfaction with export venture will be increased. The long run relationships will probably involve cooperation, goal sharing and risk sharing. Export managers should work by cooperative manner, avoid the short-term alternatives instead of long-term benefits and not act opportunistically. Relational satisfaction impacts to the financial and strategic export performances, and satisfaction with the export venture. When an exporter meets the expectations of importer based on evaluations of the tangible product or non-product related attributes such as delivery, service, or relational investments, his/her export performance will improve. Originality/value - This study can increase exporting firms' awareness and understanding about relationship quality in handling international operations. Additionally, this study differs from similar studies, which are related to relationships quality, by suggesting a classification of firms based on relational quality dimensions. Therefore, it provides more specific knowledge.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bebc109856a5a4e5e4a2b5a5d4b96462",
  "timestamp": "2025-05-15T03:01:03.675736"
}