{
  "id": 6136,
  "title": "DATA PREPROCESSING FOR ARTIFICIAL NEURAL NETWORK APPLICATIONS IN PRIORITIZING RAILROAD PROJECTS - A PRACTICAL EXPERIENCE IN TAIWAN",
  "abstract": "Financial constraints necessitate the tradeoff among proposed railroad projects, so that the project priorities for implementation and budget allocation need to be determined by the ranking mechanisms in the government. At present, the Taiwan central government prioritizes funding allocations primarily using the analytic hierarchy process (AHP), a methodology that permits the synthesizing of subjective judgments systematically and logically into objective consensus. However, due to the coopetition and heterogeneity of railway projects, the proper priorities of railroad projects could not be always evaluated by the AHP. The decision makers prefer subjective judgments to referring to the AHP evaluation results. This circumstance not only decreased the AHP advantages, but also raised the risk of the policies. A method to consider both objective measures and subjective judgments of project attributes can help reduce this problem. Accordingly, combining the AHP with the artificial neural network (ANN) methodologies would theoretically be a proper solution to bring a ranking predication model by creating the obscure relations between objective measures by the AHP and subjective judgments. However, the inconsistency between the AHP evaluation and subjective judgments resulted in the inferior soundness of the AHP/ANN ranking forecast model. To overcome this problem, this study proposes the data preprocessing method (DPM) to calculate the correlation coefficient value using the subjective and objective ranking incidence matrixes; according to the correlation coefficient value, the consistency between the AHP rankings and subjective judgments of railroad projects can be evaluated and improved, so that the forecast accuracy of the AHP/ANN ranking forecast model can also be enhanced. Based on this concept, a practical railroad project ranking experience derived from the Institute of Transportation of Taiwan is illustrated in this paper to reveal the feasibility of applying the DPM to the AHP/ANN ranking prediction model.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bebdd71e5c3f2dfe002be4e48862e173",
  "timestamp": "2025-05-15T02:55:12.893643"
}