{
  "id": 2127,
  "title": "Financial toxicity in cancer patients undergoing radiotherapy in a universal health care system-A prospective multicenter study of 1075 patients",
  "abstract": "Purpose: To establish and confirm prevalence as well as risk factors of financial toxicity in a large national cohort of cancer patients undergoing radiotherapy in a universal health care system.Methods: We conducted a prospective cross-sectional study offering a patient-reported questionnaire to all eligible cancer patients treated with radiotherapy in 11 centers in Germany during 60 consecutive days. The four-point subjective financial distress question of the EORTC QLQ-C30 was used as a surrogate for financial toxicity. Confirmatory hypothesis testing evaluated the primary study outcomes: overall prevalence of financial toxicity and its association with predefined risk factors. P-values < 0.05 were con-sidered statistically significant.Results: Of 2341 eligible patients, 1075 (46%) participated. The prevalence of subjective financial distress (=any grade higher than not present) was 41% (438/1075) exceeding the hypothesized range of 26.04- 36.31%. Subjective financial distress was felt A little by 26% (280/1075), Quite a bit by 11% (113/1075) and Very much by 4% (45/1075) of the patients. Lower household income, lower global health status/ quality of life, higher direct costs and higher loss of income significantly predicted higher subjective financial distress per ordinal regression and confirmed these risk factors. Higher psychosocial distress and lower patient satisfaction were significantly associated with higher subjective financial dis-tress in an exploratory ordinal regression model.Conclusion: The overall prevalence of financial toxicity was higher than anticipated, although reported at low or moderate degrees by most affected patients. As we confirmed risk factors associated with financial toxicity, patients at risk should be addressed early for potential support.(c) 2023 The Author(s). Published by Elsevier B.V. Radiotherapy and Oncology 183 (2023)109604 This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bebef581d0388f506fc72dde5a064bfe",
  "timestamp": "2025-05-15T02:11:40.537481"
}