{
  "id": 331,
  "title": "A Deep Learning Based Expert Framework for Portfolio Prediction and Forecasting",
  "abstract": "Stock market forecasting involves predicting fluctuations and trends in the value of financial assets, utilizing statistical and machine learning models to analyze historical market data for insights into future behavior. This practice aids investors, traders, financial institutions, and governments in making informed decisions, managing risks, and assessing economic conditions. Forecasting financial markets is difficult due to the intricate interplay of global economics, politics, and investor sentiment, making it inherently unpredictable. This study introduces a Deep Learning based Expert Framework for Stock Market forecasting (Portfolio prediction) called DLEF-SM. The methodology begins with an improved jellyfish-induced filtering (IJF-F) technique for preprocessing, effectively analyzing raw data and eliminating artifacts. To address imbalanced data and enhance data quality, pre-trained convolutional neural network (CNN) architectures, VGGFace2 and ResNet-50, are used for feature extraction. Additionally, an improved black widow optimization (IBWO) algorithm is designed for feature selection, reducing data dimensionality and preventing under-fitting. For precise stock market predictions, integrate deep reinforcement learning with artificial neural network (DRL-ANN) is proposed. Simulation outcomes reveal that the proposed framework achieves maximum forecasting accuracy, reaching 99.562%, 98.235%, and 98.825% for S&P500-S, S&P500-L, and DAX markets, respectively.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bedc72d00fcbad7a102b1945674fb87c",
  "timestamp": "2025-05-15T00:42:00.484776"
}