{
  "id": 2075,
  "title": "Prediction based mean-variance model for constrained portfolio assets selection using multiobjective evolutionary algorithms",
  "abstract": "In this paper, a novel prediction based mean-variance (PBMV) model has been proposed, as an alternative to the conventional Markowitz mean-variance model, to solve the constrained portfolio optimization problem. In the Markowitz mean-variance model, the expected future return is taken as the mean of the past returns, which is incorrect. In the proposed model, first the expected future returns are predicted, using a low complexity heuristic functional link artificial neural network (HFLANN) model and the portfolio optimization task is carried out by using multi-objective evolutionary algorithms (MOEAs). In this paper, swarm intelligence based, multiobjective optimization algorithm, namely self-regulating multiobjective particle swarm optimization (SR-MOPSO) has also been proposed and employed efficiently to solve this important problem. The Pareto solutions obtained by applying two other competitive MOEAs and using the proposed PBMV models and Markowitz mean-variance model have been compared, considering six performance metrics and the Pareto fronts. Moreover, in the present study, the nonparametric statistical analysis using the Sign test and Wilcoxon rank test are also carried out, to compare the performance of the algorithms pair wise. It is observed that, the proposed PBMV model based approach provides better Pareto solutions, maintaining adequate diversity, and also quite comparable to the Markowitz model. From the simulation result, it is observed that the self regulating multiobjective particle swarm optimization (SR-MOPSO) algorithm based on PBMV model, provides the best Pareto solutions amongst those offered by other MOEAs. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bee12ed25e2b6f54276de39fc1821a51",
  "timestamp": "2025-05-15T01:02:32.923228"
}