{
  "id": 4334,
  "title": "DETERMINANTS OF ESTABLISHING THE FINANCIAL RISK MANAGEMENT FUNCTION OF ENTERPRISES IN BOSNIA AND HERZEGOVINA",
  "abstract": "The role, position and importance of the enterprise financial risk management (FRU) function significantly changed after the collapse of the Bretton-Wood Agreement which increased the volatility of market risk factors such as exchange rates, interest rates, energy prices and/or prices of key inputs/outputs. An active approach to enterprise risk management has led to better understanding of the positive effects of risk management on sustainable business operations, while, on the other hand, it has evolved financial instruments and reduced the cost of risk hedging instruments. Over time, the FRM function has become a constituent part of the integral business dealings of enterprises. The purpose of paper is to investigate the determinants of FRM in large enterprises in Bosnia and Herzegovina (BiH) and the main objective of paper is to identify factors that explain the incidence of establishing a Malfunction with a focus on the theoretical basics and motives for Mal, and understanding the specifics of BH markets. The scientific contribution of the paper is reflected in the fact that this paper is a pioneering research in BiH that tested both positive theories on the economic rationale of FRM function and research hypotheses on the relationship between the determinants and the establishment of the enterprise Mal function. The main source of survey data is primary data collected through a structured questionnaire and secondary data collected from the financial statements of enterprises in BiH for 2017. The target population in this survey is large enterprises. The selection of the enterprise was conducted by random sampling method Three multivariate logistic regression models were evaluated The results of the research showed that there are no systematic, statistically significant differences between the hedgers and non-hedgers enterprises and there are no robust statistically significant determinants that explain the incidence of establishing a Mal function in large enterprises in BiH.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf11cdc8295bd343cc509a3e09e15ffe",
  "timestamp": "2025-05-15T02:36:05.196642"
}