{
  "id": 4009,
  "title": "Determinants of return rates of Russian equity and bond mutual funds: Active investment strategies and commissions",
  "abstract": "In our paper, we study the impact of active investment strategies and factors of their success in the Russian market of collective investment - self-confidence of managers, commissions of management companies (MC) - on return rates of mutual funds. For the first time, not only equity mutual funds, but also bond mutual funds are considered as an object of study; the time period is since 2012. Our study is based on data on the structure of mutual fund portfolios provided by Investfunds. We propose a number of original indicators of an active management style and consider the profitability of mutual funds relative to various benchmarks. Based on testing of multivariate regression models, it has been revealed that the return rate of equity mutual funds is negatively affected by a share of stocks in the fund portfolio which are not included in the market index. When managers take into account their previous negative investment experience, it contributes to the growth of mutual fund return rates. Active investment strategies correlate with increased commissions (up to 4.5% of NAV), but they do not allow an investor to receive higher return rates than index investments. An increase in the share of corporate bonds allows the fund manager to outperform benchmarks for bond funds. For the first time, a nonlinear relationship between the size of mutual funds and the value of commissions has been revealed for the Russian market.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf1b6f1d630292b940e8f812471b1d27",
  "timestamp": "2025-05-15T01:23:07.318443"
}