{
  "id": 7526,
  "title": "Links between US and Turkish agricultural commodity Markets: Nonlinear dependence and tail risk",
  "abstract": "In these unprecedented times, marred by the effects of the Covid-19 pandemic, global warming, and the war in Ukraine that began in February 2022, new approaches such as tail dependence have attracted more interest than conventional market dependence methodologies in analyzing time series in order to evaluate market linkage. In this study, we use the tail-restricted integrated regression function (IRF), introduced as a new methodology for nonlinear tail-mean dependence analysis. The IRF approach has several advantages over the existing tail-dependence measures focused solely on the occurrence of single tail events. To examine market dependence and tail risk, we analyze the nexus between the US and Turkish agricultural commodity markets over the period January 5, 2016-May 31, 2022. In addition to the daily prices of barley, corn, and wheat on agricultural commodity markets, we use Brent oil as a representative for the energy market, interest, and foreign exchange rates for financial markets as variables in our study. The results of upside and downside asymmetric risk spillovers show the direction of impact from the US agricultural market to the Turkish agricultural market. The findings suggest that, following the launch of a spot market in Tu center dot rkiye, the launch of an agricultural commodity futures market will enhance the completeness and the link between the spot and derivatives markets there. Copyright (c) 2023 Borsa Istanbul Anonim S,irketi. Published by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf3ae882a326cc397af7885f7ada5a45",
  "timestamp": "2025-05-15T03:09:36.873600"
}