{
  "id": 591,
  "title": "PERSPECTIVES ON DESIGN THINKING IN BUSINESS AND INNOVATION MANAGEMENT",
  "abstract": "The business world has never been more erratic or unpredictable. Competition comes not only for product, services and technology, but also for sales channels, policies, people and brand. In order to survive in today's unpredictable world, organizations must actively create, embrace and implement new ideas. This requires the creative thinking of the entire team. The concept of design thinking allows to realize such requirements. At-present design thinking is considered as a way to solve problems of a business or organization by empathy, deep understanding of the client, the user, the consumer of goods and services. This approach to decision making helps the reduction of the risks of wasted resources and time by introducing new design thinking methods based on key aspects. First, design thinking is human-centered, it emphasizes the importance of deep learning people's needs and lives while creating value before starting to develop solutions. Second, design thinking is a method based on the ability to create new ideas and innovate. Third, design thinking in business allows you to develop multiple options so you don't risk everything and consider the desires of all stakeholders while still in the search phase, which means being able to manage a portfolio of new ideas. Finally, the process is iterative. It involves doing experimental research in the real world instead of doing analysis using historical data. It is a process of constantly shaping and testing prototypes and changing perceptions of current tools in the business. These and other aspects are discussed in more detail in the article and underline the relevance of the research topic. Among other issues, the article considers the concept of design thinking, justified the history of development, the popularity of this new type of management tool in the economic space, highlighted the main features of design thinking, the stages of implementation, the basic tools and their capabilities. The author offered to consider design thinking as a way of the decision of a certain question in other way with use of completely different approach. It is another way of thinking or product mapping, which relies on the concept of design. This can include convergent and divergent thinking, testing and phasing, examining customers' opinions, views and tastes, and doing ethnographic research. And if all abovementioned factors are combined, this process is called design thinking. And if we add design thinking to management, we can get a number of quantitative and balanced methods of solving individual business-issues. That's why the article reveals the specifics of using design thinking on the example of certain companies, such as RealtimeBoard, Netflix, Airbnb, and presents the results of empirical research of French companies on the scope of design thinking. Focuses on selected areas of design thinking application in different business areas (business design, human resource management, etc.). In this article is presented a vision for future trends in design thinking.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf5156f7836e2a831134fe2cd1b79275",
  "timestamp": "2025-05-15T00:37:38.211988"
}