{
  "id": 9274,
  "title": "Prevalence and Risk Factors for Visual Impairment in Preschool Children The Sydney Paediatric Eye Disease Study",
  "abstract": "Purpose: To assess the prevalence and associations of visual impairment (VI) in preschool children. Design: Cross-sectional, population-based study. Participants: A total of 2461 children (73.8% participation rate), aged 6 to 72 months, were examined in the Sydney Paediatric Eye Disease Study during 2007-2009; of whom 1188, aged 30 to 72 months, with complete visual acuity (VA) data in both eyes, were included in this report. Methods: Measurement of VA was attempted on all children using the Electronic Visual Acuity (EVA) system or a logarithm of the minimum angle of resolution (logMAR) chart. Visual impairment was defined as presenting VA <20/40 in children aged >= 48 months and <20/50 in those aged <48 months. Post-cycloplegic refraction was measured, and myopia was defined as spherical equivalent (SE) <=-0.50 diopters (D), hyperopia was defined as SE >= 2.00 D, astigmatism was defined as cylinder >= 1.00 D, and anisometropia was defined as SE difference >= 1.00 D between 2 eyes. Ethnicity, birth parameters, and sociodemographic information were collected in questionnaires completed by parents. Main Outcome Measures: Visual impairment prevalence and its associations with child demographic factors and birth parameters. Results: Visual impairment was found in 6.4% of the worse eye and 2.7% of the better eye in our sample. Refractive errors (69.7%) and amblyopia (26.3%) were the principal causes of VI in the worse eye. Astigmatism (51.3%) and hyperopia (28.9%) were the main refractive errors causing VI. In regression analysis controlling for other factors, VI was independently associated with low birthweight of <2500 g (odds ratio 2.4, 95% confidence interval, 1.1-5.3), but not with age, gender, ethnicity, or measures of socioeconomic status (P > 0.05). Conclusions: Visual impairment in at least 1 eye was found in 6.4% of Australian preschool children, with bilateral VI found in 2.7%. Uncorrected refractive errors and amblyopia were the principal ocular conditions associated with VI. Low birthweight was a significant risk factor independent of age, gender, and ethnicity. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 1495-1500 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf5c8a0576c0272c7d6e9206dc51206c",
  "timestamp": "2025-05-15T03:27:24.942551"
}