{
  "id": 1960,
  "title": "Research on the Application of Big Data Intelligence Technology in the Optimization of Accounts Receivable Management of E-commerce Enterprises Under the Financial Sharing Mode",
  "abstract": "Accounts receivable management has always been an important part of the financial management of the financial sharing center. However, due to manual operation, problems like long working hours, uncontrollable errors and low efficiency of invoicing still exist. To solve this problem, we study K-means clustering method to grade customer credit, and use BP model to improve the clustering algorithm. Then, we study BP model to establish enterprise risk prediction model. Finally, we use RPA to make the billing process and reconciliation as well as write-off process optimized in accounts receivable. Through the above operations, an optimized model of account receivable management of e-commerce enterprises based on big data intelligent technology has been built. According to experimental analysis, the accuracy rate of risk prediction of e-commerce enterprise A is 95.63%. After applying the optimized management model, the ratio of accounts receivable balance to current assets has decreased from 34.3% to 28.5%. Studying and constructing models can effectively optimize corporate financial management and play a positive role in the stable development of enterprises. Applying this model to practical teaching can bring new vitality to the practical teaching of vocational education and provide new teaching methods for schools. The limitations of traditional accounts receivable management limit the effectiveness of teaching for financial students. This model effectively optimizes the management mode and brings more skilled knowledge to students.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf60e47e5b4e129021677ae92d2071c3",
  "timestamp": "2025-05-15T02:09:14.435707"
}