{
  "id": 7738,
  "title": "Improving detection of tuberculosis among household contacts of index tuberculosis patients by an integrated approach in Myanmar: a cross-sectional study",
  "abstract": "BackgroundContact tracing for tuberculosis (TB) is a recommended measure to improve the case detection rate; however, actual implementation in Myanmar is limited and low detection rates have been reported. Household contacts of a known index TB case are at high risk of infection, thus a more strategic action for contact tracing is required to achieve the goal of the World Health Organization End TB Strategy. This study aimed to assess TB case detection rates among household contacts by an integrated approach and identify risk factors for TB.MethodsA cross-sectional study was conducted in Mandalay City, Myanmar. Household contacts of index TB cases who had been receiving treatment for at least 3months were prospectively investigated by an integrated approach which included modification of screening methods and active facilitation of screening investigations as follows. Initial chest x-ray (CXR) was performed for all contacts at the responsible facilities followed by sputum specimen collection for those aged 15years and gene Xpert MTB/RIF examination. Transportation of all household contacts to health facilities and transportation of sputum samples for smear and gene Xpert MTB/RIF examination at centers were arranged by the research team to ensure that all household contacts received all investigations. Risk factors for TB among household contacts were identified by multiple logistic regression models.ResultsOf 174 household contacts, 115 were15years and 59 were<15years. The percentage of TB cases detected among the household contacts was 13.8%. There were 14 (12.2%) positive TB cases among the 115 contacts aged 15years while 10 (16.9%) of those aged <15years had clinical signs and symptoms of TB with an abnormal CXR. Risk factors among household contacts for TB were being a caretaker of an index case, active and passive smoking, and drinking alcohol.ConclusionsThe integrated approach of TB contact tracing by special arrangement for CXR, sputum and gene Xpert MTB/RIF examination yielded a high TB detection rate in a high TB prevalence area. Logistic and financial administration is needed to strengthen contact tracing. Further research on high-risk household contacts should be considered for increasing TB detection rates.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf6632b941879d0500e513731d14650e",
  "timestamp": "2025-05-15T03:11:38.538865"
}