{
  "id": 9080,
  "title": "Depressive Symptoms and Its Associated Factors Among Primary Caregivers of Stroke Survivors at Amhara Regional State Tertiary Hospitals: Multicenter Study",
  "abstract": "Background: Stroke is one of the leading causes of severe disability and functional limitation, which are reasons for being dependent on their family for daily activities and participation in social affairs. After discharge from the hospital, most stroke survivors require physical, psychosocial, and financial support from caregivers at home, which is one of the most stressful events for families. The stroke survivors and their caregivers may influence each other during the caregiving process and social life. The stroke survivor's disability and depressive symptoms affect the quality of life of the survivor and their caregivers. Therefore, the purpose of this study was to assess the prevalence and associated factors of depression among caregivers of stroke survivors.Methods: An institution-based, cross-sectional study was conducted in Amhara regional state tertiary hospitals. A systematic random sampling technique was employed to select 424 participants. The data were collected using an interviewer-administered and chartreviewed structured questionnaire. The Patient Health Questionnaire-9 (PHQ-9) was used to assess depression. Univariable and multivariable logistic regression analyses were performed to identify factors associated with depression. Adjusting the odds ratio with the corresponding 95% confidence interval and variables with a P-value < 0.05 was considered significantly associated with depression.Results: The overall prevalence of depressive symptoms was 65.6% (95% CI: 60.8-69.8). Being female, older than 40, having no formal education, having a low family monthly income, being the son or daughter, and spending more than six hours per day were associated with depression.Conclusion: We found that depression was prevalent among primary caregivers of stroke survivors. To reduce the risk of developing depression, policymakers should fully recognize the role of caregivers in caring for stroke patients. More attention should be given to caregivers who are female, elderly, have a low income, are sons or daughters, and spend a long time caring per day.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf778e1f486f8398caa8ed5ac7fbabfe",
  "timestamp": "2025-05-15T03:25:27.685360"
}