{
  "id": 8470,
  "title": "Risk Mapping on Dynamics Creative Industry: Case Study at Bandung City, Indonesia",
  "abstract": "Creative industry is a new global phenomena that arise at this information age. It is said that creativity will be the driver for social and economic change in order to become a new source of competitive advantage. Nowadays, business, government, academician focus their attention to creative economy. It is about how the content creates creativity and further adds the GDP and job creation. The purpose of this research are to find the major or relevant risks that have strong relationship to creative industry and creating policy that support creative industry based on relevant risks in Bandung, Indonesia. Data collection gathered through structured questionnaire and in-depth interview to digging information from respondents. The questionnaire contains list of variables which reflected on questions of financial sector, marketing sector, human resource sector, operation sector, and industry sector where each sector contain detail activities. Assessment of the questionnaire using likelihood and impact with the scale of 1 (rare and little impact) to 4 (almost happen and catastrophic). Respondents were chosen by purposive-random sampling method in Bandung and this research using 60 respondents that represent 14 sub-sectors of creative industry. This research uses factor analysis to summarize the variable of risks and then multiple regression to rank those risks based on priority level. The result of this research shows that there are to two sections for risk categorization i.e. the most affecting variable and less affecting variable, where each variable contains with sum of predictors that have shown by method used in this research. (C) 2015 The Authors. Published by Elsevier Ltd.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf7870391013b74757d02072b13ffe42",
  "timestamp": "2025-05-15T03:19:21.264867"
}