{
  "id": 4419,
  "title": "The prioritization of failures within the automotive industry: The two-step failure mode and effect analysis integrated approach",
  "abstract": "Traditionally, in the automotive industry, the risk posed by failures in manufacturing is based on the conventional process failure mode and effect analysis. The market changes, as well as limited financial resources dedicated to business improvement, induce the need for employment of advanced management tools. The rating of failures is derived from the research using the suggested fuzzy classification method based on the Pareto analysis. It is assumed that the classification criterion should be determined as the product of the overall product choice and the risk priority numbers given by applying the traditional process failure mode and effect analysis. All the uncertainties that exist in the problem under consideration are represented by linguistic expressions that are modeled on the interval type-2 triangular fuzzy numbers. The overall product choice is based on a fuzzy analytical hierarchy process with interval type-2 triangular fuzzy numbers. The execution of management initiatives based on the priority of failures can result in the improvement of the manufacturing process and overall business efficiency. The proposed model is tested using real-life data from a single vehicle manufacturer operating in the Western Balkans and representing a part of a global automotive supply chain.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf8604678a1f6dfb7f0ed02444cb2548",
  "timestamp": "2025-05-15T02:37:16.745069"
}