{
  "id": 3841,
  "title": "THE PERCEPTION OF BUSINESS RISKS BY SMES IN THE CZECH REPUBLIC",
  "abstract": "This article aims to find out which business risks determine the perception of the business environment of small and medium-sized enterprises (SME) in the future. 454 SMEs from the Czech Republic participated in the case study by filling in an online questionnaire. Linear regression models were used to verify statistically significant causal relationships between selected indicators of business risks and respondents' perception of the future of business. The results show that selected indicators of the market, financial, personnel, legal and operational risk determine the perceived future of business. Strategic risk indicators do not significantly affect the perceived future of business. The most important indicators: market risk - adequacy of sales of products and services; financial risk - an indicator of the company's financial performance; personnel risk - an indicator of employees' initiative to increase performance; legal risk- an indicator of respondents' ability to understand the basic legal aspects and operational risk - an indicator of the use of company capacities. All the indicators from above have a positive effect on the future perception of the company. Implications for Central European audience: The attitudes of small and medium-sized enterprises represent a certain degree of subjectivity (human factor), which does not always reflect the real position of the enterprise. However, it is the main representatives of SMEs (owners and top managers) who try to manage business risks to have a more positive perception of their future in the business environment in the Czech Republic. The results based on the business environment of the Czech Republic are important not only for the owners of SMEs, but also for state and non-profit institutions dealing with various forms of SME support.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf8978182faab32c781d1c27dc1b73bb",
  "timestamp": "2025-05-15T02:30:28.736265"
}