{
  "id": 3348,
  "title": "Are Indian sectoral indices oil shock prone? An empirical evaluation",
  "abstract": "We present the impact of oil shocks on a disaggregate Indian stock market by using 10 sectoral indices for the period from 2010-2019. We use the novel Ready's (2018) oil shock decomposition mechanism. Using the rolling regression and dynamic conditional correlation, we ascertain the time varying properties of different oil shocks on the sectoral returns. To understand the asymmetric effect, we employ the markov switching regression. The results of the study are presented in two sets: One, we observe a structural dynamic shift in the conditional correlation between the oil shocks and sectoral returns across the study period. Also, the markov regime regression confirms that demand shocks have positive effect on all sectors in high and low volatility regime signalling the huge consumption demand in Indian industries. The supply shocks are not significant either in low or high volatility regimes indicating collapse of economic activities in such case. the demand and supply shocks have positive and negative impact on all sectoral indices, respectively. The influence of risk shocks is observed to be negative and statistically significant on all the sectoral equity indices. These results are helpful for investors in devising optimal portfolio with rational risk exposure to different sectors. They would be able to ascertain the optimal market timing for investment and orient their investment strategy towards better industry rotation. The policymakers also be able to formulate better macroeconomic strategies commensurating with the time varying effects of oil price shocks on Indian economy.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf8c5dafe0487fb8179b1170d4dea3dd",
  "timestamp": "2025-05-15T01:16:22.081661"
}