{
  "id": 5485,
  "title": "Risk-adapted modulation through de-intensification of cancer treatments: an ESMO classification",
  "abstract": "Background: The landscape of clinical trials testing risk-adapted modulations of cancer treatments is complex. Multiple trial designs, endpoints, and thresholds for non-inferiority have been used; however, no consensus or convention has ever been agreed to categorise biomarkers useful to inform the treatment intensity modulation of cancer treatments. Methods: An expert subgroup under the European Society for Medical Oncology (ESMO) Precision MedicineWorking Group shaped an international collaborative project to develop a classification system for biomarkers used in the cancer treatment de-intensification, based on a tiered approach. A group of disease-oriented clinical, translational, methodology and public health experts, and patients' representatives provided an analysis of the status quo, and scanned the horizon of ongoing clinical trials. The classification was developed through multiple rounds of expert revisions and inputs. Results: The working group agreed on a univocal definition of treatment de-intensification. Evidence of reduction in the dose-density, intensity, or cumulative dose, including intermittent schedules or shorter treatment duration or deletion of segment(s) of the standard regimens, compound(s), or treatment modality must be demonstrated, to define a treatment de-intensification. De-intensified regimens must also portend a positive impact on toxicity, quality of life, health system burden, or financial toxicity. ESMO classification categorises the biomarkers for treatment modulation in three tiers, based on the level of evidence. Tier A includes biomarkers validated in prospective, randomised, non-inferiority clinical trials. The working group agreed that in non-inferiority clinical trials, boundaries are highly dependent upon the disease scenario and endpoint being studied and that the absolute differences in the outcomes are the most relevant measures, rather than relative differences. Biomarkers tested in single-arm studies with a threshold of non-inferiority are classified as Tier B. Tier C is when the validation occurs in prospective-retrospective quality cohort investigations. Conclusions: ESMO classification for the risk-guided intensity modulation of cancer treatments provides a set of evidence-based criteria to categorise biomarkers deemed to inform de-intensification of cancer treatments, in riskdefined patients. The classification aims at harmonising definitions on this matter, therefore offering a common language for all the relevant stakeholders, including clinicians, patients, decision-makers, and for clinical trials.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bf928e0c7764c9709bc96ac8cdf647e0",
  "timestamp": "2025-05-15T02:48:23.677403"
}