{
  "id": 9416,
  "title": "Which Factors Influence Whether Children With Behavioral Problems and a Mentally Ill Parent Get the Support That They Need?",
  "abstract": "Children of mentally ill parents accumulate many risk factors. Despite the high risk to their development, numerous studies have shown that these children and their families rarely profit from existent psychosocial interventions and support programs. Approximately half of the children with mentally ill parents who already show behavioral problems do not get the support they need. Some of the reasons for this lack of health-care utilization include: insufficient information about the variety of programs; worries about losing custody of their children; and feelings of guilt, shame, or failure. The factors poverty, parental stress, and life satisfaction of these children are further examined. The central objective of this study is to examine the need of support for families with a mentally ill parent in the region of Basel (Switzerland) and the specified reasons for why they do not profit from available interventions and programs. Additionally, we explored factors that predict why children with behavioral problems and low quality of life in this high-risk population do not get the support they need. A sample of mentally ill parents (N = 101, 58.4% female) from out-and in-patient care were recruited in a region of Switzerland that is well supplied with different family interventions and support. They were examined with one self-developed and several standardized psychometric questionnaires (CBCL, BSI, PSS, ILK). Affective disorders (46.5%) and substance use disorders (28.7%) were the most frequent diagnoses. The children of these patients were between 4 and 18 years old with a mean age of 10.16 years (SD = 3.97). Even in a region where support and specific interventions do exist, many families cannot access this support. Reasons for the minimal use of services were the lack of information about the help services (44.5%, n = 45), the costs were too high (30.8%, n = 31), or parents feared being separated from their children (26.7%, n = 27). Furthermore, only a few parents were aware of the specific programs for families with a mentally ill parent (9.9%, n = 10). When asked about whom they discuss their worries with, parents named relatives (59.4%, n = 60), their psychiatrist (55.4%, n = 56), their general practitioner (46.5%, n = 47), and their child's teacher (38.6%, n = 39). The most important sources of support for parents were their specific psychiatric treatment (n = 28, 27.7%) and their family, partner, relatives, and friends (34.7 %). In logistic regression analysis, parental stress was shown to be a significant predictor of children with behavioral problems and low quality of life receiving inadequate psychiatric support (b = .07, p = .03, OR = 1.08). The parents of children in this group had higher rates of parental stress (M = 50.25, SD = 12.49) than the rest of the parents (M = 40.16, SD = 9.64). Parental mental illness (b = .02, p =.38, OR = 1.02) and the financial situation of the family (b =.32, p = .58, OR = 1.38) were not related to children with behavioral problems receiving psychiatric support. The model's accuracy was satisfactory with R-2 = .18. These results once again highlight the fact that even in a region with readily accessible services, the existing health-care facilities and services have difficulty reaching families with a mentally ill parent. It would therefore be important to develop strategies with these families for early and low-threshold support, while also strengthening communication within the network of help services to improve its organization and keep everyone well informed about all the different possibilities and programs. These findings are well supported by a wide range of studies, and do not come as a surprise, which shows that implementing support for these vulnerable families unfortunately takes much too long. Parental stress reduces the parent's help-seeking skills for their children. Interestingly, parental mental illness itself does not appear to be a predictor of parents' abilities to get psychiatric help for their children. Therefore, as long as parental stress is not too high, even severely mentally ill parents should be capable of getting help for their children. Future research and treatment guidelines should include parental stress as a central factor in the support of mentally ill parents.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bfad7e0a776302010b56f7351d741d83",
  "timestamp": "2025-05-15T03:28:46.209617"
}