{
  "id": 724,
  "title": "Business investment decision-making based on mathematical model and risk analysis",
  "abstract": "Business investments are prone to market risks, so pre-analysis is mandatory. The type of risk, its period, sustainability, and economic impact are the analyzable features for preventing loss and downfall. In recent years, mathematical models have been used for representing business cycles and analyzing the impacting risks. This article introduces a Decisive Risk Analytical Model (DRAM) for identifying spur defects in business investments. The proposed risk analytical model exploits the investments, returns, and influencing factors over the various market periods. The risk model is tuned for identifying the influencing factors across various small and large investment periods. The model is tuned to adapt to different economic periods split into a single financial year. In the process of tuning and training the mathematical analysis model, deep learning is used. The learning paradigm trains the risks and modifying features from expert opinion and previous predictions. Based on these three factors, the risk for the current investment is forecasted. The forecast aids in improving the new investment feasibilities with minimal risks and model modifications. The frequent market status is identified for preventing unnecessary risk-oriented forecasts using the training performed. Therefore, the proposed model is reliable in identifying risks and providing better investment recommendations.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bfb951cc158cc66643a0b59ac264b449",
  "timestamp": "2025-05-15T01:42:05.348879"
}