{
  "id": 6740,
  "title": "Risk factors for low birth weight among first-time mothers in southern Taiwan",
  "abstract": "Background and Purpose: Low birth weight (LBW) greatly affects infant development, the family, and health care financial systems. Nonetheless, the risk factors for LBW in Taiwan have not been investigated. The purpose of this study was to determine the risk factors for LBW in Kaohsiung County. Methods: In this cross-sectional study, we recruited 1,147 first-time mothers, including all adolescent mothers (< 20 years old) who gave birth during the period from June 1994 through May 1995 and all adult mothers (greater than or equal to 20 years old) who gave birth in January and February 1995. The subjects were interviewed during home visits or by telephone by public health nurses in each township. Logistic regression analysis was used to identify the risk factors for LBW in adolescent and adult mothers. Results: The prevalence of LBW in the study population was 6.2%, ranging from 7.6% in adolescent mothers to 4.9% in adult mothers. Univariate analysis showed that mothers who had low pregravid weight (< 45 kg), infrequent prenatal visits (< 10), anemia, low gestational weight gain (< 10 kg), or habits of alcohol consumption or cigarette smoking were mor e likely to give birth to LBW infants. In logistic I-egression analysis, after controlling for covariates, the significant risk factors for LBW were low gestational weight gain (< 10 kg) and low pregravid weight (< 45 kg) for adolescent mothers. Infrequent prenatal visits (< 10) was the only significant risk factor for adult mothers. Conclusions: In this study, the risk factors for LBW among adolescent and adult mothers were different. This suggests that programs for prevention of LBW should he tailored according to maternal age, begin before conception, and continue with enhanced surveillance during prenatal visits.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bfbb67df67865402f8d3d536a66ae890",
  "timestamp": "2025-05-15T03:01:03.621693"
}