{
  "id": 2117,
  "title": "Creating an Online Social Learning Platform: A Model Approach for Open Development, Open Access and Open Education",
  "abstract": "The importance of online learning platforms in the face of the challenges of the 21st century cannot be stressed enough. Multiple approaches based on different didactic concepts and software have already been discussed. At Karlsruhe Institute of Technology, our team supports the development of an innovative digital infrastructure in creating a virtual campus that provides a portfolio of digital skills and key qualifications for students of all disciplines. The following paper presents this open source-based social online learning platform called hocampus: it aims to function as a model approach for future learning platforms connecting unsupervised learning, peer communication and tutoring as well as teaching. However, our platform is not a mere technical architecture that employs online learning and communication possibilities: it is characterized by a strong correlation of structure and content. For this, we advance a didactic concept focused on empowering students to strengthen their cross-disciplinary key competences and 21st century skills. We also depict the digital infrastructure and tools being used in the creating and operation of hocampus. Lastly, the general design principles for digital platforms are put forward. This paper also presents a firsthand account of how to implement such a learning platform by showing what hindrances need to be overcome, how students benefit from a social online learning platform and how digital learning can develop and change in the coming years. Thus, it can function as a manual portraying the necessary steps for the realization of concrete didactic concepts in a digital space.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bfcf7eeb6a0da0467c838ff726c4716b",
  "timestamp": "2025-05-15T01:03:03.753632"
}