{
  "id": 6782,
  "title": "The Impact of CEOs' Characteristics on Corporate Leverage: Indian Scenario",
  "abstract": "Ever since the prominent work by Modigliani and Miller (1958), much research has been undertaken in trying to identify the factors affecting the capital structure. Lately, behavioural finance has begun to take hold of a more prominent position in trying to explain aspects of finance which traditional research has failed to clarify. In fact, a growing body of empirical evidence suggests that manager-specific characteristics significantly influence firms' financing decisions. The limited work carried out in lower-middle income countries drives us to thoroughly investigate the role played by CEOs' characteristics in determining corporate financing decisions. Employing a sample of 307 non-financial firms listed in Nifty 500 index, the panel regression results indicate that CEO tenure is significantly and positively associated to firm's leverage for the possible reason that a long tenure of CEO reflects strong networks and alliances with important stakeholders that allow the CEO to compose, foster, and support risky initiatives like raising debt. Further, the level of leverage is higher at organizations where CEOs are younger on account of the fact that career and financial securities are imperative to a greater extent for older executives; therefore they may evade risky engagements that may interfere with their securities. The results also display that CEO share ownership has a significantly negative relationship to leverage because these executives have a large share of their personal wealth capitalized in the firm in the shape of firm-specific human capital and common stock holdings. This makes managerial insiders unwilling to use the optimum amount of debt funding for the firm for the reason that additional bankruptcy risk associated with higher levels of debt may arise. The findings thus put forward that recurrent job changes among the senior officials should be discouraged because the subsequent short-term focus and dearth of firm-specific knowledge might promote risk evasion. It shows that elder executives desire a more conservative capital structure whereas younger executives endeavour to take more risk. So, there is a need to bring diversification in the management so as to take advantage from the skills and services of the young. The inverse association between CEO share ownership and firm leverage specifies that board of directors and the shareholders should be stringent in checking managers to make sure they perform as per the interests of shareholders. It seems that while making capital structure decisions risk seeking behaviour favouring high corporate leverage is important and should be encouraged.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bfd3da265cbec0fb001332fa6f0fd913",
  "timestamp": "2025-05-15T03:01:31.411480"
}