{
  "id": 8029,
  "title": "Rates and Risk Factors for Revision Open and Arthroscopic Proximal Biceps Tenodesis",
  "abstract": "Background: Biceps tenodesis may be performed for symptomatic tendinopathy or tearing of the long head of the biceps tendon. Biceps tenodesis is also commonly performed as an adjunctive procedure. However, the indications and prevalence of biceps tenodesis have expanded. Purpose: To establish the incidence and risk factors for revision biceps tenodesis. Study Design: Case-control study; Level of evidence, 2. Methods: The PearlDiver database of Humana patient data was queried for patients undergoing arthroscopic or open biceps tenodesis (Current Procedural Terminology [CPT] 29828 and CPT 23430, respectively) from 2008 through the first quarter of 2017. Patients without a CPT laterality modifier were excluded from analysis. Revision biceps tenodesis was defined as patients who underwent subsequent ipsilateral open or arthroscopic biceps tenodesis. The financial impact of revision biceps tenodesis was also calculated. Multivariate binomial logistic regression was performed to identify risk factors for revision biceps tenodesis, such as patient demographics as well as concomitant procedures and diagnoses. Odds ratios (ORs) and 95% CIs were calculated, and all statistical comparisons with P < .05 were considered significant. Results: There were 15,257 patients who underwent biceps tenodesis. Of these, 9274 patients (60.8%) underwent arthroscopic biceps tenodesis, while 5983 (39.2%) underwent open biceps tenodesis. A total of 171 patients (1.8%) and 111 patients (1.9%) required revision biceps tenodesis after arthroscopic and open biceps tenodesis, respectively (P = .5). Male sex (OR, 1.38 [95% CI, 1.04-1.85]; P = .02) was the only independent risk factor for revision biceps tenodesis after the index open biceps tenodesis. After arthroscopic biceps tenodesis, age >45 years (OR, 0.58 [95% CI, 0.39-0.89]; P = .01) and concomitant rotator cuff tear (OR, 0.58 [95% CI, 0.47-0.71]; P < .001) were independent protective factors for revision biceps tenodesis. The total cost of revision biceps tenodesis after open and arthroscopic biceps tenodesis was US$3427.95 and US$2174.33 per patient, respectively. Conclusion: There was no significant difference in the revision rate between arthroscopic and open biceps tenodesis. Risk factors for revision surgery included male sex for open biceps tenodesis, while age >45 years and rotator cuff tears were protective factors for arthroscopic biceps tenodesis.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "bfec3256c1081818e09fab27ca687498",
  "timestamp": "2025-05-15T03:14:37.301395"
}