{
  "id": 2781,
  "title": "Financial Strain, Suicidal Thoughts, and Suicidal Behavior Among US Military Personnel in the National Guard",
  "abstract": "Background: Although financial strain is an identified risk factor for suicide among US military personnel, research is limited regarding the specific dimensions of financial strain that confer the greatest risk. Aims: The present study examined the associations among multiple indicators of financial strain, suicide ideation, and suicide attempts in a sample of US National Guard personnel, a high-risk subgroup of the US military. Method: National Guard personnel from Utah and Idaho (n = 997) completed an anonymous online self-report survey. Weighted univariate and multivariate logistic regression was used to test hypothesized associations. Results: Lifetime history of suicide ideation was significantly more common among participants reporting recent income decrease, credit problems, and difficulty making ends meet, even when adjusting for other covariates. Lifetime history of suicide attempt was significantly associated with recent foreclosure or loan default, credit problems, and difficulty making ends meet, but only in univariate analyses. Recent credit problems were the only financial strain indicator that significantly predicted a history of suicide attempt among participants with a history of suicide ideation. Limitations:The present study includes self-report methodology and cross-sectional design. Conclusion: Although multiple indicators of financial strain are associated with increased risk for suicidal thinking among National Guard military personnel, credit problems had the strongest association with suicide attempts.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c014aa8d25aa6231550c57b7328e302a",
  "timestamp": "2025-05-15T02:19:08.437507"
}