{
  "id": 5015,
  "title": "Adult life-course trajectories of psychological distress and economic outcomes in midlife during the COVID-19 pandemic: evidence from the 1958 and 1970 British birth cohorts",
  "abstract": "PurposeFinancial adversity in times of economic recession have been shown to have an unequal effect on individuals with prior mental health problems. This study investigated the relationship between mental health groupings across the adult life-course and change in financial situation and employment status during the COVID-19 pandemic, as well as the use of financial measures to mitigate the economic shock.MethodsUsing two nationally representative British birth cohorts, the National Child Development Study (1958) n = 17,415 and 1970 British Cohort Study n = 17,198, we identified 5 different life-course trajectories of psychological distress from adolescence to midlife which were similar but not identical across the two cohorts. We explored their relation to changes in financial and employment circumstances at different stages during the pandemic from May 2020 to March 2021, applying multinomial logistic regression and controlling for numerous early life covariates, including family socio-economic status (SES). In addition, we ran modified Poisson models with robust standard errors to identify whether different mental health trajectories were supported by government and used other methods to mitigate their financial situation.ResultsWe found that the financial circumstances of pre-pandemic trajectories of psychological distress with differential onset, severity, and chronicity across the life-course were exacerbated by the COVID-19 economic shock. The 'stable-high' (persistent severe symptoms) and 'adult-onset' (symptoms developing in 30s, but later decreasing) groups were vulnerable to job loss. Compared to pre-pandemic trajectory groupings with no, minor, or psychological distress symptoms in early adulthood, the 'stable-high', 'midlife-onset' (symptoms developing in midlife), and 'adult-onset' trajectory groups were more likely to seek support from the UK governments economic response package. However, trajectories with pre-pandemic psychological distress were also at greater risk of reducing consumption, dis-saving, relying on increased financial help from family and friends, and also taking payment holidays (agreements with lenders to pause mortgage, credit card or loan payments for a set period) and borrowing.ConclusionThis work highlights different trajectories of pre-pandemic psychological distress, compared to groups with no symptoms were more vulnerable to pandemic-related economic shock and job loss. By adopting unsustainable mitigating measures (borrowing and payment holidays) to support their financial circumstances during COVID-19, these mental health trajectories are at even more risk of lasting adverse impacts and future economic difficulties.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c0234807b79995a53e31352b890cf38e",
  "timestamp": "2025-05-15T02:43:40.088303"
}