{
  "id": 4304,
  "title": "Islamic ethics, capital structure and profitability of banks; what makes Islamic banks different?",
  "abstract": "Purpose - The paper aims to investigate whether the Islamic banks (IBs) and the conventional banks (CBs) could be distinguished from one another on the basis of their capital structure, profitability and their respective determinants with using a multivariate statistical method for analysis of data. Design/methodology/approach - The paper provides a comparative study based on a predictive model, the binary logistic regression, using a sample of 53 listed CBs and 45 listed IBs from the Middle East region for the period 2006-2014. Findings - The binary logistic regression reveals that profitability and capital structure are good predictors that help to distinguish between the two categories of banks. Results suggest that higher are the net margin and capital ratio, higher is the probability that the bank is Islamic. For the return on assets, results show that lower is this value; higher is the likelihood that the bank is Islamic. Regarding their related determinants, the findings suggest first that banks with higher dividend payout policy, financing ratio, costs ratio and insolvency risk are more likely to be Islamic. Second, results suggest that banks with lower collaterals, size and credit risk are more likely to be Islamic. Research limitations/implications - The study contributes to the growing literature on corporate finance and Islamic banking. Analyzing the capital structure and profitability of the two categories of banks is important for investors, financial analysts and regulators. Understanding the differences contributes to understand how following Islamic finance principles and being under Shariah governance could impact the bank profitability and financial decision, as well as investors behavior. Originality/value - The study contributes to the scare literature dedicated to the use of the multivariate statistical methods for the analysis of data to compare the financial characteristics of IBs and CBs.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c03844bc858078632ee28415b8f3451e",
  "timestamp": "2025-05-15T02:35:26.352870"
}