{
  "id": 6989,
  "title": "The prevalence of depressive symptoms among elderly Chinese private nursing home residents in Hong Kong",
  "abstract": "Background Privately-owned Nursing homes (PNH) in Hong Kong present a unique setting of institutional care where elderly with the whole spectrum of health status live together. Objectives This cross-sectional descriptive study aimed to determine the prevalence of significant depressive symptoms in a group of Cantonese-speaking Chinese private nursing home elderly living in Hong Kong, and to identify associated psychosocial and health factors. Methodological Results Two hundred and forty five residents fulfilled the inclusion criteria. Using the Chinese version of the Geriatric Depression Scale-Short Form (GDS-SF), we detected significant depressive symptoms in 29% of subjects. Univariate analysis revealed some associated socio-economic risk factors including current non-Comprehensive Social Security Assistance (CSSA) recipients, education levels and low abilities for social activities. Low vision, swallowing difficulties and low levels of basic activities of daily living (BADL) as reflected by the total Modified Barthel Index of less than 61 were important health predictors. Depression was also associated with features of self-perception of financial inadequacy, life dissatisfaction, poor self-perceived health, poor attitudes towards living arrangement and suicidal thoughts. Stepwise logistic regression identified swallowing problems, current non-CSSA recipient and low BADL ability as independent risk factors. Conclusion The high prevalence of depressive symptoms in the nursing home elderly requires the attention of Government authorities, health care and social service providers. Copyright (C) 2004 John Wiley Sons, Ltd.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c03bb0c5c7b1f6040b49a9580ad3c377",
  "timestamp": "2025-05-15T03:03:55.772910"
}