{
  "id": 7274,
  "title": "Predicting negative ureteroscopy for stone disease - Minimizing risk and cost",
  "abstract": "Introduction: Urolithiasis is common world-wide, with ureteric stones being a particular burden. Ureteroscopy (URS) is one of the most useful procedures in treating ureteric stones not passed spontaneously; this procedure has a complication risk of 4%. Negative URS, with described rates up to 15%, represents an avoidable patient risk and use of medical resources. Objectives: To describe rates and identify predictive factors for negative URS and to define strategies which would minimize patient and financial burden from these unnecessary procedures. Materials and methods: A retrospective cohort study analyzed patients who underwent URS in our Center to treat ureteric stones over a period of 2 years. Patient age, gender, and armorbidities, as well as laboratory and imaging findings, were analyzed. Results: 262 patients underwent URS for ureteric stones. The female population was 50.8% with a mean age of 56.89 years. A total of 78 (29.8%) URS procedures were negative. Univaricae analysis showed a higher prevalence of negative URS in female patients, as well as in primary, smaller, and radiolucent stones. At multivariate analysis, a logistic regression model correctly classified 76% of patients, with smaller stone size and radiolucency being significant predictors of negative URS. Discussion and conclusions: Our Center showed a high rate of negative URS, higher than commonly described in the literature. Female patients tend to have an even higher rate, possibly due to unnoticed passage of stones. Patients with small, radiolucent stones showed the highest rates of negative URS.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c046aa5dc415b89fb35e2c4b98a3d9e6",
  "timestamp": "2025-05-15T03:07:02.557157"
}