{
  "id": 9035,
  "title": "Multiple material need insecurities and severity of psychological distress during the COVID-19 pandemic among women who use drugs",
  "abstract": "BackgroundThe COVID-19 pandemic highlighted the salience of material needs and financial precarity on mental health and distress. Women who use drugs (WWUD) experienced significant mental distress and multiple material need insecurities before the pandemic. However, research is limited on the nature of these insecurities during the pandemic despite both material scarcity and mental distress placing WWUD at greater risk of drug-related harms such as overdose. We aim to characterize material need insecurities and their associations with level of mental distress among a sample of WWUD in the United States during the COVID pandemic.MethodsN = 227 WWUD (i.e., non-medical use of opioids, crack or powdered cocaine at least three times in the past three months) were recruited in Baltimore, Maryland between August 2021-December 2022. We assessed participants' challenges (i.e., none, minor, major challenge) in accessing five critical material needs during the pandemic: housing; food security; clean, potable water; transportation; and bathroom facilities. The number of major challenges was summed and dichotomized as minimal (0-1) challenges vs. multiple (2+) challenges. The outcome was severity of mental distress, measured by the Kessler-6 and categorized into no/mild, moderate, or severe distress based on validated cut-points. Multinomial logistic regression models were used to explore differences between mental distress severity groups.Results36% of the sample reported symptoms of moderate psychological distress and 39% severe distress. Nearly half (43%) reported multiple material need insecurities during COVID. Compared to those who reported minimal material need insecurities, participants with multiple insecurities were 3.25 (95% CI = 1.42-7.45) and 1.96 (95% CI = 0.97-3.95) times more likely to report severe psychological distress compared to no/mild distress or moderate distress, respectively. Unmet mental health needs increased risk of severe distress compared to no/mild 3.44 (95% CI = 1.48-7.97) or moderate 3.62 (95% CI = 1.75-7.49) distress.ConclusionsWWUD experienced a substantial burden of multiple material needs during the pandemic which were associated with elevated levels of mental distress. Results speak to the need to advance mental health equity by addressing access to material needs and mental healthcare for marginalized populations, particularly during health emergencies that threaten already-precarious social safety nets and healthcare infrastructure.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c06d83c5e23eacc29c008d66c0749100",
  "timestamp": "2025-05-15T03:24:54.903227"
}