{
  "id": 8619,
  "title": "Household catastrophic health expenditure and depressive mood among Chinese adults, children, and adolescents: a population-based panel study",
  "abstract": "BackgroundNumerous studies have suggested that catastrophic health expenditure (CHE) is associated with depressive mood. However, most published studies have examined the relationship between CHE and depressive mood only among middle-aged and older people who are already susceptible to depressive mood. The objective of our analysis was to determine the associations between household CHE and depressive mood among adults and children/adolescents.MethodsOur study population consisted of Chinese residents who participated in the 2016 CFPS, 2018 CFPS, and 2020 CFPS. Our analytical sample was restricted to children/adolescents aged 10-17 years and adults aged 18 years and older. We utilized multilevel random effects multivariate logistic regression models to investigate the associations between CHE and depressive mood among both adults and children/adolescents.ResultsOur study revealed that 15% of adults and 12.61% of children/adolescents had experienced CHE and that CHE was positively associated with depressive mood among adults (OR = 1.34, 95% CI: 1.21, 1.50) and among children/adolescents (OR = 1.48, 95% CI: 1.12, 1.96) after adjustment for potential confounding factors. This positive association persisted in different subgroup analyses. In addition, we found that being insured with either urban or rural health insurance was associated with decreased odds of depressive mood.ConclusionOur study indicated that CHE is common in Chinese families and may increase the risk of depressive mood for both adults and children/adolescents. These findings emphasize the need to focus on expanding health insurance coverage, as well as implementing family-based mental health resources and financial literacy programs to reduce the psychological impact of CHE across all age groups.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c082f921f8bdb142f0660c111d9baa2f",
  "timestamp": "2025-05-15T03:20:55.843305"
}