{
  "id": 7689,
  "title": "Cell-free fetal DNA testing in singleton IVF conceptions",
  "abstract": "STUDY QUESTION: Are fetal fraction, test failure rate and positive predictive value (PPV) of cell-free fetal DNA (cffDNA) testing different in singleton IVF conceptions compared to spontaneous conceptions? SUMMARY ANSWER: Fetal fraction is significantly lower; test failure rate is higher and PPV of cffDNA testing is lower in singleton pregnancies conceived by IVF than those conceived spontaneously. WHAT IS ALREADY KNOWN: cffDNA testing, which analyses circulating cffDNA in maternal blood, has very high accuracy for detection of trisomy 21 in the general obstetric population. Focused and conclusive evidence regarding the test characteristics of cffDNA testing in IVF conceived pregnancies is lacking. STUDY DESIGN, SIZE, DURATION: This was a retrospective cohort study including spontaneously and IVF conceived singleton pregnancies collected consecutively between April 2013 and November 2016. A total of 4633 spontaneously conceived and 992 IVF pregnancies were included. PARTICIPANTS/MATERIALS, SETTING, METHODS: The study was performed at an obstetric and gynecological ultrasound clinic in Melbourne, Australia. Participants had screening for trisomies 21, 18 and 13, as well as sex chromosome aneuploidies (SCA) performed with cffDNA testing after 10 weeks' gestation. Multivariate regression analysis was used to determine significant predictors of logarithmically transformed fetal fraction and test failure. Comparison of test characteristics between study groups was performed adopting a significance level of 5%. MAIN RESULTS AND THE ROLE OF CHANCE: Median fetal fraction was lower (10.3% [interquartile range (IQR), 7.7-13.5] versus 11.9% [IQR, 9.1-15.0]; P = 0.005), test failure rate was higher (5.2 versus 2.2%; P < 0.001) and positive predictive value (PPV) for trisomies 18, 13 and SCA was poorer in IVF pregnancies compared to those spontaneously conceived. Multivariate linear regression analysis demonstrated that IVF conception, increased BMI, earlier gestational age and South and East Asian ethnicities were independent predictors of lower fetal fraction. Multiple logistic regression analysis found IVF conception and increased BMI to be independently associated with test failure. PPV was high for trisomy 21 in IVF conception (100.0%), but was lower for other trisomies when compared with the non-IVF population. LIMITATIONS REASONS FOR CAUTION: IVF details were unascertainable for 210 cases, as the information was not available through our data collection points. Inability to karyotype some cases at high-risk for SCA, due to patients' choice, and the occurrence of miscarriages and terminations, resulted in the exclusion of high-risk cases when calculating PPV. Pregnancy outcomes were not available in low-risk pregnancies and negative predictive values could not be calculated. WIDER IMPLICATIONS OF THE FINDINGS: The limitations revealed by this work should be taken into account during pre-test counseling in pregnant women who conceive by IVF. STUDY FUNDING/COMPETING INTEREST(S): No external source of financial support was provided for this research. The authors report no conflicts of interest.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c08528f7f23b8135bd9d2fc1308097f3",
  "timestamp": "2025-05-15T03:11:04.564757"
}