{
  "id": 3280,
  "title": "Clustering based assessment of cost, security and environmental tradeoffs with possible future electricity generation portfolios",
  "abstract": "The electricity sector has a key role to play in the sustainable energy transition. The falling costs of wind and solar PV have added to both the opportunities yet also challenges of balancing sometimes competing industry objectives of costs, security, and environmental impacts. This paper presents novel techniques for assessing possible future industry generation portfolios in three ways: (1) incorporating explicit metrics for energy trilemma objectives into modelling, (2) using the optimization process of evolutionary programming to map the solution space of 'high performing', near least-cosL portfolio solutions, and (3) applying boundary min-max cases and clustering to categorize these varied portfolios to better facilitate planning and policy making. We use an open-source evolutionary programming tool, National Electricity Market Optimiser, to assess possible future generation portfolios for Indonesia's Java-Bali interconnected power system. Our findings highlight the wide range of possible portfolios that might potentially deliver similar total industry costs, and their different security and environmental implications. In particular, additional solar photovoltaic deployment appears a low-risk opportunity to reduce costs and emissions compared to more fossil-fuel oriented mixes. Our novel techniques may be useful for the energy modelling community seeking to better understand and communicate complex, uncertain, and multi-dimensional choices for electricity industry planning.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c0954805a124050b22c559af748b3d96",
  "timestamp": "2025-05-15T01:15:26.174178"
}