{
  "id": 8386,
  "title": "Managing soft tissue sarcomas in a developing country: are prognostic factors similar to those of developed world?",
  "abstract": "Background: Managing soft tissue sarcomas (STS) in a developing country with limited financial resources and a poor health referral system is a challenge. Presenting late, these extremity STS are prone to recurrence despite apparently complete resection. This study aimed to explore and compare the impact of clinico-pathological factors on recurrence and survival in Pakistan with the corresponding figures quoted from the developed world. Methods: An institutional review was performed on all patients with primary STS of the extremities operated on between 1994 and 2008. The prognostic influence of clinical, pathologic, and treatment variables on local recurrence free survival (LRFS), metastasis free survival (MFS) and overall survival (OS) were analyzed by univariate and multivariate Cox regression analysis and Kaplan Meier survival curves. Results: A total of 84 patients with a mean age of 41.8 +/- 21.9 years were included in the study. The local recurrence rate was 14.3% after a median of 6 (mean 7.4) months. Metastases occurred in 7 patients (8.3%) and 65 patients were alive without evidence of disease after a mean follow-up of 52.6 +/- 39.8 months. Tumor size > 5 cm, grade 3 tumors and margin < 10 mm significantly increased local recurrence rates. A margin >= 10 mm and age < 45 years significantly enhanced cumulative survival. Significant multivariate risk factors for metastases were margin < 10 mm and tumor grade G3. Conclusions: Despite a poor health referral system in our country, our results are no different from those reported from the developed world. Surgical margins and tumor grade prognostically influenced LRFS, MFS and OS.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c0984f7a87e2cb1f4aec697a8fc40874",
  "timestamp": "2025-05-15T03:18:19.571687"
}