{
  "id": 1980,
  "title": "Influence of foreign institutional holding on corporate risk-return profile: a panel quantile regression analysis",
  "abstract": "The study investigates the influence of foreign institutional investment on the risk-return profile of firms. Corporate risk is analyzed as business risk and financial risk in this study. The impact of foreign institutional investor's (FII) holding on business and financial risk taking behavior is studied on 174 listed non-financial firms in India using panel quantile regression methodology for a span of 20 years which include the pre and post 2008 financial crisis periods as well. Panel fixed effect model was found to be appropriate in this study The impact of FII holding is also studied through the distribution of the risk through panel quantile regression. The impact of FII holding on risk taking behaviour of the firms is studied primarily across high, average and low proportion of corporate risk. Overall FII holding has an inverse relationship with corporate risk taking behavior of firms. The positive impact of FII holding across all types of firms in terms of the risk-return profile indicates that their presence is long term and reduces risk taking behaviour of the corresponding firm. The implications of this study will be significant in regulating FII inflows and outflows to ensure discipline on the part of firm management in improving its risk-return profile.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c0b83821a1dcb9932cab397e2edf7042",
  "timestamp": "2025-05-15T02:09:48.332565"
}