{
  "id": 5575,
  "title": "The Influence of ESG Performance on Yield Spreads: A Comparative Study of Sukuk and Conventional Bonds in Emerging Dual Financial Systems",
  "abstract": "This study comparatively examines the determinants of yield spreads for Sukuk and conventional bonds, with a particular focus on the role of firms' environmental, social, and governance (ESG) performance. Using a dataset comprising 744 bond-year observations from issuers in countries with prominent dual financial systems-namely, Saudi Arabia, UAE, Turkey, Malaysia, and Indonesia-over the period 2008 to 2022, this analysis identifies distinct mechanisms that influence yield spreads in these asset classes. For robustness, the sample excludes financial institutions to prevent industry-weight distortion and to account for their distinct risk-return profiles, which require differentiated valuation approaches for conventional bonds and Sukuk. Drawing primarily on decoupling, information asymmetry, and legitimacy theories, our empirical results reveal that robust ESG performance is significantly associated with lower yield spreads for both Sukuk and conventional bonds. Moreover, the study explores the moderating effect of investment horizons on the ESG-yield spreads relationship, uncovering evidence of differentiated investor behavior in relation to yield curve positioning. These findings, robust across various regression specifications, underscores the pivotal role of ESG factors as firm-level drivers of financing costs, offering new insights for scholars, policymakers, and practitioners in the sustainable finance domain.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c0d107615c690722390b608d3065a33e",
  "timestamp": "2025-05-15T02:49:21.615157"
}