{
  "id": 8530,
  "title": "An economic analysis of high milk somatic cell counts in dairy cattle in Chiang Mai, Thailand",
  "abstract": "Mastitis in dairy cattle can lead to significant financial losses due to a reduction in milk yield, the withdrawal period after treatment when milk cannot be sold, and an increase in somatic cell count (SCC) which can reduce the milk's per liter commercial value. Dairy cooperatives point at high-SCC problems as an important factor leading to suboptimal levels of milk quantity and quality. This study aims at describing farm characteristics and milking practices associated with high SCC, identifying risk factors, and assessing the economic loss due to high SCC in three dairy cooperatives in Chiang Mai, Thailand. A cross-sectional study was conducted on 208 dairy cattle farms from July to September 2018. Structured interviews were conducted to collect the data. Univariate and multivariate analyses were performed to determine the degree of association between factors and high SCC. A retrospective cost assessment of high SCC was conducted to estimate the losses in affected farms, and two potential coping strategies were assessed: (1) culling and (2) treating the cow. More than 12% of farms had high SCC (SCC > 500,000 cells/ml). Inappropriate vacuum pressure and inappropriate pulsation rate of milking machines were identified as significant risk factors according to the multiple logistic regression (P < 0.01). Both factors can decrease the natural protection of teat tissue, increasing the likelihood of bacterial infection. The average economic loss of high SCC in affected farms was 557 USD for a three-month period. When comparing response strategies (i.e., treatment vs. culling), treating the affected cow was found to be more cost-effective. With a probability of successful treatment of 54%, treating an affected cow leads to 1,158.7 USD in gains over 3 years (vs. doing nothing). The results of this economic analysis can be used to advocate to cooperatives the value of veterinarians and for investigating and treating cases of mastitis.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c0e6e1d31099324bf8348d5c3e6c2c7e",
  "timestamp": "2025-05-15T03:19:52.077148"
}