{
  "id": 6698,
  "title": "The role of the Lendtech sector in the consumer credit market in the context of household financial exclusion",
  "abstract": "Research background: According to the World Bank (2020), about 60% of adults in develop-ing countries do not use formal financial services. Furthermore, according to the Polish Asso-ciation of Loan Institutions (2022), about 3 million Poles use loans, most of them obtained online. Among the reasons for more than a decade of growth of interest in the non-bank con-sumer lending market there are the development of modern technology applications in fi-nance and the establishment of the Lendtech sector.Purpose of the article: The main goal of the paper is to verify the role played by the Lendtech (LT) sector in the consumer credit market in the context of household financial exclusion. The following research questions were asked: Do credit-excluded households take advantage of LT services and, if so, to what extent? What are the behaviours and preferences of those who use consumer credit offered by LT? Do socio-demographic characteristics determine consumer use of loans offered by LT and, if so, what are they? Is the use of loans offered by LT due to credit exclusion or other factors? What action should be taken by participants in the digital consumer loan market interested in its inclusive direction?Methods: The paper uses the following methods: critical analysis of the literature, Kruskal-Wallis test, Mann-Whitney test, and nonparametric regression algorithm: k-nearest neighbors, as well as inductive inference methods. The data used is primary in nature and comes from a nationwide survey, September 2022 (CAWI method) of 1,200 Poles, of whom 200 respond-ents are Lendtech customers. The quota selection applied made it possible to reflect character-istics corresponding to the population of customers of lending institutions registered in BIK databases.Findings & value added: The article is a pioneering study based on an independent scientific survey, devoted to the Polish LT services market considered in terms of its relationship with one of the types of financial exclusion: credit exclusion. The most important conclusion is that people at risk of credit exclusion find a financing substitute in the LT sector, and thus it plays an important role in reducing financial exclusion, while maintaining the principle of credit-worthiness verification.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c0e6a65d1c2e9383e335e08a4c411e75",
  "timestamp": "2025-05-15T03:00:35.494853"
}