{
  "id": 6644,
  "title": "STUDENT'S ENTREPRENEURIAL INTENTIONS: ROLE OF ENTREPRENEURIAL EDUCATION AND RISK TAKEN ABILITY",
  "abstract": "After the recent global financial and economic crises, unemployment, especially among young people have become a particularly serious problem. Fostering young entrepreneurship represent not only a tool to combat young unemployment and social exclusion but also a way to encourage innovation and a country's economic growth. Education and training can contribute in building an entrepreneurial society and may shape individuals attitudes versus risk-taking. Risk taken ability is an important personality factor who have an influence in process decision making or in entrepreneurial intention. Our main objectives are directed towards identifying whether there is a significant relationship between willingness to take risks, entrepreneurship education and students intention towards entrepreneurship. The present study tested two hypotheses on a sample of 115 university students using a questionnaire-based survey. The response scales use anchors such as 5-point Likert scale (1, strongly disagree to 5, strongly agree) and semantic differentials metrics. Tests and modelling were performed using Statistical Package for Social Science (SPSS) software, SPSS 21.0. According to our research objective and developed hypotheses, several data analysis have been used: Principal Component Analysis (PCA) and OLS regression models. Our findings reveal that both Risks taken Ability and Entrepreneurial Education significantly influence the entrepreneurial intentions of Technical University students.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c0ea5e16ee258547f16938761f9128a7",
  "timestamp": "2025-05-15T03:00:05.033144"
}