{
  "id": 7338,
  "title": "Socio-demographic and mental health correlates of internet addiction amongst Hong Kong university students under COVID-19",
  "abstract": "IntroductionRegarding the problem of Internet addiction (IA) amongst university students under the pandemic, there are several research gaps. Firstly, few studies have examined IA of university students in Hong Kong, which is a Chinese society heavily influenced by Western values. In addition, findings on the socio-demographic correlates and psychological well-being predictors of IA in university students are unclear. Finally, researchers have not systematically examined the interaction effects of socio-demographic factors (particularly gender and personal infection of COVID-19) and psychological morbidity on IA. This pioneer study aimed to investigate the predictive role of socio-demographic factors and psychological morbidity in IA, and the moderating effects of gender and personal infection of COVID-19 on the relationship between psychological morbidity and IA.MethodsWe conducted an online survey (N = 1,020 university students) during the ending phase of Wave 5 of the pandemic in Hong Kong (late 2022 to early 2023). Socio-demographic correlates included age, gender, living status, personal and family financial situation, student status, personal and family infection of COVID-19. Participants responded to validated measures of psychological morbidity, including depression, suicidal behavior, and hopelessness. Hierarchical regression and simple slope analyses were used to examine the predictive role of socio-demographic variables and psychological morbidity in IA and the interactive effect of gender and personal infection of COVID-19 with psychological morbidity on IA.ResultsPersonal financial difficulty was a significant socio-demographic predictor of IA. Depression, suicidal behavior, and hopelessness positively predicted IA. We also found a significant interaction effect of gender and psychological morbidity on IA. While the predictive relationship between depression and IA was stronger in males than in females, hopelessness was more strongly related to IA in females than in males. Finally, there was a significant interaction effect of personal infection of COVID-19 and suicidal behavior on IA.ConclusionPersonal financial difficulty was a socio-economic correlate of IA. Psychological morbidity also predicted IA. Gender and personal infection of COVID-19 moderated the linkage between psychological morbidity and IA. The findings of the study enhance our understanding of individual differences in IA in university students during the pandemic, particularly concerning different ecological risk factors.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c0f46df987e0b5249d5e89302ad5ed65",
  "timestamp": "2025-05-15T03:07:31.892253"
}