{
  "id": 454,
  "title": "RETRACTED: Evaluating and forecasting the risks of small to medium-sized enterprises in the supply chain finance market using blockchain technology and deep learning model",
  "abstract": "The present work applies deep learning and blockchain technology to evaluate and control the risk of the supply chain finance market, to cope with the diversifications of the financial market development mode. Firstly, based on the relevant monetary inward theory, the potential risks are analyzed in the supply chain finance market. Besides, under the background of financial technology, the risk of the supply chain finance market is predicted and managed by intelligent technology. Secondly, the financing model of supply chain finance is analyzed to discuss the possible credit risk of supply chain finance. Meanwhile, the credit evaluation model of supply chain finance based on deep learning technology is constructed to predict the potential credit risk. Thirdly, blockchain technology is adopted to control and optimize the credit evaluation model to establish a credit system for supply chain enterprises with high credit and reliability and reduce potential supply chain financial risks. Finally, the designed model is simulated and tested. The experimental results show that the credit evaluation model of supply chain finance has a fitting effect of 0.989 on the sample data, indicating that it can effectively analyze the data. Result analysis shows that the designed model can effectively predict the potential credit risk of the enterprise. Moreover, a stable and reliable credit relationship network is established for supply chain finance by blockchain technology, which enhances the reliability of logistics transactions, and reduces potential risks faced by supply chain finance. The model provides effective technical means for studying the credit risk of supply chain finance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1013838e6599883cc2e56bd899ed0c6",
  "timestamp": "2025-05-15T01:38:17.430311"
}