{
  "id": 9315,
  "title": "A study on the co-movement and influencing factors of stock markets between India and the other Asia-Pacific countries",
  "abstract": "PurposeThe aim of this study is to examine the nature and determinants of stock market integration between India and other Asia-Pacific countries (Malaysia, Hong Kong, Singapore, South Korea, Japan, China, Indonesia, the Philippines, Thailand and Taiwan) over the period 1991-2021.Design/methodology/approachUnit root tests, the dynamic conditional correlation-Glosten Jagannathan and Runkle-generalized autoregressive conditional heteroscedasticity (DCC-GJR-GARCH), pooled ordinary least squares (OLS) regression and random effects models are employed for the analysis.FindingsThe empirical results show that the DCC between each pair of sample countries is less than 0.5, indicating weak ties between the pairs of sample countries. Also, the DCC between India and other Asia-Pacific stock markets is positive and low, implying low level of integration. The correlation between India and China stock markets is found to be the highest, implying significant level of integration. The main reason for it would be strong economic linkages and bilateral trade relationship between India and China. Moreover, gross domestic product (GDP), interest rate (IR), consumer price index (CPI)-inflation and money supply (MS) differentials are the major driver of stock market integration between India and other Asia-Pacific countries.Practical implicationsThe findings of the study have important implications for investors, portfolio managers and policymakers. It is found that the DCC between India and other Asia-Pacific countries (considered in the study) except China is low, which indicates weak ties between the pairs of sample countries. This implies that the Indian stock market provides good investment opportunities for foreign investors. Also, investors and portfolio managers can attain more diversified benefits and can minimize country risk by investing across Asia-Pacific countries. Further, knowledge about the factors that integrate the Indian stock market with the other Asia-Pacific stock markets will help policymakers frame suitable economic and financial stabilization policies.Originality/valueThis study contributes to the extant literature: first, by examining the linkages of Indian stock market with other Asia-Pacific countries; second, although previous studies confirmed the existence of linkages among the various stock markets, few researchers pay attention to the factors driving the process of stock market integration. This study provides additional evidence by examining the significant macroeconomic factors driving the process of such integration in the Asia-Pacific region considered under the study.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c116a3c0fa43025ce7d614e35867e647",
  "timestamp": "2025-05-15T03:27:53.292596"
}