{
  "id": 3154,
  "title": "Transparent Machine Learning Model to Understand Drug Permeability through the Blood-Brain Barrier",
  "abstract": "The blood-brain barrier (BBB) selectively regulates the passage of chemical compounds into and out of the central nervous system (CNS). As such, understanding the permeability of drug molecules through the BBB is key to treating neurological diseases and evaluating the response of the CNS to medical treatments. Within the last two decades, a diverse portfolio of machine learning (ML) models have been regularly utilized as a tool to predict, and, to a much lesser extent, understand, several functional properties of medicinal drugs, including their propensity to pass through the BBB. However, the most numerically accurate models to date lack in transparency, as they typically rely on complex blends of different descriptors (or features or fingerprints), many of which are not necessarily interpretable in a straightforward fashion. In fact, the black-box nature of these models has prevented us from pinpointing any specific design rule to craft the next generation of pharmaceuticals that need to pass (or not) through the BBB. In this work, we have developed a ML model that leverages an uncomplicated, transparent set of descriptors to predict the permeability of drug molecules through the BBB. In addition to its simplicity, our model achieves comparable results in terms of accuracy compared to state-of-the-art models. Moreover, we use a naive Bayes model as an analytical tool to provide further insights into the structure-function relation that underpins the capacity of a given drug molecule to pass through the BBB. Although our results are computational rather than experimental, we have identified several molecular fragments and functional groups that may significantly impact a drug's likelihood of permeating the BBB. This work provides a unique angle to the BBB problem and lays the foundations for future work aimed at leveraging additional transparent descriptors, potentially obtained via bespoke molecular dynamics simulations.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c122aea654b5ca83e2a7a85f9866e840",
  "timestamp": "2025-05-15T01:14:16.173312"
}