{
  "id": 6287,
  "title": "Prevalence of elder abuse and victim-related risk factors during the COVID-19 pandemic in China",
  "abstract": "Background With the accelerated aging of the Chinese population, elder abuse has become a serious social problem. As COVID-19 has had a very large impact on economic development and lifestyle in China, it has also affected elder abuse. The purpose of this study is to estimate the prevalence of elder abuse in China during the COVID-19 pandemic, and to identify changes in risk factors for elder abuse in the context of COVID-19. Methods We designed a cross-sectional study. In Hunan Province, a face-to-face questionnaire survey was conducted among elderly people over 65 years of age. To ensure the consistency of the measurement standards, we used the elder abuse questionnaire from the Third Survey on Chinese Women's Social Status. According to related research, we selected 10 victim-related risk factors as independent variables. A logistic regression model was established to analyze the relationship between the independent variables and the four kinds of abuse. Results We collected 10,362 samples from Hunan Province. During the COVID-19 pandemic, the prevalence of financial abuse and neglect was significantly higher than that in 2010. Income had a significant impact on the four types of abuse. The lower the income was, the greater the risk of abuse. Moreover, factors such as an older age, being a woman, a lower cognitive ability, and not having a cohabiting spouse increased the possibility of abuse. The greater the number of children was, the greater the risks of physical abuse, financial abuse, and elder neglect. Seniors with higher education levels, those who frequently participated in social activities, and those with religious beliefs were less likely to suffer abuse. Conclusions During the COVID-19 epidemic, the prevalence of elder abuse in China has increased, which may be related to economic instability and social distancing measures. Increasing the income of the elderly and giving them more social support are important measures to reduce the prevalence of elder abuse.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c12c24be0f6aea2e5310b2222c930c21",
  "timestamp": "2025-05-15T02:56:37.481867"
}