{
  "id": 4120,
  "title": "The role of signals in new venture financing in the context of an emerging market: a configurational approach",
  "abstract": "PurposeThis study proposes a portfolio of new venture signals that are likely to attract investors' attention in the context of an emerging market and examines how they work in combination to affect the likelihood of obtaining funding.Design/methodology/approachThe authors use data on early-stage venture capital investments for high-tech start-ups in Turkey. The authors adopt a configurational approach and use fuzzy QCA and regression analysis.FindingsThe findings suggest that financing of new ventures in an emerging economy is shaped by signals of context-specific capabilities that are required to survive and thrive in this market environment alongside and in interaction with signals of general capabilities required for business success. Different combinations of these signals provide equifinal pathways to obtain funding. Furthermore, signals that differ in type and content interact in complex ways to affect investors' decisions.Practical implicationsThe findings suggest that entrepreneurs with no prior experience in the emerging market context can increase their chances of obtaining funding by affiliating with a venture development organization. Another promising strategy is to form a founding team that includes members affiliated with a developed country together with members who have emerging market experience. Finally, entrepreneurs may consider combining signals of context-specific capabilities with signals of general capabilities as they work in a complementary way to attract funding.Originality/valueThis study addresses two major shortcomings of the literature on new venture signaling, first, by positing the emerging market context as a unique signaling environment and, second, by demonstrating the value of considering signals as portfolios with potential interdependencies.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c15f50be795ec577e86a9b2f95d5a944",
  "timestamp": "2025-05-15T01:23:58.094349"
}