{
  "id": 9088,
  "title": "Socioeconomic and Sociodemographic Factors Associated with Asthma Related Outcomes in Early Childhood: The Generation R Study",
  "abstract": "Rationale: Few studies have analyzed the association of socioeconomic and sociodemographic factors with asthma related outcomes in early childhood, including Fraction of exhaled Nitric Oxide (FeNO) and airway resistance (Rint). We examined the association of socioeconomic and sociodemographic factors with wheezing, asthma, FeNO and Rint at age 6 years. Additionally, the role of potential mediating factors was studied. Methods: The study included 6717 children participating in The Generation R Study, a prospective population-based cohort study. Data on socioeconomic and sociodemographic factors, wheezing and asthma were obtained by questionnaires. FeNO and Rint were measured at the research center. Statistical analyses were performed using logistic and linear regression models. Results: At age 6 years, 9% (456/5084) of the children had wheezing symptoms and 7% (328/4953) had asthma. Children from parents with financial difficulties had an increased risk of wheezing (adjusted Odds Ratio (aOR) = 1.63, 95% Confidence Interval (CI):1.18-2.24). Parental low education, paternal unemployment and child's male sex were associated with asthma, independent of other socioeconomic or sociodemographic factors (aOR = 1.63, 95% CI:1.24-2.15, aOR = 1.85, 95% CI:1.11-3.09, aOR = 1.58, 95% CI:1.24-2.01, respectively). No socioeconomic or gender differences in FeNO were found. The risks of wheezing, asthma, FeNO and Rint measurements differed between ethnic groups (p<0.05). Associations between paternal unemployment, child's sex, ethnicity and asthma related outcomes remained largely unexplained. Conclusions: This study showed differences between the socioeconomic and sociodemographic correlates of wheezing and asthma compared to the correlates of FeNO and Rint at age 6 years. Several socioeconomic and sociodemographic factors were independently associated with wheezing and asthma. Child's ethnicity was the only factor independently associated with FeNO. We encourage further studies on underlying pathways and public health intervention programs, focusing on reducing socioeconomic or sociodemographic inequalities in asthma.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c17bbee7828a9b30c78a9e6b5f21e5b1",
  "timestamp": "2025-05-15T03:25:27.738129"
}