{
  "id": 350,
  "title": "Enhancing Financial Risk Prediction for Listed Companies: A Catboost-Based Ensemble Learning Approach",
  "abstract": "The New Third Board (NTB) market is a non-publicly traded stock exchange in the Chinese securities market and is an essential component of the Chinese capital market. The distinctive features of the NTB market are its low entry barriers, high flexibility, and relatively minimal information disclosure requirements, which, in turn, introduce higher levels of risk. In order to effectively predict the financial risks of NTB-listed companies, a predictive model based on data mining and machine learning technologies needs to be developed. The purpose of this research is to construct a financial risk prediction model for NTB-listed companies, based on integrated feature engineering and learning models, to enhance risk warning capabilities and accuracy. In this study, 15 predictive indicators were formed based on collected financial data of listed companies, and the F-score was used to calculate risk prediction ground truth. Subsequently, through supervised learning, an ensemble learning model, Catboost, was trained for risk assessment and prediction in different time periods. The results of the study indicate that this framework aligns with professional scoring trends, and the mean squared error (MSE) and mean absolute error (MAE) metrics outperform traditional machine learning methods significantly. Notably, the MAE metric is as low as 0.124, suggesting a high level of precision in intelligent risk prediction, offering new perspectives for financial risk assessment of NTB-listed companies in the future.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1801c0c471f44c88c8adb18db65c336",
  "timestamp": "2025-05-15T01:49:41.090302"
}