{
  "id": 2819,
  "title": "Can monetary policy affect renewable energy enterprises investment efficiency? A case study of 92 listed enterprises in China",
  "abstract": "This paper aims to objectively identify the impact of monetary policy on renewable energy enterprises' investment efficiency, further analyze the effectiveness of the Renewable Portfolio Standard, and then put forward some suggestions that are good for the government to implement the monetary policy rationally, guide the direction of renewable energy investment, improve the investment efficiency, and promote the development of the renewable energy industry. We use data on 92 renewable energy listed enterprises in China from the first quarter of 2007 to the third quarter of 2017 as a sample, the Richardson Model to calculate the investment efficiency of related enterprises, and the Regression Discontinuity Model to measure the effectiveness of the Renewable Portfolio Standard. We find that, first, underinvestment is common among China's renewable energy enterprises during the sample period; second, the influence of monetary policy on investment efficiency varies from different transmission channels, and the effect of the credit channel is more significant. The monetary policy status is measured by the growth rate of M-2, and the Monetary Policy Perception Index promotes renewable energy enterprises' investment efficiency by 0.3635% and 0.0344%, respectively; they are promoted by 0.8389% and 0.0940%, respectively, through the credit channel; third, easy monetary policy can increase the investment opportunities of renewable energy enterprises in general and then ease their external financing constraints; fourth, the Renewable Portfolio Standard of China promotes the overall renewable energy investment efficiency by 0.2573% and strengthens the promoting effect of monetary policy on renewable energy enterprises' investment efficiency. To some extent, this proves the effectiveness of the policy. Published under license by AIP Publishing.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c18f1ca0c3a47e59183f9a3e4c4b1fa3",
  "timestamp": "2025-05-15T01:10:49.523165"
}