{
  "id": 1746,
  "title": "Theory and application of artificial intelligence in financial industry",
  "abstract": "Artificial Intelligence (AI) is deemed to be the commanding point of science and technology in the next era. In recent years, with the enhancement of computer computing power, the improvement of the quantity and quality of big data, and the important breakthroughs in many research fields such as machine learning and speech recognition, AI technology has developed rapidly and has been widely used in all walks of life. In the financial industry, the application of AI technology in risk control, marketing, customer service, transaction, operation, and product optimization of financial institutions is becoming increasingly mature, and some new business models have been created. Starting from the application status and significance of AI in the international financial field, this paper expounds on the application, status quo, and development trend of AI in the financial industry. Then, in view of the risks and practical challenges existing in the development process of AI, based on the reality of international financial development, this paper summarizes the measures to promote the in-depth, healthy, and sustainable development of AI in the financial market. This paper aims to let readers understand the development status of AI in the financial field, and also provide theoretical reference for scholars in this field.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c19d484189770bdc0f3b8663a34a8d91",
  "timestamp": "2025-05-15T02:06:52.718094"
}