{
  "id": 2787,
  "title": "Relationship between Internationalization and Financial Performance: Evidence from ENR-Listed Chinese Firms",
  "abstract": "Since the financial crisis in 2008, the international construction market has shown a relatively weak state of development. Along with China's Belt and Road Initiative, an increasing number of Chinese construction firms have swarmed to explore the global market and expect to improve their financial performance via internationalization. However, few studies have addressed how and to what extent the internationalization strategy contributes to financial performance. This paper therefore proposes three sets of assumptions on this issue and establishes four regression models. Through multiple regression analysis of 32 Chinese construction firms listed in the Engineering News-Record (ENR) during the 2010-2017 period, the study described here explored the relationship between a construction firm's degree of internationalization and its financial performance as well as the moderating effect of business diversification and three types of macroenvironmental risk. The results reveal that (1) there is a U-shaped relationship between degree of internationalization of construction firms and their financial performance-when the degree of internationalization is less than 52%, the relationship is negative and when it is greater than 52%, the relationship is positive; (2) business diversification acts as a positive moderator in the relationship between internationalization and financial performance; and (3) both economic risks and social risks play a positive moderating role in the relationship between internationalization and financial performance, whereas financial risks play a negative moderating role. This study contributes to the engineering management literature not only by broadening understanding of how internationalization strategy influences financial performance but also by guiding business layout and risk management during the internationalization process. The findings of this study are limited to the sample data from a single country (i.e., China). Similar research might be conducted in the future using sample data from different countries for comparative analysis to draw more generalizable and meaningful conclusions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1a4669b2cc50fef262b694802cf4ddb",
  "timestamp": "2025-05-15T02:19:08.459721"
}