{
  "id": 7388,
  "title": "Unmet Healthcare Needs Among Elderly Malaysians",
  "abstract": "Purpose: Older people often have chronic diseases which require a continuity of care over the long term. Countries undergoing population aging need to ensure that older people are receiving the care they need. This study assesses the prevalence of, reasons for, and factors associated with unmet healthcare needs among older people individuals in Malaysia. Patients and Methods: This cross-sectional study used data collected during 2018-2020 from 1204 older adults aged 60 and older selected from Selangor state, Malaysia. A comprehensive face-to-face interview based on the Bahasa Malaysia version of the Japan Gerontological Evaluation Study (JAGES-BM) questionnaire was administered to gain information on unmet healthcare needs, socioeconomic factors, health-related factors, and measures of function (activities of daily living, depression, visual impairment, hearing impairment, memory impairment, and walking impairment). Multivariate logistic regression was used to analyze factors associated with their unmet healthcare needs. Results: Overall, the percentage of older people respondents with unmet healthcare needs is 6.6%. The most reported reasons for forgoing or delaying healthcare were lack of knowledge about healthcare and financial barriers to care. The inability to travel alone (adjusted odds ratio [aOR] 2.51), being overweight (aOR 1.88), and having self-reported depression (aOR 2.23) were each associated with a higher likelihood of having unmet healthcare needs in their daily life. Conclusion: The prevalence of unmet healthcare needs among older people in this part of Malaysia is lower than that reported in some other countries. However, it is possible to further reduce unmet healthcare needs by improving people's knowledge and attitudes about appropriate healthcare utilization, strengthening financial protection measures and providing support to people at high risk of having unmet healthcare needs.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1a76cc6c5fe597ad9787f6dd31b8ea7",
  "timestamp": "2025-05-15T03:08:00.805844"
}