{
  "id": 4446,
  "title": "Psychiatric diagnoses are common after liver transplantation and are associated with increased health care utilization and patient financial burden",
  "abstract": "Psychiatric disorders after liver transplantation (LT) are associated with worse patient and graft outcomes, which may be amplified by inadequate treatment. We aimed to characterize the burden of psychiatric disorders, treatment patterns, and associated financial burden among liver transplantation recipients (LTRs). IQVIA PharMetrics (R) Plus for Academics-a large health plan claims database representative of the commercially insured US population-was used to identify psychiatric diagnoses among adult LTRs and assess treatment. Multivariable logistic regression analysis identified factors associated with post-LT psychiatric diagnoses and receipt of pharmacotherapy. Patient financial liability was estimated using adjudicated medical/pharmacy claims for LTRs with and without psychiatric diagnoses. Post-LT psychiatric diagnoses were identified in 395 (29.5%) of 1338 LTRs, of which 106 (26.8%) were incident cases. Treatment varied, with 67.3% receiving pharmacotherapy, 32.1% psychotherapy, 21.0% combination therapy, and 21.5% no treatment. Among 340 LTRs on psychotropic medications before transplant, 24% did not continue them post-LT. Post-LT psychiatric diagnoses were independently associated with female sex, alcohol-associated liver disease (ALD), prolonged LT hospitalization (>2 wk), and pre-LT psychiatric diagnosis. Incident psychiatric diagnoses were associated with female sex, ALD, and prolonged LT hospitalization. Patients with a post-LT psychiatric diagnosis had higher rates of hospitalization (89.6% vs. 81.5%, p<0.001) and financial liability (median $5.5K vs. $4.6K USD, p=0.006). Having a psychiatric diagnosis post-LT was independently associated with experiencing high financial liability >$5K. Over 1 in 4 LTRs had a psychiatric diagnosis in a large national cohort, yet nearly a quarter received no treatment. LTRs with psychiatric diagnoses experienced increased health care utilization and higher financial liability. Sociodemographic and clinical risk factors could inform high-risk subgroups who may benefit from screening and mitigation strategies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1bd22f78e73e508d587d32c6730407a",
  "timestamp": "2025-05-15T02:37:16.916544"
}