{
  "id": 6745,
  "title": "The beta anomaly in the Australian stock market and the lottery demand",
  "abstract": "Frazzini and Pedersen (2014) [Betting against beta. Journal of Financial Economics, 111(1), 1-25] report an insignificant performance for the betting against beta (BAB) strategy in the Australian equity market, suggesting that the beta anomaly does not exist in this market. We extend their sample period and find strong evidence for a low-beta effect. The arbitrage portfolio that takes long positions in low-beta stocks and short positions in high-beta stocks generates a significant abnormal return of 5.9% per year. The beta anomaly over 1995-2019 is strong and robust after controlling for risk factors and stock characteristics. Decomposition of the beta anomaly into stock and industry level components shows that the low-beta effect is driven by the firm, and not the industry level beta. We further find that lottery demand explains the low-beta effect. In a series of portfolio and cross-sectional analyses, we show that the abnormal returns related to the beta anomaly become insignificant after controlling for lottery demand. The findings are robust to different proxies for lottery demand, alternative beta estimation and regression analyses. There is no evidence that the beta anomaly can be explained by leverage constraints, coskewness risk or investment and profitability risk factors. We further show that beta anomaly is more pronounced during the upmarket than the downmarket periods and that lottery demand plays a role in its time-variation. The findings have important implications for retail and institutional investors who trade on beta.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1c2e3df20882b710c5bee338a04d477",
  "timestamp": "2025-05-15T03:01:03.627695"
}