{
  "id": 91,
  "title": "Classifying credit card accounts for business intelligence and decision making: A multiple-criteria quadratic programming approach",
  "abstract": "A major challenge in credit card portfolio management is to classify and predict credit cardholders' behaviors in a reliable precision because cardholders' behaviors are rather dynamic in nature. This is crucial for creditors because it allows them to take proactive actions and minimize charge-off and bankruptcy losses. Although the methods used in the area of credit portfolio management have improved significantly, the demand for alternative and sophisticated analytical tools is still strong. The objective of this paper is to propose a multiple criteria quadratic programming (MCQP) to classify credit card accounts for business intelligence and decision making. MCQP is intended to predict credit cardholders' behaviors from a nonlinear perspective that is justifiable because both the objective functions and constraints in credit card accounts classification may be nonlinear. Using a real-life credit card dataset from a major US bank, the MCQP method is compared with popular and similar classification methods: linear discriminant analysis, decision tree, multiple criteria linear programming, support vector machine, and neural network. The results indicate that MCQP is a promising business intelligence method in credit card portfolio management.",
  "year": 2005,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1c40a4e53841eec8eded8dbd0bba7ac",
  "timestamp": "2025-05-15T00:39:32.446743"
}