{
  "id": 9151,
  "title": "Has the COVID-19 Pandemic Traumatized Us Collectively? The Impact of the COVID-19 Pandemic on Mental Health and Sleep Factors via Traumatization: A Multinational Survey",
  "abstract": "Purpose: The COVID-19 pandemic affects mental health and sleep, resulting in frequent nightmares. Therefore, identifying factors associated with nightmare frequency is important, as it can indicate mental health issues. The study aimed to investigate increases in nightmare frequency comparing the pre-pandemic and pandemic period, and identify its risk factors. Further, the mediating role of post-traumatic stress disorder symptoms between the pandemic and nightmares is explored. Patients and Methods: For this cross-sectional survey data were obtained via self-rating online survey (ICOSS: details in Partinen et al, 2021), which was open to anyone older than 18 years. The final volunteer sample consisted of 15,292 participants, divided according to their nightmare frequency (high: >= 1-2 nights/week; low: <1-2 nights/week). A total of 9100 participants were excluded if answers on variables of interest were missing or receiving rewards for participation. Chi-square tests identified changes of nightmare frequency. Predictors of high nightmare frequency were assessed using logistic regression and presented as Odds Ratios. Post-hoc mediation models were used to investigate the role of post-traumatic stress symptoms (PTSS). Results: The mean age was 41.63 (SD=16.55) with 64.05% females. High nightmare frequency increased significantly from 13.24% to 22.35% during the pandemic. Factors associated with it included self-reported PTSS (OR=2.11), other mental disorders and various sleep disorders or problems. Financial burden due to the pandemic, confinement, having had COVID-19, and work situation during the pandemic were associated with nightmare frequency, those relations were partly mediated through PTSS.Conclusion: Our results display the pandemic influence on nightmare frequency, which in turn connects to multiple mental health and sleep factors. These relations were partly mediated through PTSS. The COVID-19 pandemic appears to have caused traumatization of a substantial proportion of society. Health care workers should consider nightmares in their screening routines, as it might indicate PTSS and/or other mental and sleep disorders.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1d5a56a9ebc6a9e5a9ea4de27ef6a0c",
  "timestamp": "2025-05-15T03:25:54.668946"
}