{
  "id": 7515,
  "title": "Elder abuse in the oldest old: prevalence, risk factors and consequences",
  "abstract": "Background Experiences of abuse in relationships with an expectation of trust are a common phenomenon among older people and is called elder abuse (EA). This can take various forms, such as physical, verbal, emotional, psychological, financial, sexual abuse or neglect. Due to their high vulnerability and difficulties in receiving support, people aged over 80 years old have been pointed out as a group that needs special focus in research. Objective Prevalence, risk factors and consequences of EA for different aspects of quality of life are explored among the oldest old. Material and methods Computer-assisted personal interviews were conducted in a representative sample of the oldest old in North Rhine-Westphalia (Germany). 988 self-report interviews without third persons present of the NRW80+ study are used to assess EA with the help of the elder abuse and emotional consequences scale (EACS). The EACS describes EA in six dimensions that give a broad understanding of EA. Results Prevalence of experiences of EA within the last 12 months was 54.1%. In logistic regression, multimorbidity, lower functioning, age below 90 years, smaller social network size, and aggressive behaviorwere significant risk factors for EA. People experiencing EA showed less life satisfaction and autonomy and increased loneliness and depressive symptoms. Conclusion EA is prevalent among the oldest old. Serious consequences of EA on life results can be shown with a broad operationalization of EA. Future research should focus on a deeper understanding of reasons for EA and reflect on the relationship between and the perspectives of perpetrators and victims.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1d79cb481b31a24d92bf4b196af1ad5",
  "timestamp": "2025-05-15T03:09:36.814824"
}