{
  "id": 2311,
  "title": "Project options valuation with net present value and decision tree analysis",
  "abstract": "Real options analysis (ROA) has been developed to correctly value projects with inherent flexibility, including the possibility to abandon, defer, expand, contract or switch to a different project. ROA allows computing the correct discount rate using the replicating portfolio technique or risk-neutral probability method. We propose an alternative approach for valuing Real Options based on the certainty-equivalent version of the net present value formula, which eliminates the need to identify market-priced twin securities. In addition, our approach can be extended to the case of multinomial trees, a useful tool for modeling uncertainty in projects. We introduce within decision tree analysis (DTA) a method to derive the different discount rates that prevail at different chance nodes. We illustrate the valuation method with an application presented in A Scenario Approach to Capacity Planning [Eppen, G.D., Martin, R.K., Schrage, L.E., 1989. A scenario approach to capacity planning. Operations Research, 37 (4)], in which the authors state that for the capacity configuration investment decision studied at General Motors, . . . there is no scientific way to determine the appropriate discount rate based on estimated demand. Our method allows deriving the scientifically correct discount rates. A major result of the analysis is that the discount rates are endogenously derived from the project structure and its behavior in light of prevailing market conditions, instead of being exogenously imposed. (C) 2006 Elsevier B.V. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1dd55a97fb04abcd82f82ac33833eb3",
  "timestamp": "2025-05-15T01:05:39.625462"
}