{
  "id": 4139,
  "title": "HOW DO FINANCIAL INCENTIVES AFFECT PHYSICIANS CLINICAL DECISIONS AND THE FINANCIAL PERFORMANCE OF HEALTH MAINTENANCE ORGANIZATIONS",
  "abstract": "It has been suggested that the use of financial incentives by health maintenance organizations (HMOs) may change physicians'' behavior toward individual patients. To test this hypothesis, we used a regression analysis of data from a survey of HMOs to examine the relation between the presence of financial incentives and two measures of the use of resources (the rate of hospitalization and the rate of visits for outpatient services) and one measure of the HMOs'' financial viability (the achievement of break-even status). When we controlled for the effect of market-area variables, we found that some forms of compensation were significantly associated with these indicators of decision making by physicians. Among methods of paying physicians, the use of capitation or salaries was associated with a lower rate of hospitalization than the use of fee-for-service payment; physicians in for-profit HMOs and group-model HMOs also used the hospital less often. Placing physicians at financial risk as individuals and imposing penalties for deficits in the HMO''s hospital fund beyond the loss of withheld funds were associated with fewer outpatient visits per enrollee, but a higher percentage of HMO patients in a physician''s caseload was associated with more frequent visits. HMOs were more likely to break even if they were larger, older, had physicians who treated more HMO patients, and placed physicians at personal financial risk for the cost of outpatient tests; break-even status was also related to the type of HMO. We conclude that the use of some, but not all, financial incentives, as well as the type of HMO, does influence the behavior of physicians toward patients. It remains to be determined how these factors affect the quality of care.",
  "year": 1989,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1ea56ef9976218adc91336528c37413",
  "timestamp": "2025-05-15T02:33:42.054295"
}