{
  "id": 8596,
  "title": "Posterior lumbar fusions at physician-owned hospitals - is it time to reconsider the restrictions of the Affordable Care Act?",
  "abstract": "BACKGROUND CONTEXT: Caused by perceptions regarding unnecessary healthcare resource utilization, high costs of care, and financial incentives towards cherry-picking cases in physician owned hospitals, the Affordable Care Act (ACA) of 2010 imposed restrictions on existing physician-owned hospitals from expanding. Despite an increasing number of individuals requiring access to spine surgical care, no study has evaluated the surgical safety and costs of elective posterior lumbar fusions (PLFs) being performed in physician-owned vs. non-physician-owned hospitals. PURPOSE: We assessed differences in 90-day costs and outcomes between patients undergoing elective 1- to 3-level PLFs at physician-owned hospitals vs. nonphysician-owned hospitals. STUDY DESIGN: Retrospective cohort study of 2007 to 2014 100% Medicare claims database. PATIENT SAMPLE: The 2007 to 2014 Medicare 100% Standard Analytical Files (SAF100) was queried using International Classification of Diseases 9th Edition (ICD-9) procedure code for patients undergoing elective 1- to 3-level PLFs (81.07, 81.08, and 81.62). The Medicare Hospital Compare database was used to identify provider codes for physician-owned hospitals. These provider codes were cross-referenced to identify records of patients receiving elective PLFs at these hospitals from the SAF100 database. OUTCOME MEASURES: Ninety day complications, readmissions, emergency department (ED) visits, charges, and costs. METHODS: Multivariate logistic and linear regression analyses were used to assess significant differences in 90-day complications, readmissions, charges and costs between the two groups. RESULTS: A total of 6,679 (2.9%) patients received an elective PLF at a physician-owned hospital (N=39; 2.2%) whereas 225,090 (97.1%) received surgery at nonphysician-owned hospital (N=1,774; 97.8%). After controlling for age, gender, region, hospital factors (socio-economic status area, urban vs. rural location and volume) and Elixhauser co-morbidity index, undergoing surgery at physician-owned hospital was associated with lower odds of thromboembolic complications (OR 0.66 [95% CI 0.53-0.82]; p<.001), urinary tract infections (OR 0.87 [95% CI 0.79 -0.95]; p=.002) and renal complications (OR 0.52 [95% CI 0.43-0.63]; p<.001) within 90-days following the surgery. Patients undergoing PLFs at physician-owned hospitals vs. nonphysician-owned hospitals also had lower risk-adjusted inpatient charges (-$10,218), inpatient costs (-$2,302), 90-day charges (-$9,780) and 90-day costs (-$2,324). No significant differences were noted between physician-owned and nonphysician-owned hospitals with regards to 90-day wound complications (OR 1.08 [95% CI 0.94-1.22]; p=.279), pulmonary complications (OR 1.06 [95% CI 0.97-1.17]; p=.187), cardiac complications (OR 0.92 [95% CI 0.83-1.01]; p=.089), septic complications (OR 0.77 [95% CI 0.56-1.01]; p=.073), all-cause ED visits (OR 0.96 [95% CI 0.89-1.04]; p=.311), revision surgery (OR 1.09 [95% CI 0.72-1.59]; p=.653) and readmissions (OR 0.98 [95% CI 0.89-1.08]; p=.680). CONCLUSION: Our results suggest that patients undergoing elective 1- to 3-level PLFs at physician-owned hospitals do not experience a greater number of complications and/or readmissions while having lower risk-adjusted charges and costs over the 90-day episode of care. The findings call on the need for revaluation/reconsideration of the ACAs restriction on the expansion of these physician-owned hospitals. (C) 2019 Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1ea86768367797358856d2201816524",
  "timestamp": "2025-05-15T03:20:22.301335"
}