{
  "id": 821,
  "title": "Metaheuristic Algorithms and Modern Credit Classification Methods: A Systematic Review",
  "abstract": "Number of proposed advanced analysis methods, which try to successfully predict if applicants are going to default in credit applications show an increasing pattern, especially after the Global Financial Crisis. Alternative to conventional statistical classification methods, machine learning methods arrive on the scene; they have capability to reveal information from the data independently from constraints and assumptions. Along with machine learning methods, metaheuristic algorithms that substantially improves classification performances take part in studies. Combined usages of learning methods and metaheuristic algorithms aim to benefit from the contemporary data storage and process capacities at the highest level and greatly contribute to credit risk assessment field. In this review study, credit classification studies that adopt metaheuristic algorithms in the analyses are examined with a systematic process, for the period after 2000. By forming a general framework, classification methods, metaheuristic algorithm implementations, algorithms' intended uses and performance assessment criteria are addressed. Examination showed that there is a growing interest, nevertheless method preferences are concentrated over a limited option. It is necessary to incorporate more novel metaheuristics and/or hybrid and combined usages to the studies. It is possible to say that progressive works parallel to the developments in computer and mathematical sciences will continuously contribute to the literature.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1f03f6e44a2c1adf0140f4fd17f2134",
  "timestamp": "2025-05-15T01:55:41.540708"
}