{
  "id": 8762,
  "title": "Household catastrophic payments for tuberculosis care in Nigeria: incidence, determinants, and policy implications for universal health coverage",
  "abstract": "Background: Studies on costs incurred by patients for tuberculosis (TB) care are limited as these costs are reported as averages, and the economic impact of the costs is estimated based on average patient/household incomes. Average expenditures do not represent the poor because they spend less on treatment compared to other economic groups. Thus, the extent to which TB expenditures risk sending households into, or further into, poverty and its determinants, is unknown. We assessed the incidence and determinants of household catastrophic payments for TB care in rural Nigeria. Methods: Data used were obtained from a survey of 452 pulmonary TB patients sampled from three rural health facilities in Ebonyi State, Nigeria. Using household direct costs and income data, we analyzed the incidence of household catastrophic payments using, as thresholds, the traditional > 10% of household income and the >= 40% of non-food income, as recommended by the World Health Organization. We used logistic regression analysis to identify the determinants of catastrophic payments. Results: Average direct household costs for TB were US$ 157 or 14% of average annual incomes. The incidence catastrophic payment was 44%; with 69% and 15% of the poorest and richest household income-quartiles experiencing catastrophic activity, respectively. Independent determinants of catastrophic payments were: age > 40 years (adjusted odds ratio [aOR] 3.9; 95% confidence interval [CI], 2.0, 7.8), male gender (aOR 3.0; CI 1.8, 5.2), urban residence (aOR 3.8; CI 1.9, 7.7), formal education (aOR 4.7; CI 2.5, 8.9), care at a private facility (aOR 2.9; 1.5, 5.9), poor household (aOR 6.7; CI 3.7, 12), household where the patient is the primary earner (aOR 3.8; CI 2.2, 6.6]), and HIV co-infection (aOR 3.1; CI 1.7, 5.6). Conclusions: Current cost-lowering strategies are not enough to prevent households from incurring catastrophic out-of-pocket payments for TB care. Financial and social protection interventions are needed for identified at-risk groups, and community-level interventions may reduce inefficiencies in the care-seeking pathway. These observations should inform post-2015 TB strategies and influence policy-making on health services that are meant to be free of charge.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1f30ba6724fd573fc1c94f419b53876",
  "timestamp": "2025-05-15T03:21:56.764505"
}