{
  "id": 7956,
  "title": "Health beliefs and attitudes associated with HPV vaccine intention among young gay and bisexual men in the southeastern United States",
  "abstract": "Gay and bisexual men are at increased risk of anal cancer as a result of human papillomavirus (HPV) infection. Prophylactic vaccination is a potentially effective strategy for preventing anal cancer in this population. The purpose of this study was to identify factors associated with gay and bisexual men's intention to receive HPV vaccine. In the fall of 2010, 179 self-identified gay and bisexual men (mean age 22 years) completed an Internet-based questionnaire assessing beliefs and attitudes toward HPV vaccination. Men were recruited from college-based and Internet venues throughout the southeastern United States. The probability of intent to receive HPV vaccine was modeled using logistic regression. A majority of men (93%) had heard of HPV prior to participation but were generally unaware of the association of HPV with anal, penile, and oral cancers. Only 26% were aware of an HPV vaccine for males. Of the 179 participants, 64 (36%) were likely to be vaccinated. Men most likely to receive HPV vaccine perceived stronger physical and psychological benefits from vaccination and had more positive attitudes toward the vaccine. Conversely, intent to be vaccinated was negatively associated with concern over the financial cost of vaccination. Findings from this study can inform college-based health education programs aimed at increasing vaccine uptake among gay and bisexual men. (C) 2011 Elsevier Ltd. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c1fbf348c114496c53244698d6a33d24",
  "timestamp": "2025-05-15T03:13:30.722552"
}