{
  "id": 228,
  "title": "A hybrid approach to cardinality constraint portfolio selection problem based on nonlinear neural network and genetic algorithm",
  "abstract": "Portfolio Optimization (PO) is an extremely popular method that selects the best portfolio for an investor. When the classic methods fail to find an exact solution, heuristic techniques are designed to find an approximate solution. In the literature, such techniques have often been used in the portfolio selection problem. However, hardly any of these methods utilize a neural network to apportion the extent of stocks. The basic objective of portfolio optimization is to minimize the risk of the portfolio while maximizing the expected return of the portfolio. In reality, the Standard Portfolio Optimization Model does not fulfill stock market requirements in a money related world. Indeed, this problem cannot limit the amount of stock in the portfolio. On the other hand, the precise number of stocks are taken into account by the Cardinality Constraint Portfolio Optimization model, which is the Mixed-Integer Quadratic Programming problem. While minimizing the risk of the portfolio, limiting the expected return and the number of stocks is the main subject of this study. In this study, a hybrid approach is proposed, based on the Nonlinear Neural Network and the Genetic Algorithm to solve the Cardinality Constraint Portfolio Optimization Model. To investigate the effectiveness of the proposed hybrid approach, the Istanbul Stock Exchange (ISE-301) data is used. The ISE-30 data1 consists of daily prices, from May 2015 to May 2017. The ISE-30 data1 from May 2017 to July 2018 is used as out-of-sample. To clarify the effectiveness proposed, the method was applied to publicly data sets which are used for numerous different portfolio selection strategies in many articles. The proposed hybrid approach to the cardinality constraint portfolio optimization problem has more viable outcomes than current strategies.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c2005886f7a71a292d969c0069cb2917",
  "timestamp": "2025-05-15T00:40:34.211851"
}