{
  "id": 2816,
  "title": "Navigating Uncertainty in an Emerging Market: Data-Centric Portfolio Strategies and Systemic Risk Assessment in the Johannesburg Stock Exchange",
  "abstract": "This study investigates systemic risk, return patterns, and diversification within the Johannesburg Stock Exchange (JSE) during the COVID-19 pandemic, utilizing data-centric approaches and the ARMA-GARCH vine copula-based conditional value-at-risk (CoVaR) model. By comparing three investment strategies-industry sector-based, asset risk-return plot-based, and clustering-based-this research reveals that the industrial and technology sectors show no ARCH effects and remain isolated from other sectors, indicating potential diversification opportunities. Furthermore, the analysis employs C-vine and R-vine copulas, which uncover weak tail dependence among JSE sectors. This finding suggests that significant fluctuations in one sector minimally impact others, thereby highlighting the resilience of the South African economy. Additionally, entropy measures, including Shannon and Tsallis entropy, provide insights into the dynamics and predictability of various portfolios, with results indicating higher volatility in the energy sector and certain clusters. These findings offer valuable guidance for investors and policymakers, emphasizing the need for adaptable risk management strategies, particularly during turbulent periods. Notably, the industrial sector's low CoVaR values signal stability, encouraging risk-tolerant investors to consider increasing their exposure. In contrast, others may explore diversification and hedging strategies to mitigate risk. Interestingly, the industry sector-based portfolio demonstrates better diversification during the COVID-19 crisis than the other two data-centric portfolios. This portfolio exhibits the highest Tsallis entropy, suggesting it offers the best diversity among the types analyzed, albeit said diversity is still relatively low overall. However, the portfolios based on groups and clusters of sectors show similar levels of diversity and concentration, as indicated by their identical entropy values.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c201dc97068c88deab3fff9949c1ccfa",
  "timestamp": "2025-05-15T01:10:49.501466"
}