{
  "id": 5089,
  "title": "Elder Mistreatment Experienced by Older Caregiving Adults: Results from a National Community-Based Sample",
  "abstract": "BackgroundWith an aging population, older adults are increasingly serving as caregivers to others, which may increase their risk of adverse interpersonal experiences.ObjectiveTo investigate the prevalence and types of elder mistreatment experienced by older caregiving adults.DesignCross-sectional analysisParticipantsNational sample of community-dwelling US adults over age 60 in 2015-2016.Main MeasuresCaregiving (assisting another adult with day-to-day activities) was assessed by interviewer-administered questionnaires. Experience of elder mistreatment was assessed by participant-reported questionnaire in three domains: emotional, physical, and financial. Multivariable logistic regression models examined associations between caregiving status and each domain of elder mistreatment, adjusting for age, race, ethnicity, gender, education, marital status, concomitant care-receiving status, overall physical and mental health, and cognitive function. Additional logistic regression models examined associations between being the primary caregiver (rather than a secondary caregiver) and each domain of mistreatment among older caregivers.Key ResultsOf the 1898 participants over age 60 (including 1062 women and 836 men, 83% non-Hispanic white, and 64% married or partnered), 14% reported serving as caregivers for other adults, including 8% who considered themselves to be the primary caregiver. Among these older caregivers, 38% reported experiencing emotional, 32% financial, and 6% physical mistreatment after age 60. In multivariable models, caregiving was associated with experiencing both emotional mistreatment (AOR 1.61, 95% CI 1.15-2.25) and financial mistreatment (AOR 1.72, 95% CI 1.18-2.50). In analyses confined to caregiving older adults, those who served as primary rather than secondary caregivers for other adults had an over two-fold increased odds of emotional mistreatment (AOR 2.17, 95% CI 1.07, 4.41).ConclusionIn this national cohort of older community-dwelling adults, caregiving was independently associated with experiencing emotional and financial mistreatment after age 60. Findings suggest that efforts to prevent or mitigate elder mistreatment should put more emphasis on vulnerable older caregivers.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c203551d7f45a6f042715c59fec1909b",
  "timestamp": "2025-05-15T02:44:11.030021"
}