{
  "id": 726,
  "title": "A Machine Learning Approach to Identifying Risk Factors for Long COVID-19",
  "abstract": "Long-term sequelae of coronavirus disease 2019 (COVID-19) infection are common and can have debilitating consequences. There is a need to understand risk factors for Long COVID-19 to give impetus to the development of targeted yet holistic clinical and public health interventions to reduce its associated healthcare and economic burden. Given the large number and variety of predictors implicated spanning health-related and sociodemographic factors, machine learning becomes a valuable tool. As such, this study aims to employ machine learning to produce an algorithm to predict Long COVID-19 risk, and thereby identify key predisposing factors. Longitudinal cohort data were sourced from the UK's Understanding Society: COVID-19 Study (n = 601 participants with past symptomatic COVID-19 infection confirmed by serology testing). The random forest classification algorithm demonstrated good overall performance with 97.4% sensitivity and modest specificity (65.4%). Significant risk factors included early timing of acute COVID-19 infection in the pandemic, greater number of hours worked per week, older age and financial insecurity. Loneliness and having uncommon health conditions were associated with lower risk. Sensitivity analysis suggested that COVID-19 vaccination is also associated with lower risk, and asthma with an increased risk. The results are discussed with emphasis on evaluating the value of machine learning; potential clinical utility; and some benefits and limitations of machine learning for health science researchers given its availability in commonly used statistical software.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c204a527c80c62d3c8604334cb2a166b",
  "timestamp": "2025-05-15T01:54:34.002852"
}