{
  "id": 1941,
  "title": "Enabling privacy-preserving and distributed intelligent credit scoring by zero-knowledge proof and functional encryption",
  "abstract": "Credit scores, as quantifiable indicators of individual creditworthiness reflected in credit reports, are widely adopted by financial institutions as prerequisites for accessing various financial services. Therefore, the accuracy and objectivity of credit scores are paramount in the credit reporting system. To achieve this, there is a need to optimize scoring models while broadening the sources of credit data. However, the circulation of distributed credit data may expose sensitive customer information. Existing solutions, which protect privacy through secure multi-party computation and homomorphic encryption, introduce substantial computational costs and face challenges in resolving trust issues among multiple parties dealing with encrypted data. In response, this paper introduces a privacy-preserving credit scoring system. Initially, two range proof schemes for weights and credit data, as well as a proof scheme for the association between scores and ciphertexts, are devised to address trust concerns among parties. Building on these foundations, a privacy-preserving credit scoring (PPCS) scheme tailored for traditional models and a privacy-preserving intelligent credit scoring (PICS) scheme are constructed using inner-product functional encryption (IPFE). These schemes notably enhance the efficiency of encrypted scoring computations and encrypted vector operations in neural network model training, while introducing a novel approach to credit score prediction based on neural networks. This paper also undertakes rigorous security analyses of the proposed schemes. Experimental and performance evaluations demonstrate that PPCS and PICS exhibit superior computational and storage efficiency compared to related schemes, with PICS demonstrating exceptional performance in both binary classification prediction of default risk and credit score prediction.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c2121656f691628fd0049862081f160f",
  "timestamp": "2025-05-15T02:09:14.403845"
}