{
  "id": 451,
  "title": "On the usefulness of risk-neutral distribution implied in the KOSPI 200 index option",
  "abstract": "This study investigates the usefulness of the risk-neutral distributions implied in the KOSPI 200 index options in the view of hedging. Specifically, using an adjusted implied volatility interpolation method, we infer the risk-neutral distributions of the underlying asset implied in the KOSPI 200 index (out-of-the-money only and all) options market prices in both downward and rising trends from January 2, 2003 to December 30, 2003. Then, we compare the delta-neutral and delta-vega hedging performances of implied distribution with those of Black-Scholes which assume single lognormal distribution and those of the ad hoc black-Scholes procedure that fit the implied volatility surface. To accurately investigate the cause of the different hedging performances among the models, additional empirical tests are performed: firstly, we conduct a comparative analysis of delta-vega hedging performances using post-inferred implied correlation coefficient and of the adjusted R-2 of vega hedging using post-inferred regression equations among models. Secondly, we make a comparison between the hedging performances in SIV that synthesize out-of-the-money call and put options only and those of IV that use all call (put) options through the change of the number of deep in(out-of)-the-money option's data divided by the number of all options' data occurred owing to the downward (rising) trend of the underlying asset price. Then, we analyze whether the downward (rising) trend of. the underlying asset price influences relative hedging performances among the models used in this study. The empirical results are summarized as follow: in the view of hedgers who search for a perfect hedging method, in the case of call options, SIV and IV are better choices. In comparison of SIV and IV, SIV is better than IV in the event of increase in the number of deep-in-the-money options, rather than that of deep-out-of-the-money options because IV offers more advantage than IV does, by using additionally deep-out-of-the-money call or put options for the hedging of put or call options. IV merely reflects information implied in deep-in-the-money options for hedging all options including deep-in-the-money options. Therefore, SIV (IV) is the best choice as a hedging strategy in the short term for the period of the rising (downward) trend of the underlying asset price, but there is no significant difference between IV and SIV in the long term. In the case of put options, BS is a significantly better choice in the long term as delta-vega hedging method due to its stability of pricing errors (or, at least, strongly serially dependent as suits a specification error) and accurate vegas unlike the less parsimonious models. During the period of the downward trend of index, however, SIV is better than BS in the short run.",
  "year": 2006,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c21d7e73540d5d56ce6a90bb8c9df309",
  "timestamp": "2025-05-15T01:32:30.125720"
}