{
  "id": 8072,
  "title": "Navigating the energy transition: Interplay of geopolitics, economic complexity, and environmental governance in OECD countries",
  "abstract": "This research aims to determine, within this context, the influence of environmental governance, economic complexity, and geopolitical risks on energy transition in 20 OECD countries between 1990 and 2021. The current study is anchored on the Paris Agreement and COP27, which promotes clean energy (SDG 7) and environmental conservation (SDG 13). In this analysis, the new Mixed Multi-Quantile Regression (MMQR) model is used to mitigate slope heterogeneity and cross-sectional dependence because it accommodates heterogeneity in distinct phases of the energy transition. In addition, an asymmetric approach is employed to investigate the moderating role of geopolitical risk on the link between environmental governance, economic complexity, and energy transition. The main results of this research show that environmental governance significantly and positively affects energy transition at all quantiles, while economic complexity has a positive impact at some quantiles. However, their impacts tend to differ during the energy transition process. On the one hand, the interface between environmental governance and geopolitics presents potential support for the transition process. It creates difficulties for it, on the other hand. (3) Economic development positively correlates with energy transition because nations from the developed economy possess the ability and the resources to impact energy transition effectively. Nevertheless, when considering geopolitical risks, economic complexity turns out to be negative and contributes to the problem of energy transition. This work establishes that economic diversification and good ecological policies enable energy transition. The results are also validated by a panel Granger causality test that shows that environmental governance and economic complexity can improve the environment for accepting clean energy and its financial health. The research offers a policy guide for policymakers, managers, and investors operating in the global climate, geopolitical risk, conflicts, and renewable energy.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c229386f415f56f6be20935e28818b91",
  "timestamp": "2025-05-15T03:15:09.318546"
}