{
  "id": 7963,
  "title": "Investigating the Drivers of Farm Diversification Among US Fruit and Vegetable Operations",
  "abstract": "Diversification of an agricultural operation's crop mix is considered an environmental and financial management strategy. Environmentally, crop diversification can stabilize the ecosystem via the introduction of biodiversity, allowing for more rapid response to physical and social changes. Economically, crop mix diversification can mitigate risk. Though there are environmental and economic benefits of crop diversification, little economic work has been conducted on crop diversification outside of the row crop industry. This study estimated how internal and external factors affect crop diversification among fruit and vegetable (FV) operations. External factors included access to markets and land; internal factors included farmer beliefs and access to information from extension and network sources. An OLS regression was conducted using data from 1532 farmers across 16 states in the United States. Endogeneity was addressed using an instrumental variable approach and a score endogeneity test indicated that endogeneity was not an issue. OLS results indicate that selling locally increases diversification, while reliance on other farmers for information decreases diversification. A conditional quantile analysis was conducted to reveal factors' effects across different degrees of diversification. Quantile results indicate that selling locally, season extension technologies, and use of organic practices positively influence crop diversification across all levels of diversification. Receiving information from farmers negatively influences diversification for specialized farms, but positively influences diversification for highly diversified operations.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c230c1c8741dbe5adafd6efec878cdf8",
  "timestamp": "2025-05-15T03:14:07.113272"
}