{
  "id": 6792,
  "title": "Universality of market superstatistics",
  "abstract": "We use a key concept of the continuous-time random walk formalism, i.e., continuous and fluctuating interevent times in which mutual dependence is taken into account, to model market fluctuation data when traders experience excessive (or superthreshold) losses or excessive (or superthreshold) profits. We analytically derive a class of superstatistics that accurately model empirical market activity data supplied by Bogachev, Ludescher, Tsallis, and Bunde that exhibit transition thresholds. We measure the interevent times between excessive losses and excessive profits and use the mean interevent discrete (or step) time as a control variable to derive a universal description of empirical data collapse. Our dominant superstatistic value is a power-law corrected by the lower incomplete gamma function, which asymptotically tends toward robustness but initially gives an exponential. We find that the scaling shape exponent that drives our superstatistics subordinates itself and a superscaling configuration emerges. Thanks to the Weibull copula function, our approach reproduces the empirically proven dependence between successive interevent times. We also use the approach to calculate a dynamic risk function and hence the dynamic VaR, which is significant in financial risk analysis. Our results indicate that there is a functional (but not literal) balance between excessive profits and excessive losses that can be described using the same body of superstatistics but different calibration values and driving parameters. We also extend our original approach to cover empirical seismic activity data (e.g., given by Corral), the interevent times of which range from minutes to years. Superpositioned superstatistics is another class of superstatistics that protects power-law behavior both for short- and long-time behaviors. These behaviors describe well the collapse of seismic activity data and capture so-called volatility clustering phenomena.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c23a4bcdb6250e54a3a04ddb636229d5",
  "timestamp": "2025-05-15T03:01:31.457229"
}