{
  "id": 4467,
  "title": "Prevalence and correlates of ICD-11 adjustment disorder: Findings from the Zurich Adjustment Disorder Study",
  "abstract": "Background/Objective: The 11th revision of the International Classification of Diseases (ICD-11) will provide a new definition of adjustment disorder (AjD). The aim of the present study is to report on prevalence and correlates of ICD-11 AjD in a high-risk sample. Method: Three hundred thirty persons who had lost their job involuntarily were sampled by local job centres. The Munich Composite International Diagnostic Interview was administered with a new AjD module. Associations between AjD and correlates were investigated with logistic regression analyses. Results: 27.3% of the participants reported the AjD core symptom pattern. 13.8% men and 17.2% women met diagnostic guidelines of ICD-11 AjD. Prevalence increased with age and exposure to multiple stressors. The AjD core symptom pattern was associated with various sociodemo-graphic correlates (e.g., lower financial household budget), whereas the full ICD-11 diagnosis including the exclusion algorithm was not. Regarding work-related factors, AjD occurred with a lower probability if the last job position had higher responsibilities and more general confidence for the future. Conclusions: ICD-11 AjD has a high prevalence among persons who lost their jobs involuntarily. Healthcare professionals should be aware of this problem. Research to investigate the ICD-11 AjD concept in the general populations and other subpopulations is needed. (C) 2018 Asociacion Espanola de Psicologia Conductual. Published by Elsevier Espana, S.L.U.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c240ada8655e158d4c2fd8e75e3892ce",
  "timestamp": "2025-05-15T02:37:47.475955"
}