{
  "id": 5153,
  "title": "Interplay of renewable energy investment efficiency, shareholder control and green financial development in China",
  "abstract": "The study aims to test the interplay of renewable energy investment efficiency, shareholder control, and green financial development in the context of China. To estimate the connections regression analysis approach and the Richardson model are used. This model is specifically used to assess China's renewable energy investment efficiency. The study's findings suggest that renewable energy companies and green finance development assist in alleviating investment shortages. Moreover, shareholder control has a significant connection with both the study constructs. Intermediary effects between short- and long-term bank loans account for 9.38% of the overall impact. Green finance development has a role in the efficiency of renewable energy investments via short- and long-term bank loans. The study analysis further showed that the annual growth rate was roughly 1%, lower in the Chinese context. Around 4% yearly growth in 2012-2013 indicated that the economy started a strong development period. Green finance development in China was found to have a negative influence on bank loan issuance and hindered the efficiency of renewable energy investment to some degree in 2018, yet the amount of development was marginally decreased with an effective degree of 0.17. Moreover, a risk factor is also significant that green financing growth may increase under-investment in renewable energy enterprises, although reducing credit availability mitigates this risk. According to this study, to complete and build a green financial development system, government should use rules and regulations. Financial institutions and renewable energy firms need to work together to enhance their management and construct financing channels to support the growth of renewable energy enterprises. However, multiple practical implications are recommended on it.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c244f87172abfa9122d3dea0c4e6269f",
  "timestamp": "2025-05-15T02:44:43.976887"
}