{
  "id": 8544,
  "title": "Cost of illness of chronic kidney disease in Lebanon: from the societal and third-party payer perspectives",
  "abstract": "Background Chronic kidney disease (CKD) is the 12(th) leading cause of death worldwide. Cost-of-illness studies of CKD are scarce in developing countries. This study aims to estimate the cost of illness of all stages of CKD in Lebanon, from early stages until dialysis and kidney transplantation. The secondary objective is to identify factors related to the highest financial burden. Methods This is a cross-sectional study of CKD patients who presented to two nephrology clinics during November 2020. Their medical and administrative records were reviewed for collection of demographics, CKD characteristics, direct medical costs (medications, diagnostic tests, hospitalizations, inpatient care, outpatient care), direct non-medical costs (transportation) and indirect costs (productivity losses) for one year. Kruskal Wallis test was used to compare the costs between different CKD stages and categories. Logistic regression analysis was used to evaluate risk factors associated with costs. Results The sample included 102 non-dialysis CKD patients, 40 hemodialysis, 8 peritoneal dialysis and 10 transplant patients. Their mean age was 66.74 +/- 15.36 years, 57.5% were males and 42.5% diabetics. The total median cost per year of CKD across all categories was assessed to be 7,217,500 Lebanese Pounds (3,750,000-35,535,250; 1 $USD = 1515 LBP in 2019) from the societal perspective and 5,685,500 LBP (2,281,750- 32,386,500) from the third-party payer perspective. Statistical analysis showed a higher total cost in hemodialysis (p < 0.001), higher cost of medications in transplant (p < 0.001) and higher cost in technique modality in peritoneal dialysis (p < 0.001). In a sub-analysis of hemodialysis patients, dialysis vintage negatively correlated with total societal cost (r = -0.391, p = 0.013); the regression analysis found diabetes as a risk factor for higher cost (OR = 2.3; 95%CI: 0.638,8.538; p = 0.201). In the subcategory of CKD-ND patients, age correlated with total societal cost (r = 0.323, p = 0.001); diabetes and coronary artery disease were significantly associated with higher total cost (OR = 2.4; 95%CI: 1.083,5.396; p = 0.031; OR = 3.7; 95%CI: 1.535,8.938; p = 0.004). Conclusions This cost of illness study showed a high burden of hemodialysis and peritoneal dialysis cost compared to transplant and non-dialysis CKD patients. It revealed a significantly higher cost of medications in transplant patients. Health policies should target interventions that prevent end-stage kidney disease and encourage kidney transplantation.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c25f9dac75c6cb36e645cdf84c7b21a8",
  "timestamp": "2025-05-15T03:19:52.152084"
}