{
  "id": 2345,
  "title": "Marketing Excellence: Nature, Measurement, and Investor Valuations",
  "abstract": "Marketing excellence is a foundational principle for the discipline that is gaining increasing attention among managers and investors. Despite this, the nature of marketing excellence and its effectiveness remain unclear. This research offers insight by addressing two questions: (1) How do managers understand and exercise marketing excellence? and (2) How do investors evaluate marketing excellence? Study 1 merges insights from 39 in-depth interviews with senior executives and secondary data from 150 firm strategies to find that marketing excellence is a strategy type focused on achieving organic growth by executing priorities related to the marketing ecosystem, end user, and marketing agility. Study 2 quantifies the impact of marketing excellence on firm value by using a machine learning algorithm and text analysis through an original dictionary to classify the text from 8,317 letters to shareholders in 1,727 U.S. firm annual reports. Calendar-time portfolio models reveal abnormal one-year returns of up to 8.58% for marketing excellence-returns that outpace those associated with market orientation and marketing capabilities. Findings offer guidance to managers, educators, and investors regarding how marketing excellence manifests-paving the way for the allocation of firm resources to ensure that marketing drives organic growth.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c26526d1365be5b2ddc6464e4322c0c6",
  "timestamp": "2025-05-15T01:06:10.649429"
}