{
  "id": 6714,
  "title": "Determinants of Public-Private Partnership Adoption in Solid Waste Management in Rural China",
  "abstract": "Rural solid waste management is a severe challenge in China. The Public-Private Partnership (PPP) is an effective method for rural solid waste management. However, policy efforts aimed at stimulating the adoption of PPP in rural solid waste management have been limited in their success. This study aims to empirically investigate the determinants of rural solid waste management PPP adoption in China. First, this study builds a theoretical model that consists of factors related to the institutional environment and market and proposes theoretical hypotheses. Then, using the balanced provincial panel data of 150 samples from 2015 to 2019, this study applies various count regression models and truncated regression models to empirically test the theoretical hypotheses. The results show that provinces with higher fiscal transparency, financial burdens, and market demand tend to adopt more PPP, while provinces with lower per capita GDP and market openness index ratings have a stronger motivation to initiate more PPP. In contrast, investment institutional environment factors have no impact on PPP adoption. To stimulate the development of PPP in rural solid waste management, this study proposed that a good-governed government and a strong market demand are critical foundations, and also a debt-risk prevention and evaluation system should be established to avoid local debt risks resulting from over-adoption of PPP.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c26b3d9069368e3b1e4a4b7d12c26a2b",
  "timestamp": "2025-05-15T03:01:03.517733"
}