{
  "id": 4909,
  "title": "Determinants Of Financial 3Ds: Analysis From The 3Ds Malaysian Construction Industry",
  "abstract": "The Malaysian construction. sector has been highlighted in the National Key Economic Area (NKEA) as one of the critical industries to make significant contribution in developing Malaysia to be a high income nation. However, statistics from Trading Economics Malaysia (2016), revealed that the bankruptcy rate in the construction sector is 8.2%; which is among the highest as compared to other industries such as automotive industry (10%), retail industry (6.3%), mining industry (4.1%) and manufacturing (4%). From this statistic, it illustrates that the construction sector which is full of 3D jobs - dirty, difficult and dangerous, also suffering from chronic financial 3Ds (distress, difficulties and debt) which affects the firms' performance. Hence, the objective of this study is to identify the determinants of financial distress in Malaysian construction sector. The dependent variable of this study is time interest earned while the independent variables are debt to capital, working capital and sales index. The sample of study consists of 67 companies in the construction sector and data collected covers from the period of 2001 until 2015. This study employs Panel Regression Fixed Effect Model in order to study the relationship between those variables. The result of this study shows that debt to capital ratio has significant and positive relationship with financial distress. Meanwhile, working capital and sales index has significant but negative relationship with financial distress, In conclusion, emphasis should be given to these determinants and where possible the industry may want to analyze in detail on how effective these determinants could be in minimizing the risk of financial distress.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c26d6406e145a8f42757d518883c4a8e",
  "timestamp": "2025-05-15T02:42:04.969782"
}