{
  "id": 8920,
  "title": "Prevalence and Factors Associated with Depression Among Older Adults During the COVID-19 Pandemic: A Cross-Sectional Study in Urban Areas in Thailand",
  "abstract": "Purpose: This study examined the prevalence of and factors associated with depression symptoms among Thai older adults during the COVID-19 pandemic.Patients and Methods: A cross-sectional survey was conducted among older adults in urban areas in Bangkok, Thailand, between July and October 2021. The 15-item Thai Geriatric Depression Scale (TGDS-15) was used to determine the prevalence of depression symptoms, and multiple logistic regression was conducted to identify the associated factors.Results: A total 156 older adults survey responses were received. The largest group of participants (80.8%) was aged below 70, women (50.6%), married (67.9%), retired (41%), having sufficient income (67.9%), living with their families (89.1%). More than half (71.8%) had an underlying disease, with hypertension being the most common (39.1%). In addition, 17.3% of the participants had received compulsory COVID-19 vaccination. Only 0.6% had a history of COVID-19 infection. The prevalence of depression among Thai older adults was 20.5%. Univariate analysis demonstrated occupation and income sufficiency was associated with depression symptoms. The results of the multivariate analysis found that the non-worker group was 3.54 times more likely to experience depression symptoms than the reference group (OR = 3.54, 95% CI = 1.25-10.02, p = 0.018) when controlling for the confounding factors.Conclusion: This study highlights the importance of addressing depression symptoms among Thai older adults, in which occupation and income sufficiency were the main variable factors for depression. Our study further suggested that the importance of interventions such as increasing job availability and establishing financial aid policies may ameliorate depression symptoms among older adults, especially in high-risk groups during the pandemic situation such as the COVID-19.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c271a2d1ef814c0049476d338d5bf313",
  "timestamp": "2025-05-15T03:23:56.041095"
}