{
  "id": 6797,
  "title": "The Impact of Political Exits on Dividend Policy",
  "abstract": "The paper addresses the impacts of political exits on the dividend policy, taking the impact of the Brexit deal on UK's companies listed at FTSE 100 as a practical case. The paper analyzes the political risk and uncertainty of Brexit and links it directly to the dividend policy of UK companies during the period (2010-2021). Data were collected from the annual reports of the companies from the FTSE 100 data base. Moreover, dividend policies were studied through analyzing its determinants such as dividend payout ratio, leverage, profitability, tangibility, liquidity, size and political factor - Brexit. A regression analysis was adopted to analyse and interpret the variables for the UK companies and notice the impact of the Brexit deal on the dividend policies. Therefore, the results show that there is a direct relation between political exits and corporate financial policies, especially dividend policy. Also, the results show that the financial ratios differed between the two periods (before and after) Brexit, where it seems that the dividend policy variables were affected starting from mid of 2016 due to Brexit referendum and then the political negotiations between the two parties during the period (2016-2021). In addition, the correlation matrix shows that DPR has a negative linear correlation with profitability, liquidity and size where it seems that DPR has a positive linear correlation with leverage, tangibility, and political factors. Moreover, our results show that political uncertainty and instability were affecting the FTSE 100 performance starting from 2016 due to Brexit related events.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c280dc86829a0d17a0e3d5561d373ceb",
  "timestamp": "2025-05-15T03:01:31.467226"
}