{
  "id": 5806,
  "title": "UNDERSTANDING THE INTERNATIONAL MARKET SELECTION DECISIONS OF THE SOCIAL ENTERPRISE",
  "abstract": "The role of the social enterprise (SE), as an actor of development has increased significantly over the years. SEs thrives to achieve a social mission while maintaining the financial sustainability. This creates a hybrid form of organization, which combines the characteristics of both for-profit and non-profit organizations. With the expanding role, recent years have seen a significant increase of cross boarder activity by these SEs. Despite the importance, as far as our knowledge is concerned, there have been only very few studies done in the area examining internationalization of the SE. Therefore the objective of the study was to examine the impact of target country macro-economic factors on international market selection of SEs. Study examine the impact of three macro-economic factors namely level of development, country risk and country institutional strength. Each factor was measured through two indices, where, level of development was measured through HDI and GDP; while country risk was measured through OECD risk index and Euler Hemes risk index and finally institutional strength was measured through rule of law and government effectiveness. The study then couples these macro-economic data with international market entry decisions made by 32 Microfinance SEs, and analyze them using logistic regression. The study reveals that SEs select target markets that are less developed, characterized by greater risk profiles, and governed by relatively week institutions.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c298f33eecdc93cf70f794cd9bf951e6",
  "timestamp": "2025-05-15T02:51:30.118568"
}