{
  "id": 5292,
  "title": "Fuzzy classification of sites suspected of being contaminated",
  "abstract": "One part of today's environmental pollution problem is referred to by the term contaminated soils. In Germany specialists expect to find approximately 260 000 sites suspected of being contaminated after completion of the registration phase. This large number, the urgency of carrying out measures to protect the environment and limited personnel and financial resources result in the necessity for a computer support. Detailed considerations of deficiencies of existing computer systems and formal estimation methods lead to a bipartite knowledge-based approach supporting the relative estimation of hazard. Multidimensional classification, the core of this approach, is mathematically well-founded and serves as an extension of methods already used successfully in practical operation. The unsuitability of formal risk analysis methods and various sources of incompleteness, uncertainty and vagueness of the whole research field motivate the use of fuzzy methods, and in particular the use of fuzzy classification providing a rough ranking method. Feature generation, the other main part of the approach, allows selecting, valuating and tuning the properties of the sites in such a way to ensure an optimal classification. For maximizing the expressive power of the system's results, the user is enabled to compromise between a detailed survey of a site and an easy to survey representation of a site with resulting loss of information caused by a certain a priori aggregation of properties.",
  "year": 1996,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c2ebc6734f4f97f07226b3c926cf55c1",
  "timestamp": "2025-05-15T02:46:16.247926"
}