{
  "id": 8775,
  "title": "Children's health care use in the Healthy Kids Program",
  "abstract": "Background. In 1990, the Florida Legislature established the Florida Healthy Kids Corporation to implement the concept of school enrollment-based health insurance coverage for children. The county school districts are used as a grouping mechanism to negotiate health insurance policies. The Florida Healthy Kids Corporation negotiates contracts with health maintenance organizations (HMOs) to assume financial risk and to provide health care services at each program site. In 1994, there were five sites with four different participating HMOs. Assessing quality of care is particularly important when contracting with HMOs because of the perception that financial and utilization review arrangements may restrict the enrollees' access to needed health care. One essential component of health care quality is the extent to which health care services are used in a manner consistent with the expected pattern of use for the population of enrolled children. The purpose of this study is to compare children's health care use across five different Florida Healthy Kids Program sites. Specifically, we compare the enrollees' actual health care use across HMO settings and program sites to the expected health care use based on the enrollees' case-mix. Methods. Each HMO provided child-specific health care use data including Physician's Current Procedural Terminology codes and International Classification of Diseases, 9th Revision codes. We used the Ambulatory Care Groups (ACGs) software to compare the children's actual health care use to the expected health care use at each site adjusted for case-mix. Several steps were then taken to determine if the children were receiving the anticipated number of health care visits based on their diagnoses. First, we divided the average number of encounters at each site by the group average across all of the sites, without adjusting for the case-mix of the enrollees. We then divided the average number of visits at each site by the expected number of visits based on the case-mix adjustment. A value of 1.00 means that the actual use and the expected use are identical. Values below 1 indicate underuse and values over I indicate overuse of health care services. Statistical comparisons of the actual versus expected average health care use across the five sites were performed by deriving the appropriate chi(2) statistics. Results. A census of all children (N = 14688) enrolled in the Florida Healthy Kids Program at each of the sites for 6 months or longer were included in the analysis. The average number of health care encounters across all sites for a 12-month time period was 2.98 +/- 4.6 visits. After adjusting for the case-mix of the enrollees in each site using the ACG software, several of the five sites differed from one in a statistically significant way. However, these statistical assessments must be tempered with assessing the practical magnitude of the observed differences. Conclusions. The number of public and private efforts to insure children who are not eligible for Medicaid and whose parents cannot purchase private insurance has grown dramatically. These programs are vital for ensuring financial access to care for uninsured children. However, it is essential that such programs are not viewed as merely cost containment efforts. Assessing the degree to which children receive the health care services they need across multiple delivery settings is an essential yet challenging component of quality assurance. Generally our analysis indicates that children in the Florida Healthy Kids Program are receiving the amount of health care expected based on their health care needs; which is one component of a high-quality health care program.",
  "year": 1997,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c2f9fd1e2b2315ccd59e5510ad8bdcd4",
  "timestamp": "2025-05-15T03:22:25.994197"
}