{
  "id": 3371,
  "title": "Systemic Risk Spillover Effects among China's Financial Institutions: Evidence from the Spatial Econometric Model",
  "abstract": "This study investigates the spillover and contagion effects of systemic risk among Chinese financial institutions in terms of the conditional Value-at-Risk method and spatial econometric techniques. We construct different representative spatial weight matrices to demonstrate various risk connective categories and contagion channels. The spatial autoregression model is built to reveal the different magnitudes of systemic risk contagion effects and extended as the spatial quantile regression model to measure the change in spillovers across quantiles. The results highlight that the spatial agglomeration pattern of institution-level systemic risk is highly concentrated within the same sector but highly disparate between the different sectors. The closeness of the asset price channel and the information channel would enhance the systemic risk spillover effects among institutions. The higher the single institution's systemic risk level is, the stronger its spillovers among all of them within the same financial department, yet contrarily, the spillovers are larger at lower quantiles between different sectors due to the disparate spatial tendency of systemic risk. Besides, the spillover effects across quantiles indicate the higher tail contagion of systemic risk spatial spillovers, especially during 2015 A-share market crash and 2020 COVID-19 outbreak.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c30564539461789ed7dfcea696467cb7",
  "timestamp": "2025-05-15T02:25:40.091499"
}