{
  "id": 6628,
  "title": "Impact of Firm-specific Attributes on the Shareholder Value Creation of Listed South African Companies",
  "abstract": "This article identifies firm-specific attributes with a substantial impact on the capabilities of listed South African companies to create shareholder value. It shows that the firm-specific attributes that contribute to shareholder value creation differ when value is measured using economic-based shareholder value measures, such as Economic Value Added (EVA) and Market Value Added (MVA), versus using accounting-based shareholder value measures, such as earnings per share (EPS). Data cover financial years from 2000 to 2018 for 35 JSE-listed companies. Multiple regression analysis is employed to study the relationships. The study revealed different results on shareholder value creation utilizing accounting-based and economic-based performance measures. Shareholder value measured by EVA is created by larger companies with higher profitability, lower systematic risk and efficient asset management. MVA identifies increased shareholder value for larger firms and higher profitability. MVA also pinpoints enhanced investor value by firms with lower liquidity ratios which invest less in research and development (R&D). EPS achieved different results from EVA and MVA, indicating that according to accounting-based measures, companies add value through lower profitability (measured by return on investment), efficient asset management and a higher risk profile. Understanding the effect of firm-specific attributes on shareholder value creation can assist managers in developing strategies and decision-making.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c318ccfd82badc7da478ead0a46e7d70",
  "timestamp": "2025-05-15T03:00:04.979508"
}