{
  "id": 4197,
  "title": "Determinants of discount rates, capitalisation rates and growth rates",
  "abstract": "PurposeThis paper analyses the determinants of key inputs for the explicit discounted cash flow (DCF) or the implicit capitalisation models, namely the discount rates and the capitalisation rates. We also study the factors affecting the implied growth rate of the net operating income (NOI).Design/methodology/approachWe make use of a rich database for the commercial real estate market in the US that covers a long time period (2002-2024) and over 60 metropolitan markets. Given that the figures are appraisal-based, we use a common desmoothing approach and analyse the determinants of discount rates, capitalisation rates and growth rates using regression analysis.FindingsOn average, the discount rate in gateway markets is 89 basis points lower than in non-gateway markets. A similar difference is observed for capitalisation rates (93 basis points). Inflation has an immediate negative impact on capitalisation and discount rates due to the delayed adjustment of the rental income, but the effect turns positive over time. With a lag, real GDP growth reduces both rates, as expectations of economic growth reduce risk premia. Real interest rates consistently increase capitalisation, discount and growth rates through higher borrowing costs and portfolio reallocations.Practical implicationsThe investment method to valuation is widely used in practice. By shedding additional light on the determinants of key inputs when using the explicit DCF of implicit capitalisation models, namely the discount and capitalisation rates, the results of this study should provide important information to appraisers and policymakers.Originality/valueThis paper provides a comprehensive analysis of the determinants of key inputs needed when appraising a commercial real estate property with an income approach. In particular, it not only explores the impacts of macroeconomic variables on discount and capitalisation rates but also those of various types of properties. As such, the results of this study should have important implications in practice.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c31e42aa682638252bf6dbf630ff393c",
  "timestamp": "2025-05-15T01:24:51.403121"
}