{
  "id": 8260,
  "title": "Characteristics of males who father babies born to adolescents versus older adult women in Taiwan",
  "abstract": "Purpose: To identify characteristics of males who father babies born to adolescent mothers in southern Taiwan. Methods: This was a population-based cross-sectional study of male partners of 1,145 primigravidas (555 adolescent primigravidas and 590 adults) in Kaohsiung County, Taiwan, which compared their reports of their male partners' characteristics. Data were collected by a questionnaire that included demographic characteristics, health behavior problems, and attitudes toward the pregnancy. Results: In multiple logistic regression analyses, the males who father babies born to adolescent primigravidas achieved a lower level of education; a greater age discrepancy between themselves and the mothers; a greater unemployment rate; less financial independence; more smoking, drinking, and drug abuse; less supportive attitude toward pregnancy; poorer attendance at childbirth; less provision of postpartum care for mothers and infants; and greater domestic violence than adult primigravidas (p < .05). These negative findings persist even after stratification by age discrepancy. Male partners of the adolescent mothers with an age difference of 5 years or more were more likely to report drug abuse and domestic violence than those of adult primigravidas. Conclusions: Males who father babies born to adolescent primigravidas were found to have many negative characteristics that place their partners and offspring at risk. Questions asked of or about the father of the baby during prenatal visits may help identify pregnant adolescents who need support during pregnancy and after delivery. (C) Society for Adolescent Medicine, 2001.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c320264cd3e653445b6b4171c77cec26",
  "timestamp": "2025-05-15T03:16:49.075552"
}