{
  "id": 5531,
  "title": "Correlates of depressive symptomatology among older community-dwelling Mexican Americans: The Hispanic EPESE",
  "abstract": "Objectives. The prevalence of depressive symptoms and associated risk factors is described, using data from the Hispanic EPESE, the first large. representative study of older Mexican Americans. Methods. Multivariate logistic regression was used to examine the association between depressive symptoms and sociodemographics, chronic health conditions, disability, and cultural factors. Results. Using the Center for Epidemiologic Studies of Depression scale, 25.6% of the 2,823 subjects reported high symptom levels. Rates among women (31.9%) and particularly men (17.3%) were higher than has been typically reported for older Mexican Americans and older adults in general. Consistent with previous studies of older adults, gender, lack of insurance, financial strain, chronic health conditions, and disability were found to be associated with depressive symptoms. Several cultural factors were also associated with increased risk, including immigrant status, levels of acculturation and assimilation, health locus of control, and recency of immigration. An interaction between gender and immigrant status was found such that, in relation to subjects born in the United States, female immigrants were at significantly higher risk for depressive symptoms, whereas male immigrants were at lower risk. Discussion. Our findings suggest that the increased prevalence can be attributed to higher rates of sociodemographic risk factors and functional disability, coupled with cultural factors and chronic medical conditions.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3268a45439eb8b0c2a3fc05effc9a6f",
  "timestamp": "2025-05-15T02:48:51.309174"
}