{
  "id": 7313,
  "title": "The statistical sensitivity of highway project cost to geo-heterogeneity in the tropics",
  "abstract": "Purpose The study is carried out to analytically reconnoiter geotechnical index properties of subgrade soils as key variables that shape the cost profile of road infrastructure projects in a tropical geographic setting with starkly heterogenous ground conditions. Design/methodology/approach Using the Niger Delta region, as a point of reference, data on geotechnical index properties of subgrade soils at spatially dispersed locations for 61 completed highway projects are collated. Exploratory statistical tests were carried out to infer significant associations with final project costs before regression analysis. Regression analysis is principally deployed as an explanatory analytical tool, relevant to quantify the sensitivity of highway project costs to the individual and collective impact of geotechnical variables. Findings Several parameters of expansivity and compressibility exhibited significantly strong associations with the final costs recorded on the highway projects. The statistical analysis further established a cause-effect relationship, whereby small changes in the geotechnical properties of sub-grade soils at project locations, would result in disproportionately large changes in the cost of road construction. Practical implications The study findings provide insight into the sensitivity of road construction costs to geotechnical variables, which can serve as a useful input in financial risk analysis for development appraisal and the generation of location adjustment factors. Originality/value The study statistically demonstrates location-induced construction cost profiles, triggered in response to the spatial geotechnical variability and occurrence of problem subgrade soils in the humid tropics, which may be different from those traditionally established in studies of cold and temperate climate soils.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c32d64adad64465835cea2f012806421",
  "timestamp": "2025-05-15T03:07:31.810013"
}