{
  "id": 9133,
  "title": "Psychological morbidity and return to work after injury: multicentre cohort study",
  "abstract": "Background The benefits of work for physical, psychological, and financial wellbeing are well documented. Return to work (RTW) after unintentional injury is often delayed, and psychological morbidity may contribute to this delay. The impact of psychological morbidity on RTW after a wide range of unintentional injuries in the UK has not been adequately quantified. Aim To quantify the role of psychological factors, including anxiety, depression, and post-traumatic distress, on RTW following unintentional injuries. Design and setting A longitudinal multicentre prospective study was undertaken in Nottingham, Bristol, Leicester, and Guildford, UK. Method Participants (n = 273) were 16-69-year-olds admitted to hospital following unintentional injury, who were in paid employment prior to injury. They were surveyed at baseline, then at 1, 2, 4, and 12 months following injury; demographic data were collected along with injury characteristics, psychological morbidity, and RTW status. Associations between demographic, injury and psychological factors, and RTW between 2 and 12 months after injury were quantified using random effects logistic regression. Results The odds of RTW between 2 and 12 months after injury reduced as depression scores early in the recovery period (1 month after injury) increased (odds ratio [ OR] 0.87, 95% confidence interval [CI] = 0.79 to 0.95) and as length of hospital stay increased (OR 0.91, 95% CI] = 0.86 to 0.96). For those experiencing threatening life events following injury (OR 0.27, 95% CI = 0.10 to 0.72) and with higher scores on the Crisis Support Scale (OR 0.93, 95% CI] = 0.88 to 0.99), the odds of RTW between 2 and 12 months after injury were lower. Multiple imputation analysis found similar results, but those relating to crisis support did not remain statistically significant. Conclusion Primary care professionals can identify patients at risk of delayed RTW who may benefit from management of psychological morbidity and support to RTW.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c33f1ef0217cefa0a674cf3e62753ed0",
  "timestamp": "2025-05-15T03:25:54.600079"
}