{
  "id": 382,
  "title": "Machine learning for clothing manufacture as a mean to respond quicker and better to the demands of clothing brands: a Greek case study",
  "abstract": "In the clothing industry, design, development and procurement teams have been affected more than any other industry and are constantly being under pressure to present more products with fewer resources in a shorter time. The diversity of garment designs created as new products is not found in any other industry and is almost independent of the size of the business. The proposed research is being applied to a Greek clothing manufacturing company with operations in two different countries and a portfolio of diverse brands and moves in two dimensions: The first dimension concerns the perfect transformation of the product design field into a field of action planning that can be supported by artificial intelligence, providing timely and valid information to the designer drawing information from a wider range of sources than today's method. The second dimension of the research concerns the design and implementation of an intelligent and semi-autonomous decision support system for everyone involved in the sample room. This system utilizes various machine learning techniques in order to become a versatile, robust and useful assistant: multiple clustering and classification models are utilized for grouping and combining similar/relevant products, Computer Vision state-of-the-art algorithms are extracting meaningful attributes from images and, finally, a reinforcement learning system is used to evolve the existing models based on user's preferences.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c34d5bda9753408c862625e512c70447",
  "timestamp": "2025-05-15T00:42:32.591799"
}