{
  "id": 5053,
  "title": "Prevalence and Risk Factors for Primary Glaucomas in Adult Urban and Rural Populations in the Andhra Pradesh Eye Disease Study",
  "abstract": "Purpose: To compare the prevalence of and risk factors for primary open-angle glaucoma (POAG) and primary angle-closure glaucoma (PACG) in urban and rural populations in the Andhra Pradesh Eye Disease Study. Design: A population-based, cross-sectional study using a stratified, random, cluster, and systematic sampling strategy. Participants: Between 1996 and 2000, participants from 94 clusters in 1 urban and 3 rural areas representative of the population were included. Methods: We performed a detailed eye examination, including applanation tonometry, gonioscopy, and dilated fundus evaluation after ruling out risk of angle closure. Humphrey threshold 24-2 visual fields were performed when indicated. Main Outcome Measures: Glaucoma was diagnosed and categorized using International Society of Geographical and Epidemiological Ophthalmology criteria. The prevalence and risk factors for POAG and PACG in subjects aged >= 40 years were compared between the urban and rural cohorts. Results: There were 3724 subjects >= 40 years, with 934 in the urban and 2790 in the rural cohort. The prevalence of POAG was greater in the urban compared with the rural cohort (4% vs 1.6%; P < 0.001). Age and intraocular pressure (IOP) were risk factors for POAG in both cohorts. Blindness owing to POAG was 11.1% in the rural and 2.7% in the urban cohort. The prevalence of PACG (1.8% vs 0.7%; P < 0.01), primary angle closure (PCA) (0.8% vs 0.2%; P = 0.02) and primary angle closure suspect (PACS; 3.5% vs 1.5%; P < 0.01) were significantly different between the urban and rural cohorts. Increasing age was a risk factor in the urban cohort. Intraocular pressure was a risk factor in both the populations. Blindness owing to PACG was equal (20%) in both the populations. Female gender was a risk factor in the rural cohort (P = 0.032). Conclusions: The prevalence of both POAG and PACG was greater in urban than in the rural population. Intraocular pressure was a significant risk factor for both POAG and PACG in both cohorts. Increasing age was a significant risk factor for POAG in both cohorts and for PACG in the urban cohort. Female gender was a risk factor for PACG in the rural cohort. There was more blindness owing to PACG than to POAG. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2010; 117: 1352-1359 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c34d32937b47aab2c5e471309541deaf",
  "timestamp": "2025-05-15T02:43:40.263384"
}