{
  "id": 6286,
  "title": "Trends in mortality from road traffic injuries in South Korea, 1983-2017: Joinpoint regression and age-period-cohort analyses",
  "abstract": "Although mortality trends can be influenced by different ages, periods, and cohorts, few studies have demonstrated the age-period-cohort (APC) effect on road traffic injury (RTI) mortality. Moreover, APC effects in Korea have never been documented despite the high mortality rates from RTIs. This study aimed to describe the trends in mortality from RTIs and examine APC effects on RTI mortality in Korea. Using the national death certificate and census mid-year population estimates data during 1983-2017, trends in age-standardized mortality rates from RTIs were analyzed using Joinpoint regression. Intrinsic estimator regression models were used to estimate APC effects on RTI mortality. Consistent with the trend in period effects, RTI mortality increased sharply with the economic growth in the 1980s, decelerated after the implementation of road safety policies in the early 1990s, plummeted owing to the 1997-1998 financial crisis, and gradually decreased from the early 2000s. A J-shaped age effect indicated that the relative risk of road traffic death surged in people aged >= 65 years. Educational expansion from the mid-1950s turned an increasing birth cohort effect into a continuously decreasing trend after peaking around the 1938-1943 birth cohorts. The risk of road traffic death was relatively high among the Korean Generation Y, i.e., those born in 1978-1983. RTI mortality trends in Korea have been affected by diverse socioeconomic changes through cohort and period effects. Despite the recent favorable trend, RTI mortality remains high, especially among older people. Road safety policies to address the burden of RTIs require further improvement.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c370043bc04d14c8aba2a70f0c00a638",
  "timestamp": "2025-05-15T02:56:37.474738"
}