{
  "id": 794,
  "title": "Graph Neural Networks Applied to Money Laundering Detection in Intelligent Information Systems",
  "abstract": "Context: Financial crimes exist in all world countries, and one of the most recurrent ones is Money Laundering (MoL). This crime can harm the country's economy, increase criminality, and compromise social investments. Moreover, it can increase the investment risk factor, raising exchange and interest rates and causing high inflation. In recent years, financial institutions and government agencies have searched for solutions to detect MoL in financial transactions. Problem: Several institutions have employed naive IS for detect MoL. Most systems are based on rules and label a large transactions number as suspicious, which makes the decision process inaccurate and inefficient. Solution: The recent literature presents Graph Neural Networks (GNN) as a promising solution to illegal transaction detection. We applied the Node and Edge Neural Network (NENN) architecture to classification, using the attributes of both bank accounts (vertices) and transactions (edges). IS Theory: In the Intelligent Information Systems context, Machine Learning is a way to improve the decision-making ability of programs in IS. Method: The GCN, Skip-GCN, and NENN architectures were evaluated for the MoL detection problem, comparing two ways of representing transactions as graphs (transactions as vertices or edges). Also, was considered the performance of XG-Boost and Softmax classifiers in the solution. Summary of Results: Results showed better performance when transactions represented the nodes. In addition, NENN+XGBoost was superior for higher class imbalance values, with an F1-score of 74,51 +/- 4,21% to illicit transactions. Contributions and impacts in the IS area: This paper improves the decision-making ability of Anti-Money Laundering systems, helping the organization and efficiency of public and private institutions, and contributing to the fight against corruption. This theme is aligned with the GrandDSI-BR2016-2026.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c37eb477bd9d6da2bbbe502489d710d6",
  "timestamp": "2025-05-15T01:55:08.066507"
}