{
  "id": 195,
  "title": "Regularization methods for sparse ESG-valued multi-period portfolio optimization with return prediction using machine learning",
  "abstract": "In the context of global sustainable development, environmental, social, and governance (ESG) investment has become a frontier topic in the field of asset management. This paper focuses on ESG-valued multi-period portfolio selection problem which incorporates ESG factor into traditional portfolio optimization. Using ESG-valued returns instead of traditional returns, we propose an ESG-valued fused LASSO model to promote an optimal sparse multi-period portfolio strategy. The objective of the model is to minimize a combination of returns and risks with respect to ESG ratings based on classical Markowitz mean-variance framework. The sparsity of the portfolio at each period and the turnover across periods is achieved by the l(1) regularization approach. To improve the out-of-sample performance of the ESG-valued model, we introduce two machine learning methods, namely random forest and support vector regression, to predict the ESG-valued returns. We develop a symmetric alternating direction method of multipliers to solve the regularized optimization model. Additionally, some other sparsity-driven penalty functions are discussed which results in a general framework of multi-period portfolio optimization. Finally, numerical experiments on several real datasets from both in-sample and out-of-sample demonstrate the positive effect of ESG in multi-period portfolio optimization.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c38cd9e856fb44d457700aab54c8313d",
  "timestamp": "2025-05-15T00:40:34.086999"
}