{
  "id": 7782,
  "title": "Pharmacogenetics for Genes Associated with Age-related Macular Degeneration in the Comparison of AMD Treatments Trials (CATT)",
  "abstract": "Purpose: To evaluate the pharmacogenetic relationship between genotypes of single nucleotide polymorphisms (SNPs) known to be associated with age-related macular degeneration (AMD) and response to treatment withranibizumab (Lucentis; Genentech, South San Francisco, CA) or bevacizumab (Avastin; Genentech) for neovascular AMD. Design: Clinical trial. Participants: Eight hundred thirty-four (73%) of 1149 patients participating in the Comparison of AMD Treatments Trials (CATT) were recruited through 43 CATT clinical centers. Methods: Each patient was genotyped for SNPs rs1061170 (CFH), rs10490924 (ARMS2), rs11200638 (HTRA1), and rs2230199 (C3), using TaqMan SNP genotyping assays (Applied Biosystems, Foster City, CA). Main Outcomes Measures: Genotypic frequencies were compared with clinical measures of response to therapy at one year, including mean visual acuity (VA), mean change in VA, 15-letter or more increase in VA, retinal thickness, mean change in total foveal thickness, presence of fluid on OCT, presence of leakage on fluorescein angiography (FA), mean change in lesion size, and mean number of injections administered. Differences in response by genotype were evaluated with tests of linear trend calculated from logistic regression models for categorical outcomes and linear regression models for continuous outcomes. To adjust for multiple comparisons, P <= 0.01 was considered statistically significant. Results: No statistically significant differences in response by genotype were identified for any of the clinical measures studied. Specifically, there were no high-risk alleles that predicted final VA or change in VA, the degree of anatomic response (fluid on OCT or FA, retinal thickness, change in total foveal thickness, change in lesion size), or the number of injections. Furthermore, a stepwise analysis failed to show a significant epistatic interaction among the variants analyzed; that is, response did not vary by the number of risk alleles present. The lack of association was similar whether patients were treated with ranibizumab or bevacizumab or whether they received monthly or pro re nata dosing. Conclusions: Although specific alleles for CFH, ARMS2, HTRA1, and C3 may predict the development of AMD, they did not predict response to anti-vascular endothelial growth factor therapy. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2013;120:593-599 (C) 2013 by the American Academy of Ophthalmology.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c394be2cfb11046776a3f426d8a53ece",
  "timestamp": "2025-05-15T03:12:11.576151"
}