{
  "id": 1080,
  "title": "Mathematical modeling for a new portfolio selection problem in a bubble condition using a new risk measure",
  "abstract": "A portfolio selection model is developed in this study using a new risk measure. The proposed risk measure is based on the fundamental value of stocks. For this purpose, a mathematical model is developed and transformed into an integer linear programming. In order to analyze its efficiency, the actual data of the Tehran Stock Exchange market are used in 12 scenarios to solve the proposed model. In order to evaluate the scenarios, data mining approaches are employed. Data mining methods used in this paper include Adaptive Neuro-Fuzzy Inference System (ANFIS), decision tree, random forest, Fisher Discriminant Analysis (FDA), and Gene Expression Programming (GEP). The best method for scenario evaluation is GEP based on numerical results. Hence, the market values are evaluated by this algorithm. Software packages like MATLAB, GEP xpero tools, and LINGO are used to solve the model. Different trends of market value and fundamental value volatility in the optimum stock portfolio are determined. It is possible to examine the optimum portfolio profitability in different scenarios. By using real-world data, trends are extracted and analyzed. Results show that the developed model can be effectively applied in bubble situations. (C) 2021 Sharif University of Technology. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3948f42956a691567f90ea0d21469b7",
  "timestamp": "2025-05-15T00:51:25.957534"
}