{
  "id": 4674,
  "title": "Assessing catastrophic health expenditure and impoverishment in adult asthma care: a cross-sectional study of patients attending six public health clinics in Klang District, Malaysia",
  "abstract": "BackgroundIn Malaysia, asthma is a common chronic respiratory illness. Poor asthma control may increase out-of-pocket payment for asthma care, leading to financial hardships Malaysia provides Universal Health Coverage for the population with low user fees in the public health system to reduce financial hardship. We aimed to determine out-of-pocket expenditure on outpatient care for adult patients with asthma visiting government-funded public health clinics. We examined the catastrophic impact and medical impoverishment of these expenses on patients and households in Klang District, Malaysia.MethodsThis is a cross-sectional face-to-face questionnaire survey carried out in six government-funded public health clinics in Klang District, Malaysia. We collected demographic, socio-economic profile, and outpatient asthma-related out-of-pocket payments from 1003 adult patients between July 2019 and January 2020. Incidence of catastrophic health expenditure was estimated as the proportion of patients whose monthly out-of-pocket payments exceeded 10% of their monthly household income. Incidence of poverty was calculated as the proportion of patients whose monthly household income fell below the poverty line stratified for the population of the Klang District. The incidence of medical impoverishment was estimated by the change in the incidence of poverty after out-of-pocket payments were deducted from household income. Predictors of catastrophic health expenditure were determined using multivariate regression analysis.ResultsWe found the majority (80%) of the public health clinic attendees were from low-income groups, with 41.6% of households living below the poverty line. About two-thirds of the attendees reported personal savings as the main source of health payment. The cost of transportation and complementary-alternative medicine for asthma were the main costs incurred. The incidences of catastrophic expenditure and impoverishment were 1.69% and 0.34% respectively. The only significant predictor of catastrophic health expenditure was household income. Patients in the higher income quintiles (Q2, Q3, Q4) had lower odds of catastrophic risk than the lowest quintile (Q1). Age, gender, ethnicity, and poor asthma control were not significant predictors.ConclusionThe public health system in Malaysia provides financial risk protection for adult patients with asthma. Although patients benefited from the heavily subsidised public health services, this study highlighted those in the lowest income quintile still experienced financial catastrophe and impoverishment, and the risk of financial catastrophe was significantly greater in this group. It is crucial to ensure health equity and protect patients of low socio-economic groups from financial hardship.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3949e0b3c48a360415bf8555b33d895",
  "timestamp": "2025-05-15T02:39:57.429150"
}