{
  "id": 910,
  "title": "Portfolio optimization based on neural networks sensitivities from assets dynamics respect common drivers",
  "abstract": "We present a framework for modeling asset and portfolio dynamics, incorporating this information into portfolio optimization. We define drivers for asset and portfolio dynamics and their optimal selection. For this framework, we introduce the Commonality Principle, providing a solution for the optimal selection of portfolio drivers as the common drivers. Portfolio constituent dynamics are modeled by Partial Differential Equations, and solutions approximated with neural networks. Sensitivities with respect to the common drivers are obtained via Automatic Adjoint Differentiation. Information on asset dynamics is incorporated via sensitivities into portfolio optimization. Portfolio constituents are embedded into the space of sensitivities with respect to their common drivers, and a distance matrix in this space called the Sensitivity matrix is used to solve the convex optimization for diversification. The sensitivity matrix measures the similarity of the projections of portfolio constituents on a vector space formed by common drivers' returns and is used to optimize for diversification on both idiosyncratic and systematic risks while adding directionality and future behavior information via returns dynamics. For portfolio optimization, we perform hierarchical clustering on the sensitivity matrix. The clustering tree is used for recursive bisection to obtain the weights. To the best of the author's knowledge, this is the first time that sensitivities' dynamics approximated with neural networks have been used for portfolio optimization. Secondly, that hierarchical clustering on a matrix of sensitivities is used to solve the convex optimization problem and incorporate the hierarchical information of these sensitivities. Thirdly, public and listed variables can be used to obtain maximum idiosyncratic and systematic diversification by means of the sensitivity space with respect to optimal portfolio drivers. We reach over -performance in many experiments with respect to all other out -of -sample methods for different markets and real datasets. We also include a recipe for the methodology to increase performance even further, and tackle the main issues in portfolio management such as regimes, non-stationarity, overfitting, and selection bias.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c39b6fb9f5e68f3112667f9a60e9a005",
  "timestamp": "2025-05-15T00:49:36.311495"
}