{
  "id": 6247,
  "title": "Infections Caused by Carbapenemase-Producing Klebsiella pneumoniae: Microbiological Characteristics and Risk Factors",
  "abstract": "The spread of carbapenemase-producing Klebsiella pneumoniae (CPKP) worldwide is a serious problem. This retrospective, matched case-control, parallel study in a tertiary teaching hospital analyzed the microbiological and clinical characteristics of CPKP infection, focusing on the risk factors for carbapenem resistance and patient mortality. The hospital department with the highest incidence of CPKP infections was the intensive care unit. All CPKP strains examined were positive for bla(kpc-2), and 84.8% of CPKP were ST11. Hypervirulent phenotype was identified in 22.7% of the patients with CPKP, with these strains displaying a high incidence of positivity for entB, ybtS, and iutA. Multivariate conditional logistic regression analysis demonstrated that Pitt bacteremia score >4, prior stomach tube, continuous renal replacement therapy (CRRT), and previous carbapenem exposure were associated with CPKP infection. Higher albumin concentration and use of cephalosporins after diagnosis were strong prognostic factors for crude 28-day mortality. Further, high APACHE II score, CRRT, use of carbapenems after diagnosis, and bacteremia were risk factors for crude in-hospital mortality. CPKP isolates showed clonal spread and were resistant to most antibiotics, resulting in higher financial burden. Critical illness was associated with increased mortality.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3a2053d7f17d9e1c79ddb3599de0dfb",
  "timestamp": "2025-05-15T02:56:11.005710"
}