{
  "id": 8128,
  "title": "Suicidal Ideation and Predictors of Psychological Distress during the COVID-19 Pandemic in Eswatini: A Population-Based Household Telephone Survey",
  "abstract": "The unpredictability of the COVID-19 pandemic can induce psychological distress in individuals. We investigated perceived stressors, prevalence of psychological distress and suicidal ideation, and predictors of psychological distress among adults during the COVID-19 pandemic in Eswatini. This study was a cross-sectional, population-based household telephone survey of 993 conveniently sampled adults (18+ years) from all the four administrative regions of Eswatini. Data were collected between 9 June and 18 July 2020 during the first wave of the COVID-19 pandemic, when the country was under a partial lockdown. COVID-19-related psychological distress was assessed using the Kessler 6-item Psychological Distress Scale (K6). We performed weighted modified Poisson regression analyses to identify significant predictors of moderate/severe psychological distress (K6 scores: >= 5). The weighted prevalences of moderate (K6 scores: 5-12) and severe psychological distress (K6 scores: >= 13) were 41.7% and 5.4%, respectively. Participants reported several perceived COVID-19-related stressors, including worries and fears of the contagion-specific death, serious need for food and money, and concerns about loss of income or business. The weighted prevalence of suicidal ideation was 1.5%. Statistically significant predictors of increased risk for moderate/severe psychological distress included living in the Hhohho and Manzini regions; feeling not well informed about COVID-19; feeling lonely; having received COVID-19 food or financial relief from the government; feeling burdened by the lockdown; being married; and being youth (18-24 years). The results call for the government to urgently augment the provision of mental health services during the pandemic. Mental health practitioners and programs may use several stressors and risk factors identified in this study to inform interventions and government policies aimed at reducing psychological distress induced by the pandemic.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3a57f8283624c0a703615e61177de71",
  "timestamp": "2025-05-15T03:15:38.375656"
}