{
  "id": 5942,
  "title": "Potential Impact of Modifiable Clinical Variables on Length of Stay After First-Time Cardiac Surgery",
  "abstract": "Background. Recent financial challenges highlight the importance of accurate prediction of length of hospital stay (LOS). We assessed reliability of The Society of Thoracic Surgeons (STS) risk prediction for extended and shorter LOS and examined whether modifiable clinical variables are associated with LOS in first-time cardiac surgery patients. Methods. Isolated aortic valve, mitral valve, and coronary artery bypass graft surgery patients since 2008 were included (n = 3,472). Multivariate regression was used to evaluate nonmodifiable and potentially modifiable (preoperative hematocrit, hemoglobin A(1c), body mass index, current smoker, major perioperative morbidity, and blood product transfusion) predictors of LOS in days. Results. Mean age was 63.9 +/- 11.2 years, 76% were males, and mean STS mortality risk was 1.9% +/- 3.2%. Median (interquartile range) LOS was 4 (3 to 6) days. Predicted STS risk was 6.2% +/- 7.1% for extended LOS (> 14 days) and 48.3% +/- 20.2% for short LOS (< 6 days). Extended LOS was observed in 5.2% of patients (observed versus expected, 0.84; p = 0.019). Observed short LOS was better than predicted (67.8%; observed versus expected, 1.40; p < 0.001). Inclusion of modifiable variables in the LOS prediction model was significant (p < 0.001). Significant modifiable predictors were lower hematocrit, higher hemoglobin A(1c), major morbidity, and transfusion. Longer predicted LOS from the model correlated with longer actual LOS (rs = 0.63; p < 0.001). Applying the prediction equation from the model to a hypothetical average patient, predicted LOS was 4.6 days. Conclusions. The STS risk model was reliably predictive of short and extended LOS but did not allow prediction of exact LOS in days. Accounting for potentially modifiable clinical variables, such as low hematocrit and blood transfusion, especially in elective patients, should lead to shorter LOS, higher satisfaction, and reduced financial burden. (C) 2015 by The Society of Thoracic Surgeons",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3c00149b67f06b2b412ccc30c19ce48",
  "timestamp": "2025-05-15T02:53:03.110361"
}