{
  "id": 4293,
  "title": "Species and population diversity in Pacific salmon fisheries underpin indigenous food security",
  "abstract": "1. Indigenous people arc considered to be among the most vulnerable to food insecurity and biodiversity loss. Biodiversity is cited as a key component of indigenous food security; however, quantitative examples of this linkage are limited. 2. We examined how species and population diversity influence the food security of indigenous fisheries for Pacific salmon (Oncorhynchus species). We compared two dimensions of food security- catch stability (interannual variability) and access (season length)- across a salmon diversity gradient for 21 fisheries on the Fraser River, Canada, over 30 years, using linear regression models. We used population diversity proxies derived from a range of existing measures because population-specific data were unavailable. 3. While both population and species diversity were generally associated with higher catch stability and temporal access, population diversity had a stronger signal. Fisheries with access to high species diversity had up to 1.4 times more stable catch than predicted by the portfolio effect and up to 1.2 times longer fishing seasons than fisheries with access to fewer species. Fisheries with access to high population diversity had up to 3.8 times more stable catch and three times longer seasons than fisheries with access to fewer populations. 4. Catch stability of Chinook Oncorhynchus tshawytschct and sockeye Oncorhynchus nerka fisheries was best explained by the number of populations and conservation units, respectively, that migrate past a fishery en route to spawning grounds. Similar population diversity metrics were important explanatory variables for season length of sockeye, pink Oncorhynchus god) uscha, coho Oncorhynchus kisutch and churn Oncorhynchus keta fisheries. 5. Synthesis and applications. We show an empirical example of how multiple scales of biodiversity support food security across a large watershed and suggest that protecting fine-scale salmon diversity will help promote food security for indigenous people. The scales of environmental assessments need to match the scales of the socio-ecological processes that will be affected by development. We illustrate that upstream projects that damage salmon habitat could degrade the food security of downstream indigenous fisheries, with implications to Canadian indigenous people and to watersheds around the world where migratory fishes support local fisheries.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3c85e945caea8dfdc8f1d98d353934c",
  "timestamp": "2025-05-15T01:25:50.473034"
}