{
  "id": 2433,
  "title": "Role of social support in the relationship between financial hardship and multimorbidity-a causal mediation analysis",
  "abstract": "Background: Social disadvantage is a key determinant of multimorbidity. Pathways through which social disadvantage leads to multimorbidity are yet undefined. In this study, we first examined the causal effect of moving into financial hardship on multimorbidity among Australian adults, and then the role of social support as a mediator of the relationship between financial hardship and multimorbidity. Methods: Data were obtained from the Household, Income and Labour Dynamics in Australia (HILDA) Survey (2009-2013). We identified individuals who moved into financial hardship between 2010 and 2011 (n = 5775). Inverse probability treatment weighting with regression adjustment was used to examine the relationship between financial hardship and multimorbidity. Causal mediation analysis was applied to decompose the total effect of financial hardship on multimorbidity into the proportion attributable to social support and the proportion not occurring through measured pathways. We accounted for baseline covariates including age, sex, marital status, educational attainment, employment status, income, country of birth, multimorbidity and social support. Bootstrapping with 1000 replications was used to calculate 95% confidence intervals (CIs). Results: The risk of multimorbidity was higher in those with financial hardship by 19% [relative risk 1.19 (95% CI: 1.02-1.37) and absolute risk difference 0.036 (95% CI: 0.004-0.067)] than those without financial hardship. Social support accounted for 30% of the total effect of financial hardship on multimorbidity, risk difference 0.009 (95% CI: 0.003-0.018). Conclusions: Financial hardship leads to increased risk of multimorbidity. Interventions directed at increasing social support among those in financial hardship may reduce their risk of multimorbidity.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3dfdcc89763a00baa4a3b63ff1b2180",
  "timestamp": "2025-05-15T02:15:26.982700"
}