{
  "id": 2557,
  "title": "Mortality from Suicide in the Municipalities o Mainland Portugal: Spatio-Temporal Evolution between 1980 and 2015",
  "abstract": "Introduction: Suicide is considered a public health priority. It is a complex phenomenon resulting from the interaction of several factors, which do not depend solely on individual conditions. This study analyzes the spatio-temporal evolution of suicide mortality between 1980 and 2015, identifying areas of high risk, and their variation, in the 278 municipalities of Continental Portugal.& para;& para;Material and Methods: Based on the number of self-inflicted injuries and deaths from suicide and the resident population, the spatio-temporal evolution of the suicide mortality rate was assessed via: i) a Poisson joinpoint regression model, and ii) spatio-temporal clustering methods.& para;& para;Results: The suicide mortality rate evolution showed statistically significant increases over three periods (1980 - 1984; 1999 - 2002 and 2006 - 2015) and two statistically significant periods of decrease (1984 - 1995 and 1995 - 1999). The spatio-temporal analysis identified five clusters of high suicide risk (relative risk >1) and four clusters of low suicide risk (relative risk < 1).& para;& para;Discussion: The periods when suicide mortality increases seem to overlap with times of economic and financial instability. The geographical pattern of suicide risk has changed: presently, the suicide rates from the municipalities in the Center and North are showing more similarity with those seen in the South, thus increasing the ruralization of the phenomenon of suicide.& para;& para;Conclusion: Between 1980 and 2015 the spacio-temporal pattern of mortality from suicide has been changing and is a phenomenon that is currently experiencing a growing trend (since 2006) and is of higher risk in rural areas.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3e324a103464c88b35fb27a8f3a64b1",
  "timestamp": "2025-05-15T02:16:32.725318"
}