{
  "id": 7957,
  "title": "It's time to talk fathers: The impact of paternal depression on parenting style and child development during the COVID-19 pandemic",
  "abstract": "This study aimed to understand the relationship between paternal depression, parenting behavior and child developmental outcomes during the SARS-CoV-2 (COVID) pandemic. In addition, the paternal experience of the pandemic, such as the impact of lockdowns, was explored. Fathers of children aged 6-11 years old (n = 87) were recruited for an online cross-sectional survey. Data was collected through questionnaires and open-ended comments. Regression analysis indicated a higher level of self-reported depressive symptomology in fathers more severely impacted by the pandemic across financial, familial and health domains. Further, COVID-19 impact, but not paternal depression, was linked to fewer authoritative parenting behaviors, characterized as lower warmth and responsiveness. Paternal pandemic impact and depression symptoms were independently predictive of child cognitive scores, and both were associated with emotional and behavioral outcomes. A content analysis of open-ended responses from fathers noted that concerns for their children, work and mental health were most prevalent during the pandemic. However, several responders also reported no change or positive facets of lockdowns related to the pandemic. These finds are discussed in the context of a possible behavioural mechanism of action accounting for the effect of these factors on child development. Clinical implications include targeted interventions for at risk groups as well as psychoeducation for fathers that acknowledge difference in paternal coping and support seeking.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3e67731340dd71173c3fc5609e89d84",
  "timestamp": "2025-05-15T03:13:30.726049"
}