{
  "id": 8333,
  "title": "Violent death in old age-an analysis of autopsy reports",
  "abstract": "Background More and more people in Germany reach increasingly higher ages. The risk of victimization is unclear because the lack of reliable numbers impedes assessment of the current relevance of violent death in old age. Objective To close that gap this article presents epidemiological data obtained from autopsy reports, for the most frequent circumstances of violent death in old age and discusses the characteristics and means of prevention. Material All autopsy files of the Institute of Legal Medicine and Forensic Sciences at the Charite-Universitatsmedizin Berlin from 2005 to 2016 were analyzed with respect to age, circumstances of death and motive. A total of 11,381 cases were included. Results Of all autopsied persons, 51.8% were aged 60 years or older. The homicide and suicide percentages of all cases were lower within the 60+ years age group in comparison to the younger group. Financial gain was the main motive in the case of 25.6% of people killed aged 60 years and over. Frequent suicide motives were diseases, particularly depression for women and malignant tumors as well as partnership issues for men. Being overburdened with taking care of the partner was a problem for men in particular. Dyadic death, i.e. the entirety of joint suicides and homicide-suicides, gained in importance within the 60+ years age group. Conclusion Fatal violence against older persons is presumably underestimated. The classification of dyadic death turned out to be impractical. Therefore, a replacement by erotic-aggressive, symbiotic and parasitic death is suggested. Suicide with subsequent suicide is described for the first time and dubbed suicide-suicide. Prevention by social inclusion of old people is essential.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3e97fd2457172f4e67accf92d44ca81",
  "timestamp": "2025-05-15T03:17:49.128455"
}