{
  "id": 3057,
  "title": "Round offer prices in M&A transactions: costly negotiation and psychological preference",
  "abstract": "PurposeThe authors of this study aim to investigate possible explanations of the prevalence of price clustering in the final offer prices of mergers and acquisitions (M & A).Design/methodology/approachThe authors use final offer price in M & A deals to investigate the price clustering phenomena. The authors used regressions and logistic regressions to examine potential factors that might affect pricing strategy by looking into one-time acquirers and experienced serial acquirers.FindingsPrice clustering increases with negotiation uncertainties characterized as competitive bidding, number of bidders, challenged deals and duration. Moreover, the authors find persistent price clustering in experienced serial acquirers that are more experienced and better equipped with handling uncertainties, suggesting a preference of using round numbers regardless of levels of uncertainties. The authors' evidence shows that price clustering results from a combination of Harris' (1991) costly negotiation hypothesis where round prices may be used to lower search costs and psychological bias and preference.Originality/valueThe authors appear to be the first to investigate alternative theories that support M & A offer price clustering behavior, finding that both the costly negotiation and psychological bias and preference theories apply to M & A final price formation. Thus, the authors' major contribution, specific to the M & A process, is a clarification of physical and psychological factors associated with bidding and negotiation behavior. The authors are confident that the authors' study impacts conventional knowledge regarding M & A deal negotiation strategies, including bidding behavior, contract negotiation, financial analysis, management practices and risk management.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c3effe3393a26a14d68f2584d73ee45d",
  "timestamp": "2025-05-15T02:21:52.302923"
}