{
  "id": 9199,
  "title": "Female audit partners and accruals quality: evidence from Indonesia",
  "abstract": "Purpose This study examines the association between accruals quality and gender of the firm's audit engagement partner in Indonesia. Specifically, prior studies provide evidence that gender-based difference in diligence, conservatism and risk tolerance, it is plausible that female auditors may improve audit quality. Indonesia provides a valuable research setting to investigate the issue, as it is mandatory to disclose the identity of the audit partners in the audit reports. Design/methodology/approach This study employs multivariate regression model to test the hypothesis, which examines the association between accruals quality and audit partners gender. Using a sample of Indonesian publicly listed firms, we run a panel of regression of audit quality measure proxied by abnormal accruals on female auditor variable and firm-specific controls. To triangulate the results, we also conduct sensitivity analysis using high and low category of abnormal accruals, an alternative measure of accruals quality (i.e. Beneish's M score) and propensity score matching (PSM). Findings We find that firms with female audit engagement partners are not associated with smaller abnormal accruals, thereby implying that female auditors may not constrain effects on earnings management. In other words, gender is not an important predictor for audit quality in Indonesia. Research limitations/implications We are not able to use broader measures of audit quality such as GAAP violations/restatement, litigation or audit fee. This is because the Indonesian setting somewhat limits us to collect them due to lack of regulatory actions and/or database availability. Practical implications This study will contribute to the regulators (such as Financial Service Authorities/OJK) and professionals, on the effectiveness of female audit partners in improving audit quality. The study can be used as an evidence to support the gender equality in the accounting and audit industry. Social implications Our findings suggest that auditor gender does not lead to the improvement of accruals quality in Indonesia. Given the fact that only 14% of firms in our sample audited by female audit partners, it is plausible that the positive traits of female top managers may not transmit to the overall audit process. As such, it is important to encourage more female involvement in top position of auditing and accounting industry is required to advance the profession and its positive impact to the society. Originality/value There are no prior studies in Indonesia examining the effect of audit partner gender on accruals quality using archival data. As such, this research will be the first to document such evidence and therefore can improve our understanding on the role of auditor characteristic on audit quality. We also respond to the call from DeFond and Zhang (2014) to push analysis of audit quality to the individual auditor level by examining the gender of audit partner.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c403d5e82772ae6c0c353c9a2b4c2972",
  "timestamp": "2025-05-15T03:26:26.029495"
}