{
  "id": 4040,
  "title": "Evaluation of Short-Term Relationships between Selected Investment Funds and the Capital Market in Poland",
  "abstract": "Investment funds (FIO) as collective investment institutions, place their funds in the stock exchange, thus, participate in financing enterprises. It is true that this share is at the level of several percentage points, but asset transfers at this level can significantly affect the valuation of assets. On the other hand, through the valuation of assets, the stock exchange may also affect the value of participation units of the funds investing in shares. Therefore, the relationship between investment funds and the stock exchange becomes bidirectional. The main aim of the analysis herein is to examine the interaction between the valuation of participation units of selected FIO and the capital market. The analysis includes the share funds existing since 2003. The reference point is the Warsaw Stock Exchange (four main indices: WIG, WIG20, mWIG40 and sWIG80), where these funds invest their cash. The presented analysis is carried out in two stages. The first, an assessment of the interaction between changes in the valuation of fund units and changes in the quotations of the four main WSE indices in Warsaw: WIG, WIG20, mWIG40 and sWIG80. The Granger causality test is used for this purpose. In the second stage, the funds were classified, considering the results of the causality test and portfolio structure. For the clustering, we applied k-means methods. The obtained results indicate two main findings. First, the vast majority of funds, in relation to WIG (whole market index) and WIG20 (blue-chip index) are characterized by causality, which can be described as bilateral (Index <-> FIO). In turn, the FIO relationship with the mWIG40 (medium companies index) and sWIG80 (small companies index) can be described as one-sided (Index. FIO). Such a situation is undoubtedly the outcome of the fact that the blue-chip equities have a significant share in the funds' portfolios. Second, the results of cluster analysis point, were that obtained clusters of funds are more diversified because of the structure of the portfolios than the interactions with the main stock exchange indices.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c418869194e4418694edf532619ed4a3",
  "timestamp": "2025-05-15T01:23:27.262624"
}