{
  "id": 7280,
  "title": "THE PRO-ENVIRONMENTAL BEHAVIOR PATTERNS OF COLLEGE STUDENTS ADAPTING TO CLIMATE CHANGE",
  "abstract": "As the impact of climate change is increasingly intense, environmental educators of higher education would like to know the influencing factors for college students to proceed financial strategies, such as flood insurance or energy taxes, to adapt climate change; however, the sustainable environmental education provided by most colleagues still lags far behind the pace of business and government. The research is aimed at eight colleagues in Taiwan and is an undergraduate student taking courses in general environmental education. As diverse courses integrate climate change issues, distributed 1,000 questionnaires were proportionally allocated to each university according to the number of students who had taken the course; a total of 866 questionnaires were recovered. The pro-environmental behavior model be validated, and assess the correlations among risk perception, economic incentives, intrinsic motivation, sacrifice for the environment, place attachment, cheerful emotion, and social norm with partial least squares regression. For college students with high or medium knowledge on climate change, this research demonstrated that if pro-environmental behaviors bring cheerful feeling, they will induce their intrinsic motivation; meanwhile, because of environmental sacrifice and social norms, pro-environmental behaviors will trigger cheerful feeling.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c422cf42040c980e2b5349a9b42252b2",
  "timestamp": "2025-05-15T03:07:02.599073"
}