{
  "id": 80,
  "title": "Hodrick-Prescott filter-based hybrid ARIMA-SLFNs model with residual decomposition scheme for carbon price forecasting",
  "abstract": "Accurate carbon pricing guidance is of great importance for the inhibition of excessive carbon dioxide emissions. Aiming at improving forecast performance, a number of carbon price forecasting models have been proposed based on the combination or multiscale hybrid frameworks. However, most of these hybrid models cannot easily cast a perfect reflection of erratic fluctuation in carbon trading schemes due to lack of judgment on the trend or inaccurate trend reconstruction. In this study, a novel filter-based modeling with Hodrick-Prescott (HP) filter, that can identify repeated up and down structural features around a certain carbon price, negotiates the obstacle of the parallel-series hybridization concerning the linear and the nonlinear model identification. The residual decomposition scheme with adaptive noise is carried out on the random and nonlinear component for error correction to filter-based models. Moreover, Bayesian optimization adjusts the structure of seven single-hidden layer feedforward neural networks (SLFNs) and the inputs to provide the best generalization performance. The proposed filter-hybrid model using kernel extreme learning machine as the final nonlinear integrator has better stability to the parameters, and has the superiority over the parallel-series and allocation-based models from a statistical perspective. Comparing with existing data-driven models, our proposed model is competitive in view of prediction accuracy and time cost in the majority of carbon futures trading cases.(C) 2022 Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c44727a319a0ba1f397afbb1df8302bc",
  "timestamp": "2025-05-15T01:26:55.089156"
}