{
  "id": 8304,
  "title": "The prevalence and correlates of elder abuse and neglect in a rural community of Negeri Sembilan state: baseline findings from The Malaysian Elder Mistreatment Project (MAESTRO), a population-based survey",
  "abstract": "Background As Malaysia is fast becoming an ageing nation, the health, safety and welfare of elders are major societal concerns. Elder abuse is a phenomenon recognised abroad but less so locally. This paper presents the baseline findings from the Malaysian Elder Mistreatment Project (MAESTRO) study, the first community-based study on elder abuse in Malaysia. Design Cross-sectional study, analysing baseline findings of a cohort of older adults. Setting Kuala Pilah district, Negeri Sembilan state, Malaysia. Objectives To determine the prevalence of elder abuse among community dwelling older adults and its associated factors. Participants A total of 2112 community dwelling older adults aged 60 years and above were recruited employing a multistage sampling using the national census. Primary and secondary outcome measures Elder abuse, measured using a validated instrument derived from previous literature and the modified Conflict Tactic Scales, similar to the Irish national prevalence survey on elder abuse with modification to local context. Factors associated with abuse and profiles of respondents were also examined. Results The prevalence of overall abuse was reported to be 4.5% in the past 12 months. Psychological abuse was most common, followed by financial, physical, neglect and sexual abuse. Two or more occurrences of abusive acts were common, while clustering of various types of abuse was experienced by one-third of abused elders. Being male (adjusted OR (aOR) 2.15, 95% CI 1.23 to 3.78), being at risk of social isolation (aOR 1.96, 95% CI 1.07 to 3.58), a prior history of abuse (aOR 3.28, 95% CI 1.40 to 7.68) and depressive symptomatology (aOR 7.83, 95% CI 2.88 to 21.27) were independently associated with overall abuse. Conclusion Elder abuse occurred among one in every 20 elders. The findings on elder abuse indicate the need to enhance elder protection in Malaysia, with both screening of and interventions for elder abuse.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c44b9e78de074f025541e374e145e0f1",
  "timestamp": "2025-05-15T03:17:21.586080"
}