{
  "id": 102,
  "title": "Machine Learning-Based Analysis of Cryptocurrency Market Financial Risk Management",
  "abstract": "Cryptocurrency is one of the famous financial state in all over the world which cause several type of risks that effect on the intrinsic assessment of risk auditors. From the beginning the growth of cryptocurrency gives the financial business with the wide risk in term of presentation of money laundering. In the institution of financial supports such as anti-money laundering, banks and secrecy of banks proceed as a specialist of risk, manager of bank and officer of compliance which has a provocation for the related transaction through cryptocurrency and the users who hide the illegal funds.In this study, the Hierarchical Risk Parity and unsupervised machine learning applied on the cryptocurrency framework. The process of professional accounting in term of inherent risk connected with cryptocurrency regarding the occurrence likelihood and statement of financial impact. Determining cryptocurrency risks comprehended to have a high rate of occurrence likelihood and the access of private key which is unauthorized. The professional cryptocurrency experience in transaction cause the lower risk comparing the less experienced one. The Hierarchical Risk Parity gives the better output in term of returning the adjusted risk tail to get the better risk management result.The result section shows the proposed model is robust to various intervals which are re-balanced and the co-variance window estimation.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c45d3117f42f565fe7a44e5c0639ef66",
  "timestamp": "2025-05-17T10:37:00.348499"
}