{
  "id": 4984,
  "title": "A Risk Assessment Framework for Analyzing Risks Associated with a Systems Engineering Process",
  "abstract": "Systems Engineering Process (SEP) is the systemic approach to design, development and implementation of a reliable and trustworthy system that satisfies its specified requirements. However, beyond the precision of the plans developed through SEP, it is also essential to consider uncertainties as well as emergent properties created through the process that might lead to negative consequences and subsequent financial losses throughout the system's life cycle. Therefore, assessing the risks associated with various stages of the SEP is among the key factors in efficiency of engineered systems and one of the major challenges that a systems engineer has to encounter. This paper proposes a Risk Assessment Framework (RAF) for analyzing risks associated with the process of systems engineering. RAF proposes a systemic approach to risk management and analysis through identification, classification, and prioritization of risks associated with different stages of a systems engineering process. The framework is subsequently applied to an illustrative example through which hundreds of subject matter experts participate in the risk evaluation process. Enterprises involved in systems engineering activities can use the findings of this research as a guideline to develop their risk management strategies.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c466cc0cc211a97ae88a4370c0c36ce7",
  "timestamp": "2025-05-15T02:43:06.757260"
}