{
  "id": 8997,
  "title": "Concurrent Proximal Fractures Are Rare in Distal Forearm Fractures: A National Cross-sectional Study",
  "abstract": "Introduction: Distal forearm fractures (DFF) account for 1.5% of emergency department (ED) visits in the United States. Clinicians frequently obtain imaging above/below the location of injury to rule out additional injuries. We sought to determine the incidence of associated proximal fractures (APF) in the setting of DFF and to evaluate the imaging practices in a nationally representative sample of EDs. Methods: We queried the 2013 National Emergency Department Sample using International Classification of Diseases, 9th edition, diagnostic codes for DFF and APF. Current Procedural Technology codes identified associated imaging studies. We calculated national estimates using a weighted analysis of patient and hospital-level characteristics associated with APF and imaging practices. An analysis of costs estimated the financial impact of additional imaging in patients with DFF using Medicare reimbursement to approximate costs according to the 2018 Medicare Physician Fee Schedule. Results: In 2013, an estimated 297,755 ED visits (weighted) were associated with a DFF, of which 1.6% (4836 cases) had an APF. The incidence of APF was lower among females (odds ratio [OR] (0.76); 95% confidence interval [CI], 0.64-0.91) but higher in metropolitan teaching hospitals compared to metropolitan non-teaching hospitals (OR [2.39]; 95% Cl, 1.43-3.99) and Level 1 trauma centers (OR [3.9]; 95%, 1.91-7.96) compared to non-trauma centers. Approximately 40% (n = 117,948) of those with only DFF received non-wrist radiographs and 19% (n = 55,236) underwent non-wrist/non-forearm imaging. Factors independently associated with additional imaging included gender, payer, patient and hospital rurality, hospital region, teaching status, ownership, and trauma center level. Nearly $3.6 million (2018 U.S. dollars) was spent on the aforementioned additional imaging. Conclusion: Despite the frequency of proximal imaging in patients with DFF, the incidence of APF was low. Further study to identify risk factors for APF based on mechanism and physical examination factors may result in reduced imaging and decreased avoidable healthcare spending.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c4690e3d1f0dc6f6306d94a2eb072ef7",
  "timestamp": "2025-05-15T03:24:26.389577"
}