{
  "id": 937,
  "title": "Smart city and cyber-security; technologies used, leading challenges and future recommendations",
  "abstract": "Today, some cities around the world have tended to use new technologies and become smart city. New technologies improve the quality of citizens' life. However, the use of any technology raises new issues and challenges. In a smart city, the vulnerable action of an individual or organization can put the entire city at risk. Due to the reliance of various components of smart cities on information and communication technology, cyber-security challenges (such as information leakage and malicious cyber-attacks) in this field affect smart cities behavior. Therefore, in order to respond to the enthusiastic acceptance of global smart city technologies, cyber security must develop in same direction. The aim of this paper is survey and discus on explanation of cyber security, smart cities, and survey of available relevant literature on security in that technology. For this purpose, the present study focuses on the four main components of a smart city, i.e. smart grid, Smart building, Smart transportation system, and Smart healthcare. In particular, summary of two deep learning method and cyber-security programs as well as technology correlation in smart cities are discussed. Furthermore, effective functional solutions in maintaining cyber-security and user privacy in smart cities are explained. The next progress trends of smart city with cyber security are described. Solutions need to be devised to address each of the security issues. The research in this study showed that meeting these challenges depends on the hard work of governments, developers of equipment and software and companies providing IT security services. In addition, designing flexible systems with high information protection capabilities is essential to prevent serious security incidents as these incidents can lead to disastrous financial, data, credit and loss of public trust. (C) 2021 The Author. Published by Elsevier Ltd.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c47214153850e55ab08ef1ca833608b6",
  "timestamp": "2025-05-15T01:44:35.463566"
}