{
  "id": 4033,
  "title": "Corporate governance and risk management in Islamic and convectional financial institutions: explaining the role of institutional quality",
  "abstract": "PurposeThis study aimed at exploring the differential effects of different corporate governance (CG) indicators on risk management practices in Islamic financial institutions (IFIs) and conventional financial institutions (CFIs) of Pakistan. It also investigated the moderating role of institutional quality (IQ) in shaping the effects of CG practices on financial institutions of Pakistan. Design/methodology/approachA sample of 57 financial institutions including commercial banks, insurance companies and Modarba companies over the period 2006-2017 is used to carry out the empirical analysis. The authors applied the robust two-step system-generalized method of moments estimator, which is also called the dynamic panel data estimator. They also built the PCA-based composite index of CG and IQ by using different indicators to investigate the moderating role of IQ. They used three proxies for risk taking, five for CG and one for Shari'ah governance. To test the validity of the instruments, they applied the Arellano and Bond's (1991) AR (1) and AR (2) tests and the J-statistic of Hansen (1982). FindingsThe results provided strong evidence that several individual characteristics of CG and the composite index are significantly related to the operational risk, the liquidity risk and the Z-score (a proxy for solvency risk). The results also revealed that IQ significantly and substantially contributes in reducing the level of risks. Finally, the estimation results indicated that the effects of CG on risk management are significantly different at IFIs and CFIs. This differential impact is mainly attributed to the fundamental differences in business models, operational strategies and contractual obligations of both types of institutions. Practical implicationsThe findings of this study are important for enhancing our understanding of how CG relates to risk taking in Islamic and conventional financial services industries and how good quality institutions are important for formulating the governance effects on the risk-taking behavior of financial institutions. The findings suggest that a suitable size of board should be chosen to manage the risk effectively. As the findings show that the risk-taking behavior of IFIs differs from that of CFIs, the regulators and international standard setting bodies should tailor the regulatory frameworks accordingly. Originality/valueThis paper is different from the existing studies in four aspects. First, to the best of the authors' knowledge, this is the first empirical investigation in Pakistan, which does the comparison of IFIs and CFIs while examining the impacts of CG on risk management. Second, the paper constructs the composite index of CG by considering several different indicators of governance and examines the combined effect of governance indicators on risk management process. Third, this paper adds to the growing literature on the role of IQ by investigating whether it acts as a moderator between CG structures and risk management and if yes, then whether this moderating role is different for IFIs and CFIs. Finally, the paper builds upon the existing research work on the CG effects for different types of financial institutions by proposing a single regression based analytical framework for comparing the effects across two different types of institutions, harvesting the benefits of higher degrees of freedom and avoiding/minimizing the measurement error.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c47778c480bd04e327de7f9345196032",
  "timestamp": "2025-05-15T02:32:27.523832"
}