{
  "id": 314,
  "title": "Fuzzy Levy-GJR-GARCH American Option Pricing Model Based on an Infinite Pure Jump Process",
  "abstract": "This paper focuses mainly on issues related to the pricing of American options under a fuzzy environment by taking into account the clustering of the underlying asset price volatility, leverage effect and stochastic jumps. By treating the volatility as a parabolic fuzzy number, we constructed a Levy-GJR-GARCH model based on an infinite pure jump process and combined the model with fuzzy simulation technology to perform numerical simulations based on the least squares Monte Carlo approach and the fuzzy binomial tree method. An empirical study was performed using American put option data from the Standard & Poor's 100 index. The findings are as follows: under a fuzzy environment, the result of the option valuation is more precise than the result under a clear environment, pricing simulations of short-term options have higher precision than those of medium- and long-term options, the least squares Monte Carlo approach yields more accurate valuation than the fuzzy binomial tree method, and the simulation effects of different Levy processes indicate that the NIG and CGMY models are superior to the VG model. Moreover, the option price increases as the time to expiration of options is extended and the exercise price increases, the membership function curve is asymmetric with an inclined left tendency, and the fuzzy interval narrows as the level set a and the exponent of membership function n increase. In addition, the results demonstrate that the quasi-random number and Brownian Bridge approaches can improve the convergence speed of the least squares Monte Carlo approach.",
  "year": 2018,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c4863f0949cec0e8a078f43b8fd71919",
  "timestamp": "2025-05-15T01:30:46.315052"
}