{
  "id": 4671,
  "title": "Crop Disease Diagnosis using Deep Learning Models",
  "abstract": "Diseases and pesticides are the most common problems of wheat being faced by the farmers. These are commonly formed due to improper land preparation, unconditional rains, variable climate conditions, and irregular watering. The impact of these factors on the wheat crop could ultimately affect the economy of the country. Timely detection of the diseases could avoid many financial and time-based losses and help in applying relevant disease management methods. The old manual methods of detecting the diseases are based on personal observations. These have not much contributed due to: a) High frequency of errors, b) Time consuming, c) In case of detecting the large area of the crop by the humans, the observation may not be accurate, d) Risk of spreading disease while applying manual methods. User-friendly applications with self-learning ability are primarily required to help the farmers to deal with the disease problems. In this paper, an effective and efficient approach has been presented for the timely diagnosis of wheat disease and to provide relevant management methods. This user-friendly application facilitates various types of users in the management of crop diseases. The data set has been obtained from online sources and Convolutional Neural Network (CNN) has been used to train the data. The proposed approach has gained significant accuracy in the detection of diseases.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c488c914f9b2847898c2ecdc37ffe387",
  "timestamp": "2025-05-15T02:39:57.421658"
}