{
  "id": 4386,
  "title": "Internationalisation and financial performance: in the case of global automotive firms",
  "abstract": "Purpose Given the mixed evidence on the relationship between internationalisation and firm performance, the purpose of this study is to investigate the effect of internationalisation on the financial performance in the setting of a matured and stagnant market, the global automotive industry. Design/methodology/approach The study uses 37 automotive manufacturers covering from 2000 to 2015. Panel regression analyses were used to estimate the relationship between four financial performance variables (return on equity [ROE], return on asset [ROA], return on capital [ROC] and return on sales [ROS]) and three main independent variables (foreign assets to total assets [FATA], research and development intensity [RNDi], advertising intensity [ADVi]), controlling for product diversification, firm size, age and risk. Findings The findings reveal that automotive firms with a lower FATA ratio, lower RNDi and higher ADVi tend to achieve higher financial performance. However, the intensity of product diversification does not influence the financial performance of global automakers. Ceteris paribus, larger firms in terms of market capitalisation and new entrants into the market tend to have higher financial performance relative to smaller and older firms. Originality/value This study contributes to the literature first by examining the relationship between internationalisation and firm performance in the setting of a matured market, i.e. the automotive industry. Secondly, the paper uses a multinational sample at a global level; and third, it analyses financial performance on a comprehensive basis via four measures, namely, ROA, ROE, ROC and ROS, as the dependent variables.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c48ab08618dcabe5728ec7a894aa2eac",
  "timestamp": "2025-05-15T02:36:38.467717"
}