{
  "id": 7552,
  "title": "The Impact of Fish and Shellfish Consumption on Age-Related Macular Degeneration",
  "abstract": "Purpose: To determine the relationship between fish and shellfish consumption and age-related macular degeneration (AMD) status in the Salisbury Eye Evaluation (SEE) Study participants. Design: A cross-sectional study of dietary and ophthalmologic data. Participants: A random sample of 2520 Salisbury, Maryland, residents aged 65 to 84 years. Methods: A food frequency questionnaire was used to estimate weekly fish/shellfish consumption for each participant. Age-related macular degeneration status was determined from fundus photographs obtained at baseline and graded by 2 masked readers for drusen size, retinal pigment epithelium abnormalities, geographic atrophy (GA), and choroidal neovascularization (CNV). The association between weekly fish/shellfish intake and risk of AMD was investigated using logistic regression while adjusting for risk factors and correlation between eyes. Main Outcome Measures: Status of AMD. Results: The distribution of weekly fish/shellfish consumption was not different between specific AMD categories compared with controls (P = 0.6, 0.7, and 0.7 for large drusen, pigment abnormalities, and advanced AMD compared with controls, respectively). Those with advanced AMD (CNV or GA) were significantly less likely to consume fish/shellfish high in omega-3 fatty acids (odds ratio 0.4; confidence interval, 0.2-0.8). There was no relationship of AMD with intake of crab and oysters combined, each of which has high levels of zinc. Conclusions: These data support a protective effect of fish/shellfish intake against advanced AMD. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2010;117:2395-2401 (C) 2010 by the American Academy of Ophthalmology.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c48acc7289aae69c798e869b307cba50",
  "timestamp": "2025-05-15T03:09:36.964579"
}