{
  "id": 5344,
  "title": "What drives the venture capital investments in China?",
  "abstract": "Purpose This study aims to examine the venture capital (VC) industry in China. It has demonstrated a history of high growth with significant variations over time. The authors have examined the trends and determinants of VC investments in China over a 20-year period from 1995 to 2014. They find that the aggregate amount of VC investments, the total number of venture deals and the average amount of venture investments per deal in China are all significantly impacted by macroeconomic conditions (i.e. GDP, export, money supply), technology innovations and financial market indicators (i.e. initial public offerings (IPOs), interest rate, price-to-earnings ratio, etc.). They also find that the 2007 China A-Share stock market crash and the subsequent global financial crisis have motivated VCists in China to adjust their investment strategies and risk levels by allocating more capital to later-stage investments and securing more deals with later-round financings. However, after the 2008 global financial crisis, the China's venture industry has recovered faster compared to the US counterpart response. Design/methodology/approach The authors first perform trend analysis of VC investments at an aggregate level, by stages of development, and across industry from 1995 to 2014.To test H1 and H2, the authors use multiple regression models with lagged explanatory variables. To test H3, the authors use univariate tests to compare the measures of VC investments at an aggregate level, stage funds ratios, stage deals ratios and financing series ratios during both a five-year and seven-year time windows around the 2007 A-Share stock market crash and the subsequent financial crisis. Findings The development of the VC industry in China has demonstrated a history of high growth with significant variation over time. The authors find that the aggregate amount of VC investments, the total number of venture deals and the average amount of venture investments per deal in China are all significantly impacted by macroeconomic conditions (i.e. GDP, export, money supply), technology innovations and financial market indicators (i.e. IPOs, interest rate, price-to-earnings ratio, etc.). The authors also find that the 2007 China A-Share stock market crash and the subsequent global financial crisis have motivated VCists in China to adjust their investment strategies and risk by allocating more capital to later-stage investments and securing more deals with later-round financings. However, the China VC industry has recovered faster compared to the USA just after the 2008 global financial crisis. Originality/value This paper contributes to the literature by testing the supply and demand theory on the VC market proposed by Poterba (1989) and Gompers and Lerner (1998) from the macroeconomic perspective using 20 years' VC data from China. The authors also examine how the 2007 A-Share stock market crash and the subsequent financial crisis affected VCists to adjust their risk levels and investment strategies. It provides useful information for international academia and policymakers to understand the quick rise of China VC industry. The authors also find that the macroeconomic drivers of VC industry are somewhat different under different economic systems.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c4940f5ac9bc7b6826f0a0f48f9f29e0",
  "timestamp": "2025-05-15T02:46:44.934864"
}