{
  "id": 8927,
  "title": "Functional health literacy in a population-based sample in Florence: a cross-sectional study using the Newest Vital Sign",
  "abstract": "Objectives To assess the level of functional health literacy (HL) and its antecedents and consequences in an adult population-based sample, using the Italian version of Newest Vital Sign (NUS-IT). Design Cross-sectional study. Setting General population. Participants 984 people were randomly selected from the resident registers of 11 general practitioners; a total of 452 (46.2%) of the selected people completed the study. Inclusion criteria were the following: 18-69 years of age and Italian speaking. Exclusion criteria included cognitive impairment, severe psychiatric diseases and end-stage diseases. Outcome measures HL levels as assessed by the NUS-IT and the following potential HL predictors and consequences were assessed using logistic regression models: sociodemographic characteristics, body mass index, presence of long-term illnesses, self-reported health status, health services use in the last 12 months. Results High likelihood of limited HL, possibility of limited HL and adequate HL were found in 11.5%, 24.6% and 63.9% of the sample, respectively. The results of the multivariate logistic model for the antecedents showed that the risk of having high likelihood or possibility of limited HL levels increases with age (OR 1.07, 95% CI 1.05 to 1.09), lower educational level (OR 4.03; 95% CI 3.41 to 7.49) and with worse financial situation (OR 1.64; 95% CI 1.17 to 2.63). As far as health outcomes are concerned, HL resulted to be positively associated with self-reported health status (OR 2.25, 95% CI 1.75 to 2.75). Conclusions Findings show a good level of functional HL in the population. However, older, less educated and poorer population groups showed to have a higher likelihood of suffering from limited or inadequate HL. Efforts should be made to design and implement public health policies and interventions tailored to different HL levels.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c4ac405fb028ce063da212a3ee69a547",
  "timestamp": "2025-05-15T03:23:56.053274"
}