{
  "id": 8326,
  "title": "Giving room to subjectivity in understanding and assessing problem gambling: A patient-centered approach focused on quality of life",
  "abstract": "Background and aims: Problem gambling is characterized by high stigma and self-stigma, making relevant measurement of the burden of the disorder complex. The aim of our qualitative study was to describe health-related quality of life (HRQOL) impacted by problem gambling from the patients' perspective. Methods: We conducted 6 focus groups with 25 current or lifetime at-risk problem gamblers to identify key domains of quality of life impacted by problem gambling. A content analysis from the focus groups data was conducted using Alceste (c) software, using descendant hierarchical classification analysis, to obtain stable classes and the significant presences of reduced forms. The class of interest, detailing the core of impacted quality of life, was described using a cluster analysis. Results: Thematic content analysis identified three stable classes. Class 1 contained the interviewers' speech. Class 3 was composed of the vocabulary related to gambling practice, games and gambling venues (casino, horse betting, etc.). Class 2 described the core of impact of gambling on quality of life and corresponded to 43% of the analyzed elementary context units. This analysis revealed seven key domains of impact of problem gambling: loneliness, financial pressure, relationships deterioration, feeling of incomprehension, preoccupation with gambling, negative emotions, and avoidance of helping relationships. Conclusions: We identified, beyond objective damage, the subjective distress felt by problem gamblers over the course of the disorder and in the helping process, marked in particular by stigma and self-stigma. Four impacted HRQOL areas were new and gambling-specific: loneliness, feeling of incomprehension, avoidance of helping relationships, and preoccupation with gambling. These results support the relevance of developing, in a next step, a specific HRQOL scale in the context of gambling.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c4afc6327dee92bb0efa24e931900225",
  "timestamp": "2025-05-15T03:17:49.097176"
}