{
  "id": 1471,
  "title": "Harnessing a Hybrid CNN-LSTM Model for Portfolio Performance: A Case Study on Stock Selection and Optimization",
  "abstract": "Portfolio theory underpins portfolio management, a much-researched yet uncharted field. This research suggests a collective framework combined with the essence of deep learning for stock selection through prediction and optimal portfolio formation through the mean-variance (MV) model. The CNN-LSTM model, proposed in Stage I blends the benefits of the convolutional neural network (CNN) and the long-short-term memory network (LSTM). The model combines feature extraction and sequential learning about temporal data fluctuations. The experiment considers thirteen input features, combining fundamental market data and technical indicators to capture the nuances of the wildly fluctuating stock market data. The input data sample of 21 stocks was collected from the National Stock Exchange (NSE) of India from January 2005 to December 2021, spanning two significant market crashes. Thus, the sample makes it possible to catch subtle market shifts for model execution. The shortlisted stocks with high potential returns are advanced to Stage II for optimal stock allocation using the MV model. The proposed hybrid CNN-LSTM outperformed the single models, i.e., CNN and LSTM, per the six-performance metrics and advocated by the 10-fold cross-validation technique. Furthermore, the statistical significance of the model is established using non-parametric tests followed by post hoc analysis. In addition, this method is validated by comparing the proposed model to four baseline strategies and relevant pieces of research, which it considerably outperforms in terms of cumulative return per year, Sharpe ratio, and average return to risk with and without transaction cost. These findings highlight the effectiveness of the hybrid CNN-LSTM approach in stock selection and portfolio optimization.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c4b4b2797f74939d4ecbe0851901810e",
  "timestamp": "2025-05-15T00:56:08.337188"
}