{
  "id": 1912,
  "title": "A heuristic rule adaptive selection approach for multi-work package project scheduling problem",
  "abstract": "Effectively scheduling a project is crucial for its success, especially after generating work packages from the work breakdown structure during the planning phase. Nevertheless, solving project scheduling problems with multiple work packages is challenging due to the inefficient utilization of work package information in existing scheduling approaches. To address this issue, this paper proposes the Heuristic Rule Adaptive Selection (HAS) approach for the Multi-Work Package Project Scheduling Problem (MWPSP). This approach involves work package information and employs reinforcement learning (RL) for intelligent decision-making in scheduling. First, the MWPSP with the optimization objective of minimizing the Portfolio Delay (PDEL) and the Average Percent Delay (APD) is defined, and a scheduling environment is established that integrates information from both work packages and tasks. Second, a Double Deep Q-network (DDQN) is employed to train agents for adaptively selecting heuristic rules of tasks and work packages. The performance of the HAS approach is then evaluated using a case project and the newly created MWPSP dataset. The experimental results demonstrate that the HAS approach exhibits superior solution quality and computational efficiency in optimizing PDEL and APD compared to heuristics approaches, e.g., single-priority rule-based heuristics and genetic algorithms. This achievement sets the stage for the development of next-generation adaptive scheduling for construction projects.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c4b8ec108d2f73b27020c1a7ca7e1a6a",
  "timestamp": "2025-05-15T01:01:06.117491"
}