{
  "id": 5786,
  "title": "Adverse events in childhood and chronic widespread pain in adult life: Results from the 1958 British Birth Cohort Study",
  "abstract": "Chronic widespread pain (CWP) is a common and frequently disabling condition. Several studies have shown that early life adversity is associated with CWP in later life: however, the majority are retrospective and suffer from potential recall bias. Using data from the 1958 British Birth Cohort Study, the aim of the current study was to examine, prospectively, the relationship between childhood physical and psychological adversity and CWP in adulthood. At 7 yrs data were collected, by parental report, oil physically traumatic events (hospitalisation following a road traffic accident, or for surgery): and factors indicating poor social and psychological environment (periods in local authority care, death of a parent; or parental divorce, alcoholism. or financial hardship). CWP was assessed at 45 yrs using self-completion questionnaires. The relationship between childhood events and CWP was examined using Poisson regression. 757 1 individuals provided pain data at 45 yrs (71.5%). There was no association between childhood surgery and CWP in adulthood (relative risk: 1.0: 95% Cl: 0.9-1.1). However, children who had been hospitalised following a road traffic accident experienced a significant increase in the risk Of future CWP (1.5; 1.05-2.1). Children who had resided in institutional care also experienced an increase in the risk of CWP (1.7; 1.3-2.4) as did those who experienced maternal death (2.0: 1.08-3.7) and Familial financial hardship (1.6; 1.3-1.9). Further these associations were not explained by adult psychological distress or social class. To prevent long-term Consequences of adverse childhood events, future research Should Study the mechanisms, in particular the biological mechanisms, underlying these relationships. (C) 2009 International Association for the Study of Pain. Published by Elsevier B.V. All rights reserved.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c4f32451e8a965ab223d2b43f448d52f",
  "timestamp": "2025-05-15T02:51:30.045936"
}