{
  "id": 3175,
  "title": "Informed short selling: evidence from economically linked firms",
  "abstract": "Purpose This paper examines how sophisticated and better-informed investors, such as short sellers, trade on information along the supply chain. Given the economic linkages between suppliers and customers, one would expect short sellers to trade on such information and to capitalize on investors' inattention to such economic links. Design/methodology/approach This paper uses both multivariate regression analysis and portfolio analysis where the time series averages of equally weighted monthly portfolio returns are reported to explore the abnormal returns of long-short trading strategies. Findings Results indicate that short interest predicts unexpected earnings news, consistent with short sellers extracting information from economic relationships. There is a strong negative relationship between short interest in the supplier firm and the one-month future stock return of the customer firm. This negative relation significantly persists for at least 12 months. One plausible channel explaining the information content of supplier (customer) firm's short interest for the customer (supplier) firms is the short sale constraints on the customer (supplier) firms. Originality/value The paper addresses a gap in the literature by examining whether short selling in a firm in the months leading up to a customer's (supplier's) negative shock is negatively correlated to the customer's (supplier's) future performance. Overall, the findings suggest that short sellers play an important role in the price discovery of related firms in the supply chain, which is beyond the direct effects documented in prior literature.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c4fef7e1b83adf0b8256eb9f6ab43e6b",
  "timestamp": "2025-05-15T01:14:16.256952"
}