{
  "id": 8074,
  "title": "Risk Assessments in Orthognathic Surgery: A National Inpatient Sample (NIS) and Nationwide Ambulatory Surgery Sample (NASS) Analysis",
  "abstract": "Background: Orthognathic surgery is an effective treatment for deformities involving the middle and lower third of the face. While orthognathic surgery has been demonstrated to have potential benefits, patients may be reluctant to proceed due to concerns regarding the outcome of the treatment, possibility of complications, length of hospitalization, and financial costs. This study aimed to determine whether systemic comorbidities as risk factors affect the outcomes, costs, and of surgical management for orthognathic patients. Methods: Patients who underwent orthognathic surgery, maxillary, mandibular, or both were identified from both the National Inpatient Sample (NIS) and the Nationwide Ambulatory Surgery Sample (NASS) Databases. A cross-sectional study was conducted involving patients who underwent orthognathic surgery between the years 2016 and 2018. Data collected included patient age, gender, race, median household income, insurance type, severity of illness, and comorbidities such as obstructive sleep apnea, smoking, hypertension, and diabetes. Multivariable regression was used to characterize the role of insurance status, median household income, comorbidities, and total charges in the inpatient setting versus the outpatient setting. Results: A total of 20 848 patients in the United States who underwent orthognathic surgery involving either single or double-jaw procedures were included. Diabetes (P < .05), smoking (P < .015), obesity (P < .001), and Black race (P < .001) were significantly associated with greater length of hospitalization. Patients who underwent isolated maxillary orthognathic procedures were less likely to incur increased costs due to obesity as a comorbid condition (P < .001). Hispanic patients who underwent single-jaw surgeries, either maxillary or mandibular, had 93% increased odds of having higher total charges incurred (P < .001). Conclusion: Longer hospital stays are associated with more comorbid conditions and more expensive and complex procedures. Comprehensive assessments of patients' comorbidities may be useful for predicting the length of stay as well as risk stratification in orthognathic surgery.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c50d38e0adb071d265590587500fa75b",
  "timestamp": "2025-05-15T03:15:09.322160"
}