{
  "id": 9007,
  "title": "Pattern and microbiological features of diabetic foot ulcers",
  "abstract": "Aim: Diabetic Foot Ulcers (DFUs) are a common complication of type-1 and type-2 diabetes and a significant cause of morbidity and mortality. About 10-15% of patients with diabetes develop foot ulcers. Due to insufficient diagnosis and treatment, amputations in patients occurs and treatment costs increase, which brings a serious financial burden to the patient and the country. This study aimed to evaluate the clinical and microbiological data on diabetic foot infections in our clinic. Material and Methods: In this study, 62 diabetic foot patients who were followed up with the diagnosis of diabetic foot in our internal medicine clink between 2016 and 2022 were retrospectively analyzed. Bacterial identification, antimicrobial therapy, and ulcer classification data, such as cultures and biopsies, were obtained from patient files and electronic records. Patients were divided into two groups: medical treatment and surgical treatment. Surgical interventions and amputations were made in line with the decisions of the diabetic foot council. Results: A total of 62 patients, 40 (64,5%) male, and 22 (35,5%) female, were included in the study Diabetic chronic microvascular complications were found in 49 patients and osteomyelitis in 43 patients. All of these 43 cases were amputated. The distribution of DFUs according to pathophysiological etiology was most frequently neurogenic (46.7%). Bacteria were isolated from 24 patients, and the most frequently isolated bacteria was Staph. Aureus. Other patients who did not detect growth in the culture received empirical antibiotic therapy. When patients in medical and surgical treatment groups were compared, hypertension, hyperlipidemia, bacterial growth in culture, gender, and oral antidiabetic drug or insulin use properties were statistically similar. The presence of peripheral vascular disease, poor glycemic control, osteomyelitis, sedimentation >70 mmihr, and diabetic complications were statistically significantly higher in the surgical group. Discussion: Poor glycemic control and diabetic chronic complications increase the risk of diabetic foot infections. It may be possible to protect patients from DFUs through glycemic control, prevention and early treatment of chronic complications.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5116b4602afd4bc0b9d6f243ff8cef9",
  "timestamp": "2025-05-15T03:24:26.419579"
}