{
  "id": 5557,
  "title": "Evaluating the efficiency of insurance companies in Vietnam using Data Envelopment Analysis and truncated regression",
  "abstract": "After many years of outstanding growth, the growth rate of Vietnam's life insurance market has decreased since 2022 with a decline in the number of new life insurance policies, according to the Vietnam Insurance Association. Life and non-life insurance companies face many challenges in terms of financial capacity, risk management, corporate governance, customer service quality and transparency. To gain further insight into the context before this slowdown turn, this study aims to investigate the factors affecting the efficiency of 30 Vietnamese insurance companies from 2016 to 2021. The efficiency scores were measured by applying the data envelopment analysis in the first stage. In the second stage, truncated regression is employed to identify the relationship between financial factors and efficiency. The results show that the majority of insurers in Vietnam are relatively efficient, but the average efficiency score decreases over the study period. Under Variable Returns to Scale, the factors that significantly affect efficiency are leverage, gross written premium, firm age and size, and life insurance type. All of these factors positively affect efficiency, except for firm size. The findings provide insights for policymakers and stakeholders to help improve insurance companies' performance in the Vietnamese market.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c512ce24537db0e66a13e1121a53c7bb",
  "timestamp": "2025-05-15T02:48:51.397118"
}