{
  "id": 7594,
  "title": "Psychological distress and help seeking amongst higher education students: findings from a mixed method study of undergraduate nursing/midwifery and teacher education students in Ireland",
  "abstract": "Psychological distress as experienced by higher education students is of major concern because of its potential to adversely impact academic performance, retention, mental health and lifestyle. This paper reports a mixed method investigation of student self-reported psychological distress and help-seeking behaviour. The sample comprised all students (n=1557) registered on undergraduate nursing/midwifery and teacher education programmes at an Irish university. Participants (n=1112) completed the General Health Questionnaire (GHQ) to determine their self-reported psychological distress and the Lifestyle Behaviour Questionnaire to examine sources of distress, lifestyle and demographic variables. Individual interviews (n=59) explored student experiences of psychological distress and their help-seeking behaviours. Forty two percent of respondents exceeded the GHQ threshold 5, which signifies risk of mental or physical health problems. Sources of distress included academic, financial and psychosocial stressors. Regression analysis identified that demographic, programmatic and lifestyle variables predicted GHQ scores. Despite the distress experienced, students were reluctant users of support services. Many actively avoided seeking help. These findings raise serious concerns about the extent of psychological distress among this population. They also alert education providers to be vigilant for student psychological distress and to provide effective interventions, cognisant of the impact of stigma on help seeking.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c52b8111a9c565538801a717488e535c",
  "timestamp": "2025-05-15T03:10:05.619204"
}