{
  "id": 4141,
  "title": "Chilean Universities and Universal Gratuity: Suggestions for a Model to Evaluate the Effects on Financial Vulnerability",
  "abstract": "Financial vulnerability can be understood as the risk of an organisation being unable to carry out routine its normal operations due to financial restrictions. Models to estimate financial vulnerability have mainly been developed for profit-making organisations, while few exist for non-profit organisations (NPOs). One example is higher education institutions, which have experienced important changes in Latin America through gratuity policies for student tuition. This study proposes a model to estimate the effects of gratuity on financial vulnerability, as previous studies have focused on the effects of enrolment. A binary logistic regression model is proposed, considering the following variables: debt, income concentration, operating margin, administration costs, and square metres of rooms per student. We applied this model to 54 universities between 2013 and 2019. The results showed that the model is relevant for the debt, size, and operating margin variables. Additionally, we observed that on average, all universities were negatively affected. This result is particularly true for state-owned universities because of certain management restrictions. A limitation of this study is the unavailability of other sources of non-financial information, such as each university's business model and stock of strategic resources, which could improve our model, as this information is more related to control than to management.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5347206f561e9c8b6efafb11d1a0bec",
  "timestamp": "2025-05-15T02:33:42.060868"
}