{
  "id": 8744,
  "title": "Recent/Childhood Adversities and Mental Disorders Among US Immigrants",
  "abstract": "Past research documents the heterogeneity in US immigrants, particularly in terms of racial and ethnic categories and specific ethnic subgroups. The present study builds on this research foundation by investigating heterogeneity in immigrants' experiences of adversity, both recent and during childhood, and associations with mental disorders. Data are drawn from 6,131 adult immigrants in the 2012-2013 National Epidemiologic Survey on Alcohol and Related Conditions-III. Prevalence estimates for mental disorders and adversities were calculated overall and by gender. Latent class analysis was utilized to characterize patterns of self-reported experiences of childhood and recent adversities, and multinomial logistic regression established the statistical association between latent class membership and past-year mental disorder outcomes (substance use disorder only, mood/anxiety/trauma disorder only, co-occurring disorder, or no mental disorder). Neglect was the most commonly-reported childhood adversity among immigrant men and women. Prevalence of meeting criteria for a substance use disorder only, or a mood/anxiety/trauma disorder only, varied between men and women, yet no gender differences were observed in prevalence of co-occurring disorders. For latent class analyses, a five-class solution was selected based on fit indices and parsimony. Approximately 10.0% of the sample was categorized in the latent class characterized by severe childhood adversities, while 57.5% was classified in the latent class with low probabilities of reported adversities. The relative risk of meeting criteria for a past-year substance use disorder only (compared to no substance use or mood/anxiety/trauma disorder) was more than three times as high for members of the class with severe childhood adversities (RRR, 3.26; 95% CI, 2.08-5.10), as well as the class with recent employment/financial adversities (RRR, 3.82; 95% CI, 2.36-6.19), compared to the class with low adversities. The relative risk of past-year co-occurring disorders (compared to no disorder) was more than 12 times as high for those in the severe childhood adversities class (RRR, 12.21; 95% CI, 7.06-21.10), compared to the class with low adversities. Findings underscore the importance of considering both recent and childhood adversities when assessing and providing services for US immigrant groups.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c53fe708b9c4155b99945c3e1b9e40a4",
  "timestamp": "2025-05-15T03:21:56.645917"
}