{
  "id": 6671,
  "title": "Understanding homeowner proactive actions for managing wildfire risks",
  "abstract": "Wildfires have become increasing threats to residents, built environments, and ecosystems in the USA. Individual responsibility plays an important role in reducing structure-level ignitability, and in turn, overall community vulnerability. When wildfire cannot be completely prevented through risk reduction efforts, homeowners insurance can serve as the second line of defense by allowing homeowners to transfer risk. To understand homeowner decisions on wildfire-related proactive actions and the effects of such decisions on the housing recovery, this study conducted an online survey of homeowners living at high to extreme risk of wildfire in the Western United States and collected data related to two types of proactive actions: individual-level risk reduction actions and homeowners insurance. First, a regression model for each proactive action was estimated to identify key characteristics of homeowners and house/property that had the greatest impact. The results indicated that homeowner age and household income were the two common factors affecting their decisions about home hardening and insurance policies, while the only statistically significant factor in homeowner decisions about defensible space was satisfaction with the surrounding environment (e.g., scenic beauty, privacy). Moreover, the effects of each proactive action on the housing recovery process were evaluated. The results showed that home hardening was a more effective action in reducing wildfire damage to a house than defensible space was, which was consistent with homeowner perception. The survey results also indicated that homeowners with insurance were less likely to experience post-wildfire financial hardship, and subsequently were more likely to repair their damaged houses.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c541f00ba80ac7a7bedb023535f02260",
  "timestamp": "2025-05-15T03:00:35.327438"
}