{
  "id": 4679,
  "title": "Adolescents and oral health service utilization in Canterbury, New Zealand: A geospatial cross-sectional study",
  "abstract": "ObjectiveNon-utilization of dental care during adolescence can result in poorer oral health and subsequently higher expenditures on dental services. This study examined the geospatial and epidemiological factors associated with utilization of the publicly funded Adolescent Oral Health Services (AOHS) in Canterbury, Aotearoa New Zealand (NZ). MethodsA secondary analysis of prospectively collected routine data from AOHS visits of adolescents in school Year 9 (13-14 years) for the financial year 2019-2020. Geographic information systems examined distance from home to dental practices. Multilevel mixed-effects Poisson regression models investigated associations between geospatial, demographic and clinical factors and non-utilization of dental services. Models were adjusted for sex, ethnicity, area-level deprivation, rural/urban classification, previous caries experience and the distance from home address to dental practice referred. ResultsDental practices were concentrated in large urban areas and in the least deprived neighbourhoods, with several service area gaps identified. Rural areas and the most deprived areas of Christchurch City had the highest non-utilization rates. After adjustment, adolescents residing in the most deprived areas had a higher risk of non-utilization (adjusted risk ratio [aRR] = 1.38; 95% CI 1.26-1.51) compared to adolescents in the least deprived areas. Adolescents in remote areas also had an increased risk of non-utilization (aRR = 1.36; 95% CI 1.20-1.54) compared to adolescents in urban core areas. Finally, Maori (aRR = 1.37; 95% CI 1.29-1.46) and Pasifika (aRR = 1.46; 95% CI 1.35-1.59) adolescents had significantly higher risks of non-utilization compared to their NZ European counterparts. ConclusionInequitable utilization of dental services exists among adolescents in Canterbury, NZ, and is associated with Maori, Pasifika and those living in rural and most deprived areas. Adolescents at the greatest oral health risk are geographically underserved by current oral health services. The current health system should also explore the possibility of partnering with Maori and Pasifika communities to provide services within culturally appropriate settings.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c54911cb26421efddf459d4ea8d00f70",
  "timestamp": "2025-05-15T02:39:57.465668"
}