{
  "id": 8055,
  "title": "Determinants of institutional delivery in rural Jhang, Pakistan",
  "abstract": "Background: There is expert consensus that delivery at a health facility substantially reduces the risk of maternal death. By increasing the use of antenatal (ANC), postnatal care (PNC) and family planning, the risk of maternal death can be further reduced. There has been little investigation of factors associated with the use of these services in Pakistan. Methods: A representative household survey was conducted in rural areas of Jhang district, Pakistan, to determine the effect of demographic, economic and program factors on the utilization of maternal health services. Married women who had children ages 12 months or younger were interviewed. Data was collected from 2,018 women on socio demographic characteristics and the utilization of health services. Logistic regression analysis was conducted to identify the correlates of health services use. Marginal effects quantify the impact of various factors on service utilization. Results: Parity and education had the largest impact on institutional delivery: women were substantially less likely to deliver at a health facility after their first birth; women with primary or higher education were much more likely to have an institutional delivery. Age, autonomy, household wealth, proximity to a health facility and exposure to mass media were also important drivers of institutional delivery. The use of family planning within a year of delivery was low, with parity, education and husband's approval being the strongest determinants of use. Conclusions: The findings suggest that rural women are likely to respond to well-designed interventions that remove financial and physical barriers to accessing maternal health services and motivate women by emphasizing the benefits of these services. Interventions should specifically target women who have two or more living children, little formal education and are from the poorest households.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5525a477b93f45ecb348b6be66f04cf",
  "timestamp": "2025-05-15T03:14:37.408896"
}