{
  "id": 6701,
  "title": "Citizens' opinions and experiences related to costs and reimbursements for medications in times of retrenchment: cross-sectional population surveys in 2015 and 2017",
  "abstract": "Background Finland has universal coverage for prescription medications under the National Health Insurance. Eligibility schemes target higher reimbursements to individuals with chronic illness. Nevertheless, co-payments always apply, and austerity reforms implemented in 2016 and 2017 led to further increases in co-payments. We examined the extent to which people with chronic illness experienced financial difficulties in purchasing medications, how perceptions of fairness regarding the national reimbursements differs by exposure to policies and medicine use, and in what way do these experiences and opinions vary between surveys collected before and after the reforms. Methods We used two waves of Medicines Barometer (2015 and 2017, pooled n = 10,801), a national, biennial, cross-sectional population survey. Logistic regression analyses were performed with experiences of financial difficulties and perceptions of fairness as dependent variables. We compared people with and without prescription medication use, eligibilities, and/or diabetes (exposure groups), controlling for age, gender, survey type and geographic area (NUTS2). To examine the modifying effect of study year, we fitted models with an interaction term between group and year. Results Respondents with diabetes or eligibility based on chronic illness had a notably higher risk than other respondents with at least some prescription medication use to have experienced financial difficulties in affording medications. The share of respondents experiencing difficulties increased the most among people with diabetes. Three-quarters of respondents were either critical or unsure of whether the reimbursements for medications were fair and just. People with recent prescription medication use tended to be more sceptical than people without. Overall, scepticism tended to be more prevalent in 2017 than in 2015. Conclusions Despite the protective policies in place, individuals with chronic illness were disproportionately burdened by costs of medications already before the reforms. Among individuals with diabetes, financial difficulties were even more prevalent in 2017 than in 2015, which is likely attributed to the particularly high co-payment increases targeted to type 2 diabetes medicines. Perceived fairness of the processes and outcomes of policies and regulations is a key dimension of trust in public policy. Thus, increasing scepticism implies that retrenchment may also have implications in terms of public legitimacy.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c55a22cd9d9f91dcdb81eafbb6dce027",
  "timestamp": "2025-05-15T03:00:35.515183"
}