{
  "id": 8489,
  "title": "Out-Patient Service and in-Patient Service: The Impact of Health Insurance on the Healthcare Utilization of Mid-Aged and Older Residents in Urban China",
  "abstract": "Purpose: Medical insurance is a disease risk-sharing mechanism that can improve residents' financial access to medical treatment and thus increase their utilization of health services. This paper aims to identify the impact of different kinds of medical insurances on the use of healthcare for Chinese mid-aged and older urban residents from four aspects: outpatient behaviour, outpatient costs, inpatient behaviour and inpatient costs. Materials and Methods: The data used in this study were from 2015 China Health and Retirement Longitudinal Study (CHARLS) conducted by Peking University. Binary logit model and multiple linear regression model were used to analyse the impact of health insurance on the use of healthcare, and the PSM method was used to test the robustness of the results. Results: Participating in either BMIUSE or BMISURR can significantly improve all kinds of healthcare utilization for mid-aged and older urban groups. However, there are huge differences on the healthcare utilization between BMISUE and BMISURR. Specifically, the probability of using inpatient care and inpatient costs of urban residents enrolled in the BMISUE are 4.2% and 45% higher, respectively, than those covered by the BMISURR, but there are no differences in outpatient care utilization and outpatient costs between these two health insurance programs. Conclusion: This paper suggests that the large gaps between BMISUE and BMISURR only reflect on inpatient care and inpatient costs, there is no difference in outpatient services between these two health insurance programs. Excessive demand, induced demand and other moral hazard phenomena in BMISUE should be avoided when receiving hospitalization services.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c55b906cdcc8e1b7c6015167a590e62c",
  "timestamp": "2025-05-15T03:19:21.336111"
}