{
  "id": 6210,
  "title": "Importance of substance use and violence in psychosocial syndemics among women with and at-risk for HIV",
  "abstract": "Women in the US continue to be affected by HIV through heterosexual contact. Sexual risk behaviors among women have been associated with a syndemic, or a mutually reinforcing set of conditions, including childhood sexual abuse (CSA), depression, substance use, violence, and financial hardship. Baseline data from a cohort of women with and at-risk for HIV (N=620; 52% HIV+) were analyzed with Poisson regression to assess evidence for additive, independent and interactive effects among syndemic conditions in relation to reported sexual risk behaviors (e.g., unprotected and transactional sex) over the past 6 months, controlling for age and HIV status. The number of syndemic conditions was incrementally associated with more types of sexual risk behaviors. For example, women with all five syndemic conditions reported 72% more types of risk behaviors over 6 months, as compared to women without any syndemic conditions. Compared to women with no syndemic conditions, women with three syndemic conditions reported 34% more and women with one syndemic condition reported 13% more types of risk behaviors. Endorsing substance use in the past 6 months, reporting CSA, and experiencing violence as an adult were independently associated with 49%, 12%, and 8% more types of risk behaviors, respectively compared to women without these conditions. Endorsing both substance use and violence was associated with 27% more types of risk behaviors. These associations were not moderated by HIV status. Understanding specific relationships and interactions are needed to more effectively prioritize limited resources in addressing the psychosocial syndemic associated with sexual risk behavior among women with and at-risk for HIV. Our results identify interrelated psychosocial factors that could be targeted by intervention studies aiming to reduce high-risk sex in this population.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5640d2a94e0205c893489e2c9db08f2",
  "timestamp": "2025-05-15T02:55:44.678318"
}