{
  "id": 2389,
  "title": "The impact of cryptocurrencies on the gold, WTI, VIX index, G7 and BRICS index before and during COVID-19: a quantile regression and NARDL analysis",
  "abstract": "PurposeThis study aims to explore the impact of cryptocurrencies (Bitcoin, Ethereum, Monero and Ripple) on the gold, WTI, VIX index, G7 and the BRICS index before and during COVID-19. Design/methodology/approachThis research analyzes the impact of cryptocurrencies (Bitcoin, Ethereum, Monero and Ripple) on the gold, WTI, VIX index, G7 and the BRICS index before and during COVID-19, using the quantile regression approach for the 2016-2020 period. In addition, to catch long- and short-run asymmetries of cryptocurrencies on aforementioned dependent variables, an asymmetric nonlinear co-integration (nonlinear autoregressive distributed lag [NARDL]) approach is applied. FindingsThe result of the quantile regression shows that in a high market, which corresponds to the 90th quantile, the FTSE MIB, CAC40, SSE, BSE 30, and BVSP stock market showed a statistically insignificant negative coefficient, on the Bitcoin price. In a middle and low markets, which correspond to the 0.2, 0.3 and 0.5th quantiles, the BVSP, FTSE MIB, S & P/TSX, SSE and Nikkei stock markets show statistically significant and positive on Bitcoin. Evidence from the NARDL shows a statistically significant positive impact of cryptocurrencies on the gold, WTI, VIX index, G7 and BRICS indices before and during COVID-19 pandemic. Originality/valueThese results can provide investors with valuable analysis and information and help them make the best decisions and adopt the best strategies. Therefore, future investigations may concentrate and examine the monetary and governmental policies to be adapted to face the COVID-19 pandemic's dangerous effects on both the society and the economy. For this reason, investors should take this into account when making their asset allocation decisions. Moreover, the portfolio managers, such as index funds, may consider few eligible cryptocurrencies for their inclusion into the portfolio. However, the speculators present in both stock and crypto markets may opt for a spread strategy to improve their portfolio returns.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c56c3adfcbd9ca32447503475d0a257f",
  "timestamp": "2025-05-15T01:06:10.841105"
}