{
  "id": 4282,
  "title": "Accounting for Fixed Effects in Re-Fracturing Using Dynamic Multivariate Regression",
  "abstract": "The oil and gas (O&G) industry is now as focused on minimizing costs and maximizing efficiency just as much as maximizing production. Operators are looking for new and cost-effective ways to add profitable assets to their portfolio. One such way is to re-fracture existing wells. There is evidence that these wells can be very productive in the Bakken. However, because of factors such as depletion and aging wellbore material, re-fracturing wells can be a difficult process to implement successfully and often have binding constraints on surface treating pressure (STP). This study attempts to quantify the effects that completion parameters have on re-fracturing treatment implementation by constructing dynamic fixed effects (FE) multivariate regression models. These models are not generally used in O&G and are more commonly used in economics and policy analysis. However, given that both economics and O&G deal with large amounts of uncertainty for each individual person and well, respectively, these models provide a much simpler approach to handle the uncertainty. These models also attempt to account for stress shadow effects from subsequent stages on treatment. The FE model has the advantage of treating a compilation of well treatment data as panel data and differencing out any unobservable fixed parameters. To the authors' knowledge, this is the first study using dynamic FE models to estimate temporal stress shadow effects from one stage to the next. These models may then be thought of as estimating the boundary effects from stress shadows, which will affect treatment implementation. The novelty lies in estimating these effects, while accounting for fixed within-well variation, using simpler models than those usually found in industry. We stress that the simplicity of these models is a feature, not a bug. This study found that previous stage average STP, acid volume pumped, and perforation standoff were all statistically significant predictors of average STP with a strong temporal dependence of average STP on subsequent stages after accounting for fixed wellbore and geologic parameters. The models in this study also predict a positive marginal effect from acid volume average STP, which may seem counterintuitive, but is also backed by a previous study.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c577854b8077b610d5468a5e936431aa",
  "timestamp": "2025-05-15T01:25:23.359985"
}