{
  "id": 1658,
  "title": "Regional Space-time Differences and Dynamic Evolution Law of Real Estate Financial Risk in China",
  "abstract": "This study develops a framework to evaluate real estate financial risk from three perspectives: internal risk factors, external risk factors, and interconnected risk factors, examining regional space-time differences and dynamic evolution laws across 30 provinces in China. The research finds that (1) interconnected risk factors are key contributors to real estate financial risk. (2) Significant regional differences in real estate financial risks exist across China. The western and northeastern regions are hotspots for risk, while the eastern region exhibits the most pronounced market stratification and polarization. (3) There is significant spatial autocorrelation in China's real estate financial risks, with most provinces showing high-high (HH) and low-low (LL) clustering. HH clusters are primarily located in the western and northeastern regions, while LL clusters are more prevalent in the central and eastern regions. (4) The distribution of real estate financial risks follows a single-peak evolutionary pattern, characterized by the dynamic transition of weakening LL clusters and strengthening HH clusters. (5) The dynamic evolution of China's real estate financial risks exhibits strong spatial stickiness and positive reinforcement. Over time, the probability of regions transitioning to higher-risk types increases, demonstrating a trend toward escalating risk levels.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5813bfec75d5a5e5282d03687faaf07",
  "timestamp": "2025-05-15T02:05:42.629968"
}