{
  "id": 8552,
  "title": "Incidence, Prevalence, Mortality, and Direct Costs of Breast Cancer in Iran: Using the Iran Health Insurance Organization Database",
  "abstract": "Background: Breast cancer (BC) is the most common cancer and the leading cause of cancer-related death among women worldwide. The BC is a costly disease for health care payers and patients. Objectives: This study aimed to determine the incidence, prevalence, mortality, and costs of BC using the database of the Iran Health Insurance Organization (IHIO). Methods: This study was conducted as a descriptive, cross-sectional, and retrospective study using the database of the IHIO. Data were extracted and collected using a census method from the profiles of 42,296,124 individuals in 2021 and 44,303,244 individuals in 2022 who were covered by the IHIO. The international classification of diseases, loth revision (ICD-10), was used to diagnose BC patients. Descriptive statistical methods were used to analyze the data, and the analyses were performed using SPSS version 21 and Microsoft Excel 2016. Results: The prevalence of BC in the population covered by the IHIO was 29.16 per 100,000 population in 2021 and 36.88 per 100,000 population in 2022. The incidence rate in 2022 was 7.02 per 100,000 population. Out-of-pocket (OOP) costs accounted for 33.72% of total direct BC costs in 2021 and 29.45% in 2022. The mortality rate was 0.68 per 100,000 in 2021 and 0.86 per 100,000 in 2022. The annual cost per patient was 305$ in 2021 and 446$ in 2022. Conclusions: The incidence, prevalence, and mortality rates of BC in Iran are rising, imposing a significant financial burden on families and increasing the risk of catastrophic health expenditures. Enhancing public awareness, implementing effective prevention strategies, and ensuring equitable access to timely medical treatment are essential steps in mitigating the impact of BC.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c58a271d3b1b3ab3771ebc23ad7ebd0d",
  "timestamp": "2025-05-15T03:19:52.174638"
}