{
  "id": 6648,
  "title": "The effectiveness of a government-sponsored health protection scheme in reducing financial risks for the below-poverty-line population in Bangladesh",
  "abstract": "The Government of Bangladesh is piloting a non-contributory health protection scheme called Shasthyo Surokhsha Karmasuchi (SSK) to increase access to quality essential healthcare services for the below-poverty-line (BPL) population. This paper assesses the effect of the SSK scheme on out-of-pocket expenditure (OOPE) for healthcare, catastrophic health expenditure (CHE) and economic impoverishment of the enrolled population. A comparative cross-sectional study was conducted in Tangail District, where the SSK was implemented. From August 2019 to March 2020, a total of 2315 BPL households (HHs) (1170 intervention and 1145 comparison) that had at least one individual with inpatient care experience in the last 12 months were surveyed. A household is said to have incurred CHE if their OOPE for healthcare exceeds a total of non-food HHs' expenditure threshold. Multiple regression analysis was performed using OOPE, incidence of CHE and impoverishment as dependent variables and SSK membership status, actual BPL status and benefits use status as the main explanatory variables. Overall, the OOPE was significantly lower (P < 0.01) in the intervention areas (Bangladeshi Taka (BDT) 23 366) compared with the comparison areas (BDT 24 757). Regression analysis revealed that the OOPE, CHE incidence at threshold of 10% of total expenditure and 40% of non-food expenditure and impoverishment were 33% (P < 0.01), 46% (P < 0.01), 42% (P < 0.01) and 30% (P < 0.01) lower, respectively, in the intervention areas than in the comparison areas. Additionally, HHs that utilized SSK benefits experienced even lower OOPE by 92% (P < 0.01), CHE incidence at 10% and 40% threshold levels by 72% (P < 0.01) and 59% (P < 0.01), respectively, and impoverishment by 27% at 10% level of significance. These findings demonstrated the significant positive effect of the SSK in reducing financial burdens associated with healthcare utilization among the enrolled HHs. This illustrates the importance of the nationwide scaling up of the scheme in Bangladesh to reduce the undue financial risk of healthcare utilization for those in poverty.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c58f40b1b20505213f90e619e912f5da",
  "timestamp": "2025-05-15T03:00:05.055595"
}