{
  "id": 2763,
  "title": "Relationship between primary care physician financial risk and member emergency department use in a commercial HMO population",
  "abstract": "Objective: To demonstrate whether, despite factors beyond the control of primary care physicians (PCPs), health maintenance organization (HMO) members under the care of PCPs with greater financial risk for the cost of emergency care have lower rates of emergency department use. Study Design: Cohort study using calendar year 2000 administrative data on 217 298 commercial members enrolled in a nonprofit statewide HMO (Blue Care Network of Michigan) under the care of non-staff-model PCPs with varying levels of financial risk for emergency care. Methods: Ordinary least squares (OLS) and binary logistic regression models were developed to assess the influence of PCP financial risk, net effects of member and PCP demographics, and emergency care accessibility on use of emergency treat-and release services by members. Results: OLS results indicated emergency use was lower, by 33 visits per 1000 (P <.001) and 51 visits per 1000 (P <.001) for members with PCPs who had medium and high financial risk, respectively, compared with members whose PCPs had low financial risk for emergency care. Emergency care availability, member copayment and demographics, and the number of all Blue Care Network members assigned to the PCP also were significant predictors of emergency use. Conclusions: PCPs do have the ability to influence their patients' emergency department use if financially motivated to do so. Ensuring that the PCP has a large enough number of patients under a specific contractual arrangement also is an important component of the success of an associated financial incentive.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5adec634fc111abf5f3673e074be204",
  "timestamp": "2025-05-15T02:19:08.313201"
}