{
  "id": 6113,
  "title": "The impact of executives' compensation and education on bankruptcy risk in Chinese firms",
  "abstract": "Purpose - This study aims to investigate the moderating role of executive compensation on the relationship between executive education and bankruptcy risk within the frameworks of upper echelons, human capital and agency theories. Design/methodology/approach - This research uses a data set encompassing 3,170 firm-year observations from 2005 to 2016 and uses advanced regression analysis, including two-stage least square (2SLS) and propensity score matching methods. Findings - The analysis shows that higher executive compensation intensifies the negative relationship between education and bankruptcy risk. This suggests that well-educated, well-compensated executives are more likely to make strategic decisions that strengthen a firm's resilience to bankruptcy. These findings provide insights into how governance mechanisms - such as aligning compensation structures with executives' educational qualifications - can mitigate financial instability. By integrating upper echelons, human capital and agency theories, this study demonstrates that executive traits and incentives significantly influence strategic decision-making and financial stability. Research limitations/implications - Although this study provides valuable insights into the relationship between executive education, compensation and bankruptcy risk, it is limited by its focus on Chinese firms, which may not be generalizable to other cultural or regulatory contexts. In addition, the use of historical data may not fully capture the evolving dynamics of executive decision-making in the face of contemporary challenges. Future research could expand the scope by exploring different industries and regions. The implications of the findings suggest that aligning executive compensation with educational background can enhance corporate resilience, offering a strategic tool for policymakers, shareholders and firms alike. Practical implications - The findings of this study offer actionable insights for corporate boards, compensation committees and policymakers. By strategically aligning executive compensation with educational qualifications, firms can significantly enhance their resilience to financial distress. This alignment not only mitigates bankruptcy risk but also incentivizes informed, strategic decision-making at the executive level. Shareholders can leverage this knowledge to advocate for compensation structures that prioritize long-term stability over short-term gains. Policymakers may consider these insights when crafting regulations that promote sound corporate governance, ultimately leading to a more robust and sustainable economic environment. Social implications - This study highlights the broader social benefits of aligning executive compensation with education, as this approach promotes responsible corporate governance that safeguards jobs, communities and economic stability. By reducing the risk of bankruptcy, firms can maintain employment, support local economies and contribute to social welfare. Moreover, the emphasis on educated leadership fosters a culture of informed decision-making, which can lead to more ethical and sustainable business practices. Policymakers and stakeholders can use these insights to advocate for governance reforms that not only benefit companies but also create a positive ripple effect throughout society. Originality/value - This study contributes to the literature by empirically testing how agency incentives interact with executive education and compensation to shape corporate outcomes. It highlights the importance of designing executive pay packages that balance risk and reward, offering valuable insights for corporate governance and risk management. The robustness of these results is confirmed through extensive tests.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5b1d68808a1107afeebee688066709f",
  "timestamp": "2025-05-15T02:55:12.782339"
}