{
  "id": 8264,
  "title": "PARENTAL STRESS IN PATIENTS WITH SCHIZOPHRENIA SPECTRUM DISORDER",
  "abstract": "Objectives: This study aimed to determine the prevalence of parental stress in patients with schizophrenia spectrum disorder and the contributing factors. Methods: This is a cross-sectional study involving 115 patients with schizophrenia spectrum disorder who were attending an outpatient psychiatric clinic, recruited through universal sampling. Those who fulfilled the selection criteria and gave informed consent were selected. Socio-demographic data, perceived parenting capacity, children's data, and illness data were obtained from the patient during interview as well as from the clinical notes. Presence of parental stress and severity of psychiatric symptoms were measured using Parental Stress Scale (PSS) and Brief Psychiatric Rating Scale (BPRS) respectively. Descriptive analysis was performed, followed by univariate analysis and multiple logistic regression analysis, using International Business Machines (IBM (R)) Statistical Package for Social Science (SPSS) version 24. Results: 60 out of 115 participants (52.2%) had parental stress. Factors associated with parental stress include ethnicity (p=0.032), total household income (p=0.004), parenting children with mental or learning disability (p=0.022), perceived financial inadequacy (p=0.049), perceived food inadequacy (p=0.049), and presence of psychiatric symptoms (p=0.001). Ethnicity, total household income, parenting children with mental or learning disability, and presence of psychiatric illness were the predictors for parental stress among patients with schizophrenia spectrum disorder. Conclusion: Parental stress is prevalent in this group. Hence, health care professionals should be able to identify the risk factors and to provide them with necessary support.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5b94237f88dfd8bb8d830813720f653",
  "timestamp": "2025-05-15T03:17:21.427644"
}