{
  "id": 750,
  "title": "Financial Performance Evaluation of Automotive Companies on Tehran Stock Exchange Using Absolute GRA and TOPSIS Models",
  "abstract": "This study seeks to create an optimal investment portfolio by applying grey principal components analysis (GPCA) to financial performance evaluation. The GPCA model concomitantly relies on the advantages of grey systems theory (requiring no definite range of data distribution and using limited data) and those of principal components analysis (reducing variable dimensionality, assigning fitted weights to variables, providing multivariate evaluation). This study uses 25 financial indicators to evaluate the financial performance and determine optimal investment portfolios in 28 companies in Tehran Stock Exchange within five years from 2015 to 2019. The grey relations matrix is created through grey relational analysis and replaces the covariance matrix in the principal components analysis method. To verify the model, TOPSIS is used, and a correlation coefficient test is conducted between the results of the two models across the five years. The significant correlation between the techniques confirms the validity of the model. Furthermore, to decide the most important financial ratios affecting the companies' evaluation, the correlation between each of the ratios and the results of the model solution is computed. The findings show that total assets, return on total assets, net working capital, current ratio, the price at the end of the period, and return on common stockholders are the most important financial ratios in the ranking of the companies.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5b99ab83b52698065ff32369d9deaae",
  "timestamp": "2025-05-15T00:47:50.285676"
}