{
  "id": 8133,
  "title": "The protective duo: Sukuk and corporate social sustainability as crash risk mitigators",
  "abstract": "PurposeThe purpose of this study is to examine how Sukuk Issuance (SI) and corporate social sustainability (CS) impact Stock Price Crash Risk (CR) in Malaysian firms by analyzing CS as a potential mediator between SI and CR. In addition to eliminating interest-based debt, sukuks or Islamic bonds promote information transparency, which may lead to improved CS, and these factors will play a role in reducing the CR.Design/methodology/approachData was collected from 39 firms issuing Sukuk listed on Bursa Malaysia from 2011-2022, resulting in 468 observations. CR was assessed using the down-to-up volatility approach, while SI was measured based on frequency, volume, Shariah rating, credit rating and tenure. CS was determined using the Global Reporting Initiative framework. The analysis used generalized method of moments regression.FindingsFindings reveal that increased SI is associated with a reduction in CR. It positively influences CS and negatively impacts CR. All three CS components (economic, social and environmental) have a negative effect on CR. The study's robustness is supported by alternative measurements and econometric tests. This research contributes to the limited body of knowledge on sukuk, offering novel insights into the relationship between SI, CS and CR.Originality/valueTo rationalize how SI and CS can mitigate the risk of sudden stock price crashes, often triggered by negative news circulation, this study identifies four potential effects of SI on CR. First, adherence to Islamic principles, such as avoiding Riba (interest), reduces credit stress, compliance with principles like avoiding Gharar (uncertainty) leads to increased disclosures, third SI resolves financial constraints to curb CR. It also brings new stakeholders into the fold, encouraging through examination and reducing the likelihood of news hoarding.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5c3f20918ba11ca3b7c09f8669ed148",
  "timestamp": "2025-05-15T03:15:38.386727"
}