{
  "id": 8158,
  "title": "Catastrophic payment for assisted reproduction techniques with conventional ovarian stimulation in the public health sector of South Africa: frequency and coping strategies",
  "abstract": "How often does out-of-pocket payment (OPP) for assisted reproduction techniques (ART) with conventional ovarian stimulation result in catastrophic expenditure for households? Catastrophic cost was a frequent event affecting 51 of the poorest study participants and one in five couples in total. There is increasing concern about catastrophic spending on health by households in low resource settings, but to date no study has evaluated OPP for ART. We conducted a prospective observational study comprising 135 couples undergoing ART between March 2009 and June 2011. The study was set at an urban, level 3 referral hospital in the public and academic health sector of South Africa. At this institution ART is subsidized but requires co-payment by patients. Couples undergoing ART with conventional ovarian stimulation using GnRH analogs were recruited. A questionnaire capturing information on socioeconomic status, monthly household expenditure, OPP for the index ART cycle and financial coping strategies was administered. Households were categorized into tertiles according to socio-economic status. In addition to descriptive statistics, annualized OPP for ART services as a percentage of annual non-food household expenditure was calculated to estimate catastrophic health care expenditure. The Pearson (2) test and a logistic regression were used to identify factors related to incurring catastrophic spending. In total, one in five couples (22) incurred catastrophic expenditure (P 0.01), defined as an OPP of 40 of annual non-food expenditure. Households used a range of coping strategies including reduced expenditure on items such as clothing and food, use of savings, borrowing money and taking on extra work. Differences were observed between the socio-economic tertiles: in the poorest tertile, 51 of households faced catastrophic costs compared with only 2 of the richest tertile (P 0.01). Participants in the poorest tertile were more likely to be black (P 0.01), and less likely to have health insurance (P 0.01) or female full-time employment (P 0.01). Longer duration of infertility was an additional risk factor for catastrophic payment (P 0.05). No attempt was made to obtain proof of any payment or expenditure, and all information collected relied on participants verbal account. This is the first study to document the frequency of catastrophic expenditure for ART using conventional ovarian stimulation in a low resource setting. Our results show that not all couples unable to afford treatment forfeit infertility care; instead poor couples are willing to suffer catastrophic financial hardship in order to pay. ART counselling therefore needs to include financial risk counselling in the short term. Long-term interventions comprise cost-reducing strategies as well as health systems strategies that reduce or eliminate the need for OPP for ART wherever possible. Robust evidence on mild versus conventional stimulation for ART in low resource settings is also required in the form of local RCTs which address the many clinical and health economic variables and exclude bias. Our data cannot be extrapolated to patients undergoing ART elsewhere or to patients undergoing ART with mild ovarian stimulation. This study was funded by the Medical Research Council of South Africa and the University of Cape Town (University Research Committee and Faculty of Health Sciences Research Committee). The authors had no competing interests. not applicable.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5ce81f3a0d6ad7bf89670fdf822432f",
  "timestamp": "2025-05-15T03:15:38.480559"
}