{
  "id": 7642,
  "title": "Comparison of the factors for suicidal ideation and suicide attempt: a comprehensive examination of stress, view of life, mental health, and alcohol use",
  "abstract": "This study was performed to examine the elements that cause suicidal ideation to develop into a suicide attempt by comparing the factors related to suicidal ideation and attempt. The subjects in the study were 5982 employees, who received mental health screening from January 2016 to December 2019 in Korea. Multivariate binary logistic regression analysis was performed with suicidal ideation and suicide attempt as dependent variables respectively. While suicidal ideation was associated with both moderate and severe grades of depression and alcohol consumption, only severe grades of depression and alcohol consumption were associated with suicide attempts. Among family, interpersonal, work-related, and financial stress, which were significant predictors of suicidal ideation, only family stress predicted suicide attempts. Whereas dissatisfaction with the present, regret for the past, and hopelessness for the future were all predictors for suicidal ideation, only regret for the past was a significant predictor of suicide attempts. The distinctive impact of family stress on suicide attempts suggests that family support can play a pivotal role in suicide prevention, and the significant impact of regret for the past on suicide attempts indicates the need for a cognitive approach in a high-risk population. Finally, the substantial impact of alcohol on suicide attempts compared to suicidal ideation suggests the importance of alcohol regulation in suicide prevention.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5dd25b013edf6e90d61425671b701ae",
  "timestamp": "2025-05-15T03:10:33.049975"
}