{
  "id": 8375,
  "title": "Prevalence of frailty and pre-frailty and related factors in older adults with cardio-cerebral vascular disease in China: a national cross-sectional study",
  "abstract": "ObjectiveFrailty increases adverse clinical outcomes in older patients with cardio-cerebral vascular disease (CCVD). The aim of this study was to investigate the prevalence of frailty and pre-frailty in older adults with CCVD in China and the factors associated with it. Research design and methodsIn this cross-sectional study, we used data from the fourth Sample Survey of Aged Population in Urban and Rural China. We used the frailty index for frailty and pre-frailty assessment, and the diagnosis of CCVD in older adults was self-reported. ResultsA total of 53,668 older patients with CCVD were enrolled in the study. The age-standardized prevalence of frailty and pre-frailty in older patients with CCVD was 22.6% (95% CI 22.3-23.0%) and 60.1% (95% CI 59.7-60.5%). Multinomial logistic regression analyses showed that being female, increasing age, rural residence, illiteracy, widowhood, ethnic minority, living alone, no health screening during the last year, hospitalization during the last year, difficult financial status, comorbid chronic conditions, and disability in activities of daily living were associated with frailty and pre-frailty in older patients with CCVD. ConclusionCCVD is strongly associated with frailty and pre-frailty in older Chinese people, and assessment of frailty should become routine in the management of older CCVD patients. Appropriate public health prevention strategies should be developed based on identified risk factors for frailty in older CCVD patients, which can help prevent, ameliorate or reverse the development of frailty in CCVD in the older population.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c5f54d01a1bbb71ed9a88f1e89711e4e",
  "timestamp": "2025-05-15T03:18:19.543987"
}