{
  "id": 823,
  "title": "New metrics and approaches for predicting bankruptcy",
  "abstract": "Credit risk models, particularly those seeking to understand signals given by companies close to bankruptcy, are under constant discussion and updating. Statistical models are traditional and easy to understand but machine learning have been tested in the financial context. Here, we developed bankruptcy forecast models for non-financial US companies, using a dataset comprising 1980-2014. We examined static, growth and also growth variation as inputs for predicting which firms would go bankrupt one year later. Seven techniques were tested, including Discriminant Analysis, Logistic Regression, and machine learning ones, such as Neural Networks, Support Vector Machines, AdaBoost, Bagging, and Random Forest. Given the number of models evaluated, the analyses are rich and varied, with emphasis on the finding that traditional techniques with the appropriate variables are more capable of achieving superior performance than machine learning models. These results open a debate with the current literature, which has been declaring precisely the opposite. Nevertheless, this article contributes to the literature in several ways, as it uses a comprehensive sample and a performance comparison, allowing potential application by both practitioners and researchers. Besides, this is the first work that simultaneously tests growth measures and growth variation rates, which have relevant rationale and impacts.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c6030752b25a32b4aa59430564f4888b",
  "timestamp": "2025-05-15T01:55:41.543203"
}