{
  "id": 7438,
  "title": "Challenges for urban transport policy after the Covid-19 pandemic: Main findings from a survey in 20 European cities",
  "abstract": "This article explores the changes in transport and mobility patterns that were triggered by the Covid-19 pandemic, as well as citizens' potential new expectations arising from this situation regarding public transport policy and urban planning. We conducted an extensive survey in 20 cities across 11 European countries during the second quarter of 2021, with a total of 10000 respondents. The information that we collected covered the change in the frequency of technology-based alternatives to travel-such as teleworking and online shopping -compared to the pre-pandemic period. It also included the change in trip frequency, purpose, mode and desti-nation. Using the survey dataset as input, we applied a classification model that explains the change in mode choice based on the respondent characteristics and preferences. Our findings suggest that the changes in mobility patterns induced by the pandemic are the result of the combination of the degree of mobility restrictions imposed in each city, the adoption of new lifestyle and work patterns, and individual choices that depend on personal risk aversion. We identify three main challenges for urban transport policy: the increasing use of car that can rein-force long-term car dependency, the avoidance of public transport that may lead to financial and operational instability, and the uncertainty as regards the future of innovation in urban transport, especially as regards emerging technologies and business models.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c635fd17b39a78b8f0c0916592e83ebc",
  "timestamp": "2025-05-15T03:08:37.853861"
}