{
  "id": 4387,
  "title": "Financial Hardship, Unmet Medical Need, and Health Self-Efficacy Among African American Men",
  "abstract": "Background. Health self-efficacy (the confidence to take care of one's health) is a key component in ensuring that individuals are active partners in their health and health care. The purpose of this study was to determine the association between financial hardship and health self-efficacy among African American men and to determine if unmet medical need due to cost potentially mediates this association. Method. Cross-sectional analysis was conducted using data from a convenience sample of African American men who attended a 1-day annual community health fair in Northeast Ohio (N = 279). Modified Poisson regression models were estimated to obtain the relative risk of reporting low health self-efficacy. After adjusting for sociodemographic characteristics, those reporting financial hardship were 2.91 times, RR = 2.91 (confidence interval [1.24, 6.83]; p < .05), more likely to report low health self-efficacy. When unmet medical need due to cost was added to the model, the association between financial hardship and low health self-efficacy was no longer statistically significant. Conclusion. Our results suggest that the association between financial hardship and health self-efficacy can be explained by unmet medical need due to cost. Possible intervention efforts among African American men with low financial resources should consider expanding clinical and community-based health assessments to capture financial hardship and unmet medical need due to cost as potential contributors to low health self-efficacy.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c636a5892401c8371ca3dc3b34aa6a29",
  "timestamp": "2025-05-15T02:36:38.472217"
}