{
  "id": 5740,
  "title": "CEO Overconfidence and Corporate Risk and Performance",
  "abstract": "This study examines how CEO overconfidence is related to corporate risk and performance. A sample of 74 Jordanian-listed companies, listed on Amman Stock Exchange, from both the industrial and service sectors in the period from 2009-2022, is employed. CEO overconfidence was measured by developing an index consisting of five variables related to CEO characteristics. The confidence level which is employed in this study, considers CEO gender, age, qualifications, experience and compensation. Our panel regression, which performed using the Feasible Generalized Least Square method, reveals that more confident CEOs take higher risks measured by financial risk and the volatility in the accounting profit. Corporate performance found by return on assets and return on equity is also positively and significantly affected by CEO overconfidence, indicating that more confident CEOs are value enhancing for their companies. These results imply that CEO overconfidence should be considered when analyzing determinants of corporate risk and performance. Further, the findings of this study are all in line with the hubris hypothesis and upper echelons theory arguments. Our findings are robust using alternative measures for CEO overconfidence, risk, and performance. Testing an important psychological bias, such as overconfidence, has significant implications for academics, investors, and policymakers.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c639c67d2c0560e5a0aa59850d1a7ed2",
  "timestamp": "2025-05-15T02:50:53.915788"
}