{
  "id": 887,
  "title": "???????Effects of Mobile-Based Financial Incentive Interventions for Adults at Risk of Developing Hypertension: Feasibility Randomized Controlled Trial",
  "abstract": "Background: Hypertension is the leading modifiable risk factor for cardiovascular disease and mortality. Adopting lifestyle modifications, like increasing physical activity (PA), can be an effective strategy in blood pressure (BP) control, but many adults do not meet the PA guidelines. Financial incentive interventions have the power to increase PA levels but are often limited due to cost. Further, mobile health technologies can make these programs more scalable. There is a gap in the literature about the most feasible and effective financial incentive PA framework; thus, pay-per-minute (PPM) and self-funded investment incentive (SFII) frameworks were explored. Objective: The aims were to (1) determine the feasibility (recruitment, engagement, and acceptability) of an 8-week mobile-based PPM and SFII hypertension prevention PA program and (2) explore the effects of PPM and SFII interventions relative to a control on the PA levels, BP, and PA motivation. Methods: In total, 55 adults aged 40-65 years not meeting the Canadian PA guidelines were recruited from Facebook and randomized into the following groups: financial incentive groups, PPM or SFII, receiving up to CAD $20 each (at the time of writing: CAD $1=US $0.74), or a control group without financial incentive. PPM participants received CAD $0.02 for each minute of moderate-to-vigorous PA (MVPA) per week up to the PA guidelines and the SFII received CAD $2.50 for each week they met the PA guidelines. Feasibility outcome measures (recruitment, engagement, and acceptability) were assessed. Secondary outcomes included changes in PA outcomes (MVPA and daily steps) relative to baseline were compared among PPM, SFII, and control groups at 4 and 8 weeks using linear regressions. Changes in BP and relative autonomy index relative to baseline were compared among the groups at follow-up. Results: Participants were randomized to the PPM (n=19), SFII (n=18), or control (n=18) groups. The recruitment, retention rate, and engagement were 77%, 75%, and 65%, respectively. The intervention received overall positive feedback, with 90% of comments praising the intervention structure, financial incentive, and educational materials. Relative to the control at 4 weeks, the PPM and SFII arms increased their MVPA with medium effect (PPM vs control: eta(2)(p)=0.06, mean 117.8, SD 514 minutes; SFII vs control:eta(2)(p)=0.08, mean 145.3, SD 616 minutes). At 8 weeks, PPM maintained a small effect in MVPA relative to the control (eta(2)(p)=0.01, mean 22.8, SD 249 minutes) and SFII displayed a medium effect size (eta(2)(p)mean 113.8, SD 256 minutes). Small effects were observed for PPM and SFII relative to the control for systolic blood pressure (SBP) and diastolic blood pressure (DBP) (PPM:eta(2)(p)=0.12, Delta mean SBP 7.1, SD 23.61 mm Hg;eta(2)(p)=0.04, Delta mean DBP 3.5, SD 6.2 mm Hg; SFII:eta(2)(p)=0.01, Delta mean SBP -0.4, SD 1.4 mm Hg; eta(2)(p)=0.02,.mean DBP -2.3, SD 7.7 mm Hg) and relative autonomy index (PPM:eta(2)(p)=0.01; SFII: eta(2)(p)=0.03). Conclusions: The feasibility metrics and preliminary findings suggest that a future full-scale randomized controlled trial examining the efficacy of PPM and SFII relative to a control is feasible, and studies with longer duration are warranted.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c63f39236d954d9f125d54ee4c5567a2",
  "timestamp": "2025-05-15T01:43:54.613807"
}