{
  "id": 5852,
  "title": "Clustering of characteristics associated with unplanned pregnancies: the generation R study",
  "abstract": "Background Unplanned or unintended pregnancies form a major public health concern because they are associated with unfavorable birth outcomes as well as social adversity, stress and depression among parents-to-be. Several risk factors for unplanned pregnancies in women have previously been identified, but studies usually take a unidimensional approach by focusing on only one or few factors, disregarding the possibility that predictors might cluster. Furthermore, data on predictors in men are largely overlooked. The purpose of this study is to determine predictors of unplanned versus planned pregnancy, to determine predictors of ambivalent feelings regarding pregnancy, and to investigate how characteristics of men and women with an unplanned pregnancy cluster together. Methods This study was embedded in Generation R, a multiethnic population-based prospective cohort from fetal life onwards. Pregnancy intention was reported by 7702 women and 5367 partners. Information on demographic, mental, physical, social, and sexual characteristics was obtained. Logistic regression, multinomial regression and cluster analyses were performed to determine characteristics that were associated with an unplanned pregnancy, with ambivalent feelings regarding the unplanned pregnancy and the co-occurrence of characteristics in women and men with unplanned pregnancy. Results Twenty nine percent of the pregnancies were unplanned. Logistic regression analyses showed that 42 of 44 studied predictors were significantly associated with unplanned pregnancy. The most important predictors were young age, migration background, lower educational level, lower household income, financial difficulties, being single, lower cognitive ability, drug use prior to pregnancy, having multiple sexual partners in the year prior to the pregnancy, younger age of first sexual contact and a history of abortion. Multinomial regression analyses showed that a Turkish or Moroccan background, Islamic religion, little financial opportunities, being married, having >= 3 children, high educational level, more mental health and social problems and older age of first sexual contact were associated with prolonged ambivalent feelings regarding pregnancy. Different combinations of characteristics were observed in the four clusters of women and men with unplanned pregnancy. Conclusions Many predictors are related with unplanned pregnancies, ambivalent feelings toward the pregnancy, and we identified very heterogeneous groups of women and men with unplanned pregnancies. This calls for heterogeneous measures to prevent unplanned pregnancies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c64d6f9a40a7cf485c2d42c1cb3ddc97",
  "timestamp": "2025-05-15T02:51:58.697188"
}