{
  "id": 7260,
  "title": "Socio-demographic and psychopathologic correlates of enuresis in urban Ethiopian children",
  "abstract": "Aim: To examine the association between enuresis and psychopathology in urban Ethiopian children. Methods: A two-stage mental health survey of 5000 urban children found enuresis to be by far the most common disorder. Logistic regression modelling was carried out to determine the independent associations of a number of socio-demographic and psychopathological characteristics with enuresis. Results: Male sex, younger age and lower achieved educational grade of the child were all independently associated with childhood enuresis. The odds of having enuresis were significantly higher for children in families with significant financial worries and in children from homes where parents were separated. Children with DSMIII-R anxiety disorders, especially simple phobia, or disruptive behaviour disorders were found to have significantly higher odds of having enuresis. Conclusion: Psychopathology, both anxiety and behavioural disorders, as well as family stressors in urban Ethiopian children were found to be risk factors for enuresis. Although a cause-effect relationship could not be ascertained, the findings of higher association of psychopathology with enuresis in this and other studies indicate that there is a need for evaluating children with enuresis for the presence of concurrent psychopathology, especially in traditional societies where undetected psychopathology may be more common.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c64fb346422c9df673480e8b6a9205a8",
  "timestamp": "2025-05-15T03:06:35.453152"
}