{
  "id": 7351,
  "title": "Social class related inequalities in household health expenditure and economic burden: evidence from Kerala, south India",
  "abstract": "Background: In the Indian context, a household's caste characteristics are most relevant for identifying its poverty and vulnerability status. Inadequate provision of public health care, the near-absence of health insurance and increasing dependence on the private health sector have impoverished the poor and the marginalised, especially the scheduled tribe population. This study examines caste-based inequalities in households' out-of-pocket health expenditure in the south Indian state of Kerala and provides evidence on the consequent financial burden inflicted upon households in different caste groups. Methods: Using data from a 2003-2004 panel survey in Kottathara Panchayat that collected detailed information on health care consumption from 543 households, we analysed inequality in per capita out-of-pocket health expenditure across castes by considering households' health care needs and types of care utilised. We used multivariate regression to measure the caste-based inequality in health expenditure. To assess health expenditure burden, we analysed households incurring high health expenses and their sources of finance for meeting health expenses. Results: The per capita health expenditures reported by four caste groups accord with their status in the caste hierarchy. This was confirmed by multivariate analysis after controlling for health care needs and influential confounders. Households with high health care needs are more disadvantaged in terms of spending on health care. Households with high health care needs are generally at higher risk of spending heavily on health care. Hospitalisation expenditure was found to have the most impoverishing impacts, especially on backward caste households. Conclusion: Caste-based inequality in household health expenditure reflects unequal access to quality health care by different caste groups. Households with high health care needs and chronic health care needs are most affected by this inequality. Households in the most marginalised castes and with high health care need require protection against impoverishing health expenditures. Special emphasis must be given to funding hospitalisation, as this expenditure puts households most at risk in terms of mobilising monetary resources. However, designing protection instruments requires deeper understanding of how the uncovered financial burden of out-patient and hospitalisation expenditure creates negative consequences and of the relative magnitude of this burden on households.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c671a751e16182869ae60d92c7797ce2",
  "timestamp": "2025-05-15T03:07:31.977532"
}