{
  "id": 2798,
  "title": "E-portfolio implementation: Examining learners' perception of usefulness, self-directed learning process and value of learning",
  "abstract": "Electronic portfolios (e-portfolios) have been widely used to help learners collect evidence of their learning, reflect on their evaluation, and promote self-directed learning. Through the introduction of an e-portfolio platform in a cluster of lessons in a module in a polytechnic in Singapore, this paper aimed to evaluate the effectiveness of the e-portfolio through the learners' perceptions. A cross-sectional design using an online survey was employed with 226 students taking part in this study. There was high internal consistency among the survey items. Exploratory factor analysis suggested a 5-factor structure: (1) perceived usefulness (PU), (2) organisation (ORG), (3) collaboration (COL), (4) evaluation (EVA), and (5) perceived value of learning (PVL). In addition, confirmatory factor analysis verified that the proposed 5-factor solution was a good model fit. The final research instrument comprised 19 items. A further multiple regression analysis showed that all the independent variables, except for evaluation, were positive and significant predictors of learners' PVL. Specifically, the ORG variable was the most influential predictor of PVL. In comparison, the PU variable was a relatively weaker predictor of PVL. The practical implications and further direction for research are discussed in the paper. Implications for practice: Curriculum designers could leverage on the use of Padlet as an e-portfolio as it has shown to be a promising tool in scaffolding students to practice self-directed learning. Curriculum teams could increase learners' perceived usefulness of e-portfolios by allowing learners to be familiarised with the tool in earlier phases of the curriculum. Curriculum leaders may need to orchestrate carefully the technological, learning processes, and the affective aspects of learners to promote self-directed learning.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c677e824fac0e2b5c1011b60d9a63bbb",
  "timestamp": "2025-05-15T01:10:49.431198"
}