{
  "id": 8464,
  "title": "How Self-Employed Older Adults Differ by Age: Evidence and Implications From the Health and Retirement Study",
  "abstract": "Background and Objectives: There has been increased attention in recent years on self-employment in later life, with about 1 in 5 workers past of the age of 50 working for themselves. This study aims to build upon previous documentation of the characteristics of self-employed older adults by estimating how these characteristics vary by age. Research Design and Methods: Using 7 waves of the Health and Retirement Study with a sample of more than 16,000 working older adults, this study considers how the association between self-employment and sociodemographic characteristics; indicators of human, social, and financial capital; and risk tolerance differ between adults aged 50-61 and 62 years and older. Binary logistic regression and seemingly unrelated estimation are used to estimate and compare the characteristics by age group. Results: Compared to wage-and-salary work and controlling for all other factors in the models, the oldest self-employed group was more likely to identify as Black, report lower health, and receive health insurance from several sources than the younger group. Further, the older group reported lower individual earnings from work yet higher total household income (less individual earnings) and was also less likely to formally volunteer at the highest commitment levels. Discussion and Implications: With some exceptions, these results indicate that the diversity of self-employed older adults within traditional retirement age is greater than among those before this age. Implications regarding how access to key safety net programs, such as Social Security retirement benefits and Medicare, may lead to this finding are discussed.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c68587bb53d074756bdef2609d7e68ad",
  "timestamp": "2025-05-15T03:19:21.248731"
}