{
  "id": 1200,
  "title": "A machine learning approach for time series forecasting with application to debt risk of the Montenegrin electricity industry",
  "abstract": "Level of customer electricity debts is a relevant information for the electricity production company, as it represents uncollected revenue for the provided service. Higher level of debts may affect the provider's financial stability and the ability to invest and maintain their network. On the other hand, high levels of debt may indicate larger macroeconomic problems, such as the lower standard of the citizens or high unemployment. In this paper, a Machine Learning approach for electricity debt prediction was applied, using Support Vector Regression method and data from the Montenegrin electricity provider. The obtained results indicate an excellent model performance, proving that the chosen method is an outstanding choice for this task, compared to other machine learning methods. The forecast of electricity user debts using machine learning techniques adds a new research area to the existing research, as the previous literature mostly concentrated on the prediction of electric load, consumption, and demand. The risk of default may be larger in lower income nations, as is the case in this research, therefore risk prediction and mitigation are crucial for the power supplier in these countries. The results obtained in this research on the test set are 1.63% and 0.854, for Relative Error and R2, respectively, showing excellent predictive performance. Additionally, correlation coefficient is close to 1 in cross-validation and on unknown data. Thus, it can be confirmed that the debt prediction was efficient. (c) 2023 The Authors. Published by Elsevier Ltd. This is an open access article under the CCBY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c68bd83e95f3fded84614ac1f7e23eaf",
  "timestamp": "2025-05-15T01:59:56.351919"
}