{
  "id": 5197,
  "title": "Variability of perioperative mortality of hepatic resection in Australia",
  "abstract": "BackgroundHepatic resection is a relatively young and complex specialized procedure. A strong relationship between volume and perioperative mortality has been reported internationally. However, there has been no multicentre study into hepatic resection in Australia. This retrospective, population-based cohort study was conducted to determine national, state and territory based volume and perioperative mortality rates (POMRs). MethodsAustralian Institute of Health and Welfare data was interrogated for the Australian Classification of Health Intervention codes for hepatic resection defined as extended hemi-hepatectomy (30421), hemi-hepatectomy (30418), segmental hepatic resection (30415) and sub-segmental hepatic resection (30414). Logistic regression analysis was performed using the de-identified data to investigate trends and differences between states/territories. Mortality rates were risk adjusted for age, gender and public or private admission. The data set included patients who underwent hepatic resection in the financial years 2005/2006 to 2012/2013. ResultsThe overall POMR for all types of hepatic resection was 1.6% (201/12562). There was no significant change in POMR over time. However, there was significant variation between the states and territories with two states having significantly higher POMR for major hepatic resections (regional range: 1.3-3.8%). POMRs increased with age with the highest mortality seen in the 75-79year age group. The POMR was lower in private than in public hospitals. ConclusionThe results of this study confirm that the overall Australian POMR for major hepatic resection is similar to results reported internationally. National and state/territory POMR has not varied significantly over time. The significant variation between states/territories warrants further investigation.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c6a0de6d7039e7554186f5ae36b7d46b",
  "timestamp": "2025-05-16T17:50:25.559371"
}