{
  "id": 6338,
  "title": "Taxing energy to tackle greenhouse gases: evaluating the role of financial risk in high-income economies",
  "abstract": "Energy, a basic input to the economic system, plays a pivotal function in development; at the same time, it raises concerns and hurdles to global economies as a result of negative externalities associated with its usage. Economies set various measures to limit these negative externalities and encourage citizens toward renewable energy utilization. Considering a panel of high-income economies over the period of 1990-2020, we empirically examine whether energy-related tax policies (ENT) are helpful to tackle the issue of energy-related greenhouse gas emissions (ENGHGs). Furthermore, we also investigate the role of digitalization (DIG) and financial risk (FINR) for its possible impact on ENGHGs. The advanced econometric techniques include diagnostic tests, Method of Moment Quantile Regression (MMQR), for robustness validation quantile regression, and finally Dumitrescu and Hurlin panel causality check. The findings reveal that ENT policies of selected economies are not helpful to limit ENGHGs in 25th and 50th quantiles effectively. Nevertheless, due to the progressive rise in ENT in the 75th and 90th quantiles, ENT significantly helps to smoothen the path towards a sustainable future. Furthermore, GDP increases, while improvement in FINR decreases ENGHGs. As the selected economies are developed and high-income, it is suggested that a progressive rise in ENT may further limit the issue of ENGHGs.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c6ac526e85e1af5568c457cb9ee5840b",
  "timestamp": "2025-05-15T02:57:07.701266"
}