{
  "id": 6561,
  "title": "Impact of Environmental, Social and Governance (ESG) disclosure on firm risk: A meta-analytical review",
  "abstract": "While the relationship between ESG disclosures and firm risk has been researched substantially, the results remain inconclusive, and contradictory, as of 2023. Through meta-analysis, we investigate the effect of ESG disclosures measured by studies using E, S, G, or ESG disclosure on firm risk measured as total, systematic, or idiosyncratic risk with a sample of 76 papers published between 1991 and 2023. To the best of our knowledge, this is the pioneering attempt to investigate the impact of ESG disclosure on firm risk by adopting a meta-analytical procedure to assess the significance of estimated mean effect size followed by meta-regression analysis to test the effect of potential moderators. E, S, and G disclosures were found to be inversely related to firm risk as proposed by stakeholder and legitimacy theories. Further, the relationship between ESG disclosures and firm risk was found to be more pronounced for idiosyncratic risk rather than systematic risk. Results confirmed that firm size and female participation significantly moderated the relation between ESG disclosures and the level of firm risk. However, R&D, financial flexibility, disclosure index, and ROA had an insignificant but negative impact on the relationship. Our findings provide solace to managers and policymakers who may increasingly invest in ESG activities without worrying as ESG investing results in reducing firm risk. In addition, to manage risk, portfolio managers may include more stocks of environmentally as well as socially responsible firms in their portfolios. Future studies may suggest new moderators in the field of ESG disclosures and firm risk, thereby broadening the theoretical realm. Subsequent studies should examine the influence of specific environmental concerns such as carbon emissions, as well as social concerns such as gender equality and employee compensation, on stock returns. It contributes to the prevailing debate on ESG disclosures and firm risk nexus as well as attempts to shed light on pertinence of moderators affecting the relationship.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c6c53e8761e9f47c39001a605b40f0ea",
  "timestamp": "2025-05-15T02:59:07.635681"
}