{
  "id": 8166,
  "title": "An analysis of yield variation under soil conservation practices",
  "abstract": "Much attention has been paid to the effects of multiple soil conservation and soil health practices on the mean yield of the subsequent crop. Much less research has focused on the variability of crop yields over time or space. Yield stability reported in standard deviation, mean absolute deviation, or coefficient of variation can be an important measure of risk for producers. Risk reduction has economic value, and understanding the effect of tillage and other soil conservation practices on yield risk is relevant to farm financial management and crop insurance risk assessment. We used data from test plots in a corn (Zea mays L.)-soybean (Glycine max L.) rotation, spanning from 2003 to 2011 to assess differences in yield stability over time and space. In this experiment, each plot was randomly assigned to a treatment of no-till with no cover crop (NTNC), no-till with an annual ryegrass (Lolium multiflorum Lam.) cover crop (NTCC), or a control group using conventional tillage with no cover crop (CTNC). The statistical analysis made three relevant comparisons: (1) NTCC versus NTNC, (2) NTNC versus CTNC, and (3) NTCC versus CTNC. The analysis also included separating temporal and spatial variation using a time-first approach from the literature, followed by testing for differences between groups. We employed a standard deviation ratio test, Levene's test, and coefficient of variation t-test. Additionally, analysis of temporal volatility was conducted using ordinary least squares regression and associated t-tests in a method similar to a stock beta, a technique commonly accepted in finance to measure the volatility of an investment. We propose this as a new method in analyzing the temporal volatility in crop yields. We found that no-till reduced average temporal yield variation in corn, and that cover crops reduced average spatial variation in corn. These results were robust over multiple statistical tests. Using the beta coefficient methodology proposed in this paper, we found in both corn and soybeans that NTNC and NTCC had lower temporal yield volatility relative to a benchmark yield from the CTNC group. However, the beta coefficients were, in most cases, not statistically significant. The results of this study suggest that both no-till and cover crops may help reduce yield risk for Midwestern farmers while reducing soil and nutrient loss.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c6c71541a5ff0665c4c9f992eabff185",
  "timestamp": "2025-05-15T03:16:17.283004"
}