{
  "id": 9100,
  "title": "Defining the Cross-Volume Effect of Extracorporeal Life Support on Outcomes of Cardiogenic Shock",
  "abstract": "BACKGROUND Cardiogenic shock (CS) remains a leading cause of mortality despite advancements in mechanical circulatory support and other management strategies. In particular, venoarterial extracorporeal membrane oxygenation (ECMO) requires expertise in cardiac surgery, cardiology, and critical care. The benefits of such expertise may extend beyond patients undergoing ECMO. METHODS Hospitalizations in adults (aged >= 18 years) with a primary diagnosis of CS who were not undergoing ECMO, cardiac operations, durable left ventricular assist device therapy, or heart transplantation were abstracted from the 2016-2020 Nationwide Readmissions Database. Multivariable regression models were developed to assess the association of cardiac surgical and ECMO institutional caseload with clinical and financial outcomes. RESULTS Of an estimated 70,339 patients with CS identified for study, 33,643 (47.8%) were treated at a high-volume hospital for ECMO (HVH-ECMO). HVH-ECMO was associated with decreased odds of in-hospital mortality (adjusted odds ratio [aOR], 0.85; 95% CI, 0.75-0.95), respiratory complications (aOR, 0.86; 95% CI, 0.79-0.94), and nonhome discharge (aOR, 0.86; 95% CI, 0.79-0.94). However, HVH-ECMO was associated with a longer length of stay by 1.7 days (95% CI, 1.3-2.1) and higher inpatient costs by $9170 (95% CI, $6,490-$12,060). Although ECMO volume was inversely associated with the predicted risk of in-hospital mortality, institutional volume of cardiac operations was not significantly associated with mortality. CONCLUSIONS Our findings suggest improved outcomes for patients with CS who were treated at an HVH-ECMO. Multidisciplinary care pathways, including those among surgery, cardiology, and critical care, may influence CS management. Further studies are needed to characterize long-term outcomes of regionalization and ensure equitable access for all populations. (c) 2024 The Authors. Published by Elsevier Inc. on behalf of The Society of Thoracic Surgeons. This is an open accessarticle under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/)",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c6cc80d50c267ceb5ffb8044a54df7c6",
  "timestamp": "2025-05-15T03:25:27.776147"
}