{
  "id": 4283,
  "title": "The impact of IFRS 9 and IFRS 7 on liquidity in banks: Theoretical aspects",
  "abstract": "The conviction that capital markets could always satisfy Liquidity needs of agents has been strongly questioned during recent years. One consequence has been the IASB introducing IFRS 9, as substitute of IAS 39, in order to improve mechanisms of classification and measurement of Financial Instruments, deemed as one of the main causes triggering the financial crisis. Despite the effort of the International Board to introduce provisions able to assure relevant and useful information for the assessment of the amounts, timing and uncertainty of the entity's future cash flows, there are some critical points associated with those requirements focused in the paper. We first introduced concepts of Liquidity and of Liquidity Risk, instrumental to a critical study of IFRS 9 insides. We then enriched the analysis, investigating IFRS 7 contents (just for what regards disclosure on Liquidity Risk), looking for information that could overcome IFRS 9 limits. According to our conclusions, IASB should think about the chance, among others, to pay more attention to the Business Model pattern and to behavioural liquidity characteristics associated to financial instruments. To sum up, the study aimed at analyse the impact of accounting rules on liquidity in banks. As it is a topic poorly addressed, not only from the academic literature but also by professional bodies, it can be considered as an emerging field of research. This aspect can be considered as one of its strength points. (C) 2014 Published by Elsevier Ltd.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c6ea0b2f935a1d83f23f6455cd89f5d7",
  "timestamp": "2025-05-15T02:35:26.263891"
}