{
  "id": 4248,
  "title": "Societal trust, risk avoidance and corporate risk taking: evidence from the global insurance industry",
  "abstract": "The global insurance industry is undergoing fundamental change, with countries that are classified as emerging economies (such as China and other countries in the Asia-Pacific region) playing increasingly important roles. In this article, we investigate the effect of two important dimensions of a country's culture, societal trust and risk avoidance, on risk taking by insurance firms around the world between 2001 and 2014. We measure societal trust and risk avoidance using the World Value Survey. Our results indicate that there is a positive and significant association between the level of societal trust and insurer risk taking in a country, while there is a negative and significant association between the level of risk avoidance and insurer risk taking. We show that our main results are robust to changes in sample composition and potential bias related to the 2007-2009 global financial crisis. One possible concern is that insurer risk taking could be affected by many institutional and societal factors of a country that are not included in our regression analysis. To alleviate this concern, we use the two-stage least squares regression method with instrumental variables to address the potential endogeneity problem related to omitted variables, and find that our results remain unchanged. Additionally, we show that the negative relationship between risk avoidance and insurer risk taking still holds when we use alternative uncertainty avoidance measures.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c6ecd2a2b544d493fce93f8de5faaa89",
  "timestamp": "2025-05-15T02:34:48.933230"
}