{
  "id": 613,
  "title": "A data science-based marketing decision support system for brand management",
  "abstract": "To improve the marketing activity and brand management and justify the most effec-tive marketing decisions, organizations should implement different information tech-nologies, mathematical methods and models into the marketing decision support sys-tem (MDSS). The goal of this paper is to form an architecture of an MDSS, the model base of which is developed on Data Science tools, in particular regression analysis and machine learning methods. The proposed MDSS is a multi-agent information system comprising nine intellectual agents (market environment monitoring, data processing, marketing mix modeling, price policy support, portfolio management, strategic analy-sis, forecasting, customer segmentation, and customer classification). The functionality of these agents is realized through Data Science, which allows for the optimization of marketing activities (e.g., an effective brand management strategy and its elements (portfolio strategy, price policy, and media strategy) or solving the problems of attract-ing new and retaining current customers with the maximal return on marketing in-vestments). The MDSS analyzes the marketing environment, media activity, and busi-ness indicators by constructing different models and forecasting various combinations of marketing factors to select the best one. The joint work of MDSS agents provides decision-makers with interactive reports. The research findings offer a scientific basis for making effective marketing decisions based on data, and the proposed MDSS can become part of an intelligent system for planning marketing activities.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c6f2cece8a8eef62c6286db7e0a4f2d4",
  "timestamp": "2025-05-15T00:45:39.135217"
}