{
  "id": 2131,
  "title": "Design of a Personal Credit Risk Prediction Model and Legal Prevention of Financial Risks",
  "abstract": "With the escalating demand for personal credit, banking financial institutions face the imperative to expand their user base and mitigate losses caused by non-performing loans (NPLs). This study addresses the necessity for accurate and efficient personal credit risk assessment systems, focusing on rectifying credit data imbalances and developing a high-performing credit risk prediction model. To tackle data imbalance, deep learning's Generative Adversarial Network (GAN) is employed for oversampling, learning the distribution of default samples within high-risk financial groups. New default samples are then integrated into the original dataset to achieve a balanced representation of default and normal samples. In the era of big data, marked by a surge in personal credit data dimensions and sample numbers, an advanced ensemble learning model, the Light Gradient Boosting Machine (LightGBM), is combined with the GAN model for credit risk prediction. The study utilizes six different imbalance ratio datasets from the Knowledge Extraction based on Evolutionary Learning platform to experiment with the GAN model's classification effectiveness. Additionally, consumer finance company credit data, consisting of 559 features, undergoes data preprocessing and feature extraction to validate the LightGBM-GAN model's effectiveness for credit risk prediction. Experimental results reveal that: (1) GAN significantly improves risk information classification (achieving an 86.7% accuracy), outperforming traditional oversampling methods on multiple datasets; (2) The LightGBM-GAN model excels in Area Under the Receiver Operating Characteristic Curve and Kolmogorov-Smirnov statistic values (averaging 0.86 and 0.87, respectively), establishing itself as an effective credit risk prediction model; (3) Feature importance identified by the LightGBM model underscores the predictive potential of financial weakly correlated variables, such as consumer behavior data. This study strives to equip financial institutions with efficient and precise credit risk assessment tools, ensuring compliance with laws and regulations, averting legal risks, reducing NPL risks, and fortifying the stability of the financial system.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c7025a1c294bbda73b561374987d8e4a",
  "timestamp": "2025-05-15T02:11:40.556797"
}