{
  "id": 2368,
  "title": "The Role of Sensors and Controls in Transforming the Energy Landscape",
  "abstract": "The U.S. Department of Energy funds a large portfolio of fossil energy R&D projects aimed at transformational improvements in the cost and environmental performance of coal-based power generation while maintaining high reliability standards The National Energy Technology Laboratory (NETL) manages DOE's Crosscutting Research Program, which leverages on-going trends in disruptive technology to achieve breakthroughs in sensors and controls. Examples include: advanced manufacturing of embedded sensors with energy harvesting capability; wireless signal transmission and blockchain infrastructure; and the application of data analytics and machine learning to processing distributed sensor signals to create actionable control interfaces. The fossil energy application space requires the development of sensors capable of monitoring key operational parameters (temperature, pressure, and gas compositions) while operating in harsh environments; analytical sensors capable of on-line, real-time evaluation and measurement to support condition-based monitoring. Controls development centers around self-organizing information networks, algorithms for component lifetime assessment and plant-level economics, and distributed intelligence for process control and decision making All of this must be accomplished while hardening fossil energy assets. An overview of DOE's Fossil Energy R&D Program with an emphasis on Sensors and Controls will be presented including discussion of technologies and applications being pursued and their status.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c72c029975de1a9870e633480385b5b7",
  "timestamp": "2025-05-15T01:06:10.752122"
}