{
  "id": 480,
  "title": "Cost-Effectiveness Analysis of Non-Vitamin K Antagonist Oral Anticoagulants Versus Warfarin in Thai Patients With Non-Valvular Atrial Fibrillation",
  "abstract": "Background Non-vitamin K antagonist oral anticoagulants (NOACs) have been recommended as preferred options for stroke prevention in patients with atrial fibrillation (AF) versus warfarin by guidelines worldwide. Aim This study aimed to evaluate the cost-effectiveness of each NOAC in a Thai health care environment, a country with upper middle-income economies based on the World Bank's classification. Method A lifetime Markov model was created from a Thai societal perspective. The model consisted of 19 health states separated into two cycles: event cycle and consequence cycle. The consequences of AF included in the model were ischaemic stroke, intracranial haemorrhage, extracranial haemorrhage, and myocardial infarction. All NOACs available in Thailand (dabigatran 150 mg and 110 mg twice daily; rivaroxaban 20 ing once daily; apixaban 5 mg twice daily; edoxaban 60 mg and 30 mg once daily) were assessed using warfarin with an international normalised ratio of 2-3 as the reference. Inputs were a combination of published literature and local data when available. A willingness-to-pay of 160,000 Thai baht (THB)/quality-adjusted life year (QALY) was used as the threshold of being cost-effective. Incremental cost-effectiveness ratios and cost-effectiveness acceptability curves were estimated. Results All NOACs were not cost-effective strategies for the Thai AF population. The ranking of incremental cost- effectiveness ratios from lowest to highest were apixaban 5 mg twice daily (THB 692,136 or US$21,862) followed by edoxaban 60 mg once daily (THB 911,772 or US$28,799), edoxaban 30 mg once daily (THB 913,749 or US$28,861), dabigatran 150 mg twice daily (THB 1,102,106 or US$34,811), dabigatran 110 mg twice daily (THB 1,195,347 or US$37,756), and rivaroxaban 20 mg once daily (THB 1,347,650 or US$42,566). Cost-effectiveness acceptability curve indicated that apixaban had the highest potential to be a cost-effective strategy versus other NOACs. Conclusions Our findings indicated that all NOACs were not cost-effective in the Thai AF population. Of the NOACs, apixaban may be the most likely to be cost-effective. These data may be useful for policymakers to perform a comprehensive evaluation of these agents for formulary decision and pricing negotiation.",
  "year": 2020,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c739fc5264c65191128982ff723b3533",
  "timestamp": "2025-05-15T01:32:30.186269"
}