{
  "id": 4254,
  "title": "Timeliness of Treatment Initiation in Newly Diagnosed Patients With Breast Cancer",
  "abstract": "This retrospective study analyzed timeliness of care at Tufts Medical Center between 2009 and 2015. Most patients met the 45-day surgery and the 1-year hormone therapy benchmarks. Knowledge of reasons for treatment delay, including clinical complexity and logistical/financial issues, may allow targeting interventions for patients at greatest risk of care delays. Background: Evidence-based timeliness benchmarks have been established to assess quality of breast cancer care, as delays in treatment are associated with poor clinical outcomes. However, few studies have evaluated how current breast cancer care meets these benchmarks and what factors may delay the timely initiation of treatment. Patients and Methods: Demographic and disease characteristics of 377 newly diagnosed patients with breast cancer who initiated treatment at Tufts Medical Center (2009-2015) were extracted from electronic medical records. Time from diagnosis to initial surgery and time from diagnosis to initiation of hormone therapy were estimated with Kaplan-Meier curves. Multivariable regression analysis was used to identify factors associated with treatment delays. Thematic analysis was performed to categorize reasons for delay. Results: Of 319 patients who had surgery recommended as the first treatment, 248 (78%) met the 45-day benchmark (median, 28 days; 25th-75th %, 19-43). After adjusting for potential confounders, multivariable regression analysis revealed that negative hormone receptor status (odds ratio, 3.48; 95% confidence interval, 1.44-8.43) and mastectomy (odds ratio, 4.07; 95% confidence interval, 2.10-8.06) were significantly associated with delays in surgery. Delays were mostly owing to clinical complexity or logistical/financial reasons. Of 241 patients eligible for hormone therapy initiation, 232 (96%) met the 1-year benchmark (median, 147 days; 25th-75th %, 79-217). Conclusion: Most patients met timeliness guidelines for surgery and initiation of hormone therapy, although risk factors for delay were identified. Knowledge of reasons for breast cancer treatment delay, including clinical complexity and logistical/financial issues, may allow targeting interventions for patients at greatest risk of care delays. (C) 2019 Elsevier Inc. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c74d4073542d5333e39ded34d437f166",
  "timestamp": "2025-05-15T02:34:48.955928"
}