{
  "id": 7756,
  "title": "Pediatric Medical Device Development and Regulation: Current State, Barriers, and Opportunities",
  "abstract": "Few medical devices are designed and marketed specifically for children. Instead, adult devices are often repurposed and used off-label in pediatrics. The innovation gap between pediatric and adult devices is complex and multifactorial. This review aims to summarize the medical device landscape, describe barriers to pediatric device development, and provide an update on current strategies to help overcome these limitations. Medical devices are regulated by the Food and Drug Administration. They are registered, cleared, or approved on the basis of a 3-tier risk classification system and a differentiated set of regulatory pathways. This includes some for products that receive special designations on the basis of specific aspects that warrant more rapid review and approval. Pediatric devices number only one-quarter of those developed for adults for multiple reasons. Clinically, innovators must adjust their products to address the smaller sizes, growth, and longer duration of use in children. Smaller sample sizes and population heterogeneity also challenge the ability to obtain sufficient safety data for regulatory submissions. Financial concerns stem from lower pediatric reimbursement rates coupled with a lack of nationally standardized coverage. There are a number of promising initiatives, including the Pediatric Device Consortia Program, Early Feasibility Studies, and the new System of Hospitals for Innovation in Pediatrics - Medical Devices. However, the gap will likely not be narrowed without broad cooperation across stakeholders from industry, academia, patient advocacy groups, health care providers, investors, payors, regulators, and Congress.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c7525ac5d72cb73ef9c5c96c9290015e",
  "timestamp": "2025-05-15T03:11:38.584155"
}