{
  "id": 7199,
  "title": "Computing a psychological health risk assessment model for road traffic noise",
  "abstract": "Introduction: Physical air pollutants comprising noise, temperature, and humidity are among health risk factors that influence human well-being. No study has been carried out on how the three physical pollutants affect the psychological health. Therefore, the objectives of this research are to assess road traffic noise, temperature, and relative humidity in association with psychological health. Final objective is to propose a formula capable of computing psychological health index using the three above-mentioned risk factors. Methods: At the chosen sample points throughout Baharan Town situated in the city of Sanandaj in Iran, data of four independent variables encompassing age of the residents, traffic noise, ambient temperature, and ambient relative humidity were collected from January to November 2021. Simultaneously, the 12-item General Health Questionnaires (GHQ-12) were distributed between residents of Baharan Town to figure out their psychological health index. Age and gender was already added to GHQ-12 as two questions. Finally, a model was formulated for general health by means of multiple linear regression analysis in the SPSS software. Results: The results reveal that age of the residents does not have a significant relationship with psychological health index. Hence, the final multiple regression model for psychological health index depends upon three predictor factors including traffic noise, ambient temperature, and ambient relative humidity with 0.521 as its coefficient of determination (R Square). After verifying the final model, it was witnessed that computed psychological health index data were in agreement with measured data. In the end, a conceptual model is proposed that implies if no observed noise levels are available, then a road traffic noise model and its output i.e. estimated LAeq values are applied as traffic noise (input) in the aforementioned health risk assessment model. Conclusions: The three above-mentioned predictors explain 52.1% of variance of the dependent variable i.e. psychological health index. Namely, the model's error equals 0.479. Given the amount of error that this formula generates, it is recommended new predictors such as financial conditions of the residents, ambient particulate matter (PM2.5 and PM10), ambient chemical air",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c75b6a3621cdf7c1fa43f2a546c363dd",
  "timestamp": "2025-05-15T03:06:01.284426"
}