{
  "id": 8961,
  "title": "Characteristics of risk groups with an insufficient demand for dental services - Results of the Study of Health in Pomerania (SHIP)",
  "abstract": "Aim: The purpose of this study was to identify risk groups for low dental care utilisation and to highlight adequate determinants for necessary action. Methods: The database was the Study of Health in Pomerania (SHIP), a cross-sectional sample drawn from the adult population (20-79 years) in a northeast region of Germany. 4310 of 7008 randomly selected inhabitants participated in the examinations (response rate 68.8%). The use of dental care in the last year was analysed using logistic regression according to the conceptual model by Andersen and Newman. Results: Multivariate analysis revealed that participation in the bonus scheme system of the statutory sickness funds (OR = 8.2) and participation in the bonus system of the private health insurance companies (OR = 2.6) as enabling resources predicted dental care use in the last year. Objektive need (OR = 1.02) is weaker associated with dental care utilisation than subjective need, for instance the attitude towards need of regular dental checkups. Presence of own teeth is a significant predictor for dental care utilization (OR = 3.3), whereas edentulous persons, those with complete denture prosthesis, don't think about possible oral problems and don't visit the dentist at least once a year. Among predisposing factors only gender and education were significant determinats for dental care utilization. Conclusions: The conclusions concerning the significant influence of subjective need and promotional impact of the bonus scheme are important for health care. Financial incentives and motivation for regular prevention should be continued and upgraded. Measures to improve preventive dental care utilization should focus on persons with low educational levels and on men with inadequate dental care utilisation. The mental anchorage of the term oral health rather than the conventional term dental health is important, so that edentulous persons become conscious of regular prevention pointers to maintain a high quality of life.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c761e2945fd4075b156476eb8040c728",
  "timestamp": "2025-05-15T03:23:56.202733"
}