{
  "id": 2559,
  "title": "Adoption of shared decision-making and clinical decision support for reducing cardiovascular disease risk in community health centers",
  "abstract": "Objective: Electronic health record (EHR)-based shared decision-making (SDM) and clinical decision support (CDS) systems can improve cardiovascular disease (CVD) care quality and risk factor management. Use of the CV Wizard system showed a beneficial effect on high-risk community health center (CHC) patients' CVD risk within an effectiveness trial, but system adoption was low overall. We assessed which multi-level characteristics were associated with system use.Materials and Methods: Analyses included 80 195 encounters with 17 931 patients with high CVD risk and/or uncontrolled risk factors at 42 clinics in September 2018-March 2020. Data came from the CV Wizard repository and EHR data, and a survey of 44 clinic providers. Adjusted, mixed-effects multivariate Poisson regression analyses assessed factors associated with system use. We included clinic-and provider-level clustering as random effects to account for nested data.Results: Likelihood of system use was significantly higher in encounters with patients with higher CVD risk and at longer encounters, and lower when providers were > 10 minutes behind schedule, among other factors. Survey participants reported generally high satisfaction with the system but were less likely to use it when there were time constraints or when rooming staff did not print the system output for the provider.Discussion: CHC providers prioritize using this system for patients with the greatest CVD risk, when time permits, and when rooming staff make the information readily available. CHCs' financial constraints create substantial challenges to addressing barriers to improved system use, with health equity implications.Conclusion: Research is needed on improving SDM and CDS adoption in CHCs.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c7a59ceaaaeb909ebde4cf4ba09067f8",
  "timestamp": "2025-05-15T02:16:32.728813"
}