{
  "id": 6235,
  "title": "Factors affecting the voluntary use of internal audit: evidence from the UK",
  "abstract": "Purpose - This study aims to identify the factors that lead non-financial companies listed in the UK to use an internal audit function (IAF) as a monitoring mechanism. Although the use of an IAF in the UK is voluntary, no prior research has examined the drivers for using one. Design/methodology/approach - Financial and non-financial data were collected from the annual reports of 332 UK non-financial companies listed on the London Stock Exchange (LSE) Main Market. Univariate tests and multivariate logistic regression tests were used to test the research hypotheses. A theoretical framework based on both agency theory and transaction cost economics (TCE) theory was used to explain the economic factors affecting the use of an IAF. Findings - The study provides evidence that firm size, level of internal risks, agency problem between owners and managers and existence of an effective audit committee are associated with the existence of an IAF. Thus, the need to have strong internal control and risk management systems and to reduce both internal and external agency costs drives companies to have an IAF. These results suggest the importance of IAF as an internal corporate governance tool and the effectiveness of UK governance regulations in monitoring the effectiveness of internal control systems. Practical implications - Given the importance of the IAF's corporate governance role, the study provides some policy implications. Regulators should pay more attention to the issue of maintaining an IAF, especially by large companies, the relationship between the IAF and other governance parties, especially the audit committee, and the disclosure of more relevant information about the IAF's characteristics and practices. Originality/value - This is the first study to examine the factors affecting the existence of the IAF within the UK's distinctive regulatory approach of comply or disclose reasons. Furthermore, it provides a theoretical framework that explains how both the agency theory and TCE theory can interpret the adoption of internal audit.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c7ab7abdb45ed69f6569ba6f99f6a960",
  "timestamp": "2025-05-15T02:56:10.932110"
}