{
  "id": 5891,
  "title": "Assessing regional typhoon risk of disaster management by clustering typhoon paths",
  "abstract": "Many countries are affected by typhoons and cyclones. Huge damages are caused by these natural disasters. Therefore, loss prediction models are required to ensure that society remains resilient to natural disasters, including typhoons. Although previous studies have focused on identifying strategies for mitigating typhoon damages, the relationships between the characteristics of the built environment and the extent of typhoon damages have not been sufficiently examined. The purpose of this study is to identify the features of typhoon damages and to develop a metric for estimating the impact of built environment vulnerability on financial loss using the data of types 1 and 2 typhoons. Typhoon damage data (loss ratios) recorded at the provincial level were used as the dependent variable. The independent variables were categorized into two types: typhoon characteristics and built environment indicators. The results obtained from the regression models showed that the loss ratios of type 1 typhoons were correlated with wind speed, rainfall, and number of cutting slopes, while the extent of financial loss caused by type 2 typhoons was mainly correlated with the meteorological indicators. The results obtained with the loss prediction models developed in this study would help public disaster managers develop different strategies for typhoon risk mitigation.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c7cc492d853b411c5cae8111bef16226",
  "timestamp": "2025-05-15T02:52:31.458404"
}