{
  "id": 7342,
  "title": "Incentive spirometry is an effective strategy to improve the quality of postoperative care in patients",
  "abstract": "Postoperative pulmonary complications (PPCs) most commonly occur after thoracic surgery. Not only prolonged hospital stay and increased financial expenses but also morbidity and even mortality may be troublesome for those with PPCs. Herein, we aimed to conduct a comprehensive systematic review and meta-analysis of available data to examine the effectiveness of incentive spirometry (IS) to reduce PPCs and shorten hospital stay. This systematic review and meta-analysis included 5 randomized controlled trials (RCT) and 3 retrospective cohort study (10,322 patients in total) in PubMed, Embase and Cochrane Library until September 31, 2021. We assessed the clinical efficacy of IS using length of hospital stay, PPCs, postoperative pneumonia, and postoperative atelectasis with meta-analysis, meta-regression and trial sequential analysis (TSA). With this meta-analysis, the length of hospital stay in patients undergoing IS was significantly shorter (1.8 days) than that in patients not receiving IS (MD = -1.80, 95% CI = -2.95 to -0.65). Patients undergoing IS also had reduced risk of PPCs (32%) and postoperative pneumonia (17.9%) with statistical significance than patients not undergoing IS (PPC: OR = 0.68, 95% CI = 0.51-0.90) (Pneumonia: OR = 0.821, 95% CI = 0.677-0.995). In meta-regression, the benefits of undergoing IS in patients with preoperative predicted FEV1 of <80% in a linear fashion with decreasing PPCs. IS is an effective modality to improve the quality of postoperative care for patients after pulmonary resection, compared with the control group without using IS; and applying IS has favorable outcomes of shorter length of hospital stay (1.8 days) and lower occurrence of PPCs (32% of risk reduction), which are conclusive and robust based on our validation via TSA. Moreover, the IS device is more beneficial for patients with preoperative predicted FEV1 of <80% than that in others. (c) 2023 Asian Surgical Association and Taiwan Robotic Surgery Association. Publishing services by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c7cd71dbbae74287c0069f7fa66116cd",
  "timestamp": "2025-05-15T03:07:31.899665"
}