{
  "id": 1800,
  "title": "Machine learning approach for predicting bridge components' condition ratings",
  "abstract": "Information on bridge condition rating is critical to make decisions regarding rehabilitation or replacement of bridges. Currently, bridge components' condition ratings are evaluated manually using inspection reports. Markov chain and Petri net models are most commonly used for predicting future values of bridge parameters, however, applicability of these models for a regional or statewide portfolio of bridges may be limited. The existing data based models have low prediction accuracy. Hence, a data and machine learning based approach is presented herein for predicting the future condition values of major components-deck, superstructure and substructure-in a portfolio of bridges with an objective to develop a more accurate approach. National Bridge Inventory (NBI) was used to get information on current and past bridge components' condition from year 1992-2019 along with other parameters such as ownership, maintenance responsibility and age. After selecting important parameters, this data was used to train three RUSBoost based random forest models for predicting future values of deck, superstructure, and substructure conditions, respectively. The prediction accuracy of the developed models were found above 93%, thereby addressing the limitation of poor prediction accuracy of the existing studies. Additionally, the uncertainties associated with the random forest based predictions were quantified at the regional level and for individual bridges. On-system concrete pre-cast slab units and steel I-beam bridges in Louisiana were selected to demonstrate the proposed approach and predict bridge components condition ratings for years 2020 and 2021.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c7d583ac46886344a61d4622c7212612",
  "timestamp": "2025-05-15T00:59:53.139892"
}