{
  "id": 6684,
  "title": "CAROTID ENDARTERECTOMY - IS INTENSIVE-CARE UNIT CARE NECESSARY",
  "abstract": "Purpose: The purpose of this study was to determine whether postoperative intensive care unit care is necessary for all patients undergoing carotid endarterectomy and whether a subgroup of patients at low-risk not requiring treatment in the intensive care unit could be identified. Methods: Case control analysis of random numbers sample over the last decade of 50% of patients undergoing isolated carotid endarterectomy at a tertiary care hospital. One hundred twenty-nine patients undergoing carotid endarterectomy were identified. Preoperative risk factors, intraoperative course, intensive case unit interventions including vasoactive agents, myocardial ischemia/infarction, arrhythmias, bronchospasm, reintubation, neurologic events, and need for reoperation, were recorded. Timing of interventions, length of stay in intensive care unit, and postoperative course were all recorded. Financial impact was assessed. Results: Among 129 patients only 31 patients did not require intensive care unit interventions. A multivariate Linear regression analysis demonstrated a model in which a preoperative history of hypertension, myocardial infarction, arrhythmia, and chronic renal failure were 83% predictive of the need for an intensive care unit bed. Specifically, patients could be stratified into a low-risk group before the operation by less than four risk factors. Additionally, all patients requiring interventions or with adverse outcomes were identified by the eighth postoperative hour. Conclusions: In preoperative scheduling of intensive care unit beds, patients with less than four risk factors can be stratified to monitoring beds and those with greater than or equal to four can be stratified to intervention beds. After 8 hours, if no interventions are necessary or adverse outcomes occur, then floor recovery is safe. Patients who satisfy this algorithm would save 50% of current intensive care unit charges.",
  "year": 1994,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c7d95646fac6ccb08b658cba13af0d09",
  "timestamp": "2025-05-15T03:00:35.418045"
}