{
  "id": 9408,
  "title": "A survey of male and female dairy calf care practices and opportunities for change",
  "abstract": "The primary objective of this study was to compare male and female dairy calf management practices and evaluate risk factors associated with differences in care. Secondary objectives were to understand surplus calf transportation and marketing practices and investigate incentives to motivate calf care improvements. An on-line survey was distributed to all dairy producers in Ontario (n = 3,367) from November 2020 to March 2021 and Atlantic Canada (n = 557) from April to June 2021. Dairy producers were identified through provincial dairy associations and contacted via e-mail and social media. Descriptive statistics were computed, and a logistic regression model was created to evalu-ate factors associated with using discrepant feeding practices (i.e., fed less colostrum, fed colostrum later, or fed raw, unsalable milk) for male calves compared with females. The survey had a 7.4% response rate (n = 289/3,924) and was primarily filled out by farm owners (76%). Although colostrum and milk feeding practices were similar between male and female calves, male calves received less milk while still on the dairy farm of origin compared with females. Male calves were also more likely to be fed a higher proportion of raw, unsalable milk. Female producers and those that kept their male calves beyond 10 d of age had lower odds of using poorer feeding practices for male calves. Male calves were mostly sold between 1 and 10 d (64%), primarily through direct sales to a calf-rearing facil-ity (45%), with auctions being the next most common method (35%). A small but notable proportion of pro-ducers (18%) agreed that euthanizing male calves is a reasonable alternative when their sale price is very low; however, few producers (13%) reported that financial costs limited their male calf care. The largest propor-tion (43%) of producers reported that a price premium for more vigorous calves would motivate them to take better care of their male calves. Conversely, only 28% of producers reported that a price discount for calves in poor condition would be motivating. Producers placed importance on the opinion of their calf buyer, their herd veterinarian, and the Canadian Code of Prac-tice for the Care and Handling of Dairy Cattle when considering their calf care practices, and they highly valued practices that promote calf health. Respondents to this survey reported a lower proportion of tiestall barn use and higher milk productivity compared with typical dairy herds in the region, suggesting selection bias for more progressive dairy producers. Nevertheless, our results suggest that dairy producers provide similar care between male and female calves, but some male calves experience challenges due to milk feeding and marketing practices. Feedback from calf buyers along with continued support and guidance from herd veteri-narians and the Code of Practice may motivate dairy producers to improve male calf care.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c7ec27905c280578d30787babab72d37",
  "timestamp": "2025-05-15T03:28:17.668626"
}