{
  "id": 3807,
  "title": "Global financial crisis, foreign portfolio investment and volatility Impact analysis on select Southeast Asian markets",
  "abstract": "Purpose The purpose of this paper is to understand and compare the extent and nature of the impact of foreign portfolio investment (FPI) on the stock market volatility, particularly in the Southeast Asian emerging markets, and compare that against the corresponding experience of Indian economy, in the context of a global financial crisis of the recent past. Design/methodology/approach The Asian emerging markets are now being perceived as becoming financially more and more vulnerable to international events because of their growing exposure to unstable foreign investment flows. The daily net FPI inflow and the daily leading stock market composite index of four countries, namely, Thailand, the Philippines, Indonesia and India, have been analyzed using autoregressive conditional heteroscedasticity (ARCH)-generalized ARCH group of models dividing the study period from 2000 to 2014 among pre-crisis, crisis and post-crisis period separately. Findings The study reveals that the net inflow of FPI has been a significant determinant of stock market returns in all countries. The impact of volatility spillover from the FPI market to the stock market in the sample countries has been found to be different under different market conditions. The past information and volatility clustering have been significantly influencing the stock market return volatilities of all these Southeast Asian countries on average. Originality/value However, there are significant country-wise differences in the relative importance and direction of the relationship of each of these effects with the volatility of the FPI and the stock markets. These effects have been different in these four different markets and they have significantly altered in strength and significance during the global financial crisis and in the post-financial crisis period.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c7fa4f8290b2f267826ba0ac58496c68",
  "timestamp": "2025-05-15T01:21:08.208284"
}