{
  "id": 9397,
  "title": "Experiences of Interpersonal Violence in Sport and Perceived Coaching Style Among College Athletes",
  "abstract": "Importance Concern about interpersonal violence (IV) in sport is increasing, yet its implications remain poorly understood, particularly among currently competing college athletes.Objective To document the self-reported prevalence of IV in college sports; identify associated risk factors; examine potential consequences associated with athletes' psychosocial well-being, emotional connection to their sport, and willingness to seek help; and explore the associations between IV reporting and perceived variations in coaching styles.Design, Setting, and Participants This survey study analyzes results of the 2021 to 2022 National Collegiate Athletic Association (NCAA) myPlaybook survey, which was administered from July to December 2021 to 123 colleges and universities across the US. Participants were NCAA athletes aged 18 to 25 years who were current players on an NCAA-sanctioned team.Exposures Self-reported demographic characteristics (eg, athlete gender identity and sexual orientation) and perceived differences in supportive vs abusive coaching styles (eg, athlete autonomy, team culture, and extent of abusive supervision).Main Outcomes and Measures The primary outcome was self-reported experiences of IV in sport during the college sports career of currently competing college athletes. Types of IV considered were physical abuse, financial abuse, sexual abuse, psychological or emotional abuse, and neglect or abandonment. Outcomes potentially affected by IV were assessed with 4 questionnaires.Results A total of 4119 athletes (mean [SD] age, 19.3 [1.5] years; 2302 males [55.9%]) completed the survey (response rate, 21.2%). One in 10 athletes (404 of 4119 [9.8%]) reported experiencing at least 1 type of IV during their college sports career, of whom two-thirds (267 [6.5%]) experienced IV within the past 6 weeks. On multivariable analysis, female gender identity (odds ratio [OR], 2.14; 95% CI, 1.46-3.13), nonheterosexual sexual orientation (OR, 1.56; 95% CI, 1.01-2.42), increasing age beyond 18 years (OR, 1.13; 95% CI, 1.01-1.30), increasing year of NCAA eligibility beyond the first year (OR, 1.19; 95% CI, 1.02-1.39), and participation in select sports (eg, volleyball: OR, 2.77 [95% CI, 1.34-5.72]; ice hockey: OR, 2.86 [95% CI, 1.17-6.95]) were independently associated with IV. When exposed to IV, college athletes reported experiencing consistently worse psychosocial outcomes, including increased burnout (mean difference on a 5-point Likert scale, 0.75; 95% CI, 0.63-0.86; P < .001) and an expressed desire to consider quitting their sport (mean difference, 0.81; 95% CI, 0.70-0.92; P < .001). They were not, however, less willing to seek help. Differences in coaching style were associated with differences in IV reporting. In risk-adjusted linear regression models, having a more supportive coach was associated with a 7.4 (95% CI, 6.4-8.4) absolute percentage point decrease in athletes' probability of reporting experiencing IV. In contrast, having a more abusive coach was associated with up to a 15.4 (95% CI, 13.8-17.1) absolute percentage point increase in athletes' probability of reporting experiencing IV.Conclusions and Relevance Results of this survey study suggest that IV is associated with marked changes in the psychosocial health and emotional well-being of college athletes, particularly those who identify as female and with nonheterosexual sexual orientations. Variations in coaching style have the potential to alter these associations. Ongoing efforts are needed to leverage the unique position that coaches hold to help reduce IV and create safe places where all college athletes can thrive.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8028ec142e597f6251b499c7efa9801",
  "timestamp": "2025-05-16T17:50:25.568388"
}