{
  "id": 4556,
  "title": "Social Determinants and Military Veterans' Suicide Ideation and Attempt: a Cross-sectional Analysis of Electronic Health Record Data",
  "abstract": "Background Health care systems struggle to identify risk factors for suicide. Adverse social determinants of health (SDH) are strong predictors of suicide risk, but most electronic health records (EHR) do not include SDH data. Objective To determine the prevalence of SDH documentation in the EHR and how SDH are associated with suicide ideation and attempt. Design This cross-sectional analysis included EHR data spanning October 1, 2015-September 30, 2016, from the Veterans Integrated Service Network Region 4. Participants The study included all patients with at least one inpatient or outpatient visit (n = 293,872). Main Measurements Adverse SDH, operationalized using Veterans Health Administration (VHA) coding for services and International Statistical Classification of Diseases and Related Health Problems (ICD)-10 codes, encompassed seven types (violence, housing instability, financial/employment problems, legal problems, familial/social problems, lack of access to care/transportation, and nonspecific psychosocial needs). We defined suicide morbidity by ICD-10 codes and data from the VHA's Suicide Prevention Applications Network. Logistic regression assessed associations of SDH with suicide morbidity, adjusting for socio-demographics and mental health diagnoses (e.g., major depression). Statistical significance was assessed with p < .01. Key Results Overall, 16.4% of patients had at least one adverse SDH indicator. Adverse SDH exhibited dose-response-like associations with suicidal ideation and suicide attempt: each additional adverse SDH increased odds of suicidal ideation by 67% (AOR = 1.67, 99%CI = 1.60-1.75; p < .01) and suicide attempt by 49% (AOR = 1.49, 99%CI = 1.33-1.68; p < .01). Independently, each adverse SDH had strong effect sizes, ranging from 1.86 (99%CI = 1.58-2.19; p < .01) for legal issues to 3.10 (99%CI = 2.74-3.50; p < .01) for non-specific psychosocial needs in models assessing suicidal ideation and from 1.58 (99%CI = 1.10-2.27; p < .01) for employment/financial problems to 2.90 (99%CI = 2.30-4.16; p < .01) for violence in models assessing suicide attempt. Conclusions SDH were strongly associated with suicidal ideation and suicide attempt even after adjusting for mental health diagnoses. Integration of SDH data in EHR could improve suicide prevention.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c803c6c54d93ca9285c761f6f2cc4ce7",
  "timestamp": "2025-05-15T02:38:20.493369"
}