{
  "id": 6833,
  "title": "Social and clinical predictors associated with prolonged hospital stays for patients with severe exacerbation of chronic obstructive pulmonary disease",
  "abstract": "Objective: To determine whether there are social factors that affect the prolonged hospital stay (PHS) of patients with severe chronic obstructive pulmonary disease exacerbation (COPDE), as well as clinical-demographic factors. Methodology: We conducted a prospective cohort study that consecutively included patients who were admitted to a Pneumology department for COPDE. We recorded demographic, clinical (tobacco use, exacerbations and infections, dyspnoea, impact according to CAT questionnaire, pulmonary function, comorbidities, oxygen therapy and noninvasive ventilation) and social (financial status, caregiver availability and overload, dependence for basic and instrumental activities, social risk and use of social services) variables, employing questionnaires and indices such as Barthel, Lawton-Brody, Zarit, Barber and Gijon. We performed a univariate and multivariate analysis using a logistic regression model. Results: The study included 253 patients, with a mean age of 68.9 +/- 9.8 years; 77.1% of whom were men. The logistic regression model included active tobacco use, FEV1 value, CAT score > 10, dyspnoea 3-4 on the MMRC, the presence of bacteria in sputum cultures, cardiovascular comorbidity, anaemia, home oxygen therapy, living alone, rural residence, caregiver overload and detecting social-family risks/problems. The variables independently associated with the possibility of PHS were a CAT score > 10 (OR, 8.9; P=.04) and detecting a social-family risk/problem (OR, 2.6; P=.04). Active smoking was a predictor of shorter stays (OR, 0.15; P=.002). Conclusions: Variables related to the social sphere play a relevant role in hospital stays, as do the impact of the disease and the persistent use of tobacco by patients with severe COPD exacerbation. (C) 2019 Elsevier Espana, S.L.U. and Sociedad Espanola de Medicina Interna (SEMI). All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c81ec9401c0ec5d75a65cfc73b593282",
  "timestamp": "2025-05-15T03:02:07.475972"
}