{
  "id": 2431,
  "title": "The Impact of Financial Risks on the Performance of Russian Banks",
  "abstract": "This study uses multiple regression analysis with financial ratios to determine the impact of financial risks and financial leverage on the financial performance of Russian commercial banks in the period 2008-17. This study involves 85 Russian banks, whose total assets comprise 87% of the total assets of the Russian banking sector. The study used six indicators to measure five types of financial risks and an indicator to measure the financial leverage: interest rate risk, foreign exchange risk, liquidity risk, credit risk, operational risk, and financial leverage risk. The study also used three indicators to measure bank performance: Net Interest Margin, Return on Assets, and Return on Equity. The study found that Over the 10 years of the study, the risk contributed to the formation of net interest margin by 87%, return on equity by 50%, and return on assets by 53%. The impact of credit risk, operational risk, and liquidity risks on performance indicators in Russian banks were very positive and significant. The effect of leverage and interest rate risk on performance indicators was negative and very limited. The foreign exchange risks had no effect on performance indicators. The study also found that the other variables (without risk and leverage) had a positive effect on the net interest margin, but their effect on the return on assets, and the return on equity was negative and significant. The study concluded It is important for Russian banks to search for these factors, which led to the negative impact, Russian banks should study these factors and correct their positions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8368e0132aae4d99255eb64f2a20e49",
  "timestamp": "2025-05-15T02:15:26.981199"
}