{
  "id": 346,
  "title": "Graph Representation Learning for Similarity Stocks Analysis",
  "abstract": "Listed companies with similar or related fundamentals usually influence each other, and these influences are usually reflected in stock prices. For example, the momentum spillover effect in the behavioral finance theory describes the formation of lead-lag effects between the stock prices of related companies. The relationship between listed companies consists of many types, such as relationships in the industry chain, industry information, transaction information, patent sharing degree, equity, etc. We construct a set of industry chain knowledge graph of listed companies to describe the production and supply relationship between the upstream and downstream of listed companies. Then, graph representation learning method is used to study the relevance between listed company entities in the knowledge graph. It includes dimensions such as industry and transaction information of listed companies as weights to optimize the graph representation learning process, and finally calculates the similarity index between listed companies. To evaluate the effectiveness of the method, we conduct a link prediction experiment and construct a stock quantitative investment portfolio based on the similarity index. The result of the quantitative backtest experiment based on China's stock market data in the last 10 years shows that the graph representation learning method we proposed can be used to study the momentum spillover effect and obtain investment returns.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c838f5c46cba5ab9db51a315ef7d2550",
  "timestamp": "2025-05-15T00:34:44.434867"
}