{
  "id": 165,
  "title": "On the Use of a Sequential Deep Learning Scheme for Financial Fraud Detection",
  "abstract": "Forecasting fraud detection has never been more essential for the finance industry than today. The detection of fraud has been a major concern for the banking industry due to the high impact on banks' revenues and reputation. Fraud can be related with an augmented financial risk, which is often underestimated until it is too late. Recently, deep learning models have been introduced to detect and forecast possible fraud transactions with increased efficiency compared to the conventional machine learning methods and statistics. Such methods gain significant popularity due to their ability to estimate the unknown distribution of the collected data, thus, increasing their capability of detecting more complex fraud events. In this paper, we introduce a novel multistage deep learning model that combines a feature selection process upon an Autoencoder model and a deep convolutional neural network to detect frauds. To manage highly unbalanced datasets, we rely on the Synthetic Minority Over-sampling Technique (SMOTE) to oversample our dataset and adjust the class distribution delivering an efficient classification approach. We describe the problem under consideration and our contribution that provides a solution for it. An extensive set of experimental scenarios are adopted to reveal the performance of the proposed scheme exposing the relevant numerical results. A comparative assessment is used for proving the superiority of our model compared with a Support Vector Machine (SVM) scheme, a classical CNN model and the results of two researches that use the same dataset.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8406eb0abb0b6250077dc2ca38351c8",
  "timestamp": "2025-05-15T01:47:52.916144"
}