{
  "id": 8119,
  "title": "Safety in construction in the field of investment in urban infrastructure",
  "abstract": "The purpose of the article is to review the theoretical foundations and practical examples of investor assessment with an integrated approach to the development of urban infrastructure. The article analyzes the conditions for reducing the investment costs of projects. For this purpose, methods of clarifying the conceptual apparatus, classification, systematization and an integrated approach are used. The significance of an investment project depends on its positive influence on at least one of the external or internal markets: material and financial products, services and labor, on the social environment and the environment. Examples are provided of the impact on urban planning and the ecology of the urban landscape of investment projects in the field of tourism in recent years, implemented at the expense of the Federal Target Program Development of domestic and inbound tourism in the Russia for 2011-2018. in Sarapul, Barnaul and Cherepovets. The authors conclude that in the examples cited there is a relationship between the risk tolerance of the project and the complexity of the approach to its implementation, and as a result, the amount of investment. Large projects are designed not only to solve specific problems of the investor, regions, economy, state and society, but also ensure the profitability of the state budget at various levels, create new jobs, ensure GDP growth in the country and investment in various sectors, create conditions for the development of the country's regions. The narrowly focused investment projects are fraught with great risks for the investor due to the selectivity and limited scope of the manifestation of effects.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8441525246debd8d2bd29a68e804d3f",
  "timestamp": "2025-05-15T03:15:38.347550"
}