{
  "id": 9029,
  "title": "The effect of supply chain finance on sustainability performance: empirical analysis and fsQCA",
  "abstract": "PurposeIn the context of global economic downturn and intense competition, firms are increasingly resorting to supply chains to acquire capital support and achieve sustainability. This study aims to investigate the effect of supply chain finance (SCF) on corporate sustainability performance (CSP) and identifies SCF-related recipes for CSP. Design/methodology/approachBased on a sample of 1,038 firms that disclose CSP - namely, corporate financial performance (CFP) and environmental, social and governance performance (ESGP) - the authors use a quasi-replication method consisting of empirical analysis with fuzzy-set qualitative comparative analysis (fsQCA) to investigate SCF's effects on CSP. FindingsThe authors find that SCF has a doing well by doing good effect on CSP. CFP can promote the positive effect of SCF and ESGP while ESGP's positive effect on SCF and CFP is nonsignificant. In addition, heterogeneity tests show that SCF's promoting effect on CSP is affected by high-low CFP and ESGP. The fsQCA results verify the empirical findings and reveal five SCF-related recipes for achieving high CSP. Research limitations/implicationsThis study has the following two limitations. First, we do not consider how SCF affects CSP in different industries. There is a need to investigate whether industry heterogeneity changes SCF's effects on CSP, especially in prominent industries, such as the energy industry, with its high susceptibility to ESGP, and the manufacturing industry, with its extensive application of SCF. It will be important to investigate these industries to better understand SCF's role in sustainability. Second, we study the secondary supply chain - namely, core firm-suppliers and core firm-customers. The authors do not consider financial institutions (e.g. banks and guarantee institutions). SCF modes that include the participation of financial institutions, such as factoring financing and reverse factoring financing, cater more to the capital needs of diversified firms. In the future, studying specific industries that have made significant contributions to the application of SCF along with others that are more sensitive to environmental governance could better highlight the effect of SCF on sustainability and help supply chain managers understand the application value of SCF. Future research could also extend SCF participants into multiple roles to explore separate effects. Tracking financing demanders, fund providers and credit guarantors could capture SCF characteristics more comprehensively. Methodologically, it will be challenging to accurately measure SCF networks in terms of quantification. In future work, this could be performed with the help of artificial intelligence. Practical implicationsFirst, our findings indicate that SCF has a doing well by doing good effect on core firms. SCF can not only overcome the capital shortage of SMEs but also provide significant benefits to core firms. Second, our findings provide SCF-related recipes to help firms fulfil ESGP obligations without sacrificing CFP under the pressure to do good. The authors provide valuable insights and diverse recommendations to help supply chain managers, marketing executives and researchers adjust supply chain management strategies. Third, this work can guide executives in various fields to adopt SCF to achieve sustainability as a risk-mitigation strategy by means of marketing. Originality/valueThis study identifies better, more straightforward SCF-related recipes for CSP (consisting of CFP and ESGP) using a quasi-replication analysis that improves upon conventional methods such as regression analysis, which have limited power. The authors provide valuable insights and diverse recommendations to help managers pursue sustainable development. The findings point to practical guidelines and feasible solutions that can support well-founded operational strategic and management decision-making, which can enhance a firm's competitiveness under uncertainty and a sluggish economy.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c84a5d8c4700e9e377d0b76ef072ea20",
  "timestamp": "2025-05-15T03:24:54.889677"
}