{
  "id": 7843,
  "title": "Causes and Predictors of Unplanned Readmission in Patients Undergoing Intracranial Tumor Resection: A Multicenter Analysis of 31,776 Patients",
  "abstract": "BACKGROUND: Although unplanned readmission is a postoperative outcome metric associated with significant morbidity and financial burden, precise assessment tools for its prediction have not yet been developed. The Risk Analysis Index (RAI) could potentially be used to help improve the prediction of unplanned readmissions for pa-tients undergoing intracranial tumor resection (ITR). In the present study, we evaluate the predictive accuracy of frailty on 30-day unplanned readmission after ITR using the RAI.METHODS: Data were obtained from the American Col-lege of Surgeons National Surgical Quality Improvement Program database. The baseline characteristics, preoper-ative clinical status, and outcomes were compared be-tween patients with and without unplanned readmission. Frailty was calculated using the RAI. Univariate and multivariate logistic regression analyses were performed to identify independent associations between unplanned readmissions and patient characteristics.RESULTS: The unplanned readmission rate for this cohort (n = 31,776) was 10.8% (n = 3420). Of the 3420 readmitted patients, 958 required unplanned reoperation. Multiple characteristics were significantly different be-tween the 2 groups, including age, body mass index, comorbidities, and RAI groups (P < 0.05). The common causes of unplanned readmission included infection (9.4%), seizures (6%), and pulmonary embolism (4%). The patient characteristics identified as reliable predictors of u nplanned readmission included age, body mass index, functional status, diabetes, hypertension, hyponatremia, and the patient's RAI score (P < 0.05). Frail status, hypo-natremia, leukocytosis, hypertension, and thrombocytosis were significant predictors of unplanned readmissions.CONCLUSIONS: The RAI is a reliable preoperative frailty index for predicting unplanned readmissions after ITR. Using the RAI could decrease unplanned readmissions by identifying high-risk patients and enabling future imple-mentation of appropriate management guidelines.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c85c1b60792082c49f4d0b7911bf52fb",
  "timestamp": "2025-05-15T03:12:36.517878"
}