{
  "id": 1626,
  "title": "Portfolios with return and volatility prediction for the energy stock market",
  "abstract": "Energy portfolios have important applications in many aspects of the energy market. This paper commonly integrates return and volatility prediction to advance portfolio models for the sake of building more efficient energy portfolios. In this regard, the extreme gradient boosting regression tree is applied to predict energy returns and volatilities, respectively. And six classical portfolio models are utilized to test the efficiency of this approach. Also, since these advanced portfolios own multiple objectives, this paper introduces prediction -based weights to transform these objectives. In addition, the component stocks of the CSI energy index are adopted for empirical tests. Empirical results show that commonly using return and volatility prediction to advance portfolio models significantly increases the performance of these models advanced only by return prediction. And prediction-based weights generally perform better than equal weights in transforming the multiple objectives of these advanced portfolios. Among these portfolios, the CVaR-F-PW portfolio performs the best. Robust tests show that 90% is the optimal confidence level for this portfolio. Therefore, the CVaR-F-PW portfolio is recommended for portfolio management in the energy stock market, and this portfolio is also useful to energy structure optimization, energy efficiency enhancement, and other applications in energy market.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c862acd1539f457e3e047c13a2a78f8c",
  "timestamp": "2025-05-15T00:57:46.902569"
}