{
  "id": 7840,
  "title": "Impact of childhood leukemia on siblings: their long-term perception of family functioning and its relationship with their psychosocial characteristics using structural equation modeling",
  "abstract": "PurposeIn the context of pediatric cancer, siblings' adaptation and needs have been previously investigated; however, research on the long-term consequences on siblings, especially on their family environment, is scarce.We aimed to (1) assess the family functioning (FF) perceived by siblings of childhood leukemia survivors long after diagnosis and (2) explore characteristics likely associated and investigate associations with psycho-behavioral and social factors.MethodsChildhood leukemia survivors' siblings older than 11 years were recruited through the LEA cohort, a French long-term follow-up program, and completed the family assessment device (FAD). Logistic regression analysis was used to determine factors likely associated with unhealthy functioning in families as perceived by siblings. Structural equation modeling (SEM) was used to examine relationships that predict siblings' perception of FF.ResultsWe included 605 siblings (mean follow-up time from diagnosis 14.1 +/- 6.8 years), of whom 175 (28.9%) perceived unhealthy functioning. SEM showed that older siblings were more likely to perceive problematic functioning (beta = 0.095, p = 0.014). Sex and leukemia burden had indirect effects on FF through mediators. Family financial situation at diagnosis was not associated with the risk of reporting unhealthy functioning.ConclusionsOur study contributed to identifying siblings at risk of facing family issues and reinforced the need to provide more consideration and suitable resources to avoid late consequences. Often considered as the forgotten children, future research should focus on developing targeted interventions to facilitate family communication and improve siblings' social support.Implications for cancer survivorsOverall, results regarding FF perceived by siblings are reassuring and provide new enlightening elements that allow for better support to all families.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c875c22c48fddf311b48e503f2c8e4d1",
  "timestamp": "2025-05-15T03:12:36.506211"
}