{
  "id": 1939,
  "title": "Investment risk - The perspective of individual investors",
  "abstract": "The aim of the research presented in this paper is to investigate the perceived investment risk of lay investors. Two surveys were conducted to examine the financial risk perception of German individual investors (N= 119 in study 1; N= 171 in study 2). Participants were asked to rate the risk and several aspects of different types of investment products (e.g. shares and bank savings books). Study 1 analyzed the specificity of risk perception of various common investment products. Separate regression analyses showed only minor differences in the composition of the risk perception models between the types of investment. A factor analysis revealed two dimensions of perceived investment risk, where one factor consists of aspects of loss and variability (factor risk), while the other comprises aspects of transparency and liquidity (factor manageability). The dimensions were used to classify the types of investment with regard to perceived risk. Study 2 focused on effects of individual characteristics on financial risk perception. Only financial literacy (measured by means of a knowledge test) proved to be relevant in a regression analysis where perceived investment risk was explained by using gender, age, investment experience, and financial literacy as predictors. Implications for an appropriate investment risk communication in financial consultancy were derived from the results. (C) 2011 Elsevier B.V. All rights reserved.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c87de7b5738d1357d7df242dd40808f1",
  "timestamp": "2025-05-15T02:09:14.398769"
}