{
  "id": 3305,
  "title": "A Survey on Stock Market Prediction",
  "abstract": "It is complicated to estimate the stock market where relations between input and output are random in nature. Predicting the cost of the share market is the most complex job of the financial time series. Forecasting of the stock should be possible by utilizing the present and past information available on the market. The execution measurements that should be achieved if there should be an occurrence of the stock forecast are exactness, adaptability and less time utilization. There are numerous sorts of research done as such far with the end goal to predict the stock market to complete the characterized measurements. Several techniques have been accessible in data mining for forecasting the stock market, for example, Fuzzy systems, Artificial Neural Network (ANN), if-then-else rules, Bayesian algorithm et cetera. In this paper, the different strategies are available and used for forecasting the stock markets are talked about. This review knows which method is the finest to use for predicting the stock market. The most important application of market share is to predict market trends. Likewise, the market shows the performance of the future, which constantly encourages financial experts to understand when and what shares can be purchased to improve their risk. For this reason, a large number of research has been prepared so far to analyze the stock market by means of mining of the data.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c881c9dae8f6beeda08d733e9dd2c744",
  "timestamp": "2025-05-15T02:24:39.748053"
}