{
  "id": 1593,
  "title": "SUNFIT: A Machine Learning-Based Sustainable University Field Training Framework for Higher Education",
  "abstract": "With the rapid advances in Information Technology (IT), the focus on engaging computing students to gain practical experience in the IT industry before graduation is becoming increasingly complex without incorporating pedagogical strategies of success in curricula. The goal is to enable computing major students to gain in-depth knowledge and practical understanding of the IT working environment before graduating through essential industry-driven practical skills based on international standards and best practices. Unfortunately, tracking and analyzing students' practical skills performance during their IT field training programs, which are conducted primarily off-campus at various public and private organizations, before, during, and after the training period, is a daunting task for both the college instructors and the industry trainers. To overcome these challenges, this paper introduces a Sustainable University Field Training (SUNFIT) framework, which is a pedagogical approach towards mining the educational data using machine learning to integrate and measure the field training programs against the internationally recognized accreditation standards such as Accreditation Board for Engineering and Technology (ABET). The study employs machine learning models aimed at continuously measuring and monitoring international ABET accreditation requirements on computing major courses' academic data, elucidating student performance across various semesters, integrating best practices, and producing an evidence-based rationale approach for evaluating weak learning outcomes (LOs) with minimal manual intervention, as well as preventing faculty-specific portfolio errors. The proposed approach could be easily developed by academics, researchers, or even students, and for a variety of purposes, including enhancing poor student outcomes (SOs). In addition, various data mining and machine learning approaches have been investigated over field training assessment data for successful prediction in subsequent cycles. The results are promising, with Naive Bayes obtaining the highest accuracy of 90.54% followed by J48 and PART algorithms at 87.83%.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8830a7ef93ca1c372247fb1f63dcba3",
  "timestamp": "2025-05-15T00:57:46.739886"
}