{
  "id": 8952,
  "title": "Willingness of African American Women to Participate in e-Health/m-Health Research",
  "abstract": "Introduction: Due to high rates of technology adoption, African American women are well positioned to benefit from e-health/mobile health (m-health) interventions; yet, there are limited data on understanding their use of technology and willingness to participate in e-health/m-health research. Materials and Methods: A self-administered survey was completed by 589 African American women. Survey items measured sociodemographics, technology use and access, and willingness to participate in e-health/m-health research. Multinomial logistic regression examined associations among three age groups (18-29, 30-50, and 51+years old) and technology access, as well as motivators and barriers to participating in e-health/m-health research. Results: Most participants were willing to receive text messages as part of a research study. Many reported using a health-related application in the past 30 days, with younger women more likely to do so than older women (p<0.0001). Younger women were more likely than older women to be motivated for the greater good (p<0.01) and for financial incentives (p=0.02), whereas older women were more likely than younger women to be motivated if referred by a healthcare provider (p=0.02). Younger women were more likely than older women to report concerns about data plans (p<0.01 for all), whereas older women were more likely to report a lack of a smartphone (p=0.048) and privacy concerns (p<0.001). Conclusions: Culturally tailored e-health/m-health research using smartphones may be of interest to African American women who are interested in risk reduction and chronic disease self-management. Barriers such as smartphone data plans and privacy will need to be addressed.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8953b0de0b854286f18f076047e6883",
  "timestamp": "2025-05-15T03:23:56.134823"
}