{
  "id": 1953,
  "title": "Financial impact of alternative approaches to reduce bacterial contamination of platelet transfusions",
  "abstract": "BACKGROUNDBacterial contamination of platelets remains the leading infectious risk from blood transfusion. Pathogen reduction (PR), point-of-release testing (PORt), and secondary bacterial culture (SBC) have been proposed as alternative risk control strategies, but a comprehensive financial comparison has not been conducted. STUDY DESIGN AND METHODSA Markov-based decision tree was constructed to model the financial and clinical impact of PR, PORt, and SBC, as well as a baseline strategy involving routine testing only. Hospitals were assumed to acquire leukoreduced apheresis platelets on Day 3 after collection, and, in the base case analysis, expiration would occur at the end of Day 5 (PR and SBC) or 7 (PORt). Monte Carlo simulations assessed the direct medical costs for platelet acquisition, testing, transfusion, and possible complications. Input parameters, including test sensitivity and specificity, were drawn from existing literature, and costs (2018 US dollars) were based on a hospital perspective. RESULTSThe total costs per unit acquired by the hospital under the baseline strategy, PR, PORt, and SBC were $651.45, $827.82, $686.33, and $668.50, respectively. All risk-reduction strategies decreased septic transfusion reactions and associated expenses, with the greatest reductions from PR. PR would add $191.09 in per-unit acquisition costs, whereas PORt and SBC would increase per-unit testing costs by $31.79 and $17.26, respectively. Financial outcomes were sensitive to platelet dating; allowing 7-day storage with SBC would lead to a cost savings of $12.41 per transfused unit. Results remained robust in probabilistic sensitivity analyses. CONCLUSIONSAll three strategies are viable approaches to reducing bacterially contaminated platelet transfusions, although SBC is likely to be the cheapest overall.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c89f3ccd628d48b49adecaab02952c2a",
  "timestamp": "2025-05-15T02:09:14.421353"
}