{
  "id": 1280,
  "title": "Cost-sensitive machine learning to support startup investment decisions",
  "abstract": "In 2022, global startup investments exceeded US$445 billion, sourced from entities like venture capital (VC) funds, angel investors, and equity crowdfunding. Despite their role in driving innovation, startup investments often fall short of S&P 500 returns. Surprisingly, the potential of artificial intelligence (AI) remains untapped by investors, despite AI's growing sway in financial decision-making. Our empirical analysis predicts the success of 10,000 Israeli startups, utilizing diverse machine learning models. Unlike prior research, we employ the MetaCost algorithm to convert models into cost-sensitive variants, minimizing total cost instead of total error. This innovative approach enables varied costs linked to different prediction errors. Our results underscore that these cost-sensitive machine learning models significantly reduce risk for VC funds and startup investors compared to traditional ones. Furthermore, these models provide investors with a distinct capability to tailor their risk profiles, aligning predictions with their risk appetite. However, while cost-sensitive machine learning reduces risk, it may limit potential gains by predicting fewer successful startups. To address this, we propose methods to enhance successful startup identification, including aggregating outcomes from multiple MetaCost models, particularly advantageous for smaller deal flows. Our research advances AI's role in startup investing, presenting a pivotal tool for investors navigating this domain.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8a2522ed63611daeb71925c22776f64",
  "timestamp": "2025-05-15T02:01:11.835382"
}