{
  "id": 8925,
  "title": "Predictors of treatment outcomes among patients with multidrug-resistant tuberculosis in Vietnam: a retrospective cohort study",
  "abstract": "Background Improving treatment outcomes for multidrug-resistant tuberculosis (MDR-TB) is a leading priority for global TB control. This retrospective cohort study evaluated the factors associated with treatment success among patients treated for MDR-TB in two provinces in Vietnam. Methods Treatment outcomes were evaluated for adult patients treated in Hanoi and Thanh Hoa provinces between 2014 and 2016. The primary outcome was the proportion of patients with treatment success, defined as cure or treatment completion. Logistic regression analysis was used to evaluate the relationship between patient clinical and microbiological characteristics and treatment success. Results Treatment outcomes were reported in 612 of 662 patients; of these, 401 (65.5)% were successfully treated. The odds of treatment success were lower for male patients (aOR 0.56, 95% CI 0.34-0.90), for people living with HIV (aOR 0.44, 95% CI 0.20-1.00), and for patients treated for extensive antibiotic resistance (pre-XDR-/XDT-TB) (aOR 0.53, 95% CI 0.29-0.97), compared with others. Patients who achieved culture conversion in the first 4 months of treatment had increased odds (aOR 2.93, 95% CI 1.33-6.45) of treatment success. In addition, loss to follow-up was less common among patients covered by social health insurance compared to those who paid for treatment out-of-pocket (aOR 0.55, 95% CI 0.32-0.95). Conclusions Among patients with MDR-TB, males, people living with HIV, and those with more extensive antibiotic resistance at diagnosis are at greatest risk of an unsuccessful treatment outcome. Efforts to optimise the management of co-morbidities (such as HIV), ensure rapid bacteriological conversion, and provide financial support for patients promise to improve treatment outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8a3ad5123fbb49d035ac0bbdba1fdf7",
  "timestamp": "2025-05-15T03:23:56.050284"
}