{
  "id": 7340,
  "title": "Prospective evaluation of the impact of stress, anxiety, and depression on household income among young women with early breast cancer from the Young and Strong trial",
  "abstract": "BackgroundYoung women with breast cancer tend to report lower quality of life and higher levels of stress than older women with breast cancer, and this may have implications for other psychosocial factors including finances. We sought to determine if stress, anxiety, and depression at diagnosis were associated with changes in household income over 12-months in young women with breast cancer in the United States.MethodsThis study was a prospective, longitudinal cohort study comprised of women enrolled in the Young and Strong trial. Of the 467 women aged 18-45 newly diagnosed with early-stage breast cancer enrolled in the Young and Strong trial from 2012 to 2013, 356 (76%) answered income questions. Change in household income from baseline to 12months was assessed and women were categorized as having lost, gained, maintained the same household income <$100,000, or maintained household income $100,000. Patient-reported stress, anxiety, and depression were assessed close to diagnosis at trial enrollment. Adjusted multinomial logistic regression models were used to compare women who lost, gained, or maintained household income >= $100,000 to women who maintained the same household income <$100,000.ResultsAlthough most women maintained household income $100,000 (37.1%) or the same household income <$100,000 (32.3%), 15.4% lost household income and 15.2% gained household income. Stress, anxiety, and depression were not associated with gaining or losing household income compared to women maintaining household incomes <$100,000. Women with household incomes <$50,000 had a higher risk of losing household income compared to women with household incomes $50,000. Women who maintained household incomes >= $100,000 were less likely to report financial or insurance problems. Among women who lost household income, 56% reported financial problems and 20% reported insurance problems at 12months.ConclusionsBaseline stress, anxiety, and depression were not associated with household income changes for young women with breast cancer. However, lower baseline household income was associated with losing household income. Some young survivors encounter financial and insurance problems in the first year after diagnosis, and further support for these women should be considered.Trial registrationClinicaltrials.gov, NCT01647607; date registered: July 23, 2012.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8b5e9e8e2bb40a2e1bb03f3c5798d27",
  "timestamp": "2025-05-15T03:07:31.896144"
}