{
  "id": 6985,
  "title": "Rural farmers' perceptions of and adaptations to climate change in Sub-Saharan Africa: Does climate-smart agriculture (CSA) matter in Nigeria and Ethiopia?",
  "abstract": "The available literature has ignored farmers' perceptions on the benefits and drawbacks of adopting climate-smart agriculture (CSA) in favor of focusing primarily on profitability and economic constraints. We use the Ethiopian Socioeconomic Survey (ESS) and the General Household Survey from 2018 and 2019 to compare Nigeria and Ethiopia, both of which have sizable rural populations to assess farmers' climate change perception and their adaptation options in promoting CSA. We first hypothesize that farmers with high tolerance for risk and stable financial resources are more likely to adopt CSA techniques, relying on the adopter perception theory of agricultural innovations and technologies. We address potential selection bias using the Heckman selection model, and estimate our data using multinomial logistic estimator, as well as standard logistic regression for robustness checks. We find that in both Ethiopia and Nigeria, household income and plot size influence farmers' adaptations to climate change mitigation practices. However, farmers with bigger plots who run the risk of massive production loss tend to adopt measures of coping with climate change. We show that in both Ethiopia and Nigeria, rural farmers' adaptation decisions are heavily influenced by agricultural extension programs and community social networks. Overall, our work highlights the important role of income, farm size, and climate-related information for investing in climate-smart agricultural methods to curb food insecurity in Sub-Saharan Africa.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8b781b6161e1b4150979bf056935495",
  "timestamp": "2025-05-15T03:03:55.735313"
}