{
  "id": 5610,
  "title": "Clinical predictors of flare and drug-free remission in rheumatoid arthritis: preliminary results from the prospective BIO-FLARE experimental medicine study",
  "abstract": "Objectives: Huge advances in rheumatoid arthritis (RA) treatment mean an increasing number of patients now achieve disease remission. However, long-term treatments can carry side effects and associated financial costs. In addition, some patients still experience painful and debilitating disease flares, the mechanisms of which are poorly understood. High rates of flare and a lack of effective prediction tools can limit attempts at treatment withdrawal. The BIOlogical Factors that Limit sustAined Remission in rhEumatoid arthritis (BIO-FLARE) experimental medicine study was designed to study flare and remission immunobiology. Here, we present the clinical outcomes and predictors of drug-free remission and flare, and develop a prediction model to estimate flare risk. Design, setting and participants: BIO-FLARE was a multicentre, prospective, single-arm, open-label experimental medicine study conducted across seven National Health Service Trusts in the UK. Participants had established RA in clinical remission (disease activity score in 28 joints with C reactive protein (DAS28-CRP)<2.4) and were receiving methotrexate, sulfasalazine or hydroxychloroquine (monotherapy or combination). Interventions: The intervention was disease-modifying anti-rheumatic drug cessation, followed by observation for 24 weeks or until flare, with clinical and immune monitoring. Outcome measures: The primary outcome measure was the proportion of participants experiencing a confirmed flare, defined as DAS28-CRP >= 3.2 or DAS28-CRP >= 2.4 twice within 2 weeks, and time to flare. Exploratory predictive modelling was also performed using multivariable Cox regression to understand risk factors for flare. Results: 121 participants were recruited between September 2018 and December 2020. Flare rate by week 24 was 52.3% (95% CI 43.0 to 61.7), with a median (IQR) time to flare of 63 (41-96) days. Female sex, baseline methotrexate use, anti-citrullinated peptide antibody level and rheumatoid factor level were associated with flare. An exploratory prediction model incorporating these variables allowed estimation of flare risk, with acceptable classification (C index 0.709) and good calibration performance. Conclusion: The rate of flare was approximately 50%. Several baseline clinical parameters were associated with flare. The BIO-FLARE study design provides a robust experimental medicine model for studying flare and remission immunobiology.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8c30342aa3574ffe9dfb11c17230534",
  "timestamp": "2025-05-15T02:49:21.789174"
}