{
  "id": 5281,
  "title": "Identification of Psychological Symptom Clusters and Their Influencing Factors in Women Undergoing Assisted Reproductive Technology in China: a Cross-Sectional Study",
  "abstract": "Background: There are multiple psychological symptoms in women undergoing assisted reproductive technology, which seriously affect health-related quality of life and even cause patients to stop treatment. Aim: This study aimed to identify psychological symptom clusters and their influencing factors in women undergoing assisted reproductive technology. Methods: A cross-sectional survey was conducted from June to November 2023 at the reproductive centers of Nanjing Women and Children's Healthcare Hospital. Data on demographic and clinical characteristics and Symptom Checklist-90 were collected. Exploratory factor analysis was performed to identify psychological symptom clusters. Univariate logistic regression analysis and multivariate logistic regression analysis were performed to explore influencing factors. Results: A total of 213 patients were recruited. The study found that the included participants scored higher on all SCL scales than the general Chinese females. The three most common were trouble remembering things (81.7%), feeling easily annoyed or irritated (81.2%), and feeling low in energy or slowed down (70.9%). Six symptom clusters were identified: paranoid ideation, depression, obsessive-compulsive disorder, interpersonal sensitivity, somatization, and sleep disorders. Multivariate logistic regression analysis showed that duration of infertility treatment (>12 months) was identified as a risk factor for sleep disorder cluster (OR=2.833, 95% CI:1.355 similar to 5.922), adverse pregnancy history was identified as a risk factor for paranoid ideation cluster (OR=2.961,95% CI:1.406 similar to 6.253), depression cluster (OR=2.404,95% CI:1.240 similar to 4.660), and obsessive-compulsive cluster (OR=1.810, 95% CI:1.016 similar to 3.233), financial burden during treatment was identified as risk factors for all symptom clusters[(OR=5.869, 95% CI:1.717 similar to 20.057),(OR=6.490,95% CI:2.210 similar to 19.063), (OR=3.034,95% CI:1.560 similar to 5.898),(OR=7.078,95% CI:2.420 similar to 20.698),(OR=4.532,95% CI:1.845 similar to 10.397),(OR=2.151,95% CI:1.129 similar to 4.098)]. Conclusion: Women undergoing ART experience various psychological symptoms that are interrelated and exist in the form of symptom clusters. More attention should be paid to the psychological status of patients with longer duration of infertility treatment, adverse pregnancy history, and financial burden during treatment. This study guides the development of targeted and effective psychological interventions to facilitate symptom management in women undergoing ART.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8c736e9922d3574561402efca0c1af3",
  "timestamp": "2025-05-15T02:46:16.197204"
}