{
  "id": 3150,
  "title": "Profitability and Growth in Motor Insurance Business: Empirical Evidence from Germany",
  "abstract": "Over recent years, the German motor insurance business has faced significant changes, including a growing importance of direct insurance offerings. Motor insurance products are offered by a wide range of insurers, with companies differing in terms of legal status, size, product portfolio, distribution strategy and operational efficiency. Furthermore, one distinguishes between two main products, namely motor third-party liability (MTPL) and motor own damage (OD). In our research, we analyse to what extent the characteristics of the companies can explain the premiums, the total claims costs and the operating expenses per contract in MTPL and OD. For our analysis, we use panel data of insurance companies, offering motor insurance products in Germany, for the years 2002-2014. The panel data provide almost full market coverage. In our study, we apply different statistical tests and multilinear regression models. We show that mutuals relate to lower premiums, lower total claims costs and lower operating expenses per contract when compared to listed companies. In addition, direct insurance companies get along with lower premiums and lower operating expenses per contract compared to traditional companies selling via agents or brokers. Furthermore, we find major differences related to the range of the product portfolio, the size of the motor business, the dominance of the motor business within the non-life business, and the calendar year. Our results are relevant to academics and practitioners alike and help to better understand the German motor insurance business.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8cb03bec37e1f835cbb02da3d10bb65",
  "timestamp": "2025-05-15T01:14:16.159544"
}