{
  "id": 9435,
  "title": "The economic burden of (obstructive) sleep apnea. Costs and implications for Germany based on the results of an international systematic review",
  "abstract": "Background (Obstructive) sleep apnea ((O)SA) is a prevalent sleep disorder in many countries, including Germany. The aim of this review is to evaluate the economic impact of OSA on the adult population by analysing cost determinants. Research questions are what are the direct and indirect costs associated with (O)SA before and after diagnosis and in different sectors, and can costs be reduced through diagnosis and treatment? The findings will inform potential implications for the German healthcare system. Subject and methods In July 2023, we conducted a systematic review using PubMed, EMBASE and Web of Science to identify relevant publications. We manually searched reference lists for additional sources. Our inclusion criteria were: (1) adult population (> 18 years) with SA, OSA or SBD; (2) observational study design with a cost of illness or economic modelling element; and (3) primary or secondary data sources used to determine the monetary values of cost items. Exclusion criteria for the study were as follows: (1) target population other than the one specified, (2) focus solely on cost-effectiveness, cost-benefit, cost-consequence or cost-minimization analyses without reporting original costs, (3) publication in a language other than British or American English, (4) availability only as abstracts or (5) classification as grey literature or non-academic studies. Additionally, publications published before 2010 were excluded. The Consensus Health Economic Criteria (CHEC) list was used for quality assessment and the Joanna Briggs Institute Critical Appraisal Checklist for economic evaluations was used to perform a risk of bias assessment. A predefined template in Microsoft Excel was used to record the details of each study, including article characteristics, study characteristics, participant information and outcome measures. The costs from the publications were adjusted for inflation in Germany until 2022, utilising the Organisation for Economic Co-operation and Development (OECD) Purchasing Power Parities (PPP) for gross domestic product (GDP) in the respective reference years. Results In total, seven publications from five countries, including one from Germany, that were published between 2010 and 2021 were included. Each utilizing different research methodologies. The study population ranged from 95 to 30.278 diagnosed patients. The reporting quality of the included publications is largely satisfactory as well as the risk of bias assessment. No study was excluded based on this result. In most studies, direct costs (1714 to 4777) are more significant than indirect costs (2832 to 3069), with the inpatient sector incurring most of the costs. In Germany, indirect costs of 5854 were reported for baseline examination in the sleep laboratory in one quarter. Moreover, e.g. in Denmark, direct costs in the 12 years leading up to their diagnosis are 2525 (1404 for healthy controls), with indirect costs amounting to 1652. Furthermore, the spouses of patients incur higher costs compared to the spouses of healthy controls. The cost in the inpatient sector varies from 531 in Taiwan to 2314 in Denmark per case, while in the outpatient sector it ranges from 337 in Denmark to 1176 in Taiwan. Also, e.g. in the USA after treatment, the average cost of a healthcare plan decreases by 5894 over two years. Additionally, there is a total saving of 535 in short-term disability costs over two years. Discussion Research indicates that (O)SA primarily incurs direct healthcare costs. If left untreated, these costs can increase even before diagnosis. Additionally, indirect costs are linked to absenteeism and presenteeism, particularly in cases where comorbidities such as depression are present. The literature suggests that inadequate diagnosis of OSA can result in significant clinical and financial costs due to limitations in screening procedures. In the USA, Denmark and Germany, inpatient costs are typically higher than outpatient costs. However, it is important to note that the high costs in Germany are primarily due to specialized treatment provided by medical specialists and in addition due to CPAP devices. The findings highlight the significance of timely detection and adherent treatment of (O)SA in reducing healthcare expenses, also in Germany. The impact of mandibular advancement devices as a second-line therapy on treatment costs in Germany is yet to be determined.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8ce18e22a797bc1f8767535e2183d9a",
  "timestamp": "2025-05-15T03:28:46.305182"
}