{
  "id": 3265,
  "title": "Modelling the effect of the geographical environment on Islamic banking performance: A panel quantile regression analysis",
  "abstract": "While studies have focused on Islamic banking, research on the effect of the geographical environment on Islamic banks is scarce. We investigate this issue by using daily data on 12 Islamic banks in four regions (Africa, Asia, Europe, and the United States) from July 2007 to April 2016. We apply different methodological approaches (principal component analysis, panel data tests, and quantile regression). First, the principal component analysis shows that the performance of Islamic banks varies among regions. Second, the linear panel regression highlights that the geographical environment positively and significantly affects Islamic banking, suggesting the importance of externality effects. Finally, the environmental effect seems to vary with quantiles (positive effect for the lowest quantile versus negative effect for the highest quantile). This quantile specification points to nonlinearity in the environment Islamic bank performance relationship, reflecting a time-varying discipline imposed by the Sharia board (Islamic Law). This finding helps better explain the main difference between Islamic banks in the East (Africa and Asia) and those in the West (Europe and the United States) and also enables investors to adjust their portfolio choices when considering the products of Islamic banks according to regional specificities.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8e869ac2317fdca52f2f575daf70cdc",
  "timestamp": "2025-05-15T01:15:26.124780"
}