{
  "id": 6362,
  "title": "A Longitudinal Study on Loneliness during the COVID-19 Pandemic in Japan",
  "abstract": "The prolonged COVID-19 pandemic has exacerbated existing socioeconomic and health risk factors and added additional dimensions to the loneliness problem. Considering the temporal extension of COVID-19, which exposes people to various loneliness conditions, we examined the development of loneliness and changing risk factors based on age and gender. We used longitudinal data from Hiroshima University's nationwide survey in Japan, conducted before and during the pandemic, to categorize loneliness into three types: long-term (feeling of loneliness experienced both before and during the pandemic), post-pandemic (feeling of loneliness experienced throughout the whole pandemic period), and fresh (feeling of loneliness experienced only in the last year of the pandemic). Loneliness categorization is important because the prolonged existence of the COVID-19 pandemic has added additional dimensions to the loneliness problem, which existing studies rarely identify. As a result, the distinction between long-term and fresh loneliness remains unexplained. The weighted logit regression results revealed that many Japanese people have remained or became lonely during the pandemic and identified variations based on gender, age, and changes in socioeconomic and health characteristics. More precisely, almost 52% of the participants experienced long-term loneliness, while 8% of the participants experienced post-pandemic loneliness, and nearly 5% experienced fresh loneliness. Age and having children were associated with long-term loneliness; gender, age, leaving full-time employment, financial literacy, change in health status, and change in depression were associated with post-pandemic loneliness; and gender, having children, living in rural areas, change in household assets, financial literacy, changes in health status, and changes in depression were associated with fresh loneliness. These results indicated that long-term, post-pandemic, and fresh loneliness have distinct characteristics. The Japanese government should devise distinctive solutions for people suffering from varying loneliness before and during the pandemic rather than adopting a generalized approach.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c8ea8dc5e966fc82e270449e55fde836",
  "timestamp": "2025-05-15T02:57:07.811668"
}