{
  "id": 7779,
  "title": "Determinants of credit spreads in hotel CMBS loans",
  "abstract": "Purpose This study aims to investigate the determinants of credit spreads in hotel loans securitized into commercial mortgage-backed securities (CMBS) between 2010 and 2015. Design/methodology/approach The sample represents 1,579 US hotel fixed interest rate whole loans with an aggregate mortgage value of $26.6bn at loan origination. The relationship between credit spreads and property, loan and market characteristic is examined via multiple regression analysis. Additionally, the method of 2-stage least squares is used to control for endogeneity bias and identify the effect of the loan-to-value (LTV) ratio on credit spreads. Findings The multiple regression models explain 80 per cent of the variation in credit spreads and show a significant association of credit spreads with hotel and loan characteristics and market conditions. The findings indicate the debt coverage ratio to be the most important predictor of credit spreads followed by the loan maturity term, implied capitalization rate, LTV and yield curve. The results show the debt yield premium to be a stronger predictor of credit spreads than the debt yield ratio. The spread between the debt yield ratio and mortgage interest rate could be used in future research as an instrumental variable to identify the effect of the LTV on credit spreads. Research limitations/implications This study is limited to the CMBS market and the period after the financial crisis. Additional limitations include sample selection bias, exclusion of multi-property loans and variable interest rate loans. Practical implications Interest rate increases in an expanding economy would likely increase the cost of borrowing for hotel owners leading to higher debt service payments and lower profitability. If an increase in interest rates is offset by a decline in credit spreads, hotel owners will still benefit from the ensuing stability in borrowing interest rates. The evidence also suggests that CMBS lenders favor select service and extended stay hotels. Owners and operators of these efficient and profitable hotels will likely obtain loans with lower credit spreads given their lower risk of default. Originality/value The current study provides evidence on the effects of loan and property characteristics in the pricing of loan risk and serves to inform CMBS market participants about the factors that drive credit spreads in hotel mortgage loans.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c91f0fc68cff19bd485ab116ed2647bf",
  "timestamp": "2025-05-15T03:12:11.545570"
}