{
  "id": 4924,
  "title": "Does Patient Safety Pay? Evaluating the Association Between Surgical Care Improvement Project Performance and Hospital Profitability",
  "abstract": "Financial issues are top concerns for hospital executives. Evolving reimbursement structures focused on value provide an incentive to fully understand how patient safety performance and financial outcomes are connected. To that end, this study examines the relationships between Surgical Care Improvement Project (SCIP) measurements and hospital financial performance. Using multinomial logistic regression, we determined the association between hospital patient safety performances via analysis of eight prophylaxis data elements drawn from the archived Hospital Compare data. The measures are SCIP-Inf-1 (prophylactic antibiotic prophylaxis received within 1 hr prior to surgical incision), SCIP-Inf-2 (prophylactic antibiotic selection for surgical patients), SCIP-Inf-3 (prophylactic antibiotics discontinued within 24 hr after surgery end time), SCIP-Inf-4 (cardiac surgery patients with controlled 6 a.m. postoperative serum glucose management), SCIP-Inf-9 (urinary catheter removal postsurgery), SCIP-Inf-Card-2 (beta-blocker during the perioperative period), and SCIP-Inf-VTE-2 (venous thromboembolism prophylaxis). Data from the American Hospital Association provided two dimensions of organizational profitability: operating margin and net patient revenue. Our results indicate that improved hospital safety performance is associated with a relative risk of higher operating margin and net patient revenue, with some variation noted among the measures of patient safety. Our findings suggest that targeted improvement in patient safety performance, as evaluated in the Hospital Compare data, is associated with improved financial performance at the hospital level. Increased attention to safe care delivery may allow hospitals to generate additional patent care earnings, improve margins, and create capital to advance hospital financial position.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c92217e66181def4115deba747205884",
  "timestamp": "2025-05-15T02:42:36.125309"
}