{
  "id": 441,
  "title": "Market segmentation and willingness to pay for public transport annual passes among older adults: insights from Genoa, Italy",
  "abstract": "A survey of older adults aged 65 and over (n = 247) was conducted in Genoa, often described as 'the oldest city in the oldest country' in Europe. This paper presents two scenarios exploring older people's willingness to pay (WTP) for annual tickets for local public transport (LPT) and examines the impact of factors such as cost, time, and comfort. These insights could help address the challenges of travel in ageing societies. A segmentation analysis based on the mean values of the two WTP scenarios (status quo and improved services) was conducted, followed by linear regression modelling to understand how older adults' socio-demographic traits, perceptions, and travel behaviour affect their WTP. Our findings suggest that the pricing of the annual pass (345 at the time of survey) exceeds the WTP indicated by respondents. The mean WTP for the status quo level of service (221.36) was much lower than the WTP if service levels were improved (304.07). Women were found to be more likely to use LPT but also tended to live alone and have lower incomes. Off-peak hours, particularly in the afternoon, were also associated with a higher WTP. This research is important in the context of Europe's ageing population, highlighting the need for more inclusive transport options for older adults. Public transport authorities (PTAs) should explore more tailored approaches to pricing and service provision. It is imperative to balance the competing goals of cost recovery, equity, and service attractiveness to encourage older people's uptake of LPT services, while maintaining accessibility and wellbeing.",
  "year": 2025,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c922f51464847e2a94ce3ee61d51fec2",
  "timestamp": "2025-05-15T01:31:50.790523"
}