{
  "id": 9398,
  "title": "Does the managerial compensation scheme affect the investment and capital structure policy?",
  "abstract": "Since Berle and Means (1932) stressed the effect of partial ownership on managerial decision makings, the finance literature has suggested various mechanisms of corporate governance to align managers' selfish incentives with firm value maximization. The managerial compensation scheme has been recognized as one of the most important mechanisms of corporate governance. The most controversial issue in designing a compensation scheme is the sensitivity of managers' wealth to stock price and stock volatility. This paper provides empirical evidence of a strong relation between the structure of managerial compensation and value-critical managerial decisions, such as investment policy and capital structure policy. Specifically, we find that higher prior delta (wealth-to-performance sensitivity) and vega (wealth-to-volatifity sensitivity) of managers' wealth are associated with increased investments in research and development, as well as in property, plant, and equipment. But higher prior delta and vega of managers' wealth are associated with lower leverage. This evidence provides a support for the hypothesis that a managerial compensation schemes with higher sensitivity to stock price and volatility increases executives' incentive to invest in riskier projects and, at the same time, to use lower debt levels as a bonding mechanism. Since company-wide option plans have become a substantial component of many firms' equity capital and managerial compensation, a growing body of research on stock options addresses the incentive implications of firm-level option plans (Core and Guay. 2002; Coles, Daniel and Naveen, 2004). In these studies, the key process in measuring the delta and vega of managers' wealth is related with pricing of executive stock options. We measure the delta of managers' wealth as the sensitivity of their stock and option value with respect to a 1% change in stock price, and the vega as the sensitivity of their option value with respect to a 0.01 change in stock return volatility. Using data from the Korean Listed Company Association (KLCA), we compiled all relevant values in estimating the delta and vega of executive stock options such as the total number of options outstanding at the end of the fiscal year, the exercise prices, and remaining times to maturity. We also used KLCA database for managerial share holdings and stock prices. The delta of managers' wealth is defined as the sum of option delta and stock delta. Assuming that the vega of stock is zero, we define the vega of managers' wealth as the option vega. The sample of this research consists of 97 non-financial firms that have endowed stock options as a means of executive compensation since year 2000. The investment policy of a firm is proxied by two variables: the proportion of research and development (R&D) expenditures to total sales, and the capital expenditures in property, plant and equipment (PPE) to total assets. The capital structure policy is proxied by a market value leverage ratio and a book value leverage ratio. We employ both pooled regressions and simultaneous regressions in analyzing the effect of delta and vega on the investment and capital structure decisions. Our empirical analyses show that the delta and vega of managerial wealth are positively related to R&D investments mid PPE investments of the firm, and are negatively related to the leverage ratio. The positive relation between the managers' wealth sensitivity and investment implies that managers' wealth sensitivity increases the fisk-taking incentive of managers. The negative relation between the managers' wealth sensitivity and leverage ratios implies that managers use the debt level as a bonding mechanism, not as a risk-increasing mechanism. Since the capital structure policy is more easily exposed to external monitoring than the investment policy, managers with higher delta or vega are more prone to choose the investment policy, compared to the capital structure, as a means of increasing risk level of the firm. We could hypothesize that mangers with higher delta and vega as the incentive to increase the risk level of a firm, would invest in riskier projects, and at the same time, maintain a lower debt level of bond themselves to outside investors. Our results are robust to model specifications. Year-by-year regression results are Qualitatively the same as those of pooled regression. We also set up a simultaneous equation system to incorporate a possible endogenous relation among wealth sensitivities, investment policy, and capital structure policy, and re-estimate the relation among variables. The simultaneous equation estimators are consistent with the results of pooled or year-by-year regressions. Our empirical findings as a whole support the hypothesis: higher sensitivity to stock price and volatility in the managerial compensation scheme gives executives more incentive to aggressively increase the investment level, and to use a lower debt level as a bonding mechanism. Thus, equity-based compensation such as executive stock options significantly affects value-critical managerial decisions including those of investment policy and capital structure policy.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c929c1857d1710b5374a35a95ca5c835",
  "timestamp": "2025-05-15T03:28:17.619707"
}