{
  "id": 9047,
  "title": "Mental Health Impacts of Multidrug-Resistant Tuberculosis in Patients and Household Contacts: A Mixed Methods Study",
  "abstract": "Background: Multidrug-resistant tuberculosis (MDR -TB) patients experience disproportionately worse mental health, with implications for adherence, outcomes, and families. Comprehensive assessments of comorbid depression/anxiety and related factors remain limited. Objective: This study aimed to assess the prevalence, predictors, and qualitative experiences of depression and anxiety in MDR -TB patients and household contacts. Methods: A sequential explanatory mixed methods study was conducted in Gujarat, India, with 403 smearpositive MDR -TB patients and 403 contacts. The quantitative phase administered structured questionnaires on sociodemographic factors, clinical history, depression/anxiety symptoms, and psychosocial stressors (like stigma and social support). Logistic regression models were used. The qualitative phase included in-depth interviews with 30 purposively sampled patients for thematic content analysis. Results were integrated to contextualize quantitative findings. Results: High rates of depression (37.5%, n = 151) and anxiety (45.2%, n = 182) were documented among the MDR -TB patients, significantly greater than household contacts (20.1%, n = 81 and 25.1%, n = 101, respectively). For depression, older age (adjusted odds ratio (AOR) 2.03, 95% CI 1.01-4.05), female gender (AOR 2.5, 95% CI 1.1-6.0), divorced/widowed status (AOR 3.8, 95% CI 1.1-8.0), financial constraints, substance abuse (AOR 1.7, 95% CI 1.1-2.7), greater disease severity (AOR 1.8, 95% CI 1.5-2.2), medication side effects (AOR 2.4, 95% CI 1.2-4.6), and perceived stigma (AOR 3.2, 95% CI 1.1-5.3) emerged as significant risk factors. For anxiety, significant predictors were less social support (AOR 0.81, 95% CI 0.71-0.86), higher perceived stigma (AOR 2.2, 95% CI 1.1-6.3), greater disease severity (AOR 2.6, 95% CI 1.3-4.0), and more medication side effects (AOR 3.3, 95% CI 1.1-5.5). Prominent themes included psychological impacts like depression and anxiety, experiences of stigma and caretaking challenges, and recommendations for comprehensive patient support services. Conclusion: MDR -TB patients experience a substantially higher dual disease burden of depression and anxiety, elevating the risk for adverse outcomes and transmission. Improving psychosocial support is vital to patient -centric care pathways for vulnerable groups. Mixed methods provide comprehensive evidence to inform integrated physical and mental health services.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c939ba745439f1f391e3605ac082e191",
  "timestamp": "2025-05-15T03:24:54.940755"
}