{
  "id": 3468,
  "title": "Life cycle assessment of electricity from biogas: A systematic literature review",
  "abstract": "Cleaner energy sources have been one increasing research topic in electricity generation. In that regard, (organic) waste of production processes can be object of anaerobic digestion, generating biogas; it can environmentally benefit by means of waste treatment (and consequent avoided environmental impacts) and electricity production. Additionally, the life cycle assessment (LCA) is the most comprehensive tool for environmental assessment. Therefore, the present study aims to conduct a systematic literature review of high impact research on LCA of electricity from biogas to investigate trends in this body of literature. To that end, the Methodi Ordinatio was applied to the raw portfolio to identify the most relevant, high impact, studies in the area. EndNote and VOSviewer were used, respectively, for reference management and clustering topics and researchers. The results show the main trends in the referred body of literature, possible LCA-biogas-electricity nexus, as well as the main researchers conducting studies on the topic and what their results draw on. Yet, it can be seen the main institutions housing high impact studies on the approached themes and their locations. Furthermore, this study gives an overview on the use of LCA of electricity generation from biogas and sheds light on possibilities for future research. Future opportunities for biogas should be drawn in terms of circular economy practices. (c) 2018 American Institute of Chemical Engineers Environ Prog, 38:e13133, 2019",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c93c2f5fdc008d06751d4a578ab4c99e",
  "timestamp": "2025-05-15T01:17:25.502318"
}