{
  "id": 4194,
  "title": "Does CSR contribute to the financial sector's financial stability? The moderating role of a sustainability committee",
  "abstract": "PurposeThis study tests whether corporate social responsibility (CSR) performance is a predictor of the financial sector's financial stability (FS), with the moderation of a sustainability committee.Design/methodology/approachThe sample covers financial sector firms included in the Thomson Reuters Eikon database. The analyses are based on 8,840 firm-year observations for the years between 2002 and 2019 and the country-firm-year fixed-effects (FE) regression analysis is executed.FindingsThe results reveal that CSR initiatives contribute to the financial sector's FS as a whole and the sector's three individual sub-sectors. This proven significant association holds for all sub-sectors, namely insurance, banking, and investment banking. Moreover, the moderation analysis reveals the prominent role of a sustainability committee in bridging CSR performance (CSRP) with FS.Research limitations/implicationsThe findings highlight that meeting societies' expectations pays back in the form of greater FS in the financial sector.Practical implicationsThe findings suggest that CSR engagement helps the financial sector firms manage their risks and alleviates exposure to insolvency. This is because CSR performance promotes firms' accountability and transparency toward stakeholders. The results help motivate managers to pursue CSR goals more seriously to ensure FS. The moderation analysis implies that sustainability committees develop policies and practices to integrate the non-financial and financial goals of the firm.Originality/valueAlthough prior studies have examined the link between CSR and financial performance (FP) in the financial sector, those studies have largely ignored FS in terms of risk-adjusted performance. Besides, prior studies have exclusively focused on the banking sector, but the authors concentrate on the banking, insurance, and investment banking sectors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c94515ea47094dd83107c8e022286f52",
  "timestamp": "2025-05-15T02:34:13.451077"
}