{
  "id": 2567,
  "title": "Military background officials, risk awareness, and local government fiscal balance: Novel evidence from text analysis of Chinese local officials' news reports",
  "abstract": "By introducing the method of  excess  analysis in corporate finance to quantify the fiscal balance in regional economics, we analyze the heterogeneous impact of municipal party secretaries with military backgrounds on local economic development in 275 prefecture -level cities in China. We find that military background officials can significantly decrease local fiscal imbalance, and reduce excess fiscal expenditure and fiscal deficit. Military background officials have significantly reduced the number and area of the regional industrial land allocation, possessed a lower risk preference for the development of the regional financial industry, and significantly reduced the issuance probability and risk premium of Chengtou bonds. Through data mining and machine learning text analysis, we find that military background officials have a higher risk prevention attitude, which is proportional to the military experience length and inversely proportional to the time interval from their military service discharge to the local government leaders. The results are valid after a series of robustness tests. This paper is of great significance to the creation of officials ' behavioural analysis on regional economic development and has vital enlightenment to the appointment and administration of local officials in China.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c94dbd7b919235112642e68bacb898c1",
  "timestamp": "2025-05-15T02:17:01.596313"
}