{
  "id": 1936,
  "title": "A Novel Portfolio Optimization Model Based on Trend Ratio and Evolutionary Computation",
  "abstract": "Stock selection is a paramount importance in stock investment. Selecting stocks generally requires considering return and risk simultaneously. The common assessment strategy is to use the Sharpe ratio. Sharpe ratio uses the standard deviation to determine portfolio risk but a portfolio with an uptrend has high risk, defying the logic of most investors. Therefore, this paper proposes a novel assessment strategy, trend ratio. The trend ratio uses linear regression, which is improved with the initial funds when seeking to find the trend of a portfolio. The slope of the trend line is daily expected return, and the difference between the trend line and the funds standardization of a portfolio is daily risk. The trend ratio not only can find the portfolio that has a stable uptrend, but also solves the problem of the Sharpe ratio when a portfolio with an uptrend has high risk. This paper does not limit the number of stocks in a portfolio; it uses the quantum-inspired tabu search algorithm, which is improved by an adaptive strategy, the current best-known solution, and the quantum not gate (ANQTS) to find the best portfolio in a large solution space. This paper employs the sliding window to avoid the over-fitting problem. We use the traditional sliding window, which uses the previous period as training data, as well as the year-on-year sliding window, which uses the same period in the last year as the training data. In summary, this paper combines the trend ratio, ANQTS, and the sliding window to solve the problem of stock selection. The experimental results show that our method finds better portfolios than the Sharpe ratio. Moreover, the year-on-year sliding window, as proposed herein, has promising performance in investment and finds out some suitable economic cycle lengths for stock investment.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c980634a1c764b8b0b73cfe722e8227c",
  "timestamp": "2025-05-15T01:01:06.229014"
}