{
  "id": 6428,
  "title": "Commodity market risks and green investments: Evidence from India",
  "abstract": "Green investing has recently received considerable attention in India in light of the local government plans to significantly reduce the level of CO2 emissions through conducting and funding various types of eco-friendly infrastructures and green projects on a national scale. Given that investment in environmentally friendly projects is still relatively new in India, the stock prices of Indian green companies could be highly volatile and very prone to risk transmission from other assets, which requires a precise estimation of the time-varying volatility of these green stocks to understand their underlying risk. In this paper, we examine if the stock volatility of Indian green companies can be predicted based on the information contents of commodity market implied volatility indexes (VIX) by employing a GARCH-based quantile regression model on daily data. The results show that risk significantly transmits from crude oil, gold, and silver markets to various Indian green stock indexes. The impact of the transmission from commodity market VIXs is stronger during the bearish stock market periods compared to bullish stock market periods, suggesting that green stock indexes are more likely to receive volatility from energy and precious metal markets during the periods of high uncertainty. Our findings are useful to socially responsible investors who focus not only on the environmental performance of a firm but also consider its financial performance.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9820298d980047e7069b765bdcd3fd0",
  "timestamp": "2025-05-15T02:58:05.627162"
}