{
  "id": 2048,
  "title": "RETRACTED: Effects of cost-benefit analysis under back propagation neural network on financial benefit evaluation of investment projects",
  "abstract": "To determine the influence of the weight of the economic effectiveness evaluation criteria of the major investments of listed enterprises, and provide new management ideas for the development of the follow-up enterprises, firstly, the financial benefit evaluation system of investment projects is analyzed and constructed, and the specific evaluation process is analyzed. Then, on this basis, the evaluation index is refined; the basic structure of BP neural network (BPNN) is introduced, and genetic algorithm is used to improve BP neural network. The cost-benefit analysis model is constructed based on the improved BPNN. The listed company A is taken as an example to analyze its development data in recent years, and then the data of 10 listed companies are taken as the research object. Matlab simulation software is used to train and verify the improved BPNN model, analyze and predict the weight value of the financial benefit index of the investment projects of these 10 companies, and then determine the index to improve the financial benefit of the investment projects. Under the analysis of the development data of listed company A in the past 10 years, it is found that the indicators of the listed company's profitability per share, debt risk operation ability, development, and growth ability in the past 10 years are in relatively stable state. The principal component analysis of its 20 secondary sub-indexes is conducted based on the four primary indicators: profitability, debt risk, operational capacity, and development and growth. A total of eight principal components including return on equity (ROE), return on assets (ROA), (total asset turnover) TATO, turnover of account receivable (AR), asset-liability ratio, interest protection multiple, income growth rate, and year-on-year rate of increase for complete assets are extracted. The average error between the final output value, the actual value, and the expected value is 0.0304 and 0.0169, respectively. The weight coefficient of the monetary benefits evaluation indicator of investment items is calculated, and the computed results show that year-on-year rate of increase for complete assets, TOTA, ROA, turnover of total capital, and ROE are important indexes in the financial benefit evaluation of investment projects. It indicates that to improve the financial benefit of investment projects of listed enterprises, it is necessary to enhance the year-over-year growth degree of total properties and ROA.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c98ff912957dbc4e13a2f71151aada49",
  "timestamp": "2025-05-15T02:10:25.817082"
}