{
  "id": 9168,
  "title": "Sociodemographic correlates and associated factors of depression and anxiety among internally displaced adults in Ogoja, Nigeria",
  "abstract": "Background Displaced persons in Nigeria experience various difficulties at different stages of their displacement, including mental and physical problems. These experiences have been associated with different types of mental disorders. Aims This study sought to identify sociodemographic correlates and other factors associated with depression and anxiety among internally displaced adults in Ogoja, Cross River State, Nigeria. Methods A cross-sectional study was conducted using non-probability and probability sampling techniques. Internally displaced adults (n=335) were identified in Ogoja locations with a high prevalence of internally displaced persons (IDPs). Their mental health symptoms were assessed using the Common Mental Disorder Questionnaire, and a semistructured questionnaire was employed to collect data on sociodemographic and displacement-related characteristics. Data were analysed using descriptive statistics, chi(2) analysis and multivariable logistic regression. Results The prevalence of subtypes was 66.0% for anxiety disorder and 73.4% for depression. Factors found to be significant in each bivariate chi(2) analysis were modelled for each outcome. The multivariate analysis revealed that prolonged displacement (adjusted odds ratio (AOR)=3.64; p=0.048), reduced family size (AOR=0.28; p<0.001) and fears of reprisal attacks (AOR=4.19; p=0.004) were significantly associated with anxiety disorder. Male gender (AOR=2.09; p=0.015), prolonged displacement (AOR=3.55; p=0.020), reduced family size (AOR=0.55; p=0.049), financial strain (AOR=5.43; p=0.023) and loss of loved ones (AOR=1.92; p=0.040) were significantly associated with depression. Conclusions The implications of the findings underline the complex aetiology of these two mental problems and the need to cater to the well-being of those at risk who have been exposed to trauma-related events. Accessible and affordable mental health services should be provided for these persons while also considering a social welfare scheme that covers their health expenses. Moreover, socioeconomic conditions targeting IDPs in the Ogoja Local Government Area should be improved by conducting large-scale mapping to identify this population.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9943308d08720360e7d1d9a32ccc77c",
  "timestamp": "2025-05-15T03:26:25.889690"
}