{
  "id": 9198,
  "title": "Association of Age-Related Macular Degeneration with Cholelithiasis",
  "abstract": "Purpose: Dysregulated lipid metabolism likely contributes to the pathogenesis of age-related macular degeneration (AMD). There is an overlap in risk factors between AMD and diseases of lipid metabolism, such as cholelithiasis, suggesting that an association between these diseases could provide insight into AMD pathogenesis. This study sought to determine if there is an association between cholelithiasis and AMD. Design: A cohort study was conducted using patients in the Optum deidentified Clinformatics Data Mart database from January 1, 2000, to June 30, 2022. Participants: Patients over the age of 55 with >2 years of data and no prior history of AMD were included. The exposed cohort included patients who had a history of cholelithiasis, cholecystitis, or cholecystectomy. The control cohort included patients with gastroesophageal reflux disease (GERD), matched for age +/- 3 years, sex, race, and year of index date. Methods: Propensity scores were created using multivariable logistic regression and applied to inverse probability of treatment weighting (IPTW). Cox proportional hazard regression modeling with IPTW was used to compare progression to AMD in each cohort. Main Outcome Measures: Progression to AMD for patients with cholelithiasis, cholecystitis, or a history of cholecystectomy. Results: A total of 332 536 patients with cholelithiasis and 776 591 matched GERD controls were analyzed. After IPTW, the mean age (+/- standard deviation) was 66.6 +/- 9.4 years in the cholelithiasis cohort and 67.5 (+/- 10.3) years in the GERD cohort. Women comprised 58% of the cholelithiasis cohort and 57% of the GERD cohort. In the cholelithiasis cohort, 3511.7 (1.14%) were diagnosed with AMD, compared with 23 367.1 (2.92%) in the GERD cohort and corresponding to a significantly decreased hazard of AMD (adjusted hazard ratio [aHR]- 0.72, 95% confidence interval [CI]: 0.69-0.75, P < 0.0001). In the subanalysis, before IPTW weighting, AMD developed in 3809 of 275 897 (1.4%) patients with only cholelithiasis (aHR-0.76, 95% CI: 0.73-0.80, P < 0.0001), 335 of 47 166 (0.71%) patients with cholecystitis (aHR-0.54, 95% CI: 0.47-0.61, P < 0.0001), and 114 of 9473 (1.20%) patients who underwent cholecystectomy (aHR-0.50, 95% CI: 0.41-0.63, P < 0.0001). Conclusions: Cholelithiasis was associated with a 28% hazard reduction in AMD. More severe gallbladder disease conferred greater protection. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Science 2025;5:100771 (c) 2025 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/). Supplemental material available at www.ophthalmologyscience.org.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c998f9a2e32647ce4813dd036a2a892f",
  "timestamp": "2025-05-15T03:26:26.024496"
}