{
  "id": 9466,
  "title": "Union's inspiration: Universal health care and the essential partiality of solidarity",
  "abstract": "Political struggles not only change social institutions and conventions, they also often shape normative language. Moral notions of lasting significance are like geological formations insofar as they are usually not formed in a void but under considerable pressure. While some notions are fundamentally linked to legal documents or academic treatises, others are mainly advanced in songs, pamphlets, or manifestos. Philosophical attempts to define these evolved notions are often sensitive to their particular histories in order to avoid detachment from common pre-theoretical usage. After all, moral theory would be ill-advised to rid itself of considered conceptual intuitions unless there are strong grounds for revision. Even though theoretical reflection may produce reasons to deviate from prevailing understandings of core moral notions, it must eventually rely on some form of a semantic orientation. The line between reconstructing and redefining moral notions is particularly hard to draw when it comes to comparatively young and polymorphic notions, such as solidarity. It is difficult to provide a finite definition of 'solidarity', as the term has been appropriated in the pursuit of a variety of causes. Different theoretical reconstructions explicate solidarity as a form of unity, fraternity, civic friendship, charity, humanity, or camaraderie. Instead of reflecting on this variety of meanings, the present contribution examines the reference to solidarity within a specific context of moral debate. There are recurring calls for solidarity in contemporary oppositions to the erosion of the protective reliabilities of society, as it becomes manifest in the reduction, privatization, or stratification of both social security in general and health care in particular. In this context, solidarity is invoked as a relation that connects all members of society, providing a reason to accept or support the introduction or continuation of universal health care. In the following, I am concerned with the adequacy of the moral terminology implied in this line of reasoning. My claim is that - at least relative to the purpose of moral philosophy to provide a systematic, comprehensive, and fine-grained account of moral obligation - a specific partisan notion of solidarity is of greater systematic value to moral terminology than the alternative universal notion. At least one central strain of moral references to 'solidarity' does not conceive it as a notion of universal moral inclusion, but of communal relatedness. This conception of solidarity imprints the term with a specific community-related perspective, i.e. the distinctive normative and motivational force of solidarity relations is taken to reside in a specific form of partiality toward significant groups like unions, cooperatives, parties, committees, etc. Ralph Chaplin's Solidarity Forever, for instance, memorably assigns the distinctive strength of references to solidarity to union's inspiration. In this understanding, the reference to solidarity bears a specific moral and political relevance because it conveys a normative insight to members of specific communities, explicating why they may be obliged to take a stand for a common cause, even if this involves going well beyond what can be expected of them merely qua moral subjects. I aim to show that a conception of 'solidarity' that confines it to this decidedly partisan moral relation provides a significant contribution to moral philosophy because it grasps a specific and important facet of moral obligation. In the following, this structural feature of solidarity is discussed with regard to the moral foundation of health care policies. I argue that the demand to universal access to health care should be conceived as a matter of justice, decency, or humanity, rather than of solidarity, because the failure or refusal to provide adequate health coverage does not disregard individuals as members of specific communities, but as moral subjects. My argument for this terminological suggestion comes in three sections. The first section establishes a normative notion of solidarity as a source of - essentially partisan - communal obligations reflecting on shared identificatory attributes like convictions, social positions, or significant histories. Under this description, solidarity is understood to pose a particular type of special obligations, creating moral requirements that obtain apart from and beyond the demands of universal morality. The reference to solidarity unfolds a particular theoretical potential when it captures a distinct form of communality. The second section locates the normative foundation of calls for universal health care in the domain of justice by understanding the provision of basic health care as a right of every moral subject that is independent of normatively significant commonalities. The third section concludes that solidarity is a notion that does have a place in health-related norms, but that does not provide the best moral foundation of demands for universal health care. Rather, relations of solidarity establish forms of moral obligations that are indispensable when social systems fail to provide justice or reach their legitimate limits. The first step of the argument brings 'solidarity' into view as a systematic term of moral philosophy as opposed to its role in sociology or political theory. This perspective focuses on solidarity as a relation that provides specific moral reasons, such as the reason to accept and obey practices of mutual assistance, to put oneself at risk or at a disadvantage for the benefit of others, to endure hardships for the common good, etc. Thus, the reference to solidarity within moral justification bears a discursive force in its own right. The main difficulty in the appropriation of solidarity to moral philosophy is to individuate and explicate a defining set of features of recognized uses of the term. Due to the variety of relations, attitudes, and dispositions that are commonly referred to as solidarity, no coherent notion can be expected to be able to simultaneously capture obligations toward humankind, or the exploited and the poor, among comrades and sisters in arms, and between the members of parties, teams, clubs, gangs, unions, collectives, and social movements. One reaction to this diagnosis is to accept that solidarity is a pluralistic notion that cannot be reduced to either of these meanings. However, this approach would possibly have to allow a very broad understanding of 'solidarity' that could render the notion empty or incoherent. Such a conception of solidarity may pose no difficulties within everyday language, but it can be argued to be unsuitable for the kind of justification sought in moral philosophy. There are legitimate doubts about the confinement of moral notions like solidarity to the narrow boundaries of philosophical concepts for systematic purposes. However, if the language of moral philosophy is not to become artificial, it has to adopt notions of our common language and alter them to avoid incoherences. A moral account of solidarity is only of systematic value if the reference to 'solidarity' captures a specific type of obligation that can be distinguished from other moral obligations. Without an explanation in what regards obligations of solidarity are different from, go beyond, or are more specific than obligations of justice, humanity, charity, fidelity, or loyalty, there is arguably no need for a distinct theory of solidarity within moral philosophy. Thus, a convincing exposition of solidarity should fulfill a condition of conceptual discriminability, and of irreducibility. If it is to play any significant role in moral philosophy, 'solidarity' has to refer to a moral relation sui generis. Once some defining features of solidarity are established, the meaning of references to solidarity in debates about public health care can be addressed. In approaching a sound notion of solidarity, different accounts can be distinguished with regard to their position on its normative scope, i.e. with regard to the extension of the groups within which subjects are considered to have mutual obligations and corresponding claims of solidarity. The main dividing line that is relevant to the present context - to the analysis of the systematic function of references to solidarity within moral philosophy - must be drawn between universalist and partisan accounts of solidarity. Some prominent accounts of moral solidarity conceive it as a universal relation that extends to all humanity, or to all members of society, making solidarity the basis of a universal form of moral obligation. David Wiggins and Jurgen Habermas, for instance, invoke different notions of universal solidarity for different conceptual reasons. While Wiggins refers to solidarity in order to designate a fundamental form of a pre-reflective universal recognition implying negative duties, Habermas describes solidarity as a non-formal positive attitude of care complementing formal requirements of justice. Both accounts provide valuable insights into the nature of political and moral obligation. Yet, the competing understanding of solidarity as specific by virtue of its partiality comes with considerable systematic advantages. Wiggins understands solidarity as a fundamental moral relation that is characterized, among other things, by its universality. In this understanding, solidarity is a particular form of recognition that forms the basis of morality altogether. This form of recognition entails deontological constraints, but these constraints are not solely based on demands of reason. Thus, solidarity resembles Kantian respect in terms of the demands it poses, but with regard to the underlying attitude, solidarity resembles Humean sympathy. In the course of outlining obligations of solidarity, Wiggins identifies solidarity as 'the [ horizontal ellipsis ] thing that any human being owes to any or all other human beings, namely the solidum that is presupposed to the ordinary morality of all interaction between human beings'. As the very bedrock of moral relatedness, solidarity must extend to every moral subject alike. Solidarity is the basic form of recognition that interconnects moral subjects through their mutual consideration as bearers of a point of view that commands respect. Habermas brings forth a different account of solidarity, but he also uses the term to denote a relation with a universal extension. In this account: Solidarity [ horizontal ellipsis ] is rooted in the realization that each person must take responsibility for the other because as consociates all must have an interest in the integrity of their shared life context in the same way. Justice conceived deontologically requires solidarity as its reverse side. Habermas distinguishes the fundamental moral demands of justice that are directly based on the principles of discourse from complementary demands of sympathy or care that are based on solidarity. While justice substantiates negative obligations, solidarity requires moral subjects to strive at promoting the welfare of others. Thus, Habermas supplements the discourse theory of morals with the relation of solidarity in order to be able to account for materially rich notions of social relatedness. However, in this description the 'shared life-context' relevant to solidarity is not economic class, social position, or political stance but society as a whole. For Habermas, justice and solidarity differ with regard to the content of their obligation, yet they are similar in their universal scope, as solidarity is conceived of as extending toward all members of society. While both accounts capture an important aspect of moral and political obligation, their recourse to 'solidarity' is not without problems. There is no incontestable argument that would be sufficient to reject these two notions of universal solidarity. While there is no 'separate essence' of solidarity that could be referred to in order to argue for the conceptual necessity of solidarity's partiality, some features may reasonably be stipulated as being essential to solidarity with a view to its systematic function within moral philosophy. Thus, I aim to uncover some systematic disadvantages of assigning 'solidarity' in the description of a universal relation within moral philosophy. The universal notion of solidarity misses - or deliberately excludes - something that is at the core of a competing account of solidarity. What is this feature of solidarity that is lost in its universalization? As indicated before, influential references to solidarity identify unity, cohesion, or community as essential elements of solidarity. The idea that is at the core of this understanding of solidarity can be illustrated with reference to a terminological precursor of 'solidarity'. A legal construction of Roman civil law, the obligatio in solidum, describes a joint liability, or a liability for the whole, that is incurred when individual debtors assume responsibility for a collective loan. Accordingly, one can argue that obligations of solidarity require a solidum, i.e. some form of an entirety or a whole that serves as a point of reference in the content of solidary obligations. Wiggins understands the solidum to refer to the firmness of solidarity by making the relation of solidarity 'the root of the ethical', or the hard core of morality. For Habermas, the solidum may be society as a whole comprising moral subjects viewed as consociates. These references to a solidum, however, have to be distinguished from those that base solidarity in communal relations entailing significant forms of relatedness that go beyond the obligations of moral subjects qua moral subjects. Solidarity qua partisan relation refers to a morally significant solidum in terms of a wholeness or unity of distinct communities. The question with regard to universal solidarity is what the reference to a solidum contributes normatively beyond the consideration of others as mere moral subjects. In the case of partial solidarity, significant commonalities determine the range and the dimension of specific obligations of solidarity. If a solidary community is of moral significance, then it must entail a relevant distinction between subjects as members of the community and others as - mere - moral subjects, just like friends, comrades, or family members have to make this distinction in order to satisfy the normative implications entailed in friendship, camaraderie, or family. The moral significance that is missing in accounts of universal solidarity concerns the role of expressions like 'my' or 'our' as irreducible constituents of moral reasons that are indicative of communal obligation. In this manner, the reference to others as 'my friend', 'my sister', or 'my ally' expresses a structural characteristic of morally significant relations within a community. Thus, the obligation toward one's own community is not merely an obligation toward some community based on a neutral moral property but on a reason that necessarily entails a reference to the bearer of the obligation. This demonstrates that the universal relation that Wiggins and Habermas have in mind cannot be regarded as one specific form of - a human or a moral - solidarity that may coexist with narrower forms of national, ethnic, cultural, or political solidarities. The problem is that human solidarity lacks the significant reference to a solidum. While there is a difference between characterizing someone as a friend or a comrade and referring to her as one's own friend or as my comrade, it is plainly difficult to comprehend what would distinguish someone as 'my fellow human' from someone as merely 'a human'. The solidarity within civil rights movements or political unions requires a reference to others in relation to the subject of solidarity exposing their significant commonality as feminists, homosexuals, workers, anarchists, etc. Thus understood, relations of solidarity, and the entitlements and obligations associated with them, only extend to those who are related via significant commonalities, and the content of solidary obligations is explained and limited by these commonalities as well. This structural difference between agent-relative and neutral moral reasons suggests that the notions of universal and partisan solidarity are incompatible; but this does not imply that the universal notion has to give way to the partisan notion of solidarity. My argument rests on the assumption that, while the notion of partisan solidarity captures a specific moral phenomenon for which there is no comparable alternative, the partisan conception does not take anything away from those accounts that refer to universal solidarity, because other established moral notions like humanity, charity, or beneficence suffice to capture what appears to be invoked in references to universal solidarity. While it is impossible to pre-decide this issue for all potential conceptions of universal solidarity, the relation that Wiggins has in mind may be re-described as humanity, compassion, or fellow-feeling, or maybe as a basic form of moral recognition. At any rate, other terms than 'solidarity', which is commonly associated with a much more specific meaning, may be conceived as fitting to describe such a fundamental form of moral relatedness. Similarly, one may concede that Habermas makes a valid material point to emphasize positive obligations between all members of society. Yet, there may be alternative notions, like care, mutual concern, or civility, that capture what Habermas has in mind. If using the term solidarity to describe universal moral relations leaves a specific form of moral obligation without a label, more needs to be said about the distinctiveness of the communality that is supposed to be entailed in this form of moral obligation. Solidarity is often regarded as an inherently inclusive ideal to counter the narrowness of commitments to blood, soil, and nation. This appears to be incompatible with the defense of an essentially partial, and thus exclusive, notion of solidarity. However, solidarity cannot only be distinguished from universally inclusive obligations, but also from immediate and exclusive forms of moral relatedness like patriotism, friendship, or loyalty. Thus conceived, solidarity comprises a very specific strain of a wider set of what may be considered associative obligations. These obligations, in turn, belong to a wider class of special obligations comprising contractual duties, reparative duties, and duties of gratitude. Solidarity's normative force depends on meaningful commonalities like a joint struggle, a common ideal of a good life, or a social utopia, in relation to which a solidary subject positions herself, while being aware that others do the same. Solidarity is special insofar as it contains a shared partisan involvement with a group that is not strategic, but that is nonetheless 'mediated by thought and belief'. Due to its normative foundation in reflected commitments, solidarity tends to be more inclusive than immediate ties of kith and kin. Even though solidarity is - inevitably - more exclusive than humanity, it allows for inclusion of those who are willing to join with an identificatory commitment. If solidarity relations pertain to a specific form of communal obligation which holds some significance in moral life, and for the description of which moral philosophy possesses no viable alternative, then abandoning this notion noticeably impoverishes moral language. This pragmatic argument about philosophical terminology does not question the existence of universal obligations, but it suggests that the term solidarity is misplaced in the denotation of universal obligations or affiliations; ; ",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c99fec0f7f0f348ed579690566a2e7f5",
  "timestamp": "2025-05-15T03:29:10.368337"
}