{
  "id": 5913,
  "title": "Cost-related medication nonadherence among over-indebted individuals enrolled in statutory health insurance in Germany: a cross-sectional population study",
  "abstract": "Background Millions of citizens in high-income countries face over-indebtedness that implies being unable to cover payment obligations with available income and assets on an ongoing basis. Studies have shown an association between over-indebtedness and health outcomes, independent of standard socioeconomic status measures. Patterns of cost-related medication nonadherence (CRN) among over-indebted individuals are yet unclear. The aim of this study was to examine the frequency of nonadherence to prescribed medications due to cost, and to identify risk factors for CRN among over-indebted individuals in Germany. Methods In 2017, we conducted a cross-sectional survey among over-indebted individuals recruited in 70 debt advice agencies in North Rhine-Westphalia, Germany. Data on CRN in the last 12 months (i.e. not filling prescriptions, skipping or decreasing doses of prescribed medication due to financial problems) were collected by a survey using a self-administered written questionnaire that was returned by 699 individuals with a response rate of 50.2%. Prevalence of CRN was assessed using descriptive statistics. Multiple logistic regression analysis was performed to examine risk factors of CRN, including participants enrolled in statutory health insurance with complete data (n = 521). Results The prevalence of CRN was 33.6%. The chronically ill had significantly greater odds of cost-related medication nonadherence (aOR 1.96; 95% CI 1.27-3.03) than individuals without a chronic illness. CRN was more likely to occur in individuals who had discussed financial problems with their general practitioner (aOR 1.58; 95% CI 1.01-2.47). There was no association between CRN and other sociodemographic factors or socioeconomic status. Conclusions Medication nonadherence due to financial pressures is common among over-indebted citizens enrolled in statutory health insurance in Germany. Stakeholders in social policy, research and health care need to address over-indebtedness to develop strategies to safeguard access to relevant medications, especially among those with high morbidity.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9a46d24a53965c49d594d5405bf8416",
  "timestamp": "2025-05-15T02:53:02.937583"
}