{
  "id": 4575,
  "title": "Determinants of Time for Publication Annual Reports: Empirical Evidence from Non-Financial Listed Companies in Vietnam",
  "abstract": "This article studied the factors affecting the time taken for annual report submission through an analysis of 654 non-financial listed companies on the Vietnamese stock market from 2016 to 2020. Data collected were processed by using fixed-effect models (FEM), random effect models (REM), adjusted REM, and general least square (GLS) to ensure the validity of research results. The main objective of this paper was to explore the effects of independent variables including retained earnings (RETA), earnings before interest and tax (EBITTA), liquidity (WCTA), capital structure (BVETD), bankruptcy risk (ZSCORE), size (SIZE), number of years in business (AGE), characteristics of financial reports (CONSO), and type of audit firm (AUDIT) on the number of days for publication annual reports (TIME). The results obtained from the adjusted-REM and GLS regression showed that retained earnings, firm age, and firm size have positive effects on time for disclosure annual reports, whereas earnings before interest and tax and audit firm type have negative effects. In addition, the results showed that working capital, capital structure, feature of consolidated reports, and bankruptcy risk have no significant effects on time to publish annual reports.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9a53d8af937be9c9b3e3bf925ed2c2d",
  "timestamp": "2025-05-15T02:38:56.272749"
}