{
  "id": 257,
  "title": "An empirical evaluation of fuzzy bidirectional long short-term memory with soft computing based decision-making model for predicting volatility of cryptocurrencies",
  "abstract": "Cryptocurrencies have received a lot of attention from central banks, investors, and governments worldwide. The insufficiency of any method of political guideline and their market is far from effective, so they want novel regulation methods shortly. From an econometric perspective, the technique underlying the growth of the cryptocurrencies' volatility was observed to demonstrate similarities and differences with other economic time series, e.g., foreign exchange yields. Accurate prediction of cryptocurrency price fluctuations is significant for effectual portfolio management and improves economic models by identifying potential risks and attacks. With the growing use of AI in various fields, its application in financial markets, especially cryptocurrencies and stocks, is an emerging research area. This study presents an Empirical Evaluation of Fuzzy Bidirectional Long Short-Term Memory with a Soft Computing-based Decision-Making Model for Predicting Volatility of Cryptocurrencies (FBLSTMSC-DMPVC) technique. The primary focus of the FBLSTMSC-DMPVC technique is to present a robust and intelligent framework for an advanced decision-making model to predict cryptocurrency volatility. Initially, the presented FBLSTMSC-DMPVC method performs the data preprocessing process using Z-score normalization to ensure all features are standardized and scaled. Furthermore, the fuzzy bidirectional long short-term memory (FBLSTM) method predicts cryptocurrency volatility. To enhance the hyperparameters of the FBLSTM technique, the improved carnivorous plant algorithm (ICPA) is employed. A wide range of simulation is accomplished to ensure the impact of the FBLSTMSC-DMPVC technique. The FBLSTMSC-DMPVC technique portrayed a superior MAPE value of 0.7939 for BTC, 0.8633 for ETH, 0.6187 for LTC, and 0.6667 for XRP, demonstrating its performance across various cryptocurrencies.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9abaa3cf77a2f0f128fe40074a56d7c",
  "timestamp": "2025-05-15T00:34:13.496904"
}