{
  "id": 5574,
  "title": "Does willingness-to-pay for weather index-based insurance follow covariant shocks?",
  "abstract": "Purpose - The purpose of this paper is to investigate the role that weather shocks can play in the livestock mortality microinsurance take-up when the insured risk has a prevalent covariant component. Design/methodology/approach - The sample consists of 360 rural Ethiopian households. Data were collected in a panel-structure at the end of three agricultural seasons (2011-2013). In the questionnaire, a specific section on insurance was meant to collect information on the farmer's willingness-to-pay (WTP) for a set of insurance products, including livestock mortality insurance. Two OLS regression models and a quantile regression model were employed to estimate the impact of weather anomalies on the WTP for the insurance product. Findings - The authors find that weather anomalies contribute to changes in the WTP to a large extent. Negative (positive) changes in precipitation (temperature) anomalies can lead to more than a 30 percent reduction in the WTP. This general finding is complemented with the analysis of the conditional distribution of the WTP, which shows that other elements can prevail for low values of the conditional distribution. In this case, the WTP seems to be represented more by the interviewee's age and basic knowledge of insurance, and village fixed-effects. Basic knowledge of insurance, in particular, can increase WTP by about 60 percent. Practical implications - This paper has straightforward implications from a policy perspective. It suggests that farmers would prefer an insurance premium that follows the changes in the systemic component. On the contrary, insurance as well as reinsurance companies are usually reluctant to frequently revise their premiums. Financial education programs, farmer- driven design, trust building, and bundling insurance with other financial and non-financial products can increase the value proposition perceived by the farmers. From a marketing perspective, the overall findings suggest that continuous fine-tuning of the contract, transparency, and targeted information campaigns can contribute to increase and stabilize potential customers' WTP. Originality/value - To the best of the authors' knowledge, this is the first paper that considers the impact of weather shocks on the WTP for a livestock mortality insurance product. Livestock is one of the most strategic assets of poor rural households in Africa. This study contributes to the theoretical and empirical literature on the determinants of weather insurance take-up in developing countries and, in particular, the role of spatiotemporal adverse selection and basis risk (e.g. Jensen et al., 2016).",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9b249ca30a50d76d4702a7ff06344ef",
  "timestamp": "2025-05-15T02:49:21.613160"
}