{
  "id": 7020,
  "title": "Social Network Support and Decreased Risk of Seroconversion in Black MSM: Results of the BROTHERS (HPTN 061) Study",
  "abstract": "Background and setting: Black men who have sex with men (BMSM) in the United States have disproportionately high HIV infection rates. Social networks have been shown to influence HIV risk behavior; however, little is known about whether they affect the risk of HIV seroconversion. This study uses data from the BROTHERS (HPTN 061) study to test whether contextual factors related to social networks are associated with HIV seroconversion among BMSM. Methods: We analyzed data from the BROTHERS study (2009-2011), which examined a multicomponent intervention for BMSM in 6 US cities. We ran a series of Cox regression analyses to examine associations between time-dependent measures of network support (personal/emotional, financial, medical, and social participation) and time to HIV seroconversion. We ran unadjusted models followed by models adjusted for participant age at enrollment and study location. Results: A total of 1000 BMSM tested HIV negative at baseline and were followed at 6- and 12-month study visits. Twenty-eight men tested HIV positive. In adjusted hazard ratio models, study participants who remained HIV negative had higher proportions of social network members who provided personal/emotional {0.92 [95% confidence interval (CI): 0.85 to 0.99]}, medical [0.92 (95% CI: 0.85 to 0.99)], or social participation [0.91 (95% CI: 0.86 to 0.97)] support. Conclusion: Findings suggest that the increased presence of social network support can be protective against HIV acquisition. Future research should explore the processes that link social network support with sexual and other transmission risk behaviors as a basis to inform HIV prevention efforts.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9c328f3b9e7de294c64f806537dec28",
  "timestamp": "2025-05-15T03:04:22.981446"
}