{
  "id": 6325,
  "title": "Country-Level Institutional Quality and Public Debt: Empirical Evidence from Pakistan",
  "abstract": "This paper aims to investigate the relationship between country-level institutional quality and public debt in the context of Pakistan. The hypotheses of this study were assessed by using the country-level institutional quality data for Pakistan throughout the years from 1996 to 2018. Data came from the World Databank, IMF and Worldwide Governance Indicators databases. For the analysis, ordinary least square, quantile regression and robust regression were employed to assess the factors influencing the public debt. The results of this study indicate that the factors of voice and accountability, regulatory quality, and control of corruption have a positive and significant relationship with public debt, while political stability, government effectiveness, and the rule of law have a negative and significant effect on public debt. Based on the findings, a weak country-level institutional quality poses a substantial market risk as it signals the existence of an unfavorable economic condition that raises public debt. It was also revealed that an improved performance of country-level institutional quality can lead to the improvement of financial market transparency, hence reduce public debt. In contrast to previous studies, the present study will be breaking ground in enhancing public insight regarding the impact of country-level institutional quality on Pakistan's public debt.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9ea8b8c1ee4dfeb0a851e37d109fb27",
  "timestamp": "2025-05-15T02:57:07.675264"
}