{
  "id": 4036,
  "title": "Factors Influencing Acceptability and Perceived Impacts of a Mandatory ePortfolio Implemented by an Occupational Therapy Regulatory Organization",
  "abstract": "Introduction: The use of ePortfolios has been implemented in several regulatory organizations to encourage clinicians' engagement in continuing professional development (CPD). However, their use has achieved mixed success, and multiple personal and contextual factors can influence their impacts on practice change. The aim of this study was to identify which factors influence the acceptability and perceived impacts of an ePortfolio implemented by an occupational therapy regulatory organization in one Canadian province. Method: A cross-sectional online survey design was used. The survey was sent to registered occupational therapists in Quebec. Multiple regression analyses were conducted to identify factors influencing acceptability and outcomes: ease of use, satisfaction, impact on implementation of the CPD plan, and competence improvement. Results: The survey was fully completed by 546 participants. Factors significantly influencing the ePortfolio acceptability and perceived impacts were attitude toward and familiarity with the portfolio, confidence in reflective skills, engagement in the CPD plan, and desire for feedback. Time spent completing the ePortfolio and the fact of completing it in teams were negatively associated with the outcomes. Discussion: Shaping more favorable user attitudes, helping users recognize and experience the tool's benefits for their practice, and fostering confidence in their reflective skills are important factors that can be addressed to improve ePortfolio acceptability and outcomes. Contextual factors, such as time spent completing the ePortfolio and completing it in teams, seem to reflect greater difficulty with using the tool. Study findings can contribute to improving ePortfolio implementation in the CPD context.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9ee4e30cd81c5667873def9ff65be8a",
  "timestamp": "2025-05-15T01:23:07.424749"
}