{
  "id": 2064,
  "title": "MINING RISK-RELATED SENTIMENT IN CORPORATE ANNUAL REPORTS AND ITS EFFECT ON FINANCIAL PERFORMANCE",
  "abstract": "Models that predict corporate financial risk are important early-warning systems for corporate stakeholders. Most models to date have been developed using financial indicators. However, in financial decision-making, increasing attention is being paid to the role of textual information, which may provide additional insight into managerial opinions and intentions and which has recently been used to more effectively predict corporate financial performance. Previous approaches in this regard have predominantly focused on sentiment analysis of managerial communication. However, the role of context-related sentiment remains poorly understood in the financial risk domain. Here, we investigate how risk-related sentiment in verbal managerial communication might predict corporate financial performance, including indebtedness, profitability, market value and bankruptcy risk. To ensure deductive content validity, we propose specific word lists for each type of corporate financial risk and assign each word with positive/negative labels. Our findings provide evidence for a major role of risk-related sentiment as an indicator of corporate performance in terms of financial risks. Notably, using novel risk-related word lists in regression models, we show that a proactive and opportunity-seeking risk management has a significantly positive impact on financial performance, implying that stakeholders should carefully consider the risk-related managerial communication in corporate annual reports.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9f071a4b82251d10b3ff5dadd0cfd33",
  "timestamp": "2025-05-15T02:10:58.933997"
}