{
  "id": 4948,
  "title": "Association between tobacco industry advertising expenses and tobacco advertising exposure among Korean adolescents",
  "abstract": "IntroductionMonitoring the activities and impacts of tobacco industries is vital for tobacco control. Based on tobacco industry financial statements and a nationally representative survey of Korean adolescents, we examined the association between tobacco industry commercial advertising expenses and advertising exposure among Korean adolescents.MethodsThe commercial advertising expenses of three major tobacco industries in Korea (KT&G, Philip Morris Korea, and British and American Tobacco Korea) were identified in a repository (Data Analysis Retrieval and Transfer System) established by the Korean Financial Supervisory Service. The yearly advertising expenses were merged with data from the Korean Youth Risk Behavior Survey (2015-2018 and 2021, total N=309 190). We used logistic regression analyses to analyse the associations between tobacco industry advertising expenses and adolescent tobacco advertisement exposure.ResultsIn 2021, the total advertising expenses of the three companies exceeded US$260 million, and the proportion of Korean adolescents exposed to tobacco advertisements ranged from 65.9% to 78.7% during 2015-2018 and 2021. Higher advertising expense sizes were associated with the risk of exposure to tobacco advertisements in both girls and boys, with OR of 1.009 (95% CI (1): 1.008 to 1.010) and 1.010 (95% CI: 1.009 to 1.011), respectively.ConclusionTobacco industry advertising expenses are associated with tobacco marketing exposure among adolescents. We used financial data to identify the reach of tobacco advertising among Korean adolescents. It is essential to increase tobacco industry surveillance using various data sources and to regulate tobacco advertising more strongly.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9f5526adabe982a0544136f488ccdea",
  "timestamp": "2025-05-15T02:42:36.213803"
}