{
  "id": 3129,
  "title": "Investigating the effect of risk reduction strategies on the construction of mega infrastructure project (MIP) success: a SEM-ANN approach",
  "abstract": "PurposeManaging mega infrastructure projects (MIPs) is more complex because of time, size, social, environmental and financial implications. This study aims to address the management approaches, complexity and risk factors involved in MIPs. The study focuses on project success criteria and their individual effects on the success of MIPs.Design/methodology/approachTo address the challenges and identify the most influencing factor for the success of MIPs, the study deployed a cross-sectional survey approach. Six hundred eighty-two usable samples were collected from the respondents to understand the impact of predetermined factors on the success of MIPs. The structural equation model and artificial neural network approach were used to derive the importance of factors affecting the success of MIPs.FindingsThe study's outcome confirms that all three influencing factors: feasibility studies, community engagements and contract selection, have a significant positive impact on the success of MIPs. Community engagement amongst all three has the most influential predictor for the success of MIPs.Originality/valueThe developed model will enable practitioners and policymakers from Indian construction companies and other emerging nations to concentrate on recognized risk reduction variables to enhance project success criteria and project management success, especially for MIPs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "c9fa8283ca5e755c818ef9c6a5eba02c",
  "timestamp": "2025-05-15T02:22:56.696014"
}