{
  "id": 3152,
  "title": "The effect of foreign ownership on the financial soundness of host countries' banking sector: Evidence from BRICS",
  "abstract": "We investigate the impact of foreign ownership of the financial soundness of the BRICS banking sector. Although the BRICS countries are integrated into the global financial markets and have an increased share of the world GDP, it is still not clear what the real role of foreign ownership is in terms of promoting financial soundness and impacting some macroeconomic factors. We use a pooled regression model to assess the impact of foreign ownership on various measures of financial soundness using a baseline model and two performance models. We found the presence of foreign banks in BRICS increases regulatory capital adequacy, reduces non-performing loans, improves managerial efficiency, increases ROE, reduces liquidity risk, and increases sensitivity to market risk. Practically, this nuanced understanding can guide policymakers in making informed decisions about the level of foreign ownership permissible in domestic banks operating with BRICS to strike a balance between global integration and local financial stability. Theoretically, the finding in this study not only enhances our understanding of the strategies employed by foreign banks but also sheds light on the impact of these strategies on the stability of BRICS countries. Such theoretical insights are crucial for academic discussions and future research directions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca0c294ad974ea5496d56c16e6b8cffb",
  "timestamp": "2025-05-15T02:22:56.814036"
}