{
  "id": 8075,
  "title": "The relationship between socioeconomic status and depression among the older adults: The mediating role of health promoting lifestyle",
  "abstract": "Background: Depression is the most frequent psychiatric disorder among the older adults, the purpose of this study is to explore the mediation effect of health promoting lifestyle on the relationship between Socioeconomic Status (SES) and depression, so as to provide practical reference for effectively preventing and alleviating depression of the older adults. Methods: A multi-stage random sampling method was conducted in Shanxi Province. A total 8526 older adults were included in the analysis. Regression analysis was used to explore the relationship between the socioeco-nomic status, health promoting lifestyle and depression, and the mediation effect test process was used to verify the mediating mechanism of health promoting lifestyle on this relationship. Results: 62.1% of the older adults had depression symptoms in this study, and there were significant differences in depression scores among the older adults with gender, age, residence, marital status, endowment pattern, self-care ability, exercise frequency, physical examination frequency, daily diet rules(P<0.05). The results of mediating effect analysis showed that health promoting lifestyle as mediation effect between social economic status and depression was established, and the mediating effect was accounted for (a*b/c) 63.1%. Limitations: Given the cross-sectional study, it is not possible to make causal inferences. Conclusions: There were different degrees of depression in the older adults. The lower the SES is, the higher the risk of depression is. This result once again confirms the social causation theory. Combined with the theory of health risk behavior, the study further confirmed the applicability of lifestyle mechanism in the intermediate mechanism of the relationship between SES and depression in the elderly. Thus, in addition to providing material support and financial assistance, helping the elderly develop a healthy lifestyle is also effective measure to improve their depression.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca14bbc140b0ec2409c98582ddc30c13",
  "timestamp": "2025-05-15T03:15:09.324562"
}