{
  "id": 7655,
  "title": "What encourages local authorities to engage with energy performance contracting for retrofitting? Evidence from German municipalities",
  "abstract": "Municipalities aiming at mitigating climate change by implementing new energy efficiency technologies face budgetary and capacity constraints. Outsourcing through energy service contracting could provide a solution. This paper reports results from a survey of 1298 municipalities concerning barriers to retrofitting public street lighting and the possible role of energy service contracting to overcome these barriers. Using a logistic regression analysis, the authors investigate determinants of opting for energy service contracts in the specific context of LED retrofits. Results point to an advantage of outsourcing in a financially and capacity-constrained environment, which corresponds with the main reasons for engaging in contracting: minimising investments and financial risks. However, municipalities often do not fully grasp the risks associated with retrofitting especially using a novel technology such as LED. In relation to that they underestimate the risk reduction potential of energy performance contracts (EPC). Previous experience with outsourcing increases the probability to engage in servitization although certain existing partnerships, particularly with utilities, prevent municipalities from considering energy performance contracts. Interestingly, engaging an energy consultant has a negative propensity to use energy service contracts, while pre-negotiated standardised contracts for energy performance contracts have a positive influence. (C) 2016 The Authors. Published by Elsevier Ltd.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca185364320f13ef00ead9b06e420ad7",
  "timestamp": "2025-05-15T03:10:33.127418"
}