{
  "id": 8061,
  "title": "Changes in work/sleep patterns due to the COVID-19 pandemic are associated with psychological distress among Japanese workers",
  "abstract": "ObjectivesThe coronavirus disease 2019 (COVID-19) pandemic has significantly impacted working life quality. This study investigated whether changes in work/sleep patterns due to the pandemic are related to poor psychological status among Japanese workers during the third wave of the COVID-19 pandemic (December 2020). We hypothesized that workers who experienced drastic changes in working hours and sleep duration would be at an increased risk of psychological distress. MethodsA cross-sectional self-administered Internet survey was conducted that included questions regarding socio-demographics, lifestyle, health, and occupational background and conditions. Multivariable logistic regression models were utilized to examine the association between psychological distress and a combination of changes in working hours and sleep duration. ResultsAmong 25,762 workers, decreased work hours and decreased sleep duration presented 2.59 times higher odds of psychological distress (95% confidence interval [CI] = 2.05-3.28) compared to those who had no changes in work hours combined with unchanged sleep duration (reference group). Increased work hours and decreased sleep duration were associated with 1.98 times higher odds of psychological distress (95% CI = 1.64-2.39). ConclusionOur observations confirmed that decreased sleep duration could be a key factor for psychological distress, irrespective of working hours. Interestingly, workers with a combination of decreased work hours and sleep duration posed the highest risk of psychological distress. Decreased work hours accompanied by financial difficulties in the early stage of the pandemic may have caused decreased sleep duration, resulting in a high prevalence of psychological distress. Our study underlined the importance of sleep management in maintaining workers' mental health, moreover, the need to consider situations and conditions of other daily tasks, such as work hours, for better sleep management.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca20e1294285c96fad8cb2fcc3cba5b3",
  "timestamp": "2025-05-15T03:14:37.428439"
}