{
  "id": 7513,
  "title": "The capacity of social policies to combat poverty among new social risk groups",
  "abstract": "This article considers groups who are most likely to be vulnerable to new social risks and tests the effects of social policies on their poverty levels. Specifically, the article conducts multi-level regression analyses across 18 OECD countries around the year 2004, analysing the effects of social policies on the likelihood of being poor for low-skilled young women and men, and for those at risk of possessing obsolete skills, namely low-educated men aged 55-64 years. The central question asks which policies - active labour market policies (ALMP), passive labour market policies (PLMP), employment protection legislation (EPL), family policies, and government daycare spending - are effective at combating new social risks. In addition to analysing social policies, the article also considers union density and representation of women in national parliaments as two measures that depict agents who are most intent on combating old and new social risks, respectively. The findings show that ALMP are the most important predictor of a decrease in poverty levels among the low skilled. The negative effect of PLMP on poverty is only significant for the older male group. Family policies are related to a reduction in poverty for both low-skilled young women and men. Gross public social spending as a measure of overall welfare generosity is found to be associated with a reduction in poverty only of the older male group, but not that of the younger groups. The article's analyses suggest that some social policies remain geared towards older segments of society, leaving the younger population at greater financial and therefore social risk.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca2081ad2e64e457c81e1d93467f0164",
  "timestamp": "2025-05-15T03:09:36.809305"
}