{
  "id": 3626,
  "title": "The nonlinear relationship between financial flexibility and enterprise risk-taking during the COVID-19 pandemic in Taiwan's semiconductor industry",
  "abstract": "Research background: Risk-taking is the basis for sustainable development of enterprise. It was clear that the influence COVID-19 epidemic on the global market economy has increased operational risks for businesses. The semiconductor industry has high operating risks and financial risks. Moderate financial flexibility (FF) can improve the ability of semiconductor enterprises to acquire financial resources in real time, calmly cope with the impact of uncertainties in operation, improve investment opportunities, and enhance sustainable operation. It is therefore interesting to study the influence of FF on enterprise risk-taking (ERT). Purpose of the article: The aim of the contribution is to explore the effect of FF on ERT within Taiwan's semiconductor industry amid the COVID-19 pandemic period, and investigate whether ERT varies with semiconductor industry characteristic. Methods: Data from first three quarters of 2020, from multinational semiconductor firms listed on the Taiwan Stock Exchange (TSE), were collected and analyzed. Fixed effects regression with heteroscedasticity adjustment used to evaluate the influence of FF on the ERT of Taiwan?s semiconductor industry. Furthermore, in order to corroborate and support the reliability of the results, this research also used the different measures of ERT and Quantile regression (median regression) in the research model to check the robustness. Findings & value added: Empirical results indicate that FF has a U-shaped effect on ERT for multinational semiconductor firms listed on the TSE, particularly within the integrated circuits (IC) manufacturing industry. Additionally, FF also has a U-shaped effect on ERT for the asset-light semiconductor and IC manufacturing industries. This article also suggests that for the asset-light semiconductor and IC manufacturing industries, the optimal inflection points are 1.1397 and 0.9729, respectively. Based on the consequences of this study, it is suggested that Taiwan?s semiconductor industry should reasonably maintain FF and focus on the liquidity risk management for the long term value added, even after the COVID-19 pandemic period.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca292a7dd9d16e78b7915bb81b0b9145",
  "timestamp": "2025-05-15T02:28:29.301568"
}