{
  "id": 2579,
  "title": "Robust Statistics for Portfolio Construction and Analysis",
  "abstract": "Asset returns and factor exposures frequently exhibit small fractions of extreme outliers, which are often associated with fat-tailed distributions and can have very adverse influence on classical least-squares regression estimators and sample covariance matrices. Over a number of decades, a solid theoretical and computational foundation has been developed for alternative robust estimators that are not much influenced by outliers. Unfortunately, such methods have seen relatively little use in portfolio construction and analysis. An overarching goal of this article is to encourage the use of robust statistics by portfolio managers and analysts, minimally as a complement to classical estimators and in some cases as a replacement. In support of this goal, the authors briefly describe the main data and the oretical foundations of robust statistics, then introduce a best-of-breed robust regression estimator with applications to cross-sectional and time-series factor model data. They go on to describe a highly robust covariance matrix estimator and the closely related robust multidimensional distance measure for outlier detection and shrinkage, applied to stock return and factor exposure data with influential outliers. A unique aspect of the robust estimators and most of the data used in this article is that they are freely available in several open source R packages. Consequently, most of the exhibits are reproducible with R code that may be found at: https://github.com/robustport/PCRA/blob/main/README.md.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca2a0b251e123ad9ab0dbf087c2fd056",
  "timestamp": "2025-05-15T01:08:10.929714"
}