{
  "id": 435,
  "title": "Improvized implied volatility function and nonparametric approach to unbiased estimation",
  "abstract": "The purpose of this paper is to assess unbiased options pricing predictions via ad hoc Black-Scholes model approaches. This paper investigates a number of technical issues when fitted values of implied volatility from linear regression are plugged into the Black-Scholes model, which leads to biased estimation. First, the study observes that the implied volatility linear regression can yield a negative outcome, which is meaningless. Therefore, a logarithmic transformation is applied to the linear function to ensure that the forecast is positive. Second, the retransformation from log to original metric to fitted values of implied volatility and the nonlinearity of Black-Scholes to implied volatility yields biased forecasts. A smearing technique has been applied in this study to correct this bias. Finally, the smearing estimation method also provides biased results if there is heteroscedasticity in the OLS estimation residuals. This study applies the weighted least square regression technique in order to avoid heteroscedasticity. According to the performance measures such as mean bias (MB), mean absolute error (MAE) and mean absolute relative error, the study concludes that the smearing method is the most effective to correct the bias in ad hoc Black-Scholes approaches as well as that an absolute smile approach is better than a relative smile approach without the smearing technique, but with smearing methods, relative smile performs superior to absolute.",
  "year": 2023,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca364178c4a5614857eac84c8778363b",
  "timestamp": "2025-05-15T01:31:50.780999"
}