{
  "id": 8341,
  "title": "Role of Inflammation-Related Gene Polymorphisms in Patients with Central Retinal Vein Occlusion",
  "abstract": "Objective: Central retinal vein occlusion (CRVO) is a vision-threatening disease, primarily occurring among patients aged more than 60 years. Several risk factors, including arterial hypertension and diabetes mellitus, have been identified. Compression of the central retinal vein by an atherosclerotic retinal artery at the lamina cribrosa also has been implicated in the pathogenesis of the disease. Functional gene polymorphisms of cytokines or chemokines previously shown to affect atherogenesis or hemostasis are potential risk factors for CRVO. The present study investigates a hypothesized association between inflammation-related gene polymorphisms and the presence of CRVO in a relatively large cohort of patients. Design: Case-control study. Participants: The study group consisted of 315 patients with CRVO and 335 control subjects. Methods: Determination of genotypes was done by 5' exonuclease assay (TaqMan). Main Outcome Measures: Genotypes of interleukin (IL)1 beta -511C>T, IL1 receptor antagonist (IL1RN) 1018T>C, IL4 -584C>T, IL6 -174G>C, IL10 -592C>A, IL18 183A>G, tumor necrosis factor (TNF)-alpha -308G>A, monocyte chemoattractant protein (MCP)-1/CCL2 -2518A>G, IL8 -251A>T, and RANTES (CCL5) -403G>A polymorphisms. Results: Genotype distributions and allele frequencies of the investigated gene polymorphisms did not significantly differ between both groups (P>0.05). Arterial hypertension, diabetes mellitus, and cigarette smoking were significantly more frequent in patients with CRVO than among control subjects (arterial hypertension: 67.0% vs. 52.2%, P<0.001; diabetes mellitus: 16.8% vs. 6.3%, P<0.001, cigarette smoking: 32.1% vs. 23.6%, P = 0.02). In a logistic regression analysis, the presence of arterial hypertension was associated with an odds ratio (OR) of 1.75 (95% confidence interval [CI], 1.26-2.44) in those with CRVO, whereas an OR of 2.52 (95% CI, 1.46-4.35) was found in those with diabetes mellitus. A history of cigarette smoking was associated with an OR of 1.57 (95% CI, 1.09 - 2.25) for CRVO. Conclusions: Our data suggest that the investigated inflammation-related gene polymorphisms are unlikely major risk factors for CRVO. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 1125-1129 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca5367c4acb1293f8a8ef8d4e247022a",
  "timestamp": "2025-05-15T03:17:49.153989"
}