{
  "id": 1121,
  "title": "Money laundering control in Mexico A risk management approach through regression trees (data mining)",
  "abstract": "Purpose This paper is aimed at developing a regression tree model useful to quantify the Money Laundering (ML) risk associated to a customer profile and his contracted products (customer's inherent risk). ML is a risk to which different entities are exposed, but mainly the financial ones because of the nature of their activity, so that they are legally obliged to have an appropriate methodology to analyze and assess such a risk. Design/methodology/approach This paper uses the technique of regression trees to identify, measure and quantify the ML customer's inherent risk. Findings After classifying customers as high- or low-risk based on a probability threshold of 0.5, this study finds that customers with 56 months or more of seniority are more risky than those with less seniority; the variables contracted product and customer seniority are statistically significant; the variables origin, legal entity and economic activity are not statistically significant for classifying customers; institution collection, business products and individual product are the most risky; and the percentage of effectiveness, suggested by the decision tree technique, is around 89.5 per cent. Practical implications - In the daily practice of ML risk management, the two main issues to be considered are: 1) the knowledge of the customer, and 2) the detection of his inherent risk elements. Originality/value Information from the customer portfolio and his transaction profile is analyzed through BigData and data mining.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca5e198ee53a52e870ceb070b0753d04",
  "timestamp": "2025-05-15T01:59:21.583406"
}