{
  "id": 2556,
  "title": "Investigating the influence of socioeconomic conditions, renewable energy and eco-innovation on environmental degradation in the United States: A wavelet quantile-based analysis",
  "abstract": "As global economic activities expand, ecological deterioration has become an increasingly pressing issue. Achieving the Sustainable Development Goals (SDGs) require striking a balance between environmental sustainability and economic development. Consequently, examining the United States' efforts to foster ecological sustainability becomes crucial, given its status as the globe's largest economy. Thus, this study explores the effect of socioeconomic conditions, eco-innovation, financial risk, renewable energy, and political risk on CO2 from 1985Q1 to 2020Q4. In pursuit of this objective, we introduce two new advanced techniques, including wavelet quantile regression (WQR) and wavelet nonparametric causality (WNQC). WQR allowed us to assess the strength and direction of the interrelationships, while WNQC helped determine causality. Moreover, these approaches enabled us to comprehensively explore the dynamic interactions between CO2 and their driving factors across various quantiles and periods. The results consistently indicate the negative effects of eco-innovation and renewable energy on CO2 across all quantiles and periods. Additionally, socioeconomic conditions, political risk, and financial risk were found to contribute to CO2 in each quantile and time frame. Furthermore, the wavelet nonparametric causality analysis aligns with the results of wavelet quantile regression, reinforcing the significance of socioeconomic conditions, renewable energy, eco-innovation, political risk, and financial risk in influencing CO2 across various quantiles and periods. These results have led to the implementation of various policies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca8895d3361529484b1ee347ea54d7f6",
  "timestamp": "2025-05-15T02:16:32.724077"
}