{
  "id": 8554,
  "title": "Post-disaster damage and loss assessment in the Iranian healthcare sector: a qualitative interview study",
  "abstract": "BackgroundAccurate post-disaster damage and loss assessment is critical for the success of subsequent recovery programs. A comprehensive and systematic damage and loss assessment process involves evaluating the physical damage and financial impact of an event on individuals, communities, and assets. To ensure effective recovery, the various components and entities included in the program must be developed appropriately and efficiently. This study aimed to identify the components and entities of the Iranian healthcare sector's post-disaster damage and loss assessment program.MethodsA qualitative study employing purposive sampling and semi-structured individual interviews was conducted with 18 participants between October 2022 and July 2023, with continuing until data saturation was achieved. Data collection involved semi-structured interviews and observational notes with experts, including representatives from the National Disaster Management Organization (NDMO), the Iranian Red Crescent Society, and the Disaster Risk Management Department of the Ministry of Health and Medical Sciences Universities. The interviews were conducted in the workplace of the participants. Thematic analysis, a conventional qualitative method, was employed for the analysis of the data. Following the transcription of the recorded interviews, the initial codes were extracted, reviewed for accuracy, and classified.ResultsThe results of this study are based on the insights and experiences of a diverse group of qualified experts in their respective fields. The findings were analysed and classification into ten main themes, 29 sub-themes, and 1,058 codes. The main themes were key concepts and principles of assessment; assessment stages; health system measures in assessment; roles and responsibilities; team composition; information and communication; coordination and collaboration; data collection and analysis; assessment tools and methods; and reporting, documentation, and recommendations.ConclusionAn understanding of key concepts and principles enables stakeholders to respond effectively to disasters, make informed decisions, and facilitate recovery and reconstruction efforts.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca880367c1cd0a03005bb5dbdc4898f6",
  "timestamp": "2025-05-15T03:19:52.194705"
}