{
  "id": 7479,
  "title": "Association of DIO2 and MCT10 Polymorphisms With Persistent Symptoms in LT4-Treated Patients in the UK Biobank",
  "abstract": "Context Some evidence suggests gene-treatment interactions might cause persistent symptoms in individuals receiving levothyroxine (LT4) treatment.Objective We investigated, as previously hypothesized, if single-nucleotide variations (SNVs; formerly single-nucleotide polymorphisms) in rs225014 (Thr92Ala), rs225015, or rs12885300 (ORFa-Gly3Asp) in the deiodinase 2 gene (DIO2), or rs17606253 in the monocarboxylate transporter 10 gene (MCT10) were associated with outcomes indicative of local tissue hypothyroidism in LT4-treated patients and controls.Methods We included 18 761 LT4-treated patients and 360 534 controls in a population-based cross-sectional study in the UK Biobank. LT4 treatment was defined as a diagnosis of hypothyroidism and self-reported use of LT4 without use of 3,5,3 '-triiodothyronine. Outcomes were psychological well-being, cognitive function, and cardiovascular risk factors. Associations were evaluated by linear, logistic, or ordinal logistic multiple regression. Adjustments included sex, age, sex-age interaction, and genetic principal components 1 to 10.Results Compared to controls, LT4 treatment was adversely associated with almost all outcomes, most noteworthy: Increased frequency of tiredness (P < .001), decreased well-being factor score (P < .001), increased reaction-time (P < .001), and increased body mass index (P < .001). Except for a significant association between the minor rs225015 A allele and financial dissatisfaction, there was no association of rs225014, rs225015, rs12885300, or rs17606253 with any outcomes in LT4-treated patients. For all outcomes, carrying the risk allele at these 4 SNVs did not amplify symptoms associated with LT4 treatment compared to controls.Conclusion rs225014, rs225015, rs12885300, and rs17606253 could not explain changed psychological well-being, cognitive function, or cardiovascular risk factors in LT4-treated patients. Our findings do not support a gene-treatment interaction between these SNVs and LT4 treatment.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca8805330c52c5fe336964e1d01fce9a",
  "timestamp": "2025-05-15T03:09:07.256940"
}