{
  "id": 2243,
  "title": "A data-driven and network-aware approach for credit risk prediction in supply chain finance",
  "abstract": "Purpose The purpose of this paper is to propose a data-driven model to predict credit risks of actors collaborating within a supply chain finance (SCF) network based on the analysis of their network attributes. This can support applying reverse factoring mechanisms in SCFs. Design/methodology/approach Based on network science, the network measures of the actors collaborating in the investigated SCF are derived through a social network analysis. Then several supervised machine learning algorithms are applied to predict the credit risks of the actors on the basis of their network level and organizational-level characteristics. For this purpose, a data set from an SCF within an automotive industry in Iran is used. Findings The findings of the research clearly demonstrate that considering the network attributes of the actors within the prediction models can significantly enhance the accuracy and precision of the models. Research limitations/implications The main limitation of this research is to investigate the applicability and effectiveness of the proposed model within a single case. Practical implications The proposed model can provide a well-established basis for financial intermediaries in SCFs to make more sophisticated decisions within financial facilitation mechanisms. Originality/value This study contributes to the existing literature of credit risk evaluation by considering credit risk as a systematic risk that can be influenced by network measures of collaborating actors. To do so, the paper proposes an approach that considers network characteristics of SCFs as critical attributes to predict credit risk.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca8b9759cb8950a6c5967d190ee6abaf",
  "timestamp": "2025-05-15T02:12:51.050592"
}