{
  "id": 363,
  "title": "ENSEMBLE SVR MODEL TO PREDICT FTSE100 INDEX",
  "abstract": "Recently different ranges of applications from financial time series analysis have attracted many researchers and investors as prediction accuracy of financial prices / indices playing a major role in financial decision-making. However, financial time series is characteristically nonlinear, non-stationary, noisy, high degree of uncertainty, and hidden relationships. According to many scholars these characteristics are the reason of the unavailable information regarding to the behavior of financial market between the future and past captured prices. Such inherent, which, are not taken into account when prediction models are built, considered as a noise where the changing of the financial time series over time is implied the non-stationary characteristic. As a rustle of the above characteristic, prediction of financial time series data considered as a most challenging tasks of time series prediction. Support vector machine has great potential and superior performance in practical applications. Moreover, it can be regarded as a statistical learning theory algorithm with the principles of risk minimization structure, which have been adaptive by SVM. Therefore, this unique capability and abilities have drawn the attention of investors as well as researchers to utilize such technique in financial time series prediction. As a result of introducing the insensitivity loss function SVM by Vapnik, regression model SVM, become called support vector regression. Hence SVR solve many problems regarding nonlinear estimation and financial time series prediction, the attention of utilizing such model has been also increased dramatically. Thus SVR has been used widely utilized in prediction of time series data. In this paper, SVR will be utilized for FTSE100 financial time series prediction. The full details of the work will be explained in the presentation where a prediction model is designed by applying ensemble learning techniques for improving the prediction accuracy. Several support vector regression classifiers have been applied as the members of ensemble model. In financial time series prediction model, any improvement of the accuracy is considered to be good. A considerable improvement to the prediction accuracy has been achieved in this work using an ensemble SVR model. Furthermore, the proposed method will be compared using different fusion methods ( majority vote and membership degree). FTSE100 daily closing prices, from London stock Exchange market, data set covers a period of 1984 to 2013, 28 years is used as the training set, and 1 year is the testing set. Experimental results based on single and ensemble SVR models are compared to show which combiner gives the best prediction accuracy.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca9c375341cbaad9f730a08161ac09f1",
  "timestamp": "2025-05-15T01:50:13.987475"
}