{
  "id": 503,
  "title": "Genomic structural variation in Barramundi Perch Lates calcarifer and potential roles in speciation and adaptation",
  "abstract": "Advancements in genome sequencing and assembly techniques have increased the documentation of structural variants in wild organisms. Of these variants, chromosomal inversions are especially prominent due to their large size and active recombination suppression between alternative homokaryotypes. This suppression enables the 2 forms of the inversion to be maintained and allows the preservation of locally adapted alleles. The Barramundi Perch (BP; Lates calcarifer) is a widespread species complex with 3 main genetic lineages located in the biogeographic regions of Australia and New Guinea (AUS + NG), Southeast Asia (SEA), and the Indian Subcontinent (IND). BP are typically considered to be a protandrous sequential hermaphrodite species that exhibits catadromy. Freshwater occupancy and intraspecific variation in life history (e.g. partially migratory populations) exist and provide opportunities for strongly divergent selection associated with, for example, salinity tolerance, swimming ability, and marine dispersal. Herein, we utilize genomic data generated from all 3 genetic lineages to identify and describe 3 polymorphic candidate chromosomal inversions. These candidate chromosomal inversions appear to be fixed for ancestral variants in the IND lineage and for inverted versions in the AUS + NG lineage and exhibit variation in all 3 inversions in the SEA lineage. BP have a diverse portfolio of life history options that includes migratory strategy as well as sexual system (i.e. hermaphroditism and gonochorism). We propose that the some of the life history variabilities observed in BP may be linked to inversions and, in doing so, we present genetic data that might be useful in enhancing aquaculture production and population management.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ca9d73369e9a5932547928e281a275d9",
  "timestamp": "2025-05-15T00:37:01.657796"
}