{
  "id": 7303,
  "title": "Does the skin color of patients influence the treatment decision-making of dentists? A randomized questionnaire-based study",
  "abstract": "ObjectiveTo investigate whether patients' skin color could exert an influence on the dentist's decision-making for treatment, in four different cities in Brazil.Material and methodsLists of dentists were obtained and the sample selection was performed systematically. Two questionnaires were produced for the same clinical case, but the images were digitally manipulated to obtain a patient with a black and a white skin color. Dentists were free to choose treatment without any restrictions, including the financial aspects. A random sequence (white or black) was generated which was placed at random in sealed, opaque envelopes. Dentists were questioned about the decision on the treatment of a severely decayed tooth and an ill-adapted amalgam restoration.ResultsA total of 636 dentists agreed to participate in the study. After adjustments (multinomial logistic regression), it was observed that the black patient with a decayed tooth had a 50% lower risk of being referred for prosthetic treatment (p=0.023) and a 99% higher risk of receiving a composite resin restoration, compared to the white patient (p=0.027). No differences were observed regarding recommendation for tooth extraction (p=0.657). In relation to an ill-adapted amalgam, the black patient had less risk of receiving a referral replacement with composite resin (0.09 95%CI [0.01-0.82]) and finishing and polishing (0.11 5%CI [0.01-0.99]) compared with the white patient.ConclusionPatient skin color influenced the dentist's choice of treatment. In general, black patients receive referrals for cheaper, simpler procedures.Clinical significanceSkin color played an important role in dentists' treatment decisions. Professionals may contribute unconsciously to the propagation and replication of racial discrimination.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cab5b4c5063ef5ddc1bced61e4940ee6",
  "timestamp": "2025-05-15T03:07:02.696801"
}