{
  "id": 5903,
  "title": "Mental health profiles and the related socio-demographic predictors in Hong Kong university students under the COVID-19 pandemic: A latent class analysis",
  "abstract": "While the COVID-19 pandemic has brought about significant challenges to mental health of university students, there is limited research in this area. Particularly, few studies examined the person-centered mental health symptom profiles such as depression and anxiety and the related socio-demographic predictors. Using Latent Class Analysis (LCA), this study investigated the symptom profiles of depression and anxiety in university students in Hong Kong under the COVID-19 pandemic and the socio-demographic predictors. A total of 978 undergraduate students completed an online questionnaire including socio-demographic factors and measures of depression and anxiety during the summer of 2022. The LCA identified three latent classes: normal group, moderate comorbid depression and anxiety group and severe comorbid depression and anxiety group. Multinominal logistic regression showed that comparing with the normal group and the moderate symptom group, the severe symptom group had higher personal financial difficulties and individual/family member unemployment during the pandemic. In contrast, other socio-demographic factors (age, gender, year of study, living status, and COVID-19 infection status) had no significant association with group status. The study contributes to understanding of person-centered depression and anxiety symptom profiles and the risk role of personal financial difficulty in mental health of university students under the pandemic.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cab8c7e108de5f13ad64d06b9e0aa7d9",
  "timestamp": "2025-05-15T02:52:31.502445"
}