{
  "id": 8081,
  "title": "Numerical modelling of deep coaxial borehole heat exchangers in the Cheshire Basin, UK",
  "abstract": "Few deep wells have been drilled in the Cheshire Basin, resulting in high geological and financial risk of geothermal developments. Although the geothermal gradient in the basin can be predicted, the transmissivity of aquifers at depth are unknown. This has led to an investigation of lower risk strategies such as deep coaxial borehole heat exchangers (BHEs) for spatial heating, rather than traditional doublet methods. A model of a deep coaxial BHE was designed within MATLAB using the finite-difference method. The model produces accurate results in comparison to an analytical solution with a fast computational time. Results indicate that under best case geological parameters sustainable heat loads in excess of 298.7 kW can be produced from deep coaxial borehole heat exchangers at a depth of 2.8 km over the duration of a 20 year operational cycle. The thermal gradient and conductivity for this scenario were set at 27 ?C/km and 3 W/m?C, respectively. The thermal gradient, depth of borehole, volumetric flow rate and thermal conductivity of the surrounding rock all impact the heat load and outlet temperature of a deep coaxial borehole heat exchanger. The coefficient of system performance decreases with increased volumetric flow rates due to an increase in power consumption within the borehole heat exchanger. For an optimal flow rate of 4 l/s (calculated as the flow rate to produce most net power at the end of a heating season), the coefficient of system performance was 5.29. The thermal performance and efficiency of the system provides confidence that the geothermal resource of the Cheshire Basin has significant potential to be developed via deep coaxial borehole heat exchangers. Additionally, regression analysis was undertaken in this study. These models can be used to predict heat loads and outlet temperatures at the end of a heating season without the need for complex numerical modelling.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cac424760244ed4cd4b945a3a32a9da0",
  "timestamp": "2025-05-15T03:15:09.332300"
}