{
  "id": 8302,
  "title": "Increased Vulnerability to Poorer Cancer-Specific Outcomes Following Recent Divorce",
  "abstract": "BACKGROUND: Prior studies have only considered the association between static marital status and cancer-specific outcomes. We aim to measure the effect of recent divorce on cancer-specific outcomes. METHODS: There were 83,804 patients with 2 malignancies, diagnosed 12 to 60 months apart, from 19732006 from the Surveillance, Epidemiology, and End Results database. Patients were identified as newly divorced if married at their first diagnosis and single/divorced at their second. Multivariable logistic regression and competing-risks regression were used to analyze the association of becoming newly divorced or newly married with cancer-specific outcomes from the second malignancy, including advanced diagnosis (T4 or N1 or M1), receipt of treatment, and cancer-specific survival. RESULTS: Four percent became newly divorced and 3.4% became newly married. Compared with long-term married, newly divorced patients were most likely to be diagnosed with advanced disease (adjusted odds ratio [AOR] 1.31; 95% confidence interval [CI], 1.19-1.43), followed by long-term divorced (AOR 1.18; 95% CI, 1.11-1.25), and were least likely to receive curative treatment (AOR 0.74; 95% CI, 0.67-0.81). Newly divorced patients had the worst cancer-specific survival (adjusted hazard ratio [AHR] 1.17; 95% CI, 1.05-1.30, P = .005), followed by long-term divorced (AHR 1.08; 95% CI, 1.01-1.16, P = .032), while newly married patients had similar cancer-specific survival to long-term married (AHR 0.96; 95% CI, 0.85-1.08, P = .46). CONCLUSION: Recent divorce, which represents an acute disruption of a patient's social support network, was associated with the worst cancer outcomes, followed by long-term divorce. Clinicians should consider recent divorce as a risk factor for worse cancer outcomes, and encourage appropriate screening, treatment, and access to social and financial supports for recently divorced patients. (C) 2018 Elsevier Inc. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "caeb2a86ed6e39088d9f44a1bf546053",
  "timestamp": "2025-05-15T03:17:21.581566"
}