{
  "id": 1783,
  "title": "Research on financial risk management model of internet supply chain based on data science",
  "abstract": "The supply chain financial risk management model is established under the Internet financial model, so as to improve the supply chain's ability and resist risks, a financial risk management model of Internet supply chain is proposed based on data science. Firstly, the forms and countermeasures of financial risk in Internet supply chain is analyzed. The data science analysis method is used to analyze the risk management model, and the supply chain financial risk management model is constructed based on the multivariate piecewise regression analysis and the financing decision effectiveness game. The relationship between supply chain financial risk management and enterprise performance is studied under the Internet finance model, the validity of the financing decision of Internet supply chain is analyzed, and it constructs the decision model of Internet supply chain by descriptive statistical analysis method. The fuzzy decision method is used to analyze the risk assessment of Internet supply chain, and the Simunic model is used to analyze the correlation model of risk management in Internet supply chain. In order to improve the risk management ability of Internet supply chain, the statistical analysis and comprehensive decision of risk control are carried out by using piecewise sample regression analysis. The results of empirical data analysis show that the model has good piecewise fit for financial risk management and management of supply chain under Internet financial model, and the accuracy of data evaluation is high. The model is robust for financial risk management and performance evaluation of supply chain. (C) 2019 Published by Elsevier B.V.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "caef2a48e1c97a17496e4bba58c13768",
  "timestamp": "2025-05-15T02:07:25.707313"
}