{
  "id": 5046,
  "title": "Foreign currency borrowing behaviour of Indian banks: What Matters the Most?",
  "abstract": "The current study pores on assessing what matters the most when the Indian banks borrow in foreign currency. We attempt to probe whether Indian banks are more concerned for the macroeconomic factors or firm-specific measures before opting for external commercial borrowings. We use a panel dataset consisting of 85 banks for the period ranging from 2007 to 2020, and employ the generalized method of moments along with the panel quantile regression model for the empirical analysis. We detect that the risk of exchange rate volatility acts as a constraint for banks while borrowing in foreign currency. On the contrary, lower interest rate prevailing in the overseas market drives banks to avail the dollar debt. A set of CAMEL ratios (capital adequacy, asset quality, managerial efficiency, earning capacity, and liquidity ratios) are also incorporated in the study. We find that banks with better CAMEL ratios can easily opt for external commercial borrowings. However, larger banks and profitable banks may restrict themselves to opt for the same, whereas, banks with high financial leverage may find it difficult to borrow from the overseas market. Furthermore, we suggest to have a cautious approach towards external commercial borrowings for Indian banks and recommend the mending of financial architecture to encourage financial derivatives for hedging the potential risks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "caef68ac5808af614e5a8db5b0db9af2",
  "timestamp": "2025-05-15T02:43:40.231762"
}