{
  "id": 1831,
  "title": "Predicting Credit Ratings using Deep Learning Models - An Analysis of the Indian IT Industry",
  "abstract": "Due to the complexity of transactions and the availability of Big Data, many banks and financial institutions are reviewing their business models. Various tasks get involved in determining the credit worthiness like working with spreadsheets, manually gathering data from customers and corporations, etc. In this research paper, we aim to automate and analyze the credit ratings of the Information and technology industry in India. Various Deep-Learning models are incorporated to predict the credit rankings from highest to lowest separately for each company to find the best fit Margin, inventory valuation, etc., are the parameters that contribute to the credit rating predictions. The data collected for the study spans between the years FY-2015 to FY-2020. As per the research been carried out with efficiencies of different Deep Learning models been tested and compared, MLP gained the highest efficiency for predicting the same. This research contributes to identifying how we can predict the ratings for several IT companies in India based on their Financial risk, Business risk, Industrial risk, and Macroeconomic environment using various neural network models for better accuracy. Also it helps us understand the significance of Artificial Neural Networks in credit rating predictions using unstructured and real time Financial data consisting the influence of COVID-19 in Indian IT industry.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "caf07c2f8711bc788747d53b36f3c1ee",
  "timestamp": "2025-05-15T02:08:03.933608"
}