{
  "id": 7124,
  "title": "The Battle of Words and the Reality of Never Events in Breast Reconstruction: Incidence, Risk Factors Predictive of Occurrence, and Economic Cost Analysis",
  "abstract": "Background: The Centers for Medicare and Medicaid Services has a list of 10 hospital-acquired conditions for which hospitals and physicians will not be reimbursed because it deems such conditions are preventable and should be considered never events. To evaluate the validity of this premise, the authors conducted a real-life analysis of the incidence and categories of never events occurring in a breast reconstruction cohort of a multisurgeon plastic surgery practice. Cost analysis of estimated revenue loss and risk factors associated with the development of never events are enumerated. Methods: A retrospective chart review of postmastectomy patients undergoing breast reconstruction from 2008 to August of 2010 was conducted. A total of 297 patients were identified and International Classification of Diseases, Ninth Revision codes corresponding to the never events of interest were applied to the study population. Results: Of the 297 patients, 24 (8.08 percent) developed never events in two categories: surgical-site infections (7.74 percent) and catheter-related urinary tract infections (0.34 percent). There were no complications in the remaining eight categories. Overweight body mass index and diabetes were strong independent risk factors for the development of never events (p < 0.0001). Cost estimates of associated revenue loss and economic analysis reveal substantial financial burdens to physicians and hospitals as a result of nonreimbursement. Conclusions: The one-size-fits-all approach of the Centers for Medicare and Medicaid Services may be misplaced and misleading. Certain risk factors are independent predictors of developing a never event, making it impossible to classify certain outcomes as never occurrences. The never events pendulum may have swung immensely to the left, and it is time to attain a much-needed equilibrium. (Plast. Reconstr. Surg. 130: 23, 2012.)",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "caf2295f0f01a8e117d0421af635079a",
  "timestamp": "2025-05-15T03:05:32.014538"
}