{
  "id": 2093,
  "title": "The relation between asset growth and the cross-section of stock returns: Evidence from the Chinese stock market",
  "abstract": "This study examines the effect of firm investment on stock returns by using data on the Chinese stock market. We find that stocks with higher investment experience lower future returns and there is an obvious investment effect in the Chinese stock market The investment effect is stronger for firms that have higher cash flows, lower debt or for state-owned firms. We further explore the relation between investment and returns over the 3 years around portfolio formation. The results show that the high investment firms earn higher returns than low investment firms before portfolio formation; however the high investment firms earn lower returns than low investment firms after portfolio formation, such evidence is supportive of investor's overreaction explanation. Additionally, the stock returns don't necessarily decrease after investment, and the stock returns don't significantly positively correlate with firm profitability or book-to-market, so the result don't support risk-based explanation. Overall, both our portfolio sort and two-stage cross-sectional regression analysis show that behavioral finance theories are better than risk-based theories in explaining the investment anomaly. Evidence from the Chinese stock market provides a useful perspective to understand the debate on the investment anomaly. (C) 2014 Elsevier B.V. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "caf563ff9bbdd5341ba96dbe3751798d",
  "timestamp": "2025-05-15T01:03:03.613161"
}