{
  "id": 253,
  "title": "Stock Market Volatility and the Forecasting Performance of Stock Index Futures",
  "abstract": "This study attempts to apply the general equilibrium model of stock index futures with both stochastic market volatility and stochastic interest rates to the TAIFEX and the SGX Taiwan stock index futures data, and compares the predictive power of the cost of carry and the general equilibrium models. This study also represents the first attempt to investigate which of the five volatility estimators can enhance the forecasting performance of the general equilibrium model. Additionally, the impact of the up-tick rule and other various explanatory factors on mispricing is also tested using a regression framework. Overall, the general equilibrium model outperforms the cost of carry model in forecasting prices of the TAIFEX and the SGX futures. This finding indicates that in the higher volatility of the Taiwan stock market incorporating stochastic market volatility into the pricing model helps in predicting the prices of these two futures. Furthermore, the comparison results of different volatility estimators Support the Conclusion that the power EWMA and the GARCH(1,1) estimators can enhance the forecasting performance of the general equilibrium model compared to the other estimators. Additionally, the relaxation of the up-tick rule helps reduce the degree of mispricing. Copyright (C) 2008 John Wiley & Sons, Ltd.",
  "year": 2009,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "caf777d86f3111601b28fb029160a231",
  "timestamp": "2025-05-15T01:30:19.001355"
}