{
  "id": 6081,
  "title": "The effect of IFRS convergence on risk disclosure: an investigation into the Indian accounting system",
  "abstract": "PurposeThis study aims to empirically investigate the effect of International Financial Reporting Standards (IFRS) convergence on corporate risk disclosure, with a particular emphasis on the quantity and coverage of risk information. The research also conducts economic benefit and cost analysis to investigate the economic implications that may arise from the transition to IFRS reporting.Design/methodology/approachA content analysis approach is used to measure two broader dimensions of risk disclosure, namely, risk disclosure quantity and risk topic coverage. Furthermore, using firm-fixed effect regression on a sample of 143 Indian-listed companies, this study investigates the variations in these risk disclosure dimensions before (2012-2016) and subsequent to (2017-2021) the convergence with IFRS.FindingsThe empirical results of this research demonstrate that IFRS convergence has led to a significant improvement in firms' risk disclosure across several dimensions. Particularly, during the post-IFRS period, firms' usage of risk-related words and sentences has considerably surged in MD&A, Notes and whole annual reports. In addition, upon IFRS convergence, firms' risk descriptions have become more extensive and evenly distributed across risk topic categories. Moreover, the in-depth benefit and cost analysis revealed that firms reporting under IFRS benefit from decreased cost of equity capital, but they also incur a higher cost of audit fees.Originality/valueThis study contributes to the literature in two ways. First, this is the only study, to the best of the authors' knowledge, to conduct a broader examination of the impact of mandatory IFRS convergence on corporate risk disclosure, with a major focus on quantity and coverage of risk information. Second, by conducting economic benefit and cost analysis, this study provides novel insights into the critical role of IFRS risk disclosures toward multiple economic outcomes.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "caf9e9e8dee545a0dbea41a0bf0f71e7",
  "timestamp": "2025-05-15T02:54:38.778443"
}