{
  "id": 5643,
  "title": "Managing quality risk in supply chain to drive firm's performance: The roles of control mechanisms",
  "abstract": "Product harm scandal can be viewed as a company's nightmare. In many cases, the source of defective or unsafe components may not be the manufacturing firm itself; rather, there may be problems inherent in the supply network. This research aims to investigate the effects of two focused risk management practices, namely supplier development and proactive product recall, on firms' performance. To scrutinise the impact of two types of control mechanisms, we investigate social control and formal control as antecedents of risk management practices, and explore their moderating roles on the relationship between risk management practices and firm performance. Based on the survey-based data obtained from 209 Chinese manufacturers, structural equation modelling and hierarchical regression are used to test the proposed hypotheses. The results show that both supplier development and proactive product recall significantly contribute to financial performance and quality performance. Furthermore, both formal control and social control are the significant antecedents of the two risk management practices. Most importantly, we examine the moderating roles of the control mechanisms on the relationship between the risk management practices and firm performance. Practitioners should be aware that the control mechanisms have different moderating effects, i.e. different type of control mechanism should be employed to facilitate the risk management practices in order to achieve a better firm performance.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb04712128adfdf75df4f59d25ad9814",
  "timestamp": "2025-05-15T02:49:50.343391"
}