{
  "id": 1801,
  "title": "A quadratic goal programming for portfolio selection based on ESG factors",
  "abstract": "PurposeFurthermore, the model offers a structure for expressing the preferences of individual investors, allowing for better decision-making when selecting the optimal portfolio. This strategy's implementation was created for the larger South African market. The analysis of the results shows that while ESG-controversy remains stable, lowering the risk aversion threshold results in lower ESG scores.Design/methodology/approachThe focus of this paper is on using the cluster technique to optimize portfolios by taking social and financial factors into account. First, we suggest using a clustering technique to group high-dimensional stock data. In the next stage we developed a quadratic Goal Programming model in order to integrate financial criteria into the decision-making process and accurately simulate the nonlinear relationship between the ESG Score and ESG Controversies Score.FindingsAlso the investor can achieve equilibrium between controversy management, liquidity, and investment sustainability by adjusting the risk aversion threshold.Research limitations/implicationsWhile the agglomerative clustering algorithm works well for dividing up suppliers based on certain standards, it could fail to represent all the subtleties in the data adequately. Its reliance on distance metrics for grouping may cause it to overlook nuanced linkages or patterns that more sophisticated clustering methods would be better able to capture. Therefore, to confirm and enhance the segmentation results, future research could investigate different clustering strategies.Practical implicationsOur research creates new opportunities for responsible investment decision making by fusing financial and ESG objectives, providing a more thorough method of portfolio management.Social implicationsThe study's use of real data makes a substantial contribution to practical applications by showing how our model may be applied directly in actual investment portfolio management settings.Originality/valueThe focus of this paper is on using the cluster technique to optimize portfolios by taking social and financial factors into account.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb239f89bdd4fc838149c7e2fed117c6",
  "timestamp": "2025-05-15T02:07:25.765194"
}