{
  "id": 4070,
  "title": "Strong yet Tough Catalyst-Free Transesterification Vitrimer with Excellent Fire-Retardancy, Durability, and Closed-Loop Recyclability",
  "abstract": "Despite great advances in vitrimer, it remains highly challenging to achieve a property portfolio of excellent mechanical properties, desired durability, and high fire safety. Thus, a catalyst-free, closed-loop recyclable transesterification vitrimer (TPN1.50) with superior mechanical properties, durability, and fire retardancy is developed by introducing a rationally designed tertiary amine/phosphorus-containing reactive oligomer (TPN) into epoxy resin (EP). Because of strong covalent interactions between TPN and EP and its linear oligomer structure, as-prepared TPN1.50 achieves a tensile strength of 86.2 MPa and a toughness of 6.8 MJ m-3, superior to previous vitrimer counterparts. TPN1.50 containing 1.50 wt% phosphorus shows desirable fire retardancy, including a limiting oxygen index of 35.2% and a vertical burning (UL-94) V-0 classification. TPN1.50 features great durability and can maintain its structure integrity in 1 M HCl or NaOH solution for 100 days. This is because the tertiary amines are anchored within the cross-linked network and blocked by rigid P-containing groups, thus effectively suppressing the transesterification. Owing to its good chemical recovery, TPN1.50 can be used as a promising resin for creating recyclable carbon fiber-reinforced polymer composites. This work offers a promising integrated method for creating robust durable fire-safe vitrimers which facilitate the sustainable development of high-performance polymer composites. TPN1.50 shows superior fire retardancy, mechanical properties, and chemical/aging/creep resistance due to the tertiary amines being anchored within the dynamic covalent network and obstructed by rigid phosphorus-based groups. TPN1.50 can be chemically recovered for up to 3 times and used as a polymer matrix for fabricating recyclable CFRP composites. image",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb351490c10922b27f41b31d789d7ec8",
  "timestamp": "2025-05-15T01:23:27.363377"
}