{
  "id": 2670,
  "title": "Predictive Modeling for Identifying Undervalued Stocks Using Machine Learning",
  "abstract": "This study investigates the application of Machine Learning (ML) techniques to identify undervalued stocks, addressing the limitations of traditional investment strategies that rely heavily on fundamental analysis. As financial markets become more complex, characterized by volatility and information asymmetry, conventional valuation methods often struggle to capture these dynamics. In contrast, ML offers the ability to analyze large datasets and uncover intricate patterns, presenting a data-driven alternative for stock selection and portfolio optimization. A comprehensive predictive framework was developed, integrating traditional financial ratios with novel features derived from value investing principles and technical analysis. Several ML models - Random Forest, Long Short-Term Memory (LSTM), and Support Vector Machines - were assessed for their ability to predict high-return stocks. Performance metrics, including accuracy, precision, and recall, were used to evaluate model effectiveness. Among the models tested, the LSTM demonstrated the highest accuracy at 0.81, proving its robustness in identifying undervalued stocks. This research contributes to the growing body of literature on ML in finance by offering a practical framework that bridges theoretical concepts with real-world applications. The study also emphasizes the importance of refining ML algorithms to improve model interpretability and transparency, crucial for fostering trust in these systems. Future research should explore the use of ensemble methods and alternative data sources to further enhance prediction accuracy, while addressing challenges related to accountability in ML-driven investment strategies. This work advances the conversation around algorithmic trading and the future of data-driven finance.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb39c0052eaf59e00420262c142ba7d1",
  "timestamp": "2025-05-15T01:09:14.939453"
}