{
  "id": 3732,
  "title": "Does adoption of conservation farming practices result in increased crop revenue? Evidence from Zambia",
  "abstract": "We determine the impacts of conservation farming (CF) practices on crop net revenue of smallholder farm households using nationally representative household and plot survey data in Zambia. We estimate a multinomial endogenous switching regression model of farm household's choice of combinations of CF practices and their impacts on crop net revenue. Four primary results are found. First, several factors affect adoption of CF practices depending on the combinations in which they are adopted. Second, all CF practices significantly increase crop net revenue per hectare when practised either singly or jointly. Third, a joint adoption of crop residue retention and minimum soil disturbance yields the highest crop net revenue per hectare among all the possible combinations of CF practices. Thus a more comprehensive approach that focuses on joint adoption of all CF practices is not the best income yielding portfolio. Fourth, adoption of CF practices in combination generally results in more crop net revenue per hectare than adopting them in isolation. Therefore, results point towards the need for promotion of adoption of CF practices in combination while considering the influence from household, seed, plot level, agro-ecological, and miscellaneous factors to enable farmers in Zambia to realise most payoffs.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb3a67822fea4ed2cdb69a59c5562738",
  "timestamp": "2025-05-15T01:20:03.620371"
}