{
  "id": 8875,
  "title": "Operational and structural factors influencing enrolment in community-based health insurance schemes: an observational study using 12 waves of nationwide panel data from Senegal",
  "abstract": "Community-based health insurance (CBHI) has been implemented in many low- and middle-income countries to increase financial risk protection in populations without access to formal health insurance. While the design of such social programmes is fundamental to ensuring equitable access to care, little is known about the operational and structural factors influencing enrolment in CBHI schemes. In this study, we took advantage of newly established data monitoring requirements in Senegal to explore the association between the operational capacity and structure of CBHI schemes-also termed 'mutual health organizations' (MHO) in francophone countries-and their enrolment levels. The dataset comprised 12 waves of quarterly data over 2017-2019 and covered all 676 MHOs registered in the country. Primary analyses were conducted using dynamic panel data regression analysis. We found that higher operational capacity significantly predicted higher performance: enrolment was positively associated with the presence of a salaried manager at the MHO level (12% more total enrolees, 23% more poor members) and with stronger cooperation between MHOs and local health posts (for each additional contract signed, total enrolees and poor members increased by 7% and 5%, respectively). However, higher operational capacity was only modestly associated with higher sustainability proxied by the proportion of enrolees up to date with premium payment. We also found that structural factors were influential, with MHOs located within a health facility enrolling fewer poor members (-16%). Sensitivity analyses showed that these associations were robust. Our findings suggest that policies aimed at professionalizing and reinforcing the operational capacity of MHOs could accelerate the expansion of CBHI coverage, including in the most impoverished populations. However, they also suggest that increasing operational capacity alone may be insufficient to make CBHI schemes sustainable over time.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb53dbad3bef5ee3946d47b23c6ef98d",
  "timestamp": "2025-05-15T03:23:27.763415"
}