{
  "id": 4470,
  "title": "Factors influencing risk aversion among maize farmers in the Northern Guinea Savanna of Nigeria: Implications for sustainable crop development programmes",
  "abstract": "The attitudes of fanners towards risks influence their decision to invest into farming. Understanding the factors that influence these attitudes is important for crop development. This paper uses a combination of Ridge and Tobit regression analyses to determine the factors influencing risk aversion among maize farmers in the Northern Guinea Savanna agro-ecological zone of Nigeria. Preliminary categorization of a cross-sectional sample of 348 farmers show that 8.91% are risk preferers, 48.56% are risk averters while the remaining 42.53% are risk neutral farmers. Risk aversion among the sampled farming households was found to be influenced by socioeconomic factors (e.g. age of household head, household size) and farm specific variables (e.g. proportion of income from maize, non-farm income). Probability and elasticity estimates from further Tobit analysis revealed that an improvement on the variables considered can actually reduce high risk aversion. The key socioeconomic and farm specific variables that have direct bearing on the farmers' risk attitudes, as revealed in this study, indicate the important and crucial role that extension could play in sensitizing both the research, donor agencies, government and the farmers on the need to target particular areas of the farm families' needs. Since the major issues raised here impinge on the farmers' financial status, enterprise diversification which can guarantee the security of the fanners' immediate financial future is a key element in planning at regular farming seasons and intervals. This will in effect, result in increased maize productivity. The findings in this study have policy implications for crop development programmes.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb68bcb3037910a2e75edca6742edd12",
  "timestamp": "2025-05-15T02:37:47.482438"
}