{
  "id": 3345,
  "title": "Managing Knowledge Requirements in the NPD Portfolio Selection Process Using Knowledge Clustering and Prioritization: A Case Study of an Australian Train Operator",
  "abstract": "In recent decades, knowledge-oriented new product development (NPD) has turned into a significant competitive advantage. It largely depends on the proper management of knowledge processes performed by knowledge management (KM). Among different KM processes addressed in the KM literature, knowledge clustering and prioritization (KCP) has received scant attention. However, it has a significant impact on the performance of other KM processes and is an integral part of the NPD process. KCP helps KM and NPD managers identify knowledge areas' importance, risk, and cost implications in knowledge-intensive industries such as machinery and appliances. This article addresses this issue by introducing a two-phase research approach to cluster and prioritize knowledge areas. In the first phase, the study data, including knowledge areas, characteristics, and comparisons, are collected through an interview. Then, in the second phase, best-worst method (BWM) and K-means algorithm are employed to prioritize and cluster knowledge areas, respectively. The approach is applied to prioritize and cluster ten knowledge areas adopted by the operations team of an Australian train operator. Results revealed that site and construction managements are vital knowledge areas, whereas change management, programming, and cost control are less urgent for the operation teams.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb68f350c1174979fae4e365a18eeebc",
  "timestamp": "2025-05-15T01:16:22.073657"
}