{
  "id": 1809,
  "title": "USABILITY OF REGRESSION BETA FACTOR WHEN EVALUATING STOCK TRADED ON PSE",
  "abstract": "The beta factor measures the systematic risk associated with a stock or a portfolio. The beta factor is the only independent input variable in the CAPM model that is widely used as a tool to calculate the investor's desired return rate, which is an indispensable part of the DCF valuation models. There are several types of beta factor, but most often, analysts use the regression beta factor, which has advantages but also flaws. One of the major weaknesses in the beta factor of each stock is the considerable volatility and unstable methodology for calculating regression beta. Both factors may depreciate the stock's valuation result. This paper focuses on the calculation of regression beta factors of selected stocks traded on the Prague Stock Exchange at different times and with different data rates. The aim of the paper is to evaluate the volatility and subsequent usability of beta factors for the valuation of individual stocks traded on the Prague Stock Exchange or for measuring the systematic risk of the equity portfolio created by them. It was confirmed on the Prague Stock Exchange data that the beta factor of the individual stock is more volatile than beta factor of the portfolio composed of them. Beta factor values and their variability strongly depend on the time period and character of data used for the calculation.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb6c1340ec9b662296130952f934cb49",
  "timestamp": "2025-05-15T00:59:53.186209"
}