{
  "id": 9220,
  "title": "Characteristics of consulting firms associated with the diffusion of big data analytics",
  "abstract": "PurposeThis study investigates the characteristics of business and management consulting firms (firm size, international affiliation and scope of operation) affecting the adoption rate (i.e. recency of adopting big data analytics (BDA) as a new idea) and usage level of BDA. Ten critical areas of BDA application to business and management consulting were investigated, (1) Human Resource Management; (2) Risk Management; (3) Financial Advisory Services; (4) Innovation and Strategy; (5) Brand Building and Product Positioning; (6) Market Research/Diagnostic Studies; (7) Scenario-Based Planning/Business Simulation; (8) Information Technology; (9) Internal Control/Internal Audit; and (10) Taxation and Tax Management.Design/methodology/approachSurvey data was obtained through a structured questionnaire from one hundred and eighteen (118) consultants in Nigeria from diverse consulting firm settings in terms of size, international affiliation and scope of operation (Big 4/non-Big 4 firms). Data was analyzed using descriptive statistics, cluster analysis, multivariate analysis of variance (MANOVA), multivariate discriminant analysis and multivariable logistic regression.FindingsWhereas organizational characteristics such as firm size, international affiliation and scope of operation significantly determine the adoption rate of BDA, two attributes (international affiliation and scope of operation) significantly explain BDA usage level. Internationally affiliated consulting firms are more likely to record higher usage level of BDA than local firms. Also, the usage level of BDA by the Big 4 accounting/consulting firms is expected to be higher in comparison to non-Big 4 firms.Practical implicationsContrary to common knowledge that firm size is positively associated with the adoption of an innovation, the study found no evidence to support this claim in respect of the diffusion of BDA. Overall, it appears that the scope of operation is the strongest organizational factor affecting the diffusion of BDA among consulting firms.Originality/valueThe study contributes to knowledge by exposing the factors promoting the uptake of BDA in a developing country. The originality of the current study stems from the consideration that it is the first, to the researchers' knowledge, to investigate the application of BDA by consulting firms in the Nigerian context. The study adds to literature on management accounting in the digital economy.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb7405e4579d107d11abcf0ecdfb4954",
  "timestamp": "2025-05-15T03:26:54.497006"
}