{
  "id": 5587,
  "title": "FAMILY RELATIONS AND PARENTHOOD IN FAMILIES WITH DIFFERENT INCOME: HOW IS LIFE IN HIGH RISK OF POVERTY CONNECTED TO FAMILY FUNCTIONING OF FAMILIES WITH ADOLESCENTS?",
  "abstract": "The paper assesses the contribution of objective and subjective indicators of socioeconomic status, exposure to stressful events and the availability of social support in prediction of quality of family relationships and the risk of child abuse in mothers of adolescents in families exposed to high and low risk of poverty. The sample included 392 mothers of adolescents attending 1st grade of high school. The criterion for family classification in high and low poverty risk group corresponded with the census for receiving a child benefit (N = 163, high risk of poverty, average income per household member 719.14 HRK) compared to families who are not entitled to child benefit (N = 229, low risk of poverty, average income per household member 3,357.53 kunas). The results showed that, according to Conger's Family Stress Model, in families at high risk of poverty, family conflict (measured by the Family Functioning Scale, Noller, 1988) and the risk of child abuse in mothers (measured by the Child Abuse Potential Inventory; Milner 1986) were significantly higher in comparison to low-risk families. For mothers living at high risk of poverty significant predictors for the risk of child abuse are higher level of shame due to the financial situation and exposure to more stressful events. Social support significantly reduces the risk of child abuse for mothers living at high risk of poverty, although it has considerably lower power as a protection factor than it has for the mothers living at low risk of poverty. The finding that 8.7% of mothers at low risk of poverty and 20.2% of mothers at high risk of poverty are highly in risk of child abuse is analysed in the context of different socioeconomic predictors and the possibility of an effective integrated approach to families with children at high risk of poverty.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cb90023e2ce1a47313a5cd464707f7c6",
  "timestamp": "2025-05-15T02:49:21.690558"
}