{
  "id": 6353,
  "title": "Association of Household Income at Diagnosis With Financial Toxicity, Health Utility, and Survival in Patients With Head and Neck Cancer",
  "abstract": "IMPORTANCE While several studies have documented a link between socioeconomic status and survival in head and neck cancer, nearly all have used ecologic, community-based measures. Studies using more granular patient-level data are lacking. OBJECTIVE To determine the association of baseline annual household income with financial toxicity, health utility, and survival. DESIGN, SETTING, AND PARTICIPANTS This was a prospective cohort of adult patients with head and neck cancer treated at a tertiary cancer center in Toronto, Ontario, between September 17, 2015, and December 19, 2019. Data analysis was performed from April to December 2021. EXPOSURES Annual household income at time of diagnosis. MAIN OUTCOME AND MEASURES The primary outcome of interest was disease-free survival. Secondary outcomes included subjective financial toxicity, measured using the Financial Index of Toxicity (FIT) tool, and health utility, measured using the Health Utilities Index Mark 3. Cox proportional hazards models were used to estimate the association between household income and survival. Income was regressed onto log-transformed FIT scores using linear models. The association between income and health utility was explored using generalized linear models. Generalized estimating equations were used to account for patient-level clustering. RESULTS There were 555 patients (mean [SD] age, 62.7 [10.7] years; 109 [20%] women and 446 [80%] men) included in this cohort. Two-year disease-free survival was worse for patients in the bottom income quartile (<$30 000: 67%; 95% CI, 58%-78%) compared with the top quartile (& GE;$90 000: 88%; 95% CI, 83%-93%). In risk-adjusted models, patients in the bottom income quartile had inferior disease-free survival (adjusted hazard ratio, 2.13; 95% CI, 1.22-3.71) and overall survival (adjusted hazard ratio, 2.01; 95% CI, 0.94-4.29), when compared with patients in the highest quartile. The average FIT score was 22.6 in the lowest income quartile vs 11.7 in the highest quartile. In adjusted analysis, low-income patients had 12-month FIT scores that were, on average, 134% higher (worse) (95% CI, 16%-253%) than high-income patients. Similarly, health utility scores were, on average, 0.104 points lower (95% CI, 0.026-0.182) for low-income patients in adjusted analysis. CONCLUSIONS AND RELEVANCE In this cohort study, patients with head and neck cancer with a household income less than CAD$30 000 experienced worse financial toxicity, health status, and disease-free survival. Significant disparities exist for Ontario's patients with head and neck cancer.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cba33fbb6fa2c0585355c37f50bd8920",
  "timestamp": "2025-05-15T02:57:07.772713"
}