{
  "id": 7380,
  "title": "International capital flows with safe assets accumulation",
  "abstract": "Purpose The author studies the role of safe assets accumulation in shaping the pattern of international capital flows. Design/methodology/approach The author combines a theoretical model and the empirical analysis. The model is a two-country open economy, while the evidence is based on a fixed-effect regression on a panel of 19 countries of the eurozone. Findings In an open two-country economy, a positive productivity shock raises both mean and variance of wealth accumulation rate, then, leading to a greater holding of safe assets for risk-sharing motivation. Upon financial integration, the shock can induce the outflows of net total capital. The evidence of 19 eurozone countries confirms the theory and also uncovers that the safe assets (bonds) are the dominant driver of cross-border capital flows within the eurozone. Research limitations/implications The model can be extended to account for the impact of safe assets on the economic growth, then, analyzes the role of safe assets within financial globalization. Taking into account the impact of safe assets on the open-economy economic growth can be the next step to approach the issue. Practical implications The paper also provides important policy implication. Since a higher productivity level can raise the outflows of net total capital through the accumulation of foreign safe assets, an economy needs to increase its supply of safe asset along with upgrading its domestic productivity level. This combination is important for the long-run capital accumulation and economic growth of an economy with an increasing path of the productivity level. Originality/value The paper seeks a balance between theory and evidence on international capital flows. Moreover, the paper bridges the gap between the literature on international capital flows and the literature on safe assets. And the paper also focuses on the economies of the eurozone.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cba98478f66129666920a33486192e5b",
  "timestamp": "2025-05-15T03:08:00.775614"
}