{
  "id": 3408,
  "title": "Corporate social responsibility and firm financial risk reduction: On the moderating role of the legal environment",
  "abstract": "Approaching the institutional environment through its regulative component, we distinguish between shareholder-oriented and stakeholder-oriented countries. Identifying first this classification with the distinction between common law versus civil law countries and using a large sample of 5,716 firm-year observations that represents 1,169 individual firms in 25 countries between 2001 and 2011, we show that Corporate Social Responsibility (CSR) significantly reduces firms' idiosyncratic risk in civil law countries but not in common law countries. Using then a more direct classification based on shareholder and employee protection scores, our findings suggest that CSR negatively affects firms' idiosyncratic and systematic risks only in less shareholder-oriented and more stakeholder-oriented countries, respectively. These findings are similar in the different components of CSR with two notable exceptions: a high score in corporate governance reduces firm risk only in common law countries, and community involvement increases idiosyncratic risk in more shareholder-oriented and less stakeholder-oriented countries, respectively. Taken together, our results strongly support the view that the relationship between CSR and financial risk is moderated by the institutional context of the firm.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cbaa2273047816e8c307f24790ad9c8f",
  "timestamp": "2025-05-15T02:25:40.240789"
}