{
  "id": 4175,
  "title": "BENCHMARK AS A MANAGEMENT TOOL FOR UNIVERSITY IT PORTFOLIOS",
  "abstract": "As a part of society, universities are public spaces that have been transformed into an information society through technology-based communication and the ubiquitous availability of information. The future-oriented use of information technology (IT) is of existential importance for universities. The use of IT as an important tool or service provider for processing support has significantly increased the number, scope and requirements of IT services at universities. Innovations that are gaining in relevance at ever shorter intervals and the increasing use of IT at universities are challenging IT management. The application of operational and strategic planning, improvement and management tools and increasing the efficiency of the use of IT is a good basis for management decisions. Students inform themselves about study offers and services at universities, governments compare the offers and the utilization of their universities, lecturers compare university locations when appointments are made, and the location factor plays an increasingly important role for research. Comparing has always served not only to measure, but also to improve and increase efficiency. Benchmarking is a systematic method for the comparative analysis of results, which are described in standardized indicators. Two types of benchmarks are commonly used in information technology: computer benchmarks, which are used to measure the performance of IT systems, and IT benchmarks, which are used to compare the economic aspects of the IT infrastructure. While computer benchmarks essentially provide information for operational business, IT benchmarks aim to improve and increase the efficiency of business IT operations as well as to support strategic decisions. IT benchmarking offers options for analysis of essential issues that arise in IT management in the search for the most efficient IT portfolio: Which IT services and products should be offered at universities, to what scale, with which resources and in which period of time? IT benchmarking should give answers to this question and improve efficiency. With a continuing comparison of IT services and IT products from different universities as well as comparable indicators and IT budget categories, IT benchmarking can be used as a method to improve cost transparency and as an instrument for management decisions. By comparing IT services and IT products, it is possible to identify best practice examples for operational business and use them for sustainable improvement. This paper analyses the potentials of benchmarking at universities. First, the framework conditions for the development of IT strategies are presented and a general analysis scheme is developed, which allows the question to be examined from different perspectives. Additionally, IT benchmarking concepts are presented in relation to the local conditions of university IT. One essential aspect is then the rating of IT benchmarks at universities and the answer to the question of whether IT benchmarks can be useful instruments to support an efficient and sustainable portfolio design at universities. This analysis and classification is based on data from some German universities from 2015. The benchmark process, the quality, the significance and the scope of the indicators and results were included in the assessment. Criticisms and improvement potentials for future surveys are finally discussed.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cbbc44f3322bcb9624cf619af5ce3f35",
  "timestamp": "2025-05-15T01:24:25.433903"
}