{
  "id": 1682,
  "title": "Risks Matrixes - Risks Assessment Tools of Small and Medium-Sized Enterprises",
  "abstract": "The enterprises need to assess the risk dynamic of financial instability and this risk Impact on small and medium-sized enterprises' development, because it Is Important for enterprises to extend commercial activity and to open a new structural subdivision. The authors have researched type of risks, their identification, classification and assessment possibilities in activities of small and medium-sized enterprises. The authors have used the own created algorithm of identification, classification and assessment of enterprises' risks.. The goal of the research is to study the economic and financial risks impact on small and medium-sized enterprises' development in Latvia. The authors have carried out the questionnaire of representative small and medium-sized enterprises about the economic and financial risks impact on enterprises' development In Latvia. The authors have created classification of Latvian services sectors economic and financial risks in the period from 2011 to 2012.Those risks have been included in questionnaire. The risks matrix is a quantitative assessment tool of risks. The authors have created Latvian service sector economic and financial risks matrix. The authors have arranged risks by their size of possible losses for enterprises. For each type of risk has been assessed its probability of realization. The authors have created Latvian accommodations (hotel) and food services technological process risks map. Several parts of the risk map (segments) make it possible to assess each type of the risk separately in its segment Risk matrix can use to choose enterprise's strategy of risk management Enterprise's strategy of risk management Is developed by analysing zones of risk level.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cbcb590c2302fa484aa29d98a95cd758",
  "timestamp": "2025-05-15T02:06:22.432748"
}