{
  "id": 7923,
  "title": "Mind the Gap: Hospitalizations from Multiple Sources in a Longitudinal Study",
  "abstract": "Background: Medicare claims and prospective studies with self reported utilization are important sources of hospitalization data for epidemiologic and outcomes research. Objectives: To assess the concordance of Medicare claims merged with interview-based surveillance data to determine factors associated with source completeness. Methods: The Atherosclerosis Risk in Communities (ARIC) study recruited 15,792 cohort participants aged 45 to 64 years in the period 1987 to 1989 from four communities. Hospitalization records obtained through cohort report and hospital record abstraction were matched to Medicare inpatient records (MedPAR) from 2006 to 2011. Factors associated with concordance were assessed graphically and using multinomial logit regression. Results: Among fee-for-service enrollees, MedPAR and ARIC hospitalizations matched approximately 67% of the time. For Medicare Advantage enrollees, completeness increased after initiation of hospital financial incentives in 2008 to submit shadow bills for Medicare Advantage enrollees. Concordance varied by geographic site, age, veteran status, proximity to death, study attrition, and whether hospitalizations were within ARIC catchment areas. Conclusions: ARIC and MedPAR records had good concordance among fee-for-service enrollees, but many hospitalizations were available from only one source. MedPAR hospital records may be missing for veterans or observation stays. Maintaining study participation increases stay completeness, but new sources such as electronic health records may be more efficient than surveillance for mobile elderly populations.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cbcf899d2e9e55c182ebe5aefd480671",
  "timestamp": "2025-05-15T03:13:30.655791"
}