{
  "id": 6234,
  "title": "A Model of Innovation Activity in Small Enterprises in the Context of Selected Financial Factors: The Example of the Renewable Energy Sector",
  "abstract": "One of the biggest problems of the modern economy is the depletion of traditional energy sources. Despite the fact that this problem was noticed several dozen years ago, steps to solve it were taken relatively recently. In December 2017, the European Union adopted a position on the directive, promoting the use of energy from renewable sources in all Member States. The EU has committed itself that by 2030, at least 27% of its energy consumption will come from renewable sources. On the one hand, it is a huge challenge, but on the other hand, it is an opportunity to achieve economic growth through innovation and a sustainable energy policy. On the Polish market, the chance to achieve the assumed plan is offered mainly by small companies that have been involved in innovative activities in the renewable energy sector in recent years. Innovation is an extraordinarily important determinant of the sustainable development of economies across the world. However, introducing it into business practice is extremely challenging for business leaders. Although there are many different factors influencing companies' engagement in innovation activity, for smaller entities, the financial aspect plays a key role. Managers of small enterprises must frequently deal with limited access to additional financial resources, the complexity of the process of determining final cost and capital structure, and its accompanying various levels of investment risk. Small companies also struggle with certain limitations on resources related to a knowledge gap in finance, tax regulations, and the forms of support potentially available at different stages of the innovation process. In light of this, it seems reasonable to establish the strict financial factors that significantly influence the innovation activity of small enterprises, especially those operating in the energy industry, due to their dynamics of development in recent years. This article aims to develop a model to explain the financial incentives for implementing innovative solutions in small businesses in the energy sector. An empirical study using the Computer-Assisted Personal Interviewmethod on a sample of 115 Polish small companies, operating in the renewable energy sector, identified critical financial factors stimulating the implementation of innovative projects. The significance of impact of key financial factors on the innovation activity of these enterprises was analysed based on a logit regression model. The results indicate that 5 of the 18 factors identified in the model were significant. These statistically significant financial determinants of the innovation activity of Polish small enterprises in the energy sector exhibited both positive and negative impacts on the level of innovation activities undertaken.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cbf3d03a5294c814d9e4b6653bababc4",
  "timestamp": "2025-05-15T02:56:10.924588"
}