{
  "id": 8866,
  "title": "Health Disparities Among Childrearing Women with Disabilities",
  "abstract": "This study examines leading health indicators for childrearing women with disabilities, including health-related quality of life, chronic health conditions, adverse and preventive health behaviors, health care access, and social and emotional support. The study analyzes aggregated data from the Washington State Behavioral Risk Factor Surveillance System (n = 28,629). The weighted prevalence of key health indicators of childrearing women with disabilities (aged 18-59) are compared with childrearing women without disabilities. A series of adjusted logistic regression analyses are applied, controlling for confounding variables. When compared to childrearing women without disabilities, childrearing women with disabilities are less likely to have a partner or spouse, report lower income and education levels and are older. Childrearing women with disabilities, compared to childrearing women without disabilities, report significantly lower health-related quality of life including poor general health (adjusted odds ratio[AOR] = 6.85; p < .001), frequent mental distress (AOR = 4.02; p < .001), and frequent poor physical health (AOR = 9.34; p < .001); higher prevalence of chronic health conditions, including arthritis, cardiovascular diseases, diabetes, asthma, high blood pressure and cholesterol, and obesity (the range of AORs = 1.59 to 5.65; p < .001); higher prevalence of adverse health behaviors including smoking (AOR = 2.14; p < .001) and lack of exercise (AOR = 1.61; p < .001); more financial barriers to health care (AOR = 2.11; p < .001) and lack of social and emotional support (AOR = 2.05; p < .001) while controlling for age, education, income, and relationship status. Based on population level data, the study reveals that childrearing women with disabilities experience elevated risks of health disparities across many key health indicators, many of which are preventable and modifiable. These findings underscore the importance of identifying contributing factors and developing interventions to improve the health and quality of life of childrearing women with disabilities.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cbf55b5a260b878921e8f667ccf05463",
  "timestamp": "2025-05-15T03:23:27.753439"
}