{
  "id": 7934,
  "title": "Have female executives made a difference?-The impact of female executives on cross-border mergers and acquisitions in listed companies",
  "abstract": "Cross-border mergers and acquisitions (M&A) is a key strategy for Chinese companies to achieve international expansion, with senior executives of listed companies significantly influencing these strategic decisions. As the number of female executives increases, their influence on company strategies has become increasingly significant. This study uses data from A-share listed companies on the Shanghai and Shenzhen Stock Exchanges in China from 2010 to 2019, sourced from the Zephyr and CSMAR databases, to examine the impact of female executives on cross-border M&A activities in listed companies through a fixed-effects model. The regression results indicate that female executives in listed companies reduce the company's risk tolerance and increase financial constraints, thereby hindering the implementation of cross-border M&A strategies. Heterogeneity tests reveal that the negative impact of female executives on cross-border M&A is more pronounced in samples with higher levels of gender equality, in the eastern regions, and in stateowned enterprises. This conclusion remains robust even when key explanatory variables are adjusted and the sample is modified, and when Logit and Probit models are employed for reestimation. Further analysis indicates that equity incentives in listed companies can mitigate the negative impact of female executives on cross-border M&A. In contrast, a higher average age of executives and wider salary gaps exacerbate the negative effect.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc2781eb8c25845b56bdf108da45cd89",
  "timestamp": "2025-05-15T03:13:30.671101"
}