{
  "id": 4008,
  "title": "Influence of financial literacy on investment decisions of managers of small and medium enterprises in Mogadishu, Somalia",
  "abstract": "This research aimed to explore how well managers of small and medium enterprises (SMEs) in Mogadishu, Somalia, understand financial concepts such as savings, managing debt, handling financial risks, and planning for retirement, and how this understanding affects their investment decisions. The background of the study highlights that many SMEs in Mogadishu struggle to sustain their operations, with low profits or failure often due to poor investment choices. To investigate the link between financial literacy and investment decision -making among these managers, the study was based on the principles of modern portfolio theory. The research used a correlational design to analyze data from 250 targeted SMEs, with 154 respondents selected through stratified random sampling. Data collection was facilitated by questionnaires, and the analysis involved calculating means, standard deviations, and conducting regression analysis. The findings indicated that among the financial literacy components, debt management had the most significant impact on investment decisions (beta=0.490, p<0.05), followed by financial risk management (beta=0.137, p<0.05), and lastly, the ability to save (beta=0.128, p<0.05). The study concluded that financial literacy plays a crucial role in influencing investment decisions among SME managers in Mogadishu, suggesting that improving financial knowledge could lead to better business outcomes. (c) 2024 The Authors. Published by IASE.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc3e040eee237e8752f6e6b1fcbca50e",
  "timestamp": "2025-05-15T02:31:58.717501"
}