{
  "id": 8977,
  "title": "Medical Resource Utilization by Taiwanese Psychiatric Inpatients under the National Health Insurance System",
  "abstract": "Background: The length of stay in Taiwan's psychiatric facilities is unusually long compared with that of other countries. Aims of the Study: To identify factors associated with the high length of stay in the acute and chronic psychiatric wards of a public psychiatric hospital Methods: The present study consisted of 912 inpatients discharged from a public psychiatric hospital in Northern Taiwan in 2005. Demographic characteristics, discharge diagnoses, and medical resource utilization were retrieved from the inpatient claim data of the National Health Insurance Database. Multivariate logistic regression models were performed to identify significant predictors for a long length of stay (LOS). Covariate adjusted odds ratios and a 95% confidence interval (CI) were applied to explore the effects of financial barriers, demographic, and diagnostic characteristics, and readmission for medical care. Results: A median LOS of 35.0 days and median medical charge of US$ 3,271.50 were reported. A greater likelihood of a high degree of medical care was found among patients who were exempt from copayments, were diagnosed with schizophrenia, had a co-morbidity factor, and were admitted from emergency visits. The results showed that patients in the 45-60 year age group had a higher risk of long LOS than those in the 18-30 year age group. Discussion and Limitations: A longer LOS in Taiwan might reflect more free access to hospitals and further extensive utilization of medical facilities under the National Health Insurance system. It was noted that age, sex, disease characteristics, and insurance policies were associated with a high medical utilization. However, the lack of a copayment may partially explain the long LOS in our study. Other causes, such as inadequate supplies of resources for psychiatric services, may also deserve closer study. A failure to adjust for potentially confounding factors might limit interpretation of the observed relationship between such potential factors and medical resource utilization. These findings support the future planning of specific care policies in mental health services in Taiwan. Implications for Health Policies: While an exemption in copayment aims to remove financial barriers for indigent people, it contributed to the extended LOS. To make psychiatric care more efficient, facilities in the community must be strengthened, patients must be directed to appropriate care to avoid emergency check-ins, and the reimbursement policy must be geared to facilitate the efficient delivery of care. Implications for Further Research: Our study calls for further research on the role of resource allocation, incentives for efficient delivery of care, and the frequency of hospitalization, in particular, on the long LOS of psychiatric patients in Taiwan.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc417caa5686efeb54269921c9e3ef3e",
  "timestamp": "2025-05-15T03:24:26.275050"
}