{
  "id": 4397,
  "title": "FINANCIAL PERFORMANCE DETERMINANTS OF UKRAINIAN AGRICULTURAL COMPANIES IN THE PRE-WAR PERIOD",
  "abstract": "Purpose. The purpose of the article is to identify the determinants of the financial performance of agricultural companies in Ukraine in the pre-war period.Methodology / approach. Panel data regression analysis, carried out using the GRETL software, was used as a research method. The financial statements of thirty Ukrainian agricultural companies over the defined period 2015-2021 were selected to be data for analysis. Three models were constructed in the article based on the use of three different dependent variables (Return on Assets, Return on Equity, Return on Sales) and seven independent variables (Current Ratio, Capital Intensity, Export Intensity, Leverage, Size, Dummy variable for agricultural sub-sectors, Dummy variable for location). The selection of the mentioned independent variables was logically substantiated by the structure of the financial reports of the Ukrainian agricultural companies and analytical system You Control.Results. The study of the determinants of financial performance of the agricultural companies is a widespread area of research among academicians, however, is characterized by quite controversial results. Some of these conclusions were refuted, but certain results were confirmed on the example of Ukrainian enterprises. The results of the panel regression analysis with respect to Models 1-3, partially are in contradiction with the conclusions of other studies regarding the impact of the determinants on the financial performance of agricultural companies. None of the chosen independent variables has a significant effect on all the dependent variables as investigated in the article, namely ROA, ROE, and ROS. This confirms the formulated in the study hypothesis regarding the availability of a unique set of financial performance determinants for agricultural enterprises for each individual country. The independent variables used in the study have the most significant impact on ROA. Primarily, ROA is significantly affected by CAPI (5 % level), EXPI (10 % level), and DVL (5 % level). The results obtained confirm a need for improving regional support and ensuring an access to capital for agricultural enterprises in Ukraine.Originality / scientific novelty. The originality of the conducted research lies in the study of a set of factors that influenced the financial condition of Ukrainian agrarian companies in the pre-war period, considering the peculiarities of the Ukrainian agrarian sector of the economy.Practical value / implications. Investors and financial institutions can benefit from the research results. By recognizing which factors have the most significant impact on financial performance, they can make more informed decisions when considering investments in Ukrainian agricultural companies. Understanding which factors influence financial performance can help in risk management for both agricultural companies and financial institutions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc41264bb31992d4c7e427e78ff5d9cb",
  "timestamp": "2025-05-15T02:36:38.513002"
}