{
  "id": 8546,
  "title": "The Association of Intravitreal Anti-VEGF Injections With Kidney Function in Diabetic Retinopathy",
  "abstract": "Purpose: To examine whether patients with diabetic retinopathy receiving intravitreal anti-VEGF injections are at increased risk of kidney function decline. Participants: Included 187 patients who received intravitreal anti-VEGF injections for proliferative diabetic retinopathy (PDR) and/or diabetic macular edema (DME), and 929 controls with non-PDR who did not receive injections, at a large tertiary care center in Chicago, Illinois. Methods: We queried our institutional enterprise data warehouse to identify patients with diabetic retinopathy, determined whether they received intravitreal anti-VEGF injections, and followed kidney function for all patients over time. Main Outcome Measures: We assessed time to sustained 40% decline in estimated glomerular filtration rate (eGFR) from baseline in patients receiving intravitreal anti-VEGF injections and compared it with controls using Kaplan-Meier and multivariable adjusted Cox proportional hazards regression models. Results: This study included 1116 patients (565 female [50.6%]; mean [standard deviation {SD}] age, 57.3 [13.6] years; mean [SD] eGFR, 65.3 [32.1] ml/min/1.73 m2). Of these, 187 patients received > 1 intravitreal antiVEGF injection (mean [SD], 11.4 [13.1] injections) for PDR and/or DME, and 929 controls with non-PDR received no injections. Intravitreal anti-VEGF injection use was not associated with an increased risk of kidney function decline (hazard ratio [HR], 1.44; 95% confidence interval [CI], 0.97-2.15). Subgroup analyses revealed that use of intravitreal anti-VEGF injections was associated with increased risk of kidney function decline in male patients (HR, 1.87; 95% CI, 1.11-3.14) but not female patients (HR, 0.97; 95% CI, 0.50-1.89). Intravitreal anti-VEGF injection use was also associated with an increased risk of kidney function decline in patients with baseline eGFR > 30 ml/min/1.73 m2 (HR, 1.86; 95% CI, 1.15-3.01), but not in individuals with baseline eGFR < 30 ml/min/ 1.73 m2 (HR, 0.97; 95% CI, 0.45-2.10). Among patients who received injections, receiving & GE; 12 injections was not associated with risk of kidney function decline (HR, 1.13; 95% CI, 0.52-2.49). Conclusions: Intravitreal anti-VEGF injections for patients with diabetic retinopathy are overall well-tolerated with respect to kidney function, but the use of intravitreal anti-VEGF injections was associated with an increased risk of kidney function decline in certain subgroups of patients. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology Science 2023;3:100326 & COPY; 2023 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc48f4c6aecb0db2baf33c4c22b57094",
  "timestamp": "2025-05-15T03:19:52.158561"
}