{
  "id": 8632,
  "title": "Bloodstream Infections Associated With Parenteral Nutrition Preparation Methods in the United States: A Retrospective, Large Database Analysis",
  "abstract": "Background: The incidence of bloodstream infection (BSI) among patients receiving parenteral nutrition (PN) is reported to vary widely from 1.3%-39%. BSI rates in a large inpatient population were compared in this study to determine if PN prepared by different methods was associated with BSI. Methods: Data from Premier Perspective, the largest inpatient cost-based clinical and financial claims database in the United States, were analyzed. Included were all hospitalized patients age >= 18 years who received any PN from January 1, 2005, to December 31, 2007. BSI rates, the primary dependent variable, were defined as the occurrence ICD-9 codes of 038.x (septicemia), 995.91 (sepsis), 995.92 (severe sepsis), and 790.7 (bacteremia). The exposure cohort received PN in a commercial multichamber bag (MCB) (n = 4669), whereas the comparator group received PN prepared by a pharmacy (either hospital compounded or outsourced; n = 64,315). Observed data were adjusted using multivariate logistic regression for baseline differences, risk factors, and potential confounders, with propensity score matching as a sensitivity analysis. Results: The observed and adjusted BSI rates indicate that MCB is associated with fewer infections than pharmacy-prepared PN (observed 17.5% vs 26.6%; adjusted 19.6% vs 25.9%, both P < .001). Propensity-matched scores found similar results with observed BSI rates of 18.9% in patients receiving MCB and 24.6% in patients receiving a compounded PN. Conclusion: Both the observed rate of BSI and adjusted probability of developing a BSI remained significantly lower for the MCB than the compounded PN group. (JPEN J Parenter Enteral Nutr. 2012; 36: 169-176)",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc501b1128c54602ef6a5d9ab2fb242e",
  "timestamp": "2025-05-15T03:20:55.878748"
}