{
  "id": 4161,
  "title": "Bubble contagion effect between the main precious metals",
  "abstract": "Purpose This study examines the extent to which gold and silver bubbles are correlated and which metal's bubble spills over to the other. In addition, the overlap in bubble-like episodes for the two metals is demonstrated and the influence of crises (global financial crises, European debt crisis and the COVID-19 pandemic) on the development of these episodes is compared. Design/methodology/approach This study proposes a two-step approach. In the first step, price bubbles are identified based on the backward sup augmented Dickey-Fuller of Phillips et al. (2015a, 2015b) and modified by Phillips and Shi (2018). In the second step, the correlation in the contagion effect of the bubbles between the two precious metal prices is measured using a nonparametric regression with a time-varying coefficient approach developed by Greenaway-McGrevy and Phillips (2016). Findings The findings suggest that the safe-haven property of gold and silver during financial market turbulence induces excessive price increases beyond their fundamental values. Furthermore, the results indicate that bubbles are contagious among precious metal markets and flow mainly from gold to silver; these findings are associated with the period after 2005, particularly during the global financial crisis. A contagious bubble effect is not found between gold and silver during the coronavirus disease 2020 pandemic. Practical implications The results suggest that financial market participants should consider portfolio weights in precious markets in light of the bubble correlation between gold and silver, especially during crises. Originality/value To the best of the authors' knowledge, this is the first study that explores the correlation of bubble-like episodes between gold and silver.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc550e5bae887592f79329382fb93721",
  "timestamp": "2025-05-15T01:24:25.361104"
}