{
  "id": 2081,
  "title": "Inequalities in financial risk protection in Bangladesh: an assessment of universal health coverage",
  "abstract": "Background: Financial risk protection and equity are major components of universal health coverage (UHC), which is defined as ensuring access to health services for all citizens without any undue financial burden. We investigated progress towards UHC financial risk indicators and assessed variability of inequalities in financial risk protection indicators by wealth quintile. We further examined the determinants of different financial hardship indicators related to healthcare costs. Methods: A cross-sectional, three-stage probability survey was conducted in Bangladesh, which collected information from 1600 households from August to November 2011. Catastrophic health payments, impoverishment, and distress financing (borrowing or selling assets) were treated as financial hardship indicators in UHC. Poisson regression models were used to identify the determinants of catastrophic payment, impoverishment and distress financing separately. Slope, relative and concentration indices of inequalities were used to assess wealth-based inequalities in financial hardship indicators. Results: The study found that around 9% of households incurred catastrophic payments, 7% faced distress financing, and 6% experienced impoverishing health payments in Bangladesh. Slope index of inequality indicated that the incidence of catastrophic health payment and distress financing among the richest households were 12 and 9 percentage points lower than the poorest households respectively. Multivariable Poisson regression models revealed that all UHC financial hardship indicators were significantly higher among household that had members who received inpatient care or were in the poorest quintile. The presence of a member with chronic illness in a household increased the risk of impoverishment by nearly double. Conclusion: This study identified a greater inequality in UHC financial hardship indicators. Rich households in Bangladesh were facing disproportionately less financial hardship than the poor ones. Households can be protected from financial hardship associated with healthcare costs by implementing risk pooling mechanism, increasing GDP spending on health, and properly monitoring subsidized programs in public health facilities.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc5e257c0f5919638299dc8a7049303b",
  "timestamp": "2025-05-15T02:10:59.019062"
}