{
  "id": 9291,
  "title": "Fertility intentions and long-acting reversible contraceptive use among HIV-negative single mothers in Zambia",
  "abstract": "BACKGROUND: Integrating family planning interventions with HIV studies in developing countries has been shown to prevent mother-to-child HIV transmission and simultaneously reduce HIV and unintended pregnancy in high-risk populations. As part of a prospective cohort study on HIV incidence and risk factors in Zambian women having unprotected sex, we also offered family planning counseling and immediate access to long-acting reversible contraceptives. Although long-acting reversible contraceptives are the most effective form of contraception, many Zambian women are limited to oral or injectable methods because of a lack of knowledge or method availability. This project offers to single mothers who are enrolled in a cohort study information about and access to long-acting reversible contraceptives at enrollment and at each follow-up visit. OBJECTIVE: This study evaluates how fertility intentions affect longacting reversible contraceptive use in HIV-negative single mothers in Zambia. Our primary outcome was long-acting reversible contraceptive use throughout the study participation. We also estimated rates of longacting reversible contraceptive uptake and discontinuation. We specifically studied single mothers because they are at high risk for unintended pregnancy, which can have significant negative ramifications on their financial, social, and psychologic circumstances. STUDY DESIGN: From 2012-2017, Zambia Emory HIV Research Project recruited 521 HIV-negative single mothers ages 18-45 years from government clinics in Lusaka and Ndola, Zambia's 2 largest cities. Participants were followed every 3 months for up to 5 years. At each visit, we discussed fertility goals and contraceptive options and offered a long-acting reversible method to any woman who was not pregnant or who already was using a long-acting reversible or permanent contraceptive method. Data were collected on demographic factors, sexual behavior, and reproductive history. Multivariable logistic regression was used to model baseline fertility intentions with long-acting reversible contraceptive use. RESULTS: We enrolled 518 women; 57 women did not return for any follow-up visits. There was a significant increase in long-acting reversible contraceptive use during the study. At baseline, 93 of 518 women (18%) were using a long-acting reversible method, and 151 of 461 women (33%) used a long-acting reversible method at the end of follow-up period (P<.0001). Four women chose an intrauterine device, and 91 women chose an implant for their first uptake event. After we adjusted the data for other confounders, we found that women in Ndola who did not desire any more children were more likely to use a long-acting reversible contraceptive (adjusted prevalence ratio, 2.02; 95% confidence interval, 1.88-3.42). During follow up, 37 of 183 long-acting reversible contraceptive users (20%) discontinued their method; women who desired future children at baseline were more likely to discontinue earlier (P=.016). CONCLUSION: This study demonstrates that integrated family planning services can increase long-acting reversible contraceptive use successfully among Zambian single mothers, who are a vulnerable population that disproportionately is affected by unintended pregnancy. A steady increase in use over time confirms the importance of repeated messaging about these unfamiliar methods. Thus, it is imperative that family planning interventions target single mothers in developing countries to promote effective contraceptive use.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc73784128fb772980f7544f5565fb86",
  "timestamp": "2025-05-15T03:27:25.004539"
}