{
  "id": 4255,
  "title": "Impact analysis of US quantitative easing policy on emerging markets",
  "abstract": "Purpose - Since the 2008 financial crisis, the USA has three times implemented quantitative easing (QE) policy. The results of the policy, however, were far below all expectations. Furthermore, it flooded emerging markets (EMs) with low-priced dollars. The purpose of this paper is to investigate the overall and individual impacts of the policy on EMs. Design/methodology/approach - This study uses panel data regression model together with the fixed effects model. Also, a unit root test is conducted to check stationary properties of the data, as well as Durbin-Watson statistic to check serial correlation issues in the models. In estimating empirical models, this paper employs macroeconomic data set of stock market returns, exchange rates, lending interest rates, consumer price index, monetary aggregates and foreign exchange reserves from seven diversified emerging economies. The EMs in this study include China, Indonesia, Singapore, Hong Kong, Taiwan, Russia and Brazil. The time period undertaken in this study is from 2008 to 2012. In order to measure impacts of the different stages of the policy, the authors use dummy variables to represent each stage of the policy. Findings - The results of the study show that the QE policy has significant impacts on foreign exchange reserves, foreign exchange markets and stock markets of the sample economies. Domestic credit markets, however, appear to be least influenced field by the policy. Finally, the results show that only the first stage of the policy exhibits strong significant impacts, however, leverage of the policy decreases over time. Research limitations/implications - Further studies may use different samples, also variables that measure foreign capital inflows such as changes in financial accounts, foreign direct investment and foreign portfolio investment. Originality/value - The present study has the following contributions on assessing the impacts of QE policy. First, the overall and individual impacts of the policy are analyzed. Second, in order to establish more valid results, the sample of this study is designed to include several EMs from three continents and diverse regions.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc7467317e91cdd7eeb65dbecf354b62",
  "timestamp": "2025-05-15T01:25:23.244377"
}