{
  "id": 799,
  "title": "An enhanced interval-valued decomposition integration model for stock price prediction based on comprehensive feature extraction and optimized deep learning",
  "abstract": "For the purpose of managing financial risk and making investment decisions, interval stock price forecasting is essential. Currently, decomposition integration frameworks are widely used in point-valued stock price forecasting studies, mainly focusing on mining internal information. However, point forecasts are difficult to adequately capture price uncertainty and may suffer from loss of volatile information. Therefore, this paper proposes an enhanced interval-valued decomposition integration model for stock price prediction based on comprehensive feature extraction and optimized deep learning. Firstly, the interval variational modal decomposition with feedback mechanism (FIVMD) is proposed to extract internal features and can decompose interval values into interval trend and residual. FIVMD not only solves the interval decomposition challenge, but also helps to improve the internal feature extraction capability. Secondly, while considering the influencing factors more comprehensively, appropriate feature selection and compression techniques can effectively achieve external feature extraction, obtain the best influencing factors, and improve the modeling capability of highdimensional data. Finally, the final prediction results are obtained by modeling the interval trend and residuals separately through the optimization algorithm and deep learning model to improve the prediction accuracy. The results of the empirical analysis reveal that the proposed interval decomposition integrated model has the smallest of the three evaluation metrics, where the values of interval mean average percentage errors (IMAPE) are 1.8188%, 1.1244%, 1.9001%, and 2.1542% respectively. This shows that the model is significantly more accurate and stable than the other comparative models, and it is a successful model for predicting intervalvalued stock prices.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cc91c0647a3132a41cee1e5c578bc82f",
  "timestamp": "2025-05-15T01:42:44.472570"
}