{
  "id": 4214,
  "title": "Extreme risk spillover effects of international oil prices on the Chinese stock market: A GARCH-EVT-Copula-CoVaR approach",
  "abstract": "As one of the world's largest oil importer, China's economy is significantly influenced by oil price fluctuations. This study investigates the risk spillover effect of international oil price on the Chinese sectoral stock markets and established a GARCH-EVT-Copula-CoVaR model based on daily data from July 9, 2009 to March 24, 2023. We address the volatility clustering and tail dependence in data, and offer a more robust analysis under extreme conditions. The empirical results suggest a positive risk spillover effect from the crude oil market to all sectors of Chinese stock market. When international oil market is at risk, the probability of potential losses occurring in the returns of various sectors rises. Additionally, the spillover effect is heterogeneous across different stock sectors. From the perspective of the strength of risk spillover, the impact on energy sector is the strongest, while weakest on telecommunications sector based on the results of tail correlation coefficient. According to the results of delta Conditional Value-at-Risk (Delta CoVaR) and %CoVaR, the market most affected by oil market risk is the financial sector, followed by the energy, industrial and utilities sectors. The backtesting shows that the model can effectively measure the risk spillovers between oil and stock markets, which is beneficial for regulatory au-thorities to track the changes of systemic risks in time.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cca243630727a9e0cd9a07165b60830f",
  "timestamp": "2025-05-15T02:34:48.870179"
}