{
  "id": 9304,
  "title": "Experiences of family caregivers 3-months after stroke: results of the prospective trans-regional network for stroke intervention with telemedicine registry (TRANSIT-Stroke)",
  "abstract": "Background: Long-term support of stroke patients living at home is often delivered by family caregivers (FC). We identified characteristics of stroke patients being associated with receiving care by a FC 3-months (3 M) after stroke, assessed positive and negative experiences and individual burden of FC caring for stroke patients and determined factors associated with caregiving experiences and burden of FC 3 M after stroke. Methods: Data were collected within TRANSIT-Stroke, a regional telemedical stroke-network comprising 12 hospitals in Germany. Patients with stroke/TIA providing informed consent were followed up 3 M after the index event. The postal patient-questionnaire was accompanied by an anonymous questionnaire for FC comprising information on positive and negative experiences of FC as well as on burden of caregiving operationalized by the Caregiver Reaction Assessment and a self-rated burden-scale, respectively. Multivariable logistic and linear regression analyses were performed. Results: Between 01/2016 and 06/2019, 3532 patients provided baseline and 3 M-follow-up- data and 1044 FC responded to questionnaires regarding positive and negative caregiving experiences and caregiving burden. 74.4% of FC were older than 55 years, 70.1% were women and 67.5% were spouses. Older age, diabetes and lower Barthel-Index in patients were significantly associated with a higher probability of receiving care by a FC at 3 M. Positive experiences of FC comprised the importance (81.5%) and the privilege (70.0%) of caring for their relative; negative experiences of FC included financial difficulties associated with caregiving (20.4%). Median overall self-rated burden was 30 (IQR: 0-50; range 0-100). Older age of stroke patients was associated with a lower caregiver burden, whereas younger age of FC led to higher burden. More than half of the stroke patients in whom a FC questionnaire was completed did self-report that they are not being cared by a FC. This stroke patient group tended to be younger, more often male with less severe stroke and less comorbidities who lived more often with a partner. Conclusions: The majority of caregivers wanted to care for their relatives but experienced burden at the same time. Elderly patients, patients with a lower Barthel Index at discharge and diabetes are at higher risk of needing care by a family caregiver.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ccada80302cab9407d98eaffbbd5eba5",
  "timestamp": "2025-05-15T03:27:25.094666"
}