{
  "id": 2848,
  "title": "Method for potential assessment and adaptation for additive manufacturing of conventionally manufactured components",
  "abstract": "The novelty of additive manufacturing (AM) involves new requirements, restrictions and rules, that are considerably different to those of conventional manufacturing methods. Therefore, designers often lack experience and knowledge about identifying AM-suited components. However, to ensure profitability, it is essential to choose components, that are well suited for additive manufacturing. State-of-the-art user-support methods for identifying AM potential widely focus on either economic potential or manufacturability but fail to address both aspects. While machine learning solutions are considered highly efficient, the assessment outcome lacks process transparency, inhibiting troubleshooting, plausibility checks and problem-oriented considerations. This paper proposes a holistic, yet detailed and transparent approach to identify conventionally manufactured parts for AM from an existing product portfolio, enabling decision-making based on quantifiable results. It combines and advances state-of-the-art methods, considering manufacturability, economic profitability and socio-ecological aspects. Besides evaluating AM potential, the method additionally assesses the components' potential for re-design-based enhancement for AM suitability. Besides understanding product functions and present production processes, users are expected to have a basic understanding of company goals. The approach involves inquiries regarding company- and product-specific priorities, enabling a weighted assessment. The weights are determined based on individual company philosophies regarding AM value propositions such as differing stakeholder interests and priorities. Additionally, the approach allows users to investigate different development goals by weighting opportunistic and restrictive assessment. The method application is demonstrated via an assembly comprising 11 parts in a scenario focusing on serviceability, eventually determining suitability statements.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ccb9f9b4e60a8ad2a1be92545e9b5f9e",
  "timestamp": "2025-05-15T01:11:17.322230"
}