{
  "id": 6795,
  "title": "Assessing the interconnectedness and systemic risk contagion in the Chinese banking network",
  "abstract": "Purpose In this paper, the authors use the balance sheet data to investigate the interconnectedness and risk contagion effects in China's banking sector. They firstly study the network structure and centrality of the interbank network. Then, they investigate how and to what extent the credit shock and liquidity shock can lead to the risk propagation in the banking network. Design/methodology/approach Referring to the theoretical framework by Haldane and May (2011), this paper uses the network topology theory to analyze the contagion mechanism of credit shock and liquidity shock. Centrality measures and log-log plot are used to evaluate the interconnectedness of China's banking network. Findings The network topology has shown clustering effects of large banks in China's financial network. If the Industrial and Commercial Bank of China (ICBC) is in distress, the credit shock has little impact on the Chinese banking sector. However, the liquidity shock has shown more substantial effects than that of the credit shock. The discount rate and the rollover ratio play significant roles in determining the contagion effects. If the credit shock and liquidity shock coincide, the contagion effects will be amplified. Research limitations/implications The results of this paper reveal the network structure of China's interbank market and the resilience of banking system to the adverse shock. The findings are valuable for regulators to make policies and supervise the systemic important banks. Originality/value The balance sheet data of different types of banks are used to construct a bilateral exposure matrix. Based on the matrix, this paper investigates the knock-on effects of credit shock triggered by the debt default in the interbank market, the knock-on effects of liquidity effects, which is featured by fire sale of bank assets, and the contagion effects of combined shocks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ccbb4483e53815b3d9533538db7c674c",
  "timestamp": "2025-05-15T03:01:31.463725"
}