{
  "id": 6387,
  "title": "Impact of a commercial accountable care organization on prescription drugs",
  "abstract": "Objective: To determine the long-run impact of a commercial accountable care organization (ACO) on prescription drug spending, utilization, and related quality of care. Data Sources/Study Setting: California Public Employees' Retirement System (CalPERS) health maintenance organization (HMO) member enrollment data and pharmacy benefit claims, including both retail and mail-order generic and brand-name prescription drugs. Study Design: We applied a longitudinal retrospective cohort study design and propensity-weighted difference-in-differences regression models. We examined the relative changes in outcome measures between two ACO cohorts and one non-ACO cohort before and after the ACO implementation in 2010. The ACO directed provider prescribing patterns toward generic substitution for brand-name prescription drugs to maximize shared savings in pharmacy spending. Data Collection/Extraction Methods: The study sample included members continuously enrolled in a CalPERS commercial HMO from 2008 through 2014 in the Sacramento area. Principal Findings: The cohort differences in baseline characteristics of 40 483 study participants were insignificant after propensity-weighting adjustment. The ACO enrollees had no significant differential changes in either all or most of the five years of the ACO operation for the following measures: (1) average total spending and (2) average total scripts filled and days supplied on either generic or brand-name prescription drugs, or the two combined; (3) average generic shares of total prescription drug spending, scripts filled or days supplied; (4) annual rates of 10 outpatient process quality of care metrics for medication prescribing or adherence. Conclusions: Participation in the commercial ACO was associated with negligible differential changes in prescription drug spending, utilization, and related quality of care measures. Capped financial risk-sharing and increased generics substitution for brand names are not enough to produce tangible performance improvement in ACOs. Measures to increase provider financial risk-sharing shares and lower brand-name drug prices are needed.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ccbf7302e13d1aca63534a3414c50e98",
  "timestamp": "2025-05-15T02:57:38.756417"
}