{
  "id": 3010,
  "title": "Convicted women's trajectories of community and financial adversity and race",
  "abstract": "Purpose: To identify heterogeneity in the development of high-crime neighborhood exposure and financial adversity among justice-involved women and test for racial/ethnic disparities in patterns of change and continuity. Methods: Data were from 402 women interviewed repeatedly over several years after a felony conviction. Group based trajectory modeling identified developmental subgroups differing in high-crime neighborhood exposure and patterns of financial adversity. Multinomial logistic regression examined racial/ethnic differences in trajectory group assignment for each outcome. Dual trajectory analysis tested for overlap between assignment to the high-crime neighborhood trajectory and financial adversity groups. Results: Three-group models were identified for both the financial adversity and high-crime neighborhood exposure outcomes. Racially/ethnically minoritized participants were at higher risk of assignment to trajectory groups characterized by elevated and chronic levels of high-crime neighborhood exposure and financial adversity. Following a high and chronic pattern of financial adversity was associated with increased risk for high and chronic exposure to high crime neighborhoods. Conclusions: For many justice-involved women, especially racial/ethnic minorities, high crime neighborhood exposure and financial adversity are chronic. There is a need to reconsider justice policies that impose costs of conviction, for example high bail and fees, since such policies can exacerbate exposure to criminogenic contexts and circumstances.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cce1e3af9cba681548d2d2f7d19f160b",
  "timestamp": "2025-05-15T02:21:19.311274"
}