{
  "id": 2891,
  "title": "Patients with polycystic kidney disease would benefit from routine magnetic resonance angiographic screening for intracerebral aneurysms: A decision analysis",
  "abstract": "AUTOSOMAL DOMINANT POLYCYSTIC kidney disease (ADPKD) is associated with increased prevalence of cerebral aneurysms and increased risk of subarachnoid hemorrhage. A decision analysis by Levey et al. in 1983 demonstrated that patients with ADPKD would not significantly benefit from routine arteriographic screening for cerebral aneurysms. We reexamined this conclusion in light of new clinical data and the introduction of magnetic resonance imaging (MRI) as a screening method. We compared an MRI screening strategy with a nonscreening strategy. The screening strategy specified MRI screening and then neurosurgical management of detected aneurysms. The nonscreening strategy specified cerebrovascular care only in the event of subarachnoid hemorrhage. The decision tree incorporated estimates derived from the clinical literature for the prevalence of asymptomatic aneurysms in patients with ADPKD (15%), the annual incidence of aneurysmal rupture (1.6%), the morbidity and mortality rates associated with subarachnoid hemorrhage (70 and 56%, respectively), the risk of transfemoral arteriography (0.2%), the sensitivity and specificity of MRI, the morbidity and mortality rates associated with surgical treatment of an unruptured aneurysm (4.1 and 1.0%, respectively), and the life expectancy of patients with ADPKD. The model predicted that the screening strategy would provide 1.0 additional year of life without neurological disability to a 20-year-old patient with ADPKD. A sensitivity analysis showed that the model was most sensitive to estimates of the prevalence of aneurysms in ADPKD, the annual incidence of rupture, and the morbidity and mortality rates associated with rupture. A financial analysis showed that a screening strategy is likely to cost less than a nonscreening strategy. The model predicts that an MRI screening strategy would increase the life expectancy of young patients with ADPKD and reduce the financial impact on society of ADPKD.",
  "year": 1996,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cce23fc629269ae044095efc4d93e9e4",
  "timestamp": "2025-05-15T02:20:16.913174"
}