{
  "id": 4547,
  "title": "Assessing climate risk quantification tools - mere fulfilment of duty or actually beneficial?",
  "abstract": "PurposeThe study aims to assess the effectiveness of prevailing methods for quantifying physical climate risks. Its goal is to evaluate their utility in guiding financial decision-making within the real estate industry. Whilst climate risk has become a pivotal consideration in transaction and regulatory compliance, the existing tools for risk quantification frequently encounter criticism for their perceived lack of transparency and comparability.Design/methodology/approachWe utilise a sequential exploratory mixed-methods analysis to integrate qualitative aspects of underlying tool characteristics with quantitative result divergence. In our qualitative analysis, we conduct interviews with companies providing risk quantification tools. We task these providers with quantifying the physical risk of a fictive pan-European real estate portfolio. Our approach involves an in-depth comparative analysis, hypothesis tests and regression to discern patterns in the variability of the results.FindingsWe observe significant variations in the quantification of physical risk for the pan-European portfolio, indicating limited utility for decision-making. The results highlight that variability is influenced by both the location of assets and the hazard. Identified reasons for discrepancies include differences in regional databases and models, variations in downscaling and corresponding scope, disparities in the definition of scores and systematic uncertainties.Practical implicationsThe study assists market participants in comprehending both the quantification process and the implications associated with using tools for financial decision-making.Originality/valueTo our knowledge, this study presents the initial robust empirical evidence of variability in quantification outputs for physical risk within the real estate industry, coupled with an exploration of their underlying reasons.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cce32a2d7d8bc82d4f1dfa6c29c58583",
  "timestamp": "2025-05-15T02:38:20.428670"
}