{
  "id": 7391,
  "title": "Association of perceived stress with depressive symptoms in older Taiwanese: Results of a population-based study",
  "abstract": "Aims: We determined the association of perceived stress with depressive symptoms in older Taiwanese. Methods: We analyzed the 2007 dataset of the Taiwan Longitudinal Survey on Aging, a population-based survey of 4534 persons aged >= 54 years. Perceived stress was based on respondents' reports of whether each of the five situations (own health, financial status, job, getting along with family members and family members' problems) makes you feel stressed or anxious. Participants were rated with the 10-item Center for Epidemiologic Studies Depression scale (score 0-30; >= 10 as having depressive symptoms). Multivariate logistic regression analysis was carried out to determine the association of each perceived stress situation with depressive symptoms in persons aged 54-64 years (middle-aged), 65-74 years (young-old) and >= 75 years (old-old). Results: Over one-third of respondents were stressed over their own health. The middle-aged respondents who were stressed were 2.0-10.9-fold as likely to have depressive symptoms, the young-old were 3.1-8.1-fold as likely and the old-old were 4.3-12.6-fold as likely compared with the non-stressed respondents (all P < 0.001). Financial stress and its association with depressive symptoms deceased with increasing age. Nearly half of the Taiwanese older adults had concerns over family members' problems and the concern was associated with depressive symptoms in the younger age groups. Relationship strain with family members existed in <10% of older Taiwanese, but the association with depressive symptoms was strong. Job-related stress was not associated with depressive symptoms. Conclusions: Perceived stress and its association with depressive symptoms vary according to stress situations and age. The present findings should be useful for developing appropriate strategies to reduce the risk of depression in older adults.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ccf1d69d5e04b2fb5d6a08373d0a1606",
  "timestamp": "2025-05-15T03:08:00.816355"
}