{
  "id": 4274,
  "title": "Are gold and cryptocurrency a safe haven for stocks and bonds? Conventional vs Islamic markets during the COVID-19 pandemic",
  "abstract": "PurposeThis study aims to identify the ability of gold and cryptocurrency (Cryptocurrency Uncertainty Index (UCRY) Price) as safe haven assets (SHA) for stocks and bonds in both conventional (i.e. stock indices and government bonds) and Islamic markets (i.e. Islamic stock indices and Islamic bonds (IB)).Design/methodology/approachThe authors employed the nonadditive panel quantile regression model by Powell (2016). It measured the safe haven characteristics of gold and UCRY Price for stock indices, government bonds, Islamic stocks, and IB under gold circumstances and level of cryptocurrency uncertainty, respectively. The period spanned from 11 March 2020 to 31 December 2021.FindingsThis study discovered three findings, including: (1) gold is a strong safe haven for stocks and bonds in conventional and Islamic markets under bearish conditions; (2) UCRY Price is a strong safe haven for conventional stocks and bonds but only a weak safe haven for Islamic stocks under high crypto uncertainty; and (3) gold offers a safe haven in both emerging and developed countries, while UCRY Price provides a better safe haven in developed than in emerging countries.Practical implicationsGold always wins big for safe haven properties during unstable economy. It can also win over investors who consider shariah compliant products. Therefore, it should be included in an investor's portfolio. Meanwhile, cryptocurrencies are more common for developed countries. Thus, the governments and regulators of emerging countries need to provide more guidance around cryptocurrency so that the societies have better literacy. On top of that, the investors can consider crypto to mitigate risks but with limited safe haven functions.Originality/valueThe originality aspects of this study include: (1) four chosen assets from conventional and Islamic markets altogether (i.e. stock indices, government bonds, Islamic stock indices and IB); (2) indicator countries selected based on the most used and owned cryptocurrencies for the SHA study; and (3) the utilization of UCRY Price as a crypto indicator and a further examination of the SHA study toward four financial assets.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ccf75a9d5b30da8742e4317c1d09e922",
  "timestamp": "2025-05-15T01:25:23.324419"
}