{
  "id": 4318,
  "title": "Survivorship of autologous structural bone graft at a minimum of 2 years when used to address significant glenoid bone loss in primary and revision shoulder arthroplasty: a computed tomographic and clinical review",
  "abstract": "Background: Severe glenoid bone loss remains a challenge in patients requiring shoulder arthroplasty and often requires autogenous bone grafting. The purpose of this study was to assess the integrity of the bone graft at 2 years in a series of primary and revision shoulder replacements where glenoid bone loss was managed using a structural autograft (humeral head or iliac crest bone graft) in combination with a trabecular titanium (TT) implant. Methods: Ethical approval was sought, and the study has a portfolio study status by the NIHR (17/YH/0318). We contacted patients who had primary and revision shoulder arthroplasty with Lima Axioma TT metal-back glenoid with autologous bone graft and were more than 2 years since their operation. All eligible patients underwent computed tomographic evaluation, clinical review, and scoring. Early failures of composite fixation and patients who had revision procedures were excluded (2 patients). Results: Forty-one patients (43 shoulders) with a mean age of 65 years (range 33-85 years) were reviewed. There were 24 women and 17 men. The average follow-up period was 40 months (range 24-59 months). Primary arthroplasty was performed in 24 shoulders, whereas 19 shoulders had revision arthroplasty. Twenty-five shoulders had reverse shoulder replacement and 18 had anatomic shoulder replacement. Twenty-four shoulders had graft taken from the humeral head, and 19 had iliac crest bone graft, reflecting the number of revisions. We used Wrightington classification for porous metal implant and bone graft incorporation. Satisfactory bone graft incorporation (>50%) was seen in 40 shoulders, and only 3 patients had <50% graft incorporation. The scans at 2 years or later showed no significant deterioration in the bone graft from the early postoperative scans. Average forward elevation improved from 50 degrees (preoperative) to 98 degrees (range 35 degrees-150 degrees). The mean improvement in mean Oxford Shoulder Score was 16 (preoperative, 15; postoperative, 31) and the mean improvement in Constant score improvement was 36 ( preoperative, 12; postoperative, 48). The mean postoperative American Shoulder and Elbow Surgeons Standardized Shoulder Assessment Form (ASES) score was 64 (range 30-85). Conclusion: The use of TT in conjunction with autologous bone graft provides a reliable method of addressing glenoid bone defects in primary and revision shoulder arthroplasty. This graft-trabecular metal composite has been shown to integrate well and remain largely unchanged over a 2-year period. A stable baseplate is essential in difficult primary and revision arthroplasty situations. The stability of this construct in our series is reflected in the satisfactory outcomes. (C) 2020 Journal of Shoulder and Elbow Surgery Board of Trustees. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ccfe8bf26dcac75ded51f66bc009cb2a",
  "timestamp": "2025-05-15T01:25:50.544814"
}