{
  "id": 9419,
  "title": "Attainment of Target in Therapeutic Range of International Normalized Ratio and Correlates Among Patients on Warfarin Therapy at Jimma Medical Center, Jimma, Ethiopia",
  "abstract": "Purpose: Warfarin is effective therapy to prevent thromboembolic complications of venous thromboembolism, atrial fibrillation, and cardiac thrombus, among valvular heart diseases, including in patients treated with prostheses and/or repair. Its optimum effect is achieved when the international normalized ratio (INR) is in the target therapeutic range, but a subtherapeutic level increases risk of thromboembolism and complications. This study aimed to assess the attainment of target therapeutic range, proportion, and factors associated with subtherapeutic level of warfarin. Methods: A hospital-based cross-sectional study was conducted at Jimma Medical Center in Jimma, Ethiopia, from October 1, 2020 through December 30, 2021. All patients on warfarin and attending Medical Follow-Up Clinics of Jimma Medical Center during the study period were included. Data were collected using structured questionnaires and then analyzed using EpiData Manager software, version 3.1 (EpiData Association). chi(2) Tests and logistic regression models were used to assess relationships among variables. Findings: Of 196 patients on warfarin, similar to 60% were taking it for atrial fibrillation, followed by deep venous thrombosis, women accounted for 61.7% of patients, and mean (SD) age was 43 (7) years. Most patients (61.7%) lived in rural areas and 44.9% farmed to earn a living. Most of the study participants (51.5%) had a very low monthly income of less than USD50. Most of the patients (n = 107 [54.6%]) were advised on dietary selections while on warfarin and approximately two-thirds (n = 70 [65.4%]) were adherent to the advice. Most participants (n = 118 [60.2%]) were poorly adherent to warfarin therapy and more than two-thirds of them discontinued warfarin for financial reasons. Mean (SD) duration of warfarin therapy was 15.53 (18.92) months (range 1-90 months). Most of the respondents (n = 109 [55.6%]) had subtherapeutic INR and 21 (10.7%) were in the supratherapeutic range. Although the mean (SD) time in therapeutic range was 25.03% (24.17% [range 0-80%]), in most patients (n = 166 [84.7%]), it was < 60%. Poor adherence (adjusted odds ratio = 6.13; 95% CI, 3.31-28.10), shorter duration of warfarin ( < 12 months; adjusted odds ratio = 0.104; 95% CI, 0.012-0.875), and presence of comorbidity (adjusted odds ratio = 0.035; 95% CI, 0.004-0.323) were significantly associated with subtherapeutic INR. Implications: Attainment of therapeutic INR among patients on warfarin therapy is suboptimal. This was evidenced by a significant number of patients with low time in therapeutic range, as well as INR. Poor adherence to warfarin therapy, shorter duration since initiation of warfarin, and presence of comorbid illnesses were significantly associated with subtherapeutic INR. This can lead to complications of atrial fibrillation, including thrombus formation and subsequent cardioembolic stroke, venous thromboembolism, and others, leading to morbidity, in- creased mortality, and poor quality of life. Therefore, providing health education and treatment for comorbidities may improve adherence, which may also improve attainment of therapeutic INR and reduce complications and improve quality of life.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ccff33ab9be1f4dccc85af7119fd13e7",
  "timestamp": "2025-05-15T03:28:46.239026"
}