{
  "id": 441,
  "title": "Fintech adoption dynamics in a pandemic: An experience from some financial institutions in Nigeria during COVID-19 using machine learning approach",
  "abstract": "The novel coronavirus caused a lifestyle shift, and the acceptance of offsite financial transactions is still a case for financial technology (fintech). Mobile financial transactions continue to be at an all-time low, and financial institutions are developing approaches for financial digitalization acceptability. The present study attempts to understand users' motivations for fintech adoption. The technology acceptance model (TAM) and the unified theory of acceptance and use of technology (UTUAT) were utilized to uncover the rationale behind technology adoption. This study explored the drivers inhibiting the adoption of financial technology in Nigeria during the pandemic. A machine learning (ML) approach was implemented to examine fintech adoption predictors using a self-administered consumer survey of 480 account holders. Survey responses were analyzed using a set of ML models (naive Bayes, logistic regression, K-nearest neighbors, decision trees, and support vector machines), revealing the features and decision criteria for predicting perceived technology adoption. The decision tree outperformed the other models, with an accuracy of over 84%, precision of 88%, recall of 86%, F1-score of 84%, and area under the curve of 87%. The result indicates that customers are concerned about their safety. Thus, furthering their sense of risk. These results provide a roadmap for financial institutions and policymakers to understand behavioral attitudes toward adopting fintech and suggest strategies for attracting customers to the fintech space.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd0199ca5d6d87a5c041cd0d6e239088",
  "timestamp": "2025-05-15T01:50:52.663103"
}