{
  "id": 4104,
  "title": "Islamic, ethical and conventional mutual funds: a comparative study (1990-2022)",
  "abstract": "PurposeThis study aims to test mutual fund superiority, comparing the performance of 646 Islamic mutual funds with 475 ethical funds and conventional proxies.Design/methodology/approachThis study uses statistical methods including paired t-statistics of independent samples, one-way Bonferroni test-analysis of variance-F-statistic for testing means equality, the chi-squared test for median equality and regression models corrected for heteroscedasticity. These methods are used to identify superiority of mutual funds and to validate the significance of the results.FindingsThe findings confirm the superiority of conventional funds over ethical funds and ethical funds over Islamic funds. Both ethical and Islamic funds, however, outperform conventional proxies during some recessionary periods. Moreover, stronger performance is recorded for Islamic funds in Europe and North America regions and across age and asset allocation categories, but limited support for reversal fund size, composition focus and reversed price effect.Research limitations/implicationsThese findings should assist investors when deciding to invest and motivate Islamic and ethical funds to improve their portfolio formation and asset allocation strategies set by their professional managers.Originality/valueThe originality of this study is in its comprehensive approach in that it compares the performance of funds after accounting for such characteristics as fund objectives, size, age, asset allocation, geographical investment focus, fund composition focus, share price levels and the effect of global crises. This study approach is not only original and productive in documenting Islamic funds' performance for the past three decades (1990-2022) but can also update the literature on these characteristics collectively and individually.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd0e98ca2814bbbb308b2cdfbfe4422b",
  "timestamp": "2025-05-15T01:23:58.036221"
}