{
  "id": 3303,
  "title": "A decision aid for assessing the likelihood of fraudulent financial reporting",
  "abstract": "The auditor's responsibility for detecting fraudulent financial reporting is of continuing importance to both the profession and society. The Auditing Standards Board has recently issued SAS No. 82, Consideration of Fraud in a Financial Statement Audit, which makes the auditor's responsibility for the detection of material fraud more explicit without increasing the level of responsibility. Using a sample of 77 fraud engagements and 305 nonfraud engagements, we develop and test a logistic regression model that estimates the likelihood of fraudulent financial reporting for an audit client, conditioned on the presence or absence of several fraud-risk factors. The significant risk factors included in the final model are: weak internal control environment, rapid company growth, inadequate or inconsistent relative profitability, management places undue emphasis on meeting earnings projections, management lied to the auditors or was overly evasive, the ownership status (public vs. private) of the entity, and an interaction term between a weak control environment and an aggressive management attitude toward financial reporting. The logistic model was significantly more accurate than practicing auditors in assessing risk for the 77 fraud observations. There was not a significant difference between model assessments and those of practicing auditors for the sample of nonfraud cases. These findings suggest that a relatively simple decision aid performs quite well in differentiating between fraud and nonfraud observations. Practitioners might consider using this model, or one developed using a similar procedure, in fulfilling the SAS No. 82 requirement to assess the risk of material misstatement of the financial statements due to fraud.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd20b65df25274165ea956a595af8601",
  "timestamp": "2025-05-15T02:24:39.739329"
}