{
  "id": 4357,
  "title": "A credit default swap application by using quantile regression technique",
  "abstract": "A credit default swap (CDS) is a type of financial derivative or contract that permits an investor to swap or balance the owned credit risk with that of another investor. Recently, this investment tool has been preferred by a wide range of investors in order to minimize their probability of credit default. Many economists and researchers agree that credit default swaps contribute significantly to the prevention of credit risk. Quantile regression provides conditional quantiles of solutions with a general linear model that assumes non parametric form for the conditional distribution of the solutions. Moreover, it is possible to obtain more information by this method which could not be reached directly from standard regression methods. Furthermore, the quantile regression method has a broad application area in various disciplines since it gives the option of modeling the tails of the conditional distribution. In this study, a comprehensive literature review was given at the beginning and then a credit default swap application was implemented by using the quantile regression method. In the application section, the Credit Default Swap variables and the ratings of various independent rating agencies such as Standard&Poor's, Fitch, and Moody's of Turkey were used for between 2013 and 2018 as monthly.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd2a5d5568c8fa27b118c62361506c96",
  "timestamp": "2025-05-15T02:36:05.274907"
}