{
  "id": 7935,
  "title": "What predicts persistent depression in older adults across Europe? Utility of clinical and neuropsychological predictors from the SHARE study",
  "abstract": "Background: Depression in later life frequently persists and perpetuating factors are of immediate therapeutic relevance to clinicians. No studies of this scale have examined both clinical and neuropsychological predictors of persistent depression in a cross-national European context. Methods: 4095 community dwelling older adults (>= 50 yr) with clinically signficant depression (EUROD >= 4) from eleven European countries in the Survey of Heath, Ageing, and Retirement in Europe (SHARE) were followed for a median of 28 months. Logistic regression analyses were conducted to determine predictors of persistent depression. Results: 2187 (53.4%) remained depressed at follow up. Independent predictors included: female gender, baseline functional impairment, functional decline, physical symptoms, past history of depression, increased severity of depression, early age of onset (< 50 yr), life events, financial distress and country of residence. Neuropsychological variables were associated with persistent depression but not independently of other variables. Limitations: The assessment of depression was by self-report and the data source did not contain a number of potentially relevant predictors. Conclusion: Individuals at risk of persistent depression may be identified and targeted for intervention. Therapeutic interventions should adopt a multimodal approach to optimise current function, prevent further functional decline and treat symptoms of depression. Country of residence may be associated with further modifiable variables. (c) 2012 Elsevier B.V. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd2fd6a07726413578cb5937b016be0e",
  "timestamp": "2025-05-15T03:13:30.675128"
}