{
  "id": 2776,
  "title": "Corporate governance impact on risk disclosure in Shariah-compliant financial firms of Kuwait",
  "abstract": "Purpose - This study aims to investigate the relationship between corporate governance characteristics and risk disclosure in Shariah-compliant financial firms operating in Kuwait. It aims to provide insights into the factors influencing risk disclosure practices within these institutions. Design/methodology/approach - The research used manual content analysis to quantify risk disclosure levels in the annual reports of 47 Shariah-compliant financial companies listed in Kuwait in 2020. Subsequently, multiple regression analysis was conducted to assess the impact of various corporate governance factors on the extent of risk disclosure. Findings - The study reveals that while Kuwaiti Shariah-compliant firms exhibit limited risk disclosure in their annual reports, larger boards and committees, along with a higher number of independent directors, positively influence the level of risk disclosure. Interestingly, the size of the Shariah supervisory boards did not show a significant impact on risk disclosure practices. Practical implications - These findings hold regulatory implications for Kuwait, highlighting the need to ensure information adequacy and promote market efficiency. Additionally, they offer practical insights for managers and investors seeking to optimize fund sourcing and diversify investment portfolios within the context of Shariah-compliant financial institutions. Originality/value - This study contributes to the existing literature by providing empirical evidence on the relationship between corporate governance characteristics and risk disclosure in the specific context of Shariah-compliant financial firms operating in Kuwait. Furthermore, it identifies avenues for future research to delve into the influence of additional governance factors on risk disclosure practices within this unique financial landscape.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd33c0b44c6abda2514936172a1e53b5",
  "timestamp": "2025-05-15T02:19:08.417328"
}