{
  "id": 5773,
  "title": "A longitudinal study of franchisor failure according to Altman's Z model",
  "abstract": "Purpose: The foremost objective of this study is to obtain segments/clusters of franchisors that are more likely to fail. A second aim is to evaluate the influence of the usual variables of the franchise contract on the solvency of franchises. Design/methodology/approach: This study set up a database with information collected from several Spanish franchising yearbooks and franchisors' websites to establish the census of Spanish franchisors. This article worked with a census of the franchises operating in Spain from 2001 to 2011. Latent class regression analysis is used. Findings: This research found four segments or classes of franchisors with regard to their failure pattern. In addition, this article defined the most influential variables in the franchisors' risk of failure. The relationships between the variables that define a franchise contract and the Z scores of Altman's model have been extracted. The dependent variable has been the Altman's Z model and the independent variables are those that define the franchise contract. Research implications: This methodology offers potential franchisees a new criterion for assessing the franchise chains they are investigating, taking into account their risk of failure. This allows franchisees to better highlight those franchisors that have a lower crash risk and avoid the damage incurred by the closure of the chain. The information provided for franchisees should be accessible, usable, and suitable to help franchisees to choose the best franchise systems in which to invest. This methodology is of course very useful for franchisors, because they can comprehend their financial situation and how they could manage the franchising variables in order to improve their solvency. Practical implications: All the segments are solvent, except Segment 3. The distinguishing feature of this segment is that over 64 percent of the firms are retailer chains. In addition, more than 20 percent of the franchises from our database are in financial danger, and this is the group where the number of service companies is lower. Originality/value: This research is unique in two ways. First, this study presents a new methodology in this field that allows researchers to use the historical-financial data of franchisors, and the information of the franchise contract to predict franchisor failure. Second, this article helps franchisees to make their own decisions on the basis of the franchisors' level of risk of failure. Third, this research offer a theoretical contribution about franchisor failure, this topic is scarcely treated by academic literature.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd4336a55d1ca66e744a81f7904d04fc",
  "timestamp": "2025-05-15T02:51:29.977417"
}