{
  "id": 2512,
  "title": "A look beyond climate risk exposure: the impact of incapacity to cope with natural hazards on financial development",
  "abstract": "We provide a comprehensive cross-country analysis on the impact of national incapacity to cope with natural hazards (i.e., social shocks, political stability, health care, infrastructure, and material security needed to reduce the harmful effects of natural disasters) on financial development. The panel quantile regression analyses on a global sample of 130 countries generally confirm that the financial development of countries with lower capacity to cope is indeed significantly hampered compared to their peers, especially in countries with low financial development levels. Seemingly unrelated regression (SUR) analyses, which acknowledge the dynamic co-existence between both financial institutions and financial market sectors in a given economy simultaneously, offer notable finer details. For example, the handicapping effect on both sectors tends to apply to only countries with higher climate risks. Lack of coping capacity also exert negative effects on the development of financial institutions in countries of all levels of income but only affect financial markets of high-income group. The more detailed look into different dimensions (financial efficiency, financial access, and financial depth) of financial development is also given in our study. Overall, our findings highlight the vital and complex role of coping capacity aspect of climate risk on the sustainable development of financial sectors.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd52c77a8a28345935b45c22af1f6607",
  "timestamp": "2025-05-15T02:15:59.933639"
}