{
  "id": 3267,
  "title": "Toward Better Measurement of Financial Risk Protection in Health Expenditure: The Case of Chile",
  "abstract": "Objectives: Our study highlights the impact of out-of-pocket health expenditure (OOPHE) in highly unequal countries, where the middle class is particularly vulnerable to declines in well-being. We modify 2 financial protection measures- impoverishment and catastrophic health expenditure (CHE)-to address this issue. The first adjustment improves the classification of households based on their risk of poverty due to OOPHE, whereas the second corrects the underestimation of CHE for poorer households and the overestimation for the richest. Methods: We applied our adjusted financial protection measures to data from the Chilean Household Budget Surveys (2006-2007, 2011-2012, 2016-2017, and 2021-2022) and compared the results with conventional CHE and impoverishment measures. Logistic regressions were used to identify factors associated with CHE. Results: Our impoverishment risk indicator indicates that approximately 10% of Chilean households entered poverty, became poorer, or were at high risk due to OOPHE in 20. Our revised CHE measure suggests that approximately 15.8% of households faced financial hardship, with both figures exceeding conventional estimates. Households with more women and an older average age were more likely to experience CHE. Conclusions: Effective and equitable access to health services, along with adequate financial protection, is critical to achieving universal health coverage. However, in countries with high-income inequality and a high proportion of nonpoor households close to the poverty line, conventional measures may have blind spots for monitoring and analyzing financial hardship in health spending. This research provides evidence to open the debate on this issue.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd5307477c3df87295600ff254720e34",
  "timestamp": "2025-05-15T02:24:39.567060"
}