{
  "id": 6984,
  "title": "Estimating the Acceptance Probabilities of Consumer Loan Offers in an Online Loan Comparison and Brokerage Platform",
  "abstract": "It is widely recognised that the ability of e-commerce businesses to predict conversion probability, i.e., acceptance probability, is critically important in today's business environment. While the issue of conversion prediction based on browsing data in various e-commerce websites is broadly analysed in scientific literature, there is a lack of studies covering this topic in the context of online loan comparison and brokerage (OLCB) platforms. It can be argued that due to the inseparable relationship between the operation of these platforms and credit risk, the behaviour of consumers in making loan decisions differs from typical consumer behaviour in choosing non-risk-related products. In this paper, we aim to develop and propose statistical acceptance prediction models of loan offers in OLCB platforms. For modelling, we use diverse data obtained from an operating OLCB platform, including on customer (i.e., borrower) behaviour and demographics, financial variables, and characteristics of the loan offers presented to the borrowers/customers. To build the models, we experiment with various classifiers including logistic regression, random forest, XGboost, artificial neural networks, and support vector machines. Computational experiments show that our models can predict conversion with good performance in terms of area under the curve (AUC) score. The models presented are suitable for use in a loan comparison and brokerage platform for real-time process optimisation purposes.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd61262c8f843ae8efdcc65c28a5cb97",
  "timestamp": "2025-05-15T03:03:55.723736"
}