{
  "id": 9196,
  "title": "The mental health impact of 9/11 on inner-city high school students 20 miles north of Ground Zero",
  "abstract": "Purpose: To determine the rate of post-traumatic stress disorder (PTSD) after 9/11 in a sample of New York City high school students and associations among personal exposure, loss of psychosocial resources, prior mental health treatment, and PTSD. Methods: A total of 1214 students (grades 9 through 12) attending a large community, high school in Bronx County, 20 miles north of Ground Zero, completed a 45-item questionnaire during gym class on one day eight months after 9/11. Students were primarily Hispanic (62%) and African American (29%) and lived in the surrounding neighborhood. The questionnaire included the PCL-T, a 17-item PTSD checklist supplied by the Office of Behavioral and Social Science Research of the National Institutes of Health (NIH). The PCL-T was scored following the DSM-IV criteria for PTSD requiring endorsement of at least one repeating symptom, two hyperarousal symptoms, and three avoidance symptoms. Bivariate analysis comparing PTSD with personal exposure, loss of psychosocial resources, and mental health variables was done and multiple logistic regression was used to identify significant associations. Results: There were 7.4% of students with the PTSD symptom cluster. Bivariate analysis showed a trend for females to have higher rates of PTSD [males [6%] vs. females [9%], p = .06] with no overall ethnic differences. Five of the six personal exposure variables, and both of the loss of psychosocial resources and mental health variables were significantly associated with PTSD symptom cluster. Multiple logistic regression analysis found one personal exposure variable (having financial difficulties after 9/11, odds ratio [OR] = 5.27; 95% confidence interval [CI] 2.9-9.7); both the loss of psychosocial resources variables (currently feeling less safe, OR = 3.58; 95% CI 1.9-6.8) and currently feeling less protected by the government, (OR = 4.04; 95% CI 2.1-7.7); and one mental health variable (use of psychotropic medication before 9/11, OR = 3.95; 95% CI 1.2-13.0) were significantly associated with PTSD symptom cluster. Conclusions: We found a rate of PTSD in Bronx students after 9/11 that was much higher than other large studies of. PTSD in adolescents done before 9/11. Adolescents living in inner cities with high poverty and violence rates may be at high risk for FTSD after a terrorist attack. Students who still felt vulnerable and less safe eight months later and those with prior mental health treatment were four times more likely to have PTSD than those without such characteristics, highlighting the influence of personality and mental health on development of PTSD after a traumatic event. (c) 2006 Society for Adolescent Medicine. All fights reserved.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd621c3c21963d487c531ad9ca92a8eb",
  "timestamp": "2025-05-15T03:26:26.017499"
}