{
  "id": 146,
  "title": "Portfolio optimization and return prediction by integrating modified deep belief network and recurrent neural network",
  "abstract": "The victory of portfolio construction is mostly based on the future stock market performance. Recently, the developed machine learning techniques bring more significance of involving the prediction theory for selecting the portfolio. Implementing the return prediction of conventional time series methods in portfolio generation can enhance the efficiency of real portfolio optimization method. But, expert systems and deep structured learning methods has gives awesome performance when comparing other time series methods, in this work integrates return prediction in portfolio formation with hybridized deep learning method named Deep Belief-Recurrent Neural Network (DBRNN). The forecasting of the portfolio is performed by the optimal training (weight optimization) of RNN with DBN, by the hybrid meta-heuristic algorithm termed Harris Hawks-Deer Hunting Optimization (HH-DHO). The newly developed optimization algorithm does not fall into the local optimum owing to the integrated method of exploration in the DHOA and HHO. The combination of standard algorithms is confirmed that it is better for solving the test problems and is it is very competitive and realistic over other conventional algorithms. Thus, it reveals that the implemented HH-DHO can highly balance the exploration and exploitation phases. With the predicted information by the integrated deep learning model, the best companies that high returns are optimally selected by the same hybrid HH-DHO. It can be enlarge the prediction performance of the designed approaches. On observing the analysis, the acquired results reveal that the suggested method is superior to existing ways and benchmarks in terms of returns and risks. (C) 2022 Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd718e2ff5c7200c39310b79b90de7e0",
  "timestamp": "2025-05-15T00:40:02.056383"
}