{
  "id": 2251,
  "title": "Psychological determinants of financial buffer saving: the influence of financial risk tolerance and regulatory focus",
  "abstract": "With governments redistributing more responsibilities unto citizens, individuals have an increasing need for financial resources acting as a buffer against life's setbacks and unexpected expenditures. The purpose of this study was to examine psychological determinants of saving for a financial buffer, for which a theoretical model was formulated based on the theory of planned behaviour with three new, domain-specific psychological constructs: financial risk tolerance, regulatory focus and perceived saving barriers. Data were collected with an online questionnaire that utilised convenience and snowball sampling to target both students and working individuals (N=272). Regression analyses offered support for the proposed model, showing that participants' financial risk tolerance (i.e. an individual's attitude towards financial risk taking) was significantly associated with their subjective financial knowledge and regulatory focus. Furthermore, perceived financial self-efficacy and financial risk tolerance both predicted participants' intention to save for a financial buffer. In turn, perceived financial self-efficacy and saving intention predicted self-reported saving behaviour. Importantly, perceived saving barriers mediated the relationship between saving intention and self-reported saving behaviour. In line with the proposed model, results also showed that a specific attitude-based construct (financial risk tolerance) is a considerably better predictor of saving intention than general measures of attitude towards saving. This study is also the first to demonstrate that regulatory focus influences financial risk tolerance. Implications of these findings for stimulating saving behaviour are discussed.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd902e5382aae21e7808eb8a5e0599d7",
  "timestamp": "2025-05-15T02:12:51.070053"
}