{
  "id": 6162,
  "title": "Predictors of self-harm and emergency department attendance for self-harm in deprived communities",
  "abstract": "Emergency departments (EDs) are often the first point of contact for individuals following self-harm. The majority of previous research relies on hospital-based data, yet only a minority of individuals who self-harm in the community present to healthcare services. The study design is cross-sectional survey design. Data from the National Institute for Health Research Applied Research Collaboration North West Coast (NIHR ARC NWC) Household Health Survey, a community-based public health survey in North West England, was collected using stratified random sampling. Three thousand four hundred twelve people were recruited in 2018 from relatively disadvantaged areas. The sample included 1490 men and 1922 women aged 18 to 100 years (M = 49.37, SD = 18.91). Logistic regression analysis was employed to examine demographic, health and socioeconomic predictors of self-harm and ED attendance for self-harm. Age (18-24 years), lower financial status, depression, anxiety and physical and mental health co-morbidity was associated with significantly higher levels of self-harm. People aged 18-24 years, with physical and mental health co-morbidity and lower levels of social support had significantly higher levels of attending EDs for self-harm. Improving people's financial situations, social connectivity, mental and physical health may help to reduce individual risk for self-harm and strain on health services.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd949546e417dc5f21401aa4f4b9133a",
  "timestamp": "2025-05-15T02:55:13.157086"
}