{
  "id": 3274,
  "title": "The effect of deregulation on bank risk-taking in China: a balance sheet capacity perspective",
  "abstract": "PurposeThe impact of banking deregulation on firms and economic growth is heavily researched, but not the effects on banks' risk-taking. This study aims to investigate the impact of China's 2009 banking deregulation on bank risk-taking, particularly from a balance sheet capacity perspective.Design/methodology/approachUsing a difference-in-differences approach, this study examines how deregulation affects bank risk-taking. A three-stage regression strategy is employed to conduct mechanism analysis.FindingsThe results reveal that deregulated banks exhibit higher levels of risk-taking. Mechanism analysis confirms the bank balance sheet capacity channel: deregulation helps strengthen the net interest margin of deregulated banks, which enhances their balance sheet capacity and subsequently increases their risk appetite. In addition, deregulation improves firms' access to long-term credit in regions with limited credit availability, especially for smaller firms, thereby expanding the financial sector's service outreach.Practical implicationsWhile banking deregulation enhances credit availability for firms and supports the real economy, it also raises banks' risk-taking, posing challenges to financial stability. Our study highlights the trade-off between supporting the real economy and maintaining financial stability under banking deregulation.Originality/valueThis study fills a gap in research on the effects of banking deregulation on bank risk-taking, highlighting the critical role of balance sheet capacity in this process.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cd9fa2a161d76a000a037c31c7df2a5a",
  "timestamp": "2025-05-15T02:24:39.581590"
}