{
  "id": 7038,
  "title": "Exploring the risk dynamics of US green energy stocks: A green time-varying beta approach",
  "abstract": "Green investments play a crucial role in fighting climate change and facilitating the shift towards a low-carbon economy in line with goals of the Paris Agreement. This paper focuses on the U.S. green energy sector, analyzing its underlying risk dynamics, especially during crisis periods. In this paper, we employ a novel green energy timevarying beta (GETVB) to assess the risk profiles of U.S. green energy stocks across different market conditions. We have chosen NASDAQ Clean Edge Green Energy Index (CELS) as the U.S. green energy market index. We use Markov-switching and discrete-threshold-regression models to examine whether the GETVB varies across regimes and is affected by market stress. In particular, we examine if the market risk of these stocks itself exhibits higher volatility during regimes of stress. Our results show that the green stocks are apparently risky, with a GETVB most likely to lie between 1.2 and 1.6. However, these stocks turn out to be resilient against market volatility with the market stress having negligible impact on GETVB. This suggests an inherent robustness of green stocks against extreme market conditions. This resilience makes the U.S. green energy stocks a potential safe destination for investors during times of significant market volatility. Based on the results, we recommend that policymakers bolster support for green investments through enhanced tax incentives and subsidies, aiming to standardize the ESG metrics for increased transparency, and aligning the international financial flows with strategies that align with meeting the Paris Agreement targets.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cda7349f79c26ac85396c95d67768456",
  "timestamp": "2025-05-15T03:04:23.020374"
}