{
  "id": 6333,
  "title": "Research on Factors Affecting SMEs' Credit Risk Based on Blockchain-Driven Supply Chain Finance",
  "abstract": "The development of blockchain-driven supply chain finance aimed to solve the financing problems of SMEs. However, credit risk is expanded, and even transmitted to the whole supply chain, due to their connection, so that it becomes more difficult to effectively identify the credit risk of SMEs. The purpose of this paper was to examine the factors affecting SMEs' credit risk in the mode of block-chain-driven supply chain finance. This research proposed an entropy weight method to construct independent variables and used logistic regression to examine whether the financing enterprises, core enterprises, assets position under financing, blockchain platform, and supply chain operation have significant impacts on credit risk. The panel data, originating from CSMAR on fifty-six quoted SMEs, included eight core enterprises and twenty-six blockchain enterprises, between 2016 and 2020. The results showed that the financing enterprises, core enterprises, asset position under fi-nance, blockchain platform, and supply chain operation have significant impacts on SMEs' credit risk when the confidence level is 90%. The financial status of financing enterprises can reflect the credit status of SMEs. Core enterprises give credit guarantees to SMEs, and the business transactions between SMEs and core enterprises affect the credit risk through the asset position under financing. Meanwhile, blockchain platforms can solve the problem of the information asymmetry of the par-ticipating enterprises in supply chain operations. At the same time, the supply chain operation is also an important factor affecting the credit risk. This conclusion provides a reference for the ap-plication of blockchains in supply chains, to reduce the credit risk. At the same time, the selected indicators were more comprehensive, which provided a strong basis for the subsequent construc-tion of a credit risk assessment model using key factors.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cdc2248f93dd43a6f4d3e765f563af90",
  "timestamp": "2025-05-15T02:57:07.687264"
}