{
  "id": 4170,
  "title": "Relationship Between Social Vulnerability Indicators and Trial Participant Attrition: Findings From the HYVALUE Trial",
  "abstract": "BACKGROUND: Social vulnerability indicators are associated with health care inequities and may similarly impede ongoing participation in research studies. We evaluated the association of social vulnerability indicators and research participant attrition in a trial focused on reducing health disparities. METHODS: Self-identified White or Black adults enrolled in the HYVALUE trial (Hypertension and VALUES), a randomized trial testing a values-affirmation intervention on medication adherence, from February 2017 to September 2019 were included. The self-reported measures of social vulnerability indicators included: (1) Black race; (2) female gender; (3) no health insurance; (4) unemployment; (5) a high school diploma or less; and (6) financial-resource strain. Full attrition was defined as not completing at least one 3- or 6-month follow-up study visit. Log-binomial regression models adjusted for age, gender, race, medical comorbidities, and the other social vulnerability indicators to estimate the relative risk of each social vulnerability indicator with study attrition. RESULTS: Among 825 participants, the mean age was 63.3 years (+/- 11.7 years), 60% were women, 54% were Black, and 97% reported at least one social vulnerability. Overall, 21% participants had full attrition after study enrollment. After adjustment for all other social vulnerabilities, only financial-resource strain remained consistently associated with full attrition (relative risk, 1.71 [95% CI, 1.28-2.29]). In a secondary analysis of partial attrition (completed only one follow-up visit), financial-resource strain (relative risk, 1.40 [95% CI, 1.09-1.81]) and being uninsured (relative risk, 1.54 [95% CI, 1.01-2.34]) were associated with partial attrition. CONCLUSIONS: In a trial aimed at reducing disparities in medication adherence, participants who reported financial-resource strain had a higher risk of participant attrition independent of race or gender. Our findings suggest that efforts to retain diverse populations in clinical trials should extend beyond race and gender to consider other social vulnerability indicators.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cdcccc3dc03ff5ea593f6fc5e78cbbed",
  "timestamp": "2025-05-15T02:34:13.326196"
}