{
  "id": 1677,
  "title": "A Fuzzy ELECTRE Method to Model the Risk in Credit Products for Financing Tourism Experiences",
  "abstract": "After the COVID-19 pandemic, the world began to value sensations and emotions much more, and it has been the tourism sector that has become one of the primary generators of sensory and emotional experiences in different tourist destinations worldwide. In this sense, people began to demand new credit products to finance tourism experiences; however, the international standards for credit risk management (IFRS-9) are still adjusting their regulations to these new market segments. In the scientific literature, we can observe a series of development trends aimed at modelling credit risk management at an international level for non-traditional credit segments, integrating machine learning concepts, which suggests a challenge for financial organisations worldwide. In this article, a Fuzzy ELECTRE model is proposed for the characterisation of portfolio provisions associated with credit risk for financial products aimed at tourism, integrating in a single structure a series of variables that describe the behaviour of the economy at the origin of travellers (macroeconomic variables), as well as a series of variables associated with consumer confidence when visiting a tourist destination. The proposed model made it possible to establish a general methodology for the creation of risk scenarios for portfolio provisions in financial products aimed at tourism, based on the characterisation of the variables described above as linguistic variables by integrating the criteria of experts from both the financial sector and the tourism sector, thus aligning the portfolio provisioning factors established by international IFRS-9 standards with the particularities of the tourism sector, without affecting the capital requirements of financial institutions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cdd01ee7884bbd9be3aa5aaa086924a7",
  "timestamp": "2025-05-15T02:06:22.417450"
}