{
  "id": 1790,
  "title": "Forecasting corporate credit ratings using big data from social media",
  "abstract": "Corporate credit ratings are comprehensive indicators of a company's management performance, earnings quality, and future prospects; they represent its market evaluation and status in the industry and are relevant to the financing and investment decision-making process. Financial institutions determine corporate credit ratings using corporate financial and governance indicators. With advancements in the Internet and the popularity of social media, the appeal of enterprises on social media has become a relevant research topic. Social media represents an alternative method for financial institutions to determine corporate credit ratings. Therefore, the large amounts of data from social media have been used to effectively analyze and predict corporate credit ratings in risk management departments of financial institutions in the field of financial technology (FinTech). This study develops an approach to forecasting corporate credit ratings by analyzing public opinion toward corporations on social media to assist financial institutions in effectively evaluating and controlling corporate risk. This objective is achieved through the following steps: (i) designing a corporate credit rating forecasting process based on big data from social media, (ii) developing techniques for corporate credit rating forecasting, and (iii) implementing and evaluating the corporate credit rating forecasting mechanism. The experimental results of this research show that the accuracy of corporate credit rating prediction based on social media big data is higher than that of traditional financial report, corporate governance and macroeconomic indicators. Moreover, the adopted forecasting model, K-Nearest Neighbor (KNN), is superior to the other machine learning models in terms of accuracy.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cdd7f660040ce71a7c9bd16495ecdd2a",
  "timestamp": "2025-05-15T02:07:25.735602"
}