{
  "id": 7436,
  "title": "VC-DRSA for Knowledge Retrieval Based on Technical Analysis and Investment Practice",
  "abstract": "This study aims to retrieve useful knowledge from commonly adopted technical indicators, based on a soft computing model, to support investment decisions. Though the validity of technical analysis (TA) has been examined extensively by various statistical models in financial literature, a practical approach that may consider the inconsistency among various technical indicators and the down-side risk of an investment is still underexplored. As a result, the present study takes a two-stage approach to construct a variable consistency dominance-based rough set approach (VC-DRSA) model, to retrieve the imprecise patterns and implicit knowledge from technical indicators. At the first stage, the trading signals indicated by various technical indicators are suggested by domain experts, and those signals were simulated by a trading strategy to examine the outcomes of each indicator. And the simulation results of each technical indicator are further processed by VC-DRSA model at the second stage for retrieving decision rules (i.e., knowledge). To illustrate the proposed model, the weighted average index of the Taiwan stock market was examined by using its historical data from mid/2002 to mid/2014, and a set of decision rules with more than 70% classification accuracy were inducted in this empirical case. The findings suggest that certain technical indicators should be considered simultaneously, and the obtained rules have practical implications for investors.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cdd8227dde81e713a0c82622d80ae890",
  "timestamp": "2025-05-15T03:08:37.849367"
}