{
  "id": 6183,
  "title": "Legal frameworks for AI service business participants: a comparative analysis of liability protection across jurisdictions",
  "abstract": "The rapid growth of AI service businesses presents significant legal and financial challenges, particularly concerning liability protection, regulatory compliance, and risk mitigation. A robust legal framework is essential as AI enterprises navigate issues like algorithmic bias, misinformation, privacy violations, and regulatory inconsistencies. This paper examines how business structures-Godo-Kaisha in Japan and Limited Liability Companies (LLCs) and Series LLCs in the U.S.-shape liability exposure and corporate governance in AI enterprises. A key contribution of this study is its focus on legal structures as a foundation for AI's social implementation. Granting legal status to AI service businesses enables the assignment of rights and obligations, ensuring effective risk allocation, governance, and regulatory compliance. This highlights the interaction between business law and AI governance in fostering responsible innovation. Through comparative legal analysis, this paper explores how liability structures influence AI governance, corporate accountability, and ethical compliance. It examines the EU AI Act's dual-axis risk classification and emerging governance models such as the OECD AI Principles and the G7 Hiroshima AI Process, with Series LLCs proposed as a novel approach to fluctuating AI risks. This paper addresses three key research questions: (1) Impact of AI risks on liability exposure for business participants. (2) Comparative analysis of liability protection in Japan and the U.S. (3) Role of Series LLCs and other legal structures in enhancing AI business. By integrating AI governance with corporate law, this study provides a theoretical foundation for aligning liability protection with AI risk landscapes, offering insights for lawmakers, policymakers, and AI business participants navigating global AI regulations.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cdec913f0d7284a80e80e661129bc688",
  "timestamp": "2025-05-15T02:55:44.524562"
}