{
  "id": 3497,
  "title": "Asymmetric effects and volatility transmission from metals markets to solar energy stocks: Evidence from DCC, ADCC, and quantile regression approach",
  "abstract": "Detrimental environmental repercussions have recently given rise to an interest in green investments. Although solar energy stocks are appealing assets for ethical investors, little is known about their dynamic correlations and linkages with metal (silicon, lithium, and rare earth) markets, particularly during economic events which is essential for hedging effectiveness and asset allocation. This study investigates the nexus between metal markets, oil price volatility (OVX), market sentiments (VIX), and solar energy markets using DCC, ADCC models, and the quantile regression approach. The results show both symmetric and asymmetric shock spillover between metals markets, VIX, OVX, and solar energy markets which are more prominent during COVID-19 pandemic, US-China trade frictions, and Russian invasion of Ukraine. For portfolio management, the hedging effectiveness of lithium stocks is highest, followed by silicon and rare earth metals. However, the hedge ratios are time-varying, and the variability is highest during US-China trade frictions. The quantile regression estimates reveal that lithium market is the most persistent determinant of solar energy stocks followed by silicon market even after segregating the periods into Paris Agreement and COVID-19 pandemic. Thus, lithium and silicon are driving markets of solar energy markets and can be a cause of omitted variable bias if stay unobserved. Nonetheless, there is little influence of VIX, rare earth metals, and OVX on solar energy stocks. Lastly, the estimations of threshold regression suggest that market sentiments change the association between metal markets and solar energy markets after the VIX reaches a certain threshold level.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cdf45a441d4673a2da91b83c73e45a5f",
  "timestamp": "2025-05-15T01:17:54.056008"
}