{
  "id": 8370,
  "title": "Epidemiology of Penile Fractures in United States Emergency Departments: Access to Care Disparities May Lead to Suboptimal Outcomes",
  "abstract": "Introduction: The epidemiology of penile fractures in the emergency setting is not well described. Aim: Examine the incidence, evaluation, management, risk factors predicting surgical repair or hospital transfer, and use of financial resources in patients presenting with penile fractures to the emergency departments (ED) nationwide in the Unites States. Methods: ED visits with a primary diagnosis of penile fractures (International Classification of Diseases, Ninth Edition codes) between 2010-2014 were abstracted from the Nationwide Emergency Department Sample. Main Outcome Measure: Penile fracture incidence, disposition, hospital, and clinical factors which were associated with immediate surgical repair or transfer to another institution, and cost were investigated. Results: 8,029 ED visits for penile fracture in the United States were observed, which represents a national incidence of 1.02 per 100,000 male subjects per year. No meaningful trends in incidence were observed over the 5-year period. 63.9% were treated non-surgically or discharged from the ED, 25.7% underwent surgical repair, and 10.3% were transferred to other institutions. Hospital factors which predicted surgical repair included Northeast region, teaching hospital status, trauma hospital status, high volume ED, and urban location. Clinical risk factors which predicted surgical repair included hypertension, smoking, alcohol dependence, drug abuse, erectile dysfunction, hematuria, urethral injury, and urinary retention. Factors leading to patient transfers included non-academic, rural and non-trauma hospitals, low economic income and low emergency department volume. In addition, weekend and spring presentation were associated with higher transfer rates, while summer presentation was associated with surgical repair. Clinical Implications: A large proportion of penile fractures are discharged from the ED, indicating possible health care access disparity. Strengths & Limitations: This is one of the first population-based study of penile fracture incidence, disposition, risk factors which predict surgery or transfer, and cost in the US ED setting. The unexpected high number of discharges may be a result of misdiagnosis; alternatively these data may reveal previously under-reported management patterns in the community. Conclusion: This large retrospective study of penile fractures in the US ED setting demonstrates a stable incidence of penile fractures presenting to the US emergency departments. A quarter of patients undergo immediate surgical repair, 10% are transferred to other institutions and 63.9% of patients are discharged home. The high proportion of ED discharges may be due to access to health care disparities. Copyright (C) 2019, International Society for Sexual Medicine. Published by Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ce106d5b0acfe0cd20d8360dbca69b98",
  "timestamp": "2025-05-15T03:18:19.518194"
}