{
  "id": 370,
  "title": "Analysis and design of financial data mining system based on fuzzy clustering",
  "abstract": "With the rapid development of the economy, a large amount of financial data will be generated during the continuous growth of enterprises. However, due to the explosive growth of the financial data range index, the use of machine learning methods to mine and analyse financial data is extremely important. Among them, accurate financial risk evaluation is an effective measure to prevent and resolve corporate financial crises. In this article, we use fuzzy clustering method to establish a financial risk early warning and evaluation model. Specifically, we use fuzzy C-mean (FCM), half-suppressed FCM, and interval FCM clustering algorithms-based state construction financial risk early warning and evaluation models, to give an evaluation from two aspects of corporate financial indicators and non-financial indicators system. In order to verify the feasibility and effectiveness of the fuzzy clustering algorithms used in financial data mining, we conducted experiments in financial data mining and early warning in real estate companies and ST companies. The experimental results show that the fuzzy clustering algorithms represented by the FCM clustering algorithm has achieved good results in financial data mining, and can achieve good results in financial risk analysis and financial risk early warning.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ce109330440349f995bd019addfc96fb",
  "timestamp": "2025-05-15T01:50:14.003862"
}