{
  "id": 3198,
  "title": "Material selection for eco-innovation: SPICE model",
  "abstract": "Achieving a sustainable society requires design practitioners to eco-innovate through material selection. Material selection resources are evolving, including physical material libraries, databases, software and tools that connect materials with designers. However, the material-properties focus of these resources risks over-rationalising material selection within the context of technical material properties. Material selection needs consideration of a broader material system, reflecting sectoral behaviour, stakeholders, legislation, access to knowledge and networks. In light of this, the aim of this research is to deepen understanding of ecodesign by investigating the role of key stakeholders during material selection for the development of eco-innovative products. The research method is an in-depth case study at a sustainability-focused furniture design business. Four embedded case studies of New Product Developments (NPD) are drawn from within the main case. The case study methods include interviews, site visits and observation activities spanning three years. The case studies uncover the role of stakeholders in eco-innovative material selection during New Product Development of office furniture. The paper presents eco-innovations based on standard portfolio materials and new material adoptions. Ecodesign strategies employed include (1) Design for Disassembly (2) Dematerialisation (3) Material Streamlining and (4) Part Reduction. The results uncover how the efficacy of ecodesign decision-making is strongly dependent on stakeholder knowledge, characterised by heuristics with conflicting trade-offs along product life cycles. From this the paper presents SPICE, a new conceptual model and material portfolio classification. By linking stakeholders, material selection, ecodesign and trade-offs, the SPICE model aids strategic design management and material selection for eco-innovation. (C) 2014 Elsevier Ltd. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ce2342fce10d8cab32b1efea4828d310",
  "timestamp": "2025-05-15T01:14:54.842867"
}