{
  "id": 2221,
  "title": "A multi-variable service supply management portfolio model for Telecom industry",
  "abstract": "Supply operations require some kind of classification according to the features of items. Based on the literature review and expert interview, a multi-variable service supply management portfolio model was developed to classify the procurable service items in the Telecom industry in a more realistic way with better precision. First, a multi-level relational reflective model was built based on four dimensions using the fuzzy Delphi method and the model was validated by factor analysis. Then, 50 service items were placed in 16 clusters of the portfolio model. For each category of services in the model, the pertinent supplier relationship management practices were proposed using the literature review accompanied by a focus group. The presented model contributed to the development of previous theoretical trends in supply management portfolio models by introducing a new dimension, called pace of innovation in technology, to those extracted from the literature review, such as strategic importance of the items, supply risk, and extent of buyer captivity. Despite the classical models targeting tangible goods and products, our model was customized for the service industry context and can be considered a starting point towards service supply market segmentation procedures according to the attributes of each service item category.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ce32652a57446a7da5046a707bc1bdae",
  "timestamp": "2025-05-15T01:04:27.465801"
}