{
  "id": 1773,
  "title": "Effectiveness of bank credit activity evaluation with application of economic and mathematic modeling",
  "abstract": "The paper presents data on the influence of the most significant factors having impact on the credit portfolio volume, as well as conducts correlation and regression analysis with the subsequent construction of the trend for a short period. Credit activity is understood as the bank activity in the formation of a credit portfolio. Considering the structure of the bank credit portfolio, it can be observed that it consists of credits granted by the bank particularly for legal entities, individuals and other banks. Herewith, it is necessary to understand that any decrease in the credit portfolio will adversely affect the financial stability and effectiveness of any commercial bank. Moreover, during crisis periods, the policy and practice of banks have been determined as quite aggressive and conducted as such with regard to interest rates. The dynamics of credit portfolio volume has been selected as an independent factor due to the reason that it can fully explain the current development situation and the effectiveness of the bank credit policy. Considering the dependent factors, their influence will be assessed by the credit portfolio volume indicator. The authors have distinguished the following ones among them: the volume of credits granted to individuals; the volume of credits granted to legal entities; the amount of overdue credits in the credit portfolio; bank investments in the securities; inflation; key rate.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ce494228566e20576b96f0ab796e71a4",
  "timestamp": "2025-05-15T00:59:23.017429"
}