{
  "id": 7853,
  "title": "Socially responsible investing: performance evaluation of BRICS nations",
  "abstract": "Purpose The study aims to contribute towards the sustainable development of financial systems, by testing the performance of socially responsible investing alternatives in emerging BRICS countries. The study outcomes give us an insight into viability of responsible financial decisions in contrast with the conventional style of investing. Design/methodology/approach The authors examine the performance of socially responsible indices of BRICS nations vis-a-vis respective conventional market indices using various risk-adjusted measures and conditional volatility measures. We further segregate the 12-year study period to crisis and non-crisis period particular to the respective country, as well as a common global financial crisis period to analyze the impact of market conditions in BRICS nations and observe the performance using dummy regression analysis. Conditional volatility of the stochastic index series is measured using ARCH-GARCH analysis. Fama Decomposition Model helps rank the index performance through the sub-periods. Findings Fama Decomposition Model helps us observe that while Brazil secures a position in top rankers consistently, it is India that ranks top during crisis period. With evidence of outperformance in terms of risk-return by SRI indices of BRICS countries through the overall period as well as through different market conditions, our study contributes to the positive literature on socially responsible investing. Research limitations/implications The study explores performance of SRI in BRICS and finds evidence of the sustainable investment to be non-penalizing to the investor, even as the performance trend remain distinct in the countries with same level of development. It has implications for the investors and asset managers to include responsible stocks, while for the companies and regulatory bodies to unite for better reporting and disclosures. Given the broad implications, future research is required to link the impact of various cultural, legislative and demographic factors on the level and performance of the socially responsible investment in BRICS nations. Practical implications The current study evaluating and comparing performances of the socially responsible investments in BRICS nations puts forth following implications for the different sectors of the society, especially in emerging countries: (1) BRICS organization - The association of five economic giants, having significant influence over global as well as regional affairs, can aim to orient the countries' efforts towards collective sustainable development by designing uniform SRI framework. (2) Investors - In the globalization era, the investor can gain from ethical cross border investments to diversification and country benefits. (3) Companies and regulatory bodies - Only voluntary or mandatory unified efforts, to provide accurate and consistent disclosures, can upscale the mediocre growth trends of sustainable investing in emerging economies. (4) Asset Managers - Call of greater role in educating, warding off inhibitions related to RI. Originality/value This is to certify that the research paper submitted by us is an outcome of our independent and original work. We have duly acknowledged all the sources from which the ideas and extracts have been taken. The project is free from any plagiarism and has not been submitted elsewhere for publication.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ce505299002d59acac97656a754eb118",
  "timestamp": "2025-05-15T03:12:36.542070"
}