{
  "id": 397,
  "title": "Design and Application of Financial Market Option Pricing System Based on High-Performance Computing and Deep Reinforcement Learning",
  "abstract": "The option pricing estimation of financial market can be transformed into the calculation of high-dimensional integrals. In order to obtain the actual price, option pricing system can only rely on modern numerical methods; on the other hand, the improvement of calculation methods and technologies has also shifted the focus of design and application of option pricing system from a strict closed model to a less advanced but computationally intensive calculation. High-performance computing can establish a reasonable analysis model, realistically simulate the effects of various designed performance and parameters, and provide technical support for a large number of fast numerical calculations and simulations. Deep reinforcement learning can obtain a description of empirical knowledge through the learning of historical information and use the acquired experience to deal with future problems, which can well solve classification problems, regression problems, and optimization problems. Therefore, based on summarizing and analyzing previous research results, this paper expounds the current research status and significance of the design and application of financial market option pricing systems, elaborates the development background, current status, and future challenges of high-performance computing and deep reinforcement learning, introduces the methods and principles of high-performance computing platform and deep reinforcement learning algorithm, conducts no-arbitrage pricing model design, performs risk-neutral pricing model design, discusses the design of finance market option pricing system based on high-performance computing and deep reinforcement learning, analyzes the financial market option pricing considering random interest rates, implements financial market option pricing considering transaction costs, explores the application of financial market option pricing system based on high-performance computing and deep reinforcement learning, and finally carries out empirical experiment and its result analysis. The study results show that the financial market option pricing system based on high-performance computing and deep reinforcement learning records the basic information of high-performance computer system users and option pricing information in the form of relational data in a relational database. The financial market option pricing system describes the state of the controller and the upcoming option pricing situation. The system's initialization uses multiple arrays from a stochastic strategy to initialize option pricing and evaluation buffers, which uniformly selects an option pricing from the initial option pricing set in each cycle. The study results of this paper provide a reference for further researches on the design and application of financial market option pricing system based on high-performance computing and deep reinforcement learning.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ce52562347d6d0d9a453a831c7e33f0b",
  "timestamp": "2025-05-15T01:50:14.091984"
}