{
  "id": 7180,
  "title": "Financial market models with Levy processes and time-varying volatility",
  "abstract": "Asset management and pricing models require the proper modeling of the return distribution of financial assets. While the return distribution used in the traditional theories of asset pricing and portfolio selection is the normal distribution, numerous studies that have investigated the empirical behavior of asset returns in financial markets throughout the world reject the hypothesis that asset return distributions are normally distribution. Alternative models for describing return distributions have been proposed since the 1960s, with the strongest empirical and theoretical support being provided for the family of stable distributions (with the normal distribution being a special case of this distribution). Since the turn of the century, specific forms of the stable distribution have been proposed and tested that better fit the observed behavior of historical return distributions. More specifically, subclasses of the tempered stable distribution have been proposed. In this paper, we propose one such subclass of the tempered stable distribution which we refer to as the KR distribution. We empirically test this distribution as well as two other recently proposed subclasses of the tempered stable distribution: the Carr-Geman-Madan-Yor (CGMY) distribution and the modified tempered stable (MTS) distribution. The advantage of the KR distribution over the other two distributions is that it has more flexible tail parameters. For these three subclasses of the tempered stable distribution, which are infinitely divisible and have exponential moments for some neighborhood of zero, we generate the exponential Levy market models induced from them. We then construct a new GARCH model with the infinitely divisible distributed innovation and three subclasses of that GARCH model that incorporates three observed properties of asset returns: volatility clustering, fat tails, and skewness. We formulate the algorithm to find the risk-neutral return processes for those GARCH models using the change of measure for the tempered stable distributions. To compare the performance of those exponential Levy models and the GARCH models, we report the results of the parameters estimated for the S&P 500 index and investigate the out-of-sample forecasting performance for those GARCH models for the S&P 500 option prices. (C) 2007 Elsevier B.V. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ce709ea5617068837d2291865bd68c96",
  "timestamp": "2025-05-15T03:06:01.197005"
}