{
  "id": 29,
  "title": "Nonlinear Volatility Risk Prediction Algorithm of Financial Data Based on Improved Deep Learning",
  "abstract": "With the gradual integration of global economy and finance, the financial market presents many complex financial phenomena. To increase the prediction accuracy of financial data, a new nonlinear volatility risk prediction algorithm is proposed based on the improved deep learning algorithm. First, the financial data are taken as the research object and the closing price is set as the prediction target. Then, the nonlinear volatility risk prediction model of the financial data is established through the wavelet principal component analysis noise reduction module and the long and short-term memory network (LSTM) module, and the nonlinear volatility trend is extracted from multiple financial data series to realize the nonlinear volatility risk prediction of the financial data. During the whole experiment, the time of the research method was less than 1.5 minutes. And for 1200 test samples, the average error of data risk prediction of the proposed method is 0.0217%. The average cost of the research method is 114.25 million yuan, which is significantly lower than other existing algorithms. Experimental results show that the research method can effectively predict the risk of financial data and is more suitable for the risk control early warning of Internet financial platform.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ce98d990d463b1514dd34146cbd592ef",
  "timestamp": "2025-05-15T01:33:11.269715"
}