{
  "id": 5440,
  "title": "Incidence of Elder Abuse in a US Chinese Population: Findings From the Longitudinal Cohort PINE Study",
  "abstract": "Background: Elder abuse (EA) is a global public health issue. However, no prior longitudinal research has quantified the incidence of EA, which is critical to understand risk factors and future prevention strategies. Methods: The study is based on a longitudinal cohort design. We followed 2,713 U.S. Chinese older adults who agreed to participate in the study within 2011 to 2015. A structured questionnaire was used to collect data regarding the 2-year incidence of EA and its subtypes. We employed multiple logistic regression analyses to examine the associations between the sociodemographic characteristics and incident EA. Results: The incidence of overall EA was 8.8% with 4.8% for psychological, 2.9% for financial, 0.5% for physical, 0.1% for sexual abuse, and 1.1% for caregiver neglect. Age, gender, duration of residence, language preference and health status change were associated with incident EA. Self-perceived worsened health was positively associated with overall EA (odds ratio [OR] 1.28 (1.01, 1.62). Women (OR 2.98 [1.10, 8.11]) and older individuals (OR 1.06 [1.00, 1.13]) had an increased risk of caregiver neglect. Older adults who have lived in the U.S. longer had a higher risk of financial exploitation (OR 1.02 [1.00, 1.05]). Individuals who prefer to speak Mandarin or English were more likely to experience EA (OR 2.08 [1.21, 3.58]) and sexual or physical abuse (OR 3.91 [1.01, 15.17]). No significant association was observed between education, income, marital status, number of children, country of origin, overall health, life quality, and incident EA. Conclusion: This study presents the first illustration of EA incidence in a longitudinal cohort study, the findings of which verify and challenge prior fundamental assumptions of risk factors associated with EA, and are relevant to future prevention strategies.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cea42c1eee46214cb692396822804f37",
  "timestamp": "2025-05-15T02:47:43.029548"
}