{
  "id": 5336,
  "title": "THE IMPACT OF INNOVATION STRATEGIES ON BUSINESS PERFORMANCE: PRACTICES IN HIGH TECHNOLOGY COMPANIES IN TURKEY",
  "abstract": "Innovation efforts aim to attain important competitiveness by improving performance criteria. It has led to very strong ties between innovation and performance, which is also accepted by the recent business understanding. The purpose of the current study, which is designed in compliance with this understanding, is to examine the effect of innovation strategies on business performance in enterprises using high technology. Innovation strategies consist of strategy, and analytical strategy. Business performance was measured as product performance, employee-based performance, customer-based performance, financial performance, and process performance. The study involved the innovation strategies and business performance scale developed by Morgan and Strong (1998), Chandy and Telis (1998), and Eskici (2020). The current study conducted a survey on 346 managers of companies operating in Turkey and using high technology. The obtained data were analyzed with the help of JAMOVI and SPSS 26.0 programs. Exploratory factor analysis, confirmatory factor analysis, Pearson correlation, and regression analysis methods were used in empirical analysis. The result determined that innovation strategies are effective on business performance. In other words, future-oriented strategy is effective on the product, customer-based, employee-based, financial, and process performances of enterprises. On the other hand, it was determined that future-oriented strategy and riskoriented strategy are not effective on enterprises' product, customer-based, employee-based, financial, and process performances. In addition, offensive, analytical, defensive, proactive, and risk-oriented strategies are ineffective in process performance. Analytical, defensive, future-oriented, and proactive strategies are effective on product performance, customer-based performance, and financial performance of businesses. As a result, it was determined that innovation strategies affect customer-based performance (R2=0.687) and financial performance (R2=0.701) of companies more.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ceafbcca5f84ad55310fa4778dfba54b",
  "timestamp": "2025-05-15T02:46:44.905326"
}