{
  "id": 5581,
  "title": "Serious life events and the risk of latent autoimmune diabetes in adults (LADA) and Type 2 diabetes",
  "abstract": "AimIt has been suggested that experiencing serious life events may promote Type1 diabetes in children. Studies in adults are lacking, as are studies on the interaction of life events with genetic factors. We aimed to investigate life events and the risk of latent autoimmune diabetes in adults (LADA) and Type 2 diabetes while taking into account HLA genotype. MethodsAnalysis was based on 425 incident cases of LADA, 1417 incident cases of Type 2 diabetes and 1702 population-based controls recruited in Sweden between 2010 and 2016. Self-reported information on life events including conflicts, divorce, illness/accidents, death and financial problems experienced during the 5years preceding diagnosis/index year was used. Odds ratios (ORs) and 95% confidence intervals (95% CI) were calculated by logistic regression and adjusted for age, sex, BMI, family history of diabetes, smoking, physical activity and education. ResultsOverall there was no association between experience of any life event and either LADA (OR 0.86, 95% CI 0.68-1.08) or Type2 diabetes (OR 1.00, 95% CI 0.83-1.21). The results were similar for individual events as well as in separate analysis of men and women. Similar results were seen in more autoimmune LADA (glutamic acid decarboxylase antibodies >median) [OR (any life event) 0.88, 95% CI 0.64-1.21] and in LADA carriers of the high-risk HLADR4-DQ8 genotype (OR 0.89, 95% CI 0.61-1.29). ConclusionsOur findings indicate that experience of a serious life event, including the death of a family member, divorce or financial problems, is not associated with an increased risk of LADA, overall or in genetically susceptible individuals.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cebd1fb6a907d92760d6b815e423a85a",
  "timestamp": "2025-05-15T02:49:21.645248"
}