{
  "id": 588,
  "title": "Prospects of Artificial Intelligence and Machine Learning Application in Banking Risk Management",
  "abstract": "Artificial intelligence and machine learning have increasing influence on the financial sector, but also on economy as a whole. The impact of artificial intelligence and machine learning on banking risk management has become particularly interesting after the global financial crisis. The research focus is on artificial intelligence and machine learning potential for further banking risk management improvement. The paper seeks to explore the possibility for successful implementation yet taking into account challenges and problems which might occur as well as potential solutions. Artificial intelligence and machine learning have potential to support the mitigation measures for the contemporary global economic and financial challenges, including those caused by the COVID-19 crisis. The main focus in this paper is on credit risk management, but also on analysing artificial intelligence and machine learning application in other risk management areas. It is concluded that a measured and well-prepared further application of artificial intelligence, machine learning, deep learning and big data analytics can have further positive impact, especially on the following risk management areas: credit, market, liquidity, operational risk, and other related areas.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cec35c9c518dbba189aabef035b05da4",
  "timestamp": "2025-05-15T01:52:49.458195"
}