{
  "id": 8615,
  "title": "Corporate derivatives use and firm value: conditional role of corporate governance",
  "abstract": "PurposeThis study aims to examine the effect of corporate derivatives use on firm value and how the corporate governance index modifies this relationship.Design/methodology/approachThe sample consists of 219 nonfinancial firms on the Pakistan Stock Exchange (PSX) from 2011 to 2019. The study used ordinary least square regression with year and industry dummies for estimations. Multiple estimation models such as fixed/random effect, Fama-MacBeth and two-stage least squares (2SLS) are used for robustness. Finally, the PROCESS macro tool is used to estimate the effect of moderating the role of corporate governance (CG) as robustness.FindingsThe findings show that derivatives use has an inverse influence on firm value. The firms did not use derivatives as a risk management tool but for speculation motives. However, the corporate governance index significantly weakens this relationship. However, strong governance forces the managers to use derivatives for hedging purposes. The firm-specific factors, including size, age, leverage, cash, financial distress cost, dividend and growth opportunities, also significantly influence firm value. The findings are robust to the other estimation models.Research limitations/implicationsThe findings indicate that emerging economies like Pakistan are more prone to agency problems. The strong corporate governance structure helps firms turn the speculative motive of derivatives use into hedging purposes and mitigate the agency issues.Practical implicationsThis empirical evidence suggests that good governance structures can help improve the impact of derivative usage on firm value.Originality/valueTo the best of the author's knowledge, this is the first study that examines the conditional role of corporate governance on the derivatives-value relationship from the viewpoint of agency problem/speculative motive.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cec6f8e3ea95eca432c8f33b031e0cd3",
  "timestamp": "2025-05-15T03:20:55.836408"
}