{
  "id": 2896,
  "title": "INFLUENCE OF FINANCIAL RISK ON VALUE CREATION IN THE FOOD INDUSTRY OF COMPANIES LISTED ON B3",
  "abstract": "Objective: To identify the influence of financial risk on value creation in the food industry of cornpanies listed on B3. Foundations: Risk is an inherent factor in companies' investment and debt decisions, with measurement methods and empirical models being discussed in the literature. It is known that business strategies can influence the reduction of asymmetries and the lower exposure of assets to systematic risk, which would result in a positive influence on the value creation. However, these assumptions lack empirical evidence, especially when focused on specific segments and that expose the individual characteristics of the companies. Method: From the approach of the relationship between risk and value creation, a regression analysis was used to verify the impact of risk on the value creation metrics in the food sector. The study was conducted based on economic and financial information, with data available between 2013 and 2018. The results were constructed using regression analysis with panel data, using the weighted least squares technique. Results: The analysis carried out showed that the risks present in the environment pertaining to companies established in the Food Sector and listed on Brasil Bolsa Balcao (B3) have a negative impact on the creation of value. In this context, the companies' operating and financial results are directly related to the creation of value through indicators such as EVA (R) and MVA (R). These indicators show the importance of operating results and management strategies that reduce asymmetries to decrease assets volatility which negatively impacts the value of companies. Contributions: Several surveys explore approaches to risk management and business return. This article shows that risk mitigation can maximize the creation of value. To this end, the implementation of improvements in aspects related to business governance, ethics and transparency as a strategy can reduce the asymmetries and the impact of risk in the food industry. The creation of value must be the main object of the financial management of a company and it is from the knowledge of the value of a business that it is possible to make several decisions.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ced91399299064b4d2689b7ca6b91213",
  "timestamp": "2025-05-15T02:20:16.932258"
}