{
  "id": 70,
  "title": "Credit Risk Assessment Model of Real Estate Enterprises Based on SVM",
  "abstract": "Scope Real Estate Enterprises, as the key of the nation's economy and the center of financial credit, play a multiple irreplaceable role in the financial system. Therefore, predicting financial credit risks of Real Estate Enterprises is crucial to prevent and lessen the incoming negative effects on the economic system. Objective: This study aims to apply a credit risk assessment model based on support vector machine (SVM) in a Chinese case, after analyzing the credit risk rules and building a credit risk index. After the modeling, this paper presents a comprehensive computational comparison of the classification performances of Back-Propagation Neural Network (BPNN) and SVM. Method: In this empirical study, we utilize statistical product and service solutions (SPSS) for the factor analysis on the financial data from the 130 companies and Mat lab and Libsvm toolbox for the experimental analysis. Conclusion: We compare the assessment results of SVM and BPN and get the indication that SVM is very suitable for the credit risk assessment of Real Estate Enterprises. Empirical results show that SVM is effective and more advantageous than BPN. SVM, with the features of simple classification hyperplane, good generalization ability, good accuracy, strong robustness, has a better developing prospect although there are still some problems, such as the space mapping of the kernels, the optimizing scale, and so on. They are worthy of our continued exploration and research.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cee0adc80dad77e3f3a9516fd9ea0365",
  "timestamp": "2025-05-15T01:46:39.483815"
}