{
  "id": 8764,
  "title": "Gender differences in longevity in free-living older adults who eat-with-others: a prospective study in Taiwan",
  "abstract": "Objectives Social activities such as 'eating-with-others' can positively affect the ageing process. We investigated the gender-specific association between eating arrangements and risk of all-cause mortality among free-living older adults. Setting A representative sample from the Elderly Nutrition and Health Survey in Taiwan during 1999-2000. Participants Some 1894 participants (955 men and 939 women) who aged >= 65 and completed eating arrangement question as well as confirmed survivorship information. Primary and secondary outcome measures Eating arrangements, health condition and 24-hour dietary recall information were collected at baseline. We classified eating arrangements as the daily frequency of eating-with-others (0-3). Survivorship was determined by the National Death Registry until the end of 2008. Cox proportional-hazards regression was used to assess the association between eating-with-others and mortality risk. Results Overall, 63.1% of men and 56.4% of women ate with others three times a day. Both men and women who ate with others were more likely to have higher meat and vegetable intakes and greater dietary quality than those who ate alone. The HRs (95% CI) for all-cause mortality when eating-with-others two and three times per day were 0.42 (0.28 to 0.61), 0.67 (0.52 to 0.88) in men and 0.68 (0.42 to 1.11), 0.86 (0.64 to 1.16) in women, compared with those who ate alone. Multivariable HRs (95% CI) adjusted for sociodemographic, nutritional and 'activities of daily living' covariates were 0.43 (0.25 to 0.73), 0.63 (0.41 to 0.98) in men and 0.68 (0.35 to 1.30), 0.69 (0.39 to 1.21) in women. With further adjustment for financial status, HR was reduced by 54% in men who ate with others two times a day. Pathway analysis shows this to be dependent on improved dietary quality by eating-with-others. Conclusions Eating-with-others is an independent survival factor in older men. Providing a social environment which encourages eating-with-others may benefit survival of older people, especially for men.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cf1feef96d66be85ac3e5e4712d5a360",
  "timestamp": "2025-05-15T03:22:25.961667"
}