{
  "id": 4348,
  "title": "A club convergence analysis of financial integration: cross-country evidence",
  "abstract": "PurposeThe purpose of this study is to examine the club convergence of Financial integration (FI) in the case of 60 countries from 1970 to 2015. FI plays a vital role in economic growth through sharing the risk between countries, cross-border capital association, investment and financial information. It also leads to the efficient allocation of capital and capital accumulation, thereby improving the systematic growth and productivity of the economy. Literature on examining the convergence hypothesis of FI is scarce. Design/methodology/approachThis study applies the clustering algorithm to identify club convergence, advanced by the Phillips and Sul test, which enables the identification of multiple steady states or club convergence, unlike beta and sigma convergences. FindingsThe findings indicate the non-convergence when all 60 countries were taken together. This highlights that the selected countries' have unique transition paths in terms of FI. Hence, the authors implement the clustering algorithm, and the estimation shows that 56 countries are categorised into three different clubs. However, for the rest of four countries, the results are sort of ambiguous, favouring neither convergence nor divergence. Practical implicationsOn the basis of three country clubs, Club 1 presents the model countries such as the Netherlands, Singapore and Switzerland. The Club 2 and Club 3 countries can start making moves towards the model countries by making policy adaptations for trade, finance and business facilitation. Originality/valueThe existing literature provides a plethora of studies investigating the convergence of stock markets, exchange rates and equity markets, but studies on the convergence of FI, particularly across the countries, are scarce. This study contributes by bridging this gap. The study is unique in its type as it takes into account the multiple steady states or club convergence. This study also contributes in policymaking by suggesting Club 1 countries (the Netherlands, Singapore and Switzerland) as the model ones for the FI.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cf3401739ab699d5b785bb9e45f37896",
  "timestamp": "2025-05-15T02:36:05.233767"
}