{
  "id": 4025,
  "title": "Exchange rate volatility in West African countries: is there a shred of Spillover?",
  "abstract": "Purpose The purpose of this paper is to evaluate selected West African currencies/US dollar exchange rates for the evidence of volatility spillover. Specifically, the paper examines West African CFA franc, Gambian dalasi and Nigerian naira exchange rates in relation to the USD, for any evidence of shock and volatility spillover. Design/methodology/approach The author employs multivariate GARCH (1,1)-BEKK model which enables the evaluation of the interaction within the volatility of two or more series because of its capability to detect volatility spillover among time series observations, as well as the persistence of volatility within each series. Findings The major findings of this study are as follows: there is evidence of volatility clustering in West African CFA franc, Gambian dalasi and Nigerian naira exchange rates in relation to the USD. There is evidence of bi-directional shock and volatility spillover between the Nigerian naira and West African CFA franc/USD exchange rates, and uni-directional shock spillover from the Gambian dalasi to the West African CFA franc/USD exchange rates. There is, however, no evidence of exchange rate shock and volatility spillover between Nigerian naira and Gambian dalasi. Originality/value Although considerable literature exists on the volatility of exchange rate in West Africa and comparative analysis of exchange rates volatility in few countries of West Africa, there is absence of empirical studies on exchange rate volatility spillover among countries in the region. Since containing exchange rate volatility is one of the major objectives of monetary policy, understanding the nature and direction of exchange rate volatility spillover would propel formulation exchange rate policies that would minimise exchange rate uncertainty and entrench sustainable development. In addition, the nature of exchange rate volatility spillover between West African countries would provide basis for international traders and foreign portfolio investors to develop effective strategies for hedging against exchange rate shocks that are propagated across countries by designing appropriate risk management techniques.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cf3e303ea53c2590858f3dd75ea7f911",
  "timestamp": "2025-05-15T01:23:07.374075"
}