{
  "id": 3993,
  "title": "Intellectual capital and the 'capable firm': narrating, visualising and numbering for managing knowledge",
  "abstract": "Intellectual capital statements are 'new' forms of reporting whose object is knowledge management activities. Based on 17 firms' work to develop intellectual capital statements, this paper analyses them as managerial technologies making knowledge amenable to intervention. Aspects of actor-network-theory are mobilised to suggest that the intellectual capital statement is a centre of translation, which mobilises knowledge management via three interrelated elements: knowledge narratives, visualisations and numbers. Intellectual capital statements report on the mechanisms put in place to make knowledge manageable. Writing intellectual capital is a local story, which often concerns making knowledge collective and a process of allowing it to be oriented towards organisational ends. In such a story, knowledge is about a firm's capabilities and abilities to make a difference to a user. When writing an intellectual capital statement, firms locate employees, customers, processes and technologies and orient them towards a user. However, the statement as such is a means of 'dis-locating' knowledge resources making them amenable to intervention. There are certain broad types of intervention that allows a classification of strategies of intervention to be proposed. These terms are portfolio management, improvement activities and productivity. Such forms of intervention circumscribe the aspiration to transform knowledge from something internal to the person into something that is the effect of a collective arrangement. They allow-through intellectual capital statements-the dark, tacit knowing of individuals to come into the open space of calculation and action at a distance. (C) 2001 Published by Elsevier Science Ltd.",
  "year": 2001,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cf5c990e8750f2df40d16dfe0d4cb5db",
  "timestamp": "2025-05-15T01:23:07.232016"
}