{
  "id": 7043,
  "title": "Loss of Autonomy: Likely Dementia and Living Arrangement Transitions Among Mexicans and Mexican Americans",
  "abstract": "Background and Objectives To examine the role of probable dementia on changes in living arrangements and mortality among very old Mexicans and Mexican Americans in 2 different nations. Research Design and Methods We employ the Hispanic Established Population for the Epidemiologic Study of the Elderly and the Mexican Health and Aging Study, 2 comparable longitudinal data sets, to identify predictors of changes in living arrangements using multinomial logistic regression, controlling for cognitive status, demographic characteristics, and resources. Results In Mexico, women with dementia who lived alone at baseline were more likely to become part of an extended family household than men with similar levels of cognitive impairment. A similar pattern emerges for the oldest Mexican-American women. Spousal loss increases the likelihood of living alone for women in the United States regardless of dementia. Although dementia elevates the risk of mortality for men living alone in the United States, in both countries, women in their 90s who lived alone with dementia had a lower risk of mortality relative to men. Discussion and Implications Longer life spans increase the risk of living alone with dementia in both countries, especially for women. Older individuals in both countries face financial hardships. Mexicans have limited formal options in dementia care. Mexican Americans with dementia continue to live alone despite low income although, unlike the Mexicans, they have access to Medicaid long-term care. For Mexico and the United States, the growing number of older individuals with dementia represents a growing public health concern.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cf6227a9276321764c1b4c8babd4fea9",
  "timestamp": "2025-05-15T03:04:23.027755"
}