{
  "id": 8263,
  "title": "Radiofrequency ablation (RFA) compared to observation for benign thyroid nodules: emerging considerations for judicious use",
  "abstract": "Purpose of review Radiofrequency ablation (RFA) for thyroid nodules confers tangible advantages over surgery, which include promising outcomes in the context of a minimally invasive procedure and the functional benefits of organ preservation. However, the ubiquity of benign nodules worldwide may spur the risk of misuse in cases where there is negligible gain over conventional surveillance. This review summarizes new developments in RFA and examines its judicious utilization in benign nodules. Recent findings RFA appears to be safe and effective for addressing compressive or cosmetic issues caused by benign functional and nonfunctional thyroid nodules. Volume regression occurs over 12 months, with some cases requiring multiple staged RFA procedures to achieve adequate shrinkage or to address regrowth. Complication rates including recurrent laryngeal nerve injury are reportedly low and are mitigated by strategic technical maneuvers, training, and experience. Consensus guidelines across international societies have emerged to better define appropriate patient candidates. Although association of overuse in analogous disciplines has been well established, no evidence of misuse in thyroid RFA has been described thus far. Compelling multi-institutional data support RFA as first-line treatment for select benign thyroid nodules. Defining the nuances of patient selection and long-term surveillance are necessary to substantiate current observed results. Given the high incidence of thyroid nodules worldwide, it is important to emphasize that the majority of benign nodules will not require any intervention. Thorough consideration and careful implementation of recommended guidelines will hopefully lead to measurable benefit and avoid financial misuse.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cf66559143b6f11680cc7b1e91860f17",
  "timestamp": "2025-05-15T03:17:21.426143"
}