{
  "id": 7255,
  "title": "Pension insurance contributions and corporate financialization: evidence from China",
  "abstract": "Purpose This paper aims to investigate the impact of a firm's pension insurance contributions (PIC) on its financialization (investment in risky assets) using a sample of Chinese firms. Design/methodology/approach The authors use a multiple regression model to conduct the analysis. Findings The findings suggest that a firm's PIC increases its financialization. Additional analysis suggests that firms with higher PIC are more likely to have lower operating profit and higher financial risk. In addition, the impact of PIC on financialization is more salient when a firm faces high industry competitiveness, holds more cash, has high labor costs and labor intensity or is non-state owned. Practical implications The paper adds to the growing literature on the effect of social insurance on corporate policies. The findings complement those related to the relationship between defined contributions and defined benefits retirement plans and corporate policies. Social implications The study contributes to the debate on the merits of financialization. The literature is mixed on the pros and cons of financialization. The results suggest that financialization has an adverse effect on a firm's performance and risk in the lens of increased PIC. Originality/value China has seen a trend of financialization arising from the rapid economic development in the past decade. Moreover, the PIC premiums in China are not trivial. Thus, the significant cost of PIC and the financialization trend suggest that the answer to the research question is timely and meaningful.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cf6ad8b225ea30640f65396e662fe754",
  "timestamp": "2025-05-15T03:06:35.443965"
}