{
  "id": 7845,
  "title": "Malnutrition screening in hospitalised patients and its implication on reimbursement",
  "abstract": "Background: Several studies have cited the incidence of malnutrition in hospitals, which is correlated to negative clinical outcomes, to be up to 60%. Data in Singapore, however, are scarce. Its impact on casemix funding is not known. Aims: The aims of the present study were to determine the prevalence of malnutrition, the predisposing risk factors and the impact of documentation and coding of malnutrition on casemix funding in a local population in Singapore. Methods: Patients admitted to selected wards over a 1-month period were screened for malnutrition. Those at risk were further assessed using subjective global assessment. Logistic regression was used to ascertain the impact of identified factors on malnutrition. Financial impact analysis of coding of malnutrition as a comorbidity was carried out and tested with Wilcoxon signed rank tests. Results: Six hundred and fifty-eight patients were eligible for screening. The overall prevalence of malnutrition in the selected wards was 14.7% (95% confidence interval (CI): 12.0-17.4%). Old age, the occurrence of cancer and the admitting unit were statistically significant in explaining the occurrence of malnutrition. Coding of malnutrition was found to significantly increase the complexity of 24 of 105 episodes (22.9%) of patient care as measured by expected cost weights (P < 0.001) and expected lengths of stay (P < 0.001). As a result, the expected financing for these 24 patients increased by 59.7%. Conclusions: Malnutrition is prevalent in hospitalised medical and surgical patients. Certain clinical factors should heighten awareness and prompt detection for malnutrition. Coding for malnutrition impacts favour-ably on casemix funding for a subset of malnourished patients.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cf83e33d24d0e0cec94efa0220ea0a8d",
  "timestamp": "2025-05-15T03:12:36.532048"
}