{
  "id": 824,
  "title": "Guidelines for the management of hypertension at primary health care level",
  "abstract": "Objective. To outline rational and cost-effective comprehensive management of hypertension by health care professionals in a primary care setting. Outcomes. Control of hypertension with a target blood pressure (BP) of systolic 140 - 159 mmHg, diastolic 90 - 94 mmHg with minimal or no drug side-effects. Reduce BP in the elderly and those with severe hypertension gradually. Stricter BP control is required for patients with end-organ damage, coexisting risk factors, diabetes mellitus. Extensive data including many randomised controlled trials showed the benefit of controlling hypertension. This evidence is reported in Opie L. H. and Steyn K., Rationale for the hypertension guidelines for primary care in South Africa, S Afr Med J 1995; 85: 1325-1338. Values. To treat as many of the untreated hypertensive patients as possible, using rational and cost-effective care. Cost-effectiveness and access to therapy are major issues. Benefits, harms and costs. Reduction in stroke, cardiac failure, renal failure and coronary artery disease. The major precautions and contraindications to each antihypertensive drug recommended are listed. The financial costs of the drugs are considered. Recommendations. Correct BP measurement procedure. Identification of blood pressure levels for appropriate management. Evaluation of other cardiovascular risk factors and their influence on when to treat hypertension. Lifestyle modification and patient education for all patients. Drug therapy: first line - low-dose diuretics; second line - reserpine or beta-blockers or AGE inhibitors or calcium channel blockers; third line - hydralazine or prazosin or another second-line drug. Drug treatment and referral of specific cases (pregnancy, diabetes mellitus, severe hypertension). Validation. Developed by the Hypertension Society of Southern Africa Executive Committee and co-opted persons during 1995, with added input from HSSA members at the National Congress. Endorsed by the Medical Association of South Africa. Sponsors. The meetings of the HSSA Executive Committee and co-opted persons were predominantly funded by Pfizer Laboratories and Astra Pharmaceuticals.",
  "year": 1995,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cf8dfc50d51aaecf959a3b02a6db4927",
  "timestamp": "2025-05-15T01:43:20.506527"
}