{
  "id": 6142,
  "title": "Adverse childhood experiences (ACEs) and suicidal behaviors in emerging adulthood: The 1993 Pelotas birth cohort",
  "abstract": "Background: Suicide is the second most common cause of death among young individuals (10-25 years). The risk of first occurrence of suicidal behavior increases significantly at the start of adolescence, highlighting the importance of research regarding the association between early life factors, such as adverse childhood experiences (ACEs), and suicidal behaviors. Objective: To assess if ACEs are prospectively associated with lifetime suicide attempt and suicidal thoughts at young adulthood. Participants and Setting: Data from 3050 young adults from the 1993 Pelotas Birth Cohort. Methods: Discrimination (of any type), financial hardship, maternal common mental disorders (CMD - SRQ-20), parental death, parental divorce and physical abuse were assessed at the 11year follow-up. Data regarding suicidal thoughts and suicide attempt was assessed at 22 years with Mini International Neuropsychiatric Interview (MINI), version 5.0. Crude and adjusted logistic regression models were estimated. Results: In the adjusted model, those who suffered financial hardship (OR 2.51; 95 % CI 1.66-3.79), parental divorce (OR 1.44; 95 % CI 1.02-2.04) and maternal CMD (OR 1.72; 95 % CI 1.21-2.46) at 11 years were more likely to report suicidal thoughts at 22 years. Also, those who experienced financial hardship (OR 1.71; 95 % CI 1.13-2.58), physical abuse (OR 1.48; 95 % CI 1.08-2.04), discrimination (OR 1.74; 95 % CI 1.20-2.51), maternal CMD (OR 1.67; 95 % CI 1.20-2.32), or parental divorce (OR 1.41; 95 % CI 1.02-1.94) were more likely to report a lifetime suicide attempt. Conclusion: There was a strong association between financial hardship, maternal CMD and divorce during childhood, and suicidal thoughts, such as suicidal ideation or planning, at the beginning of adulthood. Financial hardship, discrimination, divorce, maternal CMD and physical abuse were associated with suicide attempt. These findings demonstrate that mental health support must be available following certain ACEs during childhood, alongside with ACEs prevention. More research is needed on the association between discrimination and suicide attempts, differentiating the nature and impact of each type of discrimination.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cf96149ada4be7658c61da4b949b1bd6",
  "timestamp": "2025-05-15T02:55:12.921761"
}