{
  "id": 2212,
  "title": "Performance of negatively screened sustainable investments during crisis",
  "abstract": "We investigate the market performance of negatively screened environment social and governance (ESG) portfolio or sustainable investments prior to and during crisis. A general and simple method is developed under the ESG Capital Asset Pricing Model (CAPM) framework for the assessment. The novelty is that this method can be employed when the parent portfolio is not a market portfolio. In this situation, both coefficients, alpha and beta, in the reduced form of regression have special interpretations and are informative. This paper examines 24 negatively screened ESG indices from the S&P, DJSI and MSCI data across various regions, firm sizes, and criteria of screening, for 2017 to 2021. Markov Switching Autoregressive (MSAR) model is adopted to identify the crisis regime. Our results show that the negatively screened ESG indices provide positive investors' surpluses for ESG-motivated investors during the crisis, when the corresponding parent indices are the market portfolios. For ESG investments where market portfolios are not their parent indices, half of ESG indices under consideration still provide positive surplus with similar systematic risks as their parent indices during the crisis. The remaining ESG indices under-performs but has relatively lower systematic risks, implying resilience as compared to the corresponding parent indices during the crisis. Furthermore, we demonstrate the sensitivity analysis of treating a parent index as a market portfolio.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cfb6546b3663ac146304fc80e25ea1ed",
  "timestamp": "2025-05-15T01:04:27.436485"
}