{
  "id": 3270,
  "title": "Financial reporting quality of ESG firms listed in China",
  "abstract": "Given the growing importance of environmental protection in China, this study investigated the determinants of the financial reporting quality of environmental, social and governance (ESG) firms listed in China. The quality of financial reporting shows how informative the accounting numbers are for decision-making. Because business outlook can influence financial reporting quality, this study examined predictable, moderately predictable and unpredictable business outlooks. The study randomly selected 100 firms from the 2021 China ESG Top 500 Outstanding Enterprises published by the Sina Finance ESG Rating Centre and then analysed those firms in 2018, 2019 and 2020. It investigated determinants (financial health, governance and earnings management), controlling for the influence of known variables (firm age and firm-specific risk) on financial reporting quality measured as accruals quality and earnings smoothness. Ordinary robust least square regression was conducted. Financial health had a negative influence, but governance variables and earnings management did not affect financial reporting quality. Firm-specific risk had a positive effect, but firm age did not influence financial reporting quality. Changes in business outlook had no impact on the determinants' effect on financial reporting quality. The study found that ESG firms did not engage in earnings management and aggressively manage earnings, pointing to ethical behaviour. This is the first study to contribute to understanding the financial reporting quality of ESG firms listed in China. It examined different business outlooks to understand ESG firms' behaviour towards financial reporting quality. The findings invite replicable studies outside China to understand the contextual validity and reliability of the financial reporting quality of ESG firms, and to investigate the effect of determinants not examined in this study.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cfc3993174ed911cb9ecc8c1f01595a9",
  "timestamp": "2025-05-15T02:24:39.572063"
}