{
  "id": 2677,
  "title": "Automated Feature Engineering for Fraud Prediction in Online Credit Loan Services",
  "abstract": "Internet finance fraud is an increasingly serious social and economic problem. Online loan services are a typical mode of Internet finance. Constructing machine learning models has become a promising solution for Internet financial anti-fraud. In the process of constructing a fraud detection model, feature engineering is the most critical step. The quality of features directly affects the performance of models. It is also one of the most time-consuming and customized steps. The existing Internet finance anti-fraud model is mainly carried out by experts using manually constructed features based on business knowledge. However, this artificial feature construction method is time-consuming and labor-intensive in the ever-changing Internet finance scenarios, and it has the disadvantages of missing complex features. Artificial feature construction methods can no longer meet the increasing demand for anti-fraud. Automated feature engineering is a promising solution for efficiently constructing anti-fraud models. To evaluate fraud risk for online loan services, this paper proposes an automated feature engineering method based on deep feature synthesis and feature selection, which can be easily cooperated with the current mainstream machine learning models. This method reduces the scale of synthesized features by dividing the original data table into small parts. Combined with the designed feature selection strategy, the method picks out important features from a large number of redundant and meaningless synthesized features. Experiments indicate that our method can improve the efficiency of feature construction and select important features for anti-fraud models.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cfc410aef40947d479d1e4f6e6599e0d",
  "timestamp": "2025-05-15T02:18:06.150232"
}