{
  "id": 6001,
  "title": "Risk governance and performance: a developing country perspective",
  "abstract": "Purpose - The purpose of this paper is to investigate the association between risk governance and bank performance in a country where disclosure of risk information is virtually voluntary. Design/methodology/approach - Using 210 bank-year observations comprising hand-collected data for the period 2006-2012, the study uses regression analysis to test whether a significant relationship exists between risk governance and banks' accounting-and market-based performance. Findings - This paper investigates risk governance in terms of risk disclosure, number of risk committees and existence of a risk management unit, controlling for other corporate governance variables. Accounting-based performance is measured by return on equity and return on assets; market-based performance is measured by Tobin's q and buy-and-hold returns. The results show that there is a significant relationship between risk governance and bank performance measures used in this study. Research limitations/implications - This paper complements the governance literature by incorporating agency and neo-institutional theory to provide robust evidence that risk monitoring and management are associated with bank performance, which has become extremely important following the global financial crisis (2007-2008). Practical implications - Empirical evidence in this paper suggests that risk governance characteristics can be used as channels to improve bank performance. In addition, stakeholders may find these results useful in selecting their preferred bank. Originality/value - The uniqueness of this paper lies in its country setting. Most studies on governance and performance involve developed countries. This paper's contribution is to examine the association of risk governance characteristics for both accounting-based and market-based performance in a developing economy setting, with virtually voluntary compliance mechanisms in place.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cfd73e2cd1dac529767b27069b73319f",
  "timestamp": "2025-05-15T02:53:33.480315"
}