{
  "id": 3530,
  "title": "Multi-hazard risk assessment of highway bridges subjected to earthquake and hurricane hazards",
  "abstract": "This paper presents a Parameterized Fragility based Multi Hazard Risk Assessment (PF-MHRA) procedure risk for assessment of a portfolio of highway bridges subjected to earthquake and hurricane events. As a part of this approach, parametric bridge fragility functions are generated for the two hazards, which are an advance over conventional fragility curves as they can be used for bridges with different geometric and structural properties given exposure to different hazard types. The parametric bridge fragility functions are derived using metamodels and stepwise logistic regression with a non-linear logit function. The relative change in hurricane and earthquake fragilities of the bridges is captured by the parametric fragility functions given variation in design details or geometric parameters of the bridges. These fragility functions are combined with regional hazard data to evaluate annual risk, which is measured as the annual probability of damage. For this purpose, hazard input parameters are identified for earthquakes and hurricane events and a new risk assessment procedure for bridges subjected to hurricane wave and surge loading is also developed. Furthermore, coupling of the risk assessment procedure with parameterized fragilities enables a comparative assessment of the contributions of different hazards to the total risk as the bridge details differ in a portfolio. The proposed framework is applied to multi-span simply supported concrete girder bridges located in South Carolina. The application demonstrates the identification and derivation of input models for the multi-hazard risk assessment for earthquakes and hurricane induced storm surge and wave loading. By applying the proposed method, insights are gained on the influence of different bridge geometries and hazard exposure conditions to the risk of bridge damage. The potential of the proposed procedure to serve as an aid to risk based design of bridges is also highlighted. (C) 2014 Elsevier Ltd. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cff116d1637a5f9ec5c3eda644fabcb0",
  "timestamp": "2025-05-15T01:17:54.202581"
}