{
  "id": 3564,
  "title": "Investigating the Condition and Flood Effects of Undocumented Levees, A Case Study Within the Waimea Floodplain",
  "abstract": "Levees play a crucial role in flood protection, but globally, there is a need for more knowledge about levee networks and their flood routing effects. Without complete knowledge, the question arises: 'What is the flood risk associated with an unknown or partially known levee portfolio?' Unknown or undocumented levees can be maladaptive and undermine system resilience. However, current literature often does not acknowledge undocumented levees, assuming all assets are known. A greater understanding would provide insight into present vulnerabilities and enable more complete management of our flood protection systems, reducing communities' risk. Our research assessed the physical condition of two undocumented levees in a case study. Computational flood modelling then simulated (1) their present condition, (2) their removal and (3) their reconstruction to a good physical condition. This determined their effect on inundation area and building damages, allowing their classification. The undocumented levees in the case study were significantly degraded, leading to an insignificant impact on flood routing and flood damages in their present state. However, if reconstructed, the levees could be valuable if the surrounding land were developed. More broadly, this study illustrates the importance of identifying and integrating undocumented levees into network modelling and maintenance.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "cff56e96c60ad21fe52cf67edabaf16c",
  "timestamp": "2025-05-15T01:18:20.563415"
}