{
  "id": 9020,
  "title": "The rate of euploid miscarriage is increased in the setting of adenomyosis",
  "abstract": "STUDY QUESTION: Does the rate of miscarriage increase in the setting of adenomyosis independent of other known risk factors for miscarriage such as maternal age, BMI, embryo genetic status? SUMMARY ANSWER: Adenomyosis and high BMI both significantly increase miscarriage risk independent of each other, maternal age and embryo health. This study is the first to suggest that ultra-long down regulation GnRH agonist treatment may reduce the rate of early pregnancy loss in adenomyosis patients. WHAT IS KNOWN ALREADY: The presence of adenomyosis is known to be associated with lower rates of successful implantation and increased risk of early pregnancy loss. However, it is presently unclear whether this reproductive impairment is directly mediated by adenomyosis itself, or indirectly caused by adenomyosis association with known risk factors for miscarriage such as obesity and advancing maternal age/foetal aneuploidy. STUDY DESIGN, SIZE, DURATION: A retrospective cohort study was undertaken in a private infertility (IVF) clinic examining the outcome for women (n = 345) undergoing the transfer of a genetically screened frozen-thawed embryo between 2012 and 2015. PARTICIPANTS/MATERIALS, SETTING AND METHOD: A total of 171 women who successfully conceived (positive serum fihCG) following the transfer of a single euploid good morphology frozen-thawed embryo were included in analysis after meeting the inclusion criteria. Only the first conception cycle for each patient was included in the study. Patients with known pre-existing medical risk factors for miscarriage (e.g. thrombophilia, poorly controlled diabetes, coeliac disease, SLE, uterine septum, chromosomal abnormalities) and those women undergoing treatment using donated oocytes and surrogacy were excluded. Patients were then classified as having adenomyosis or not based on a high-quality pelvic ultrasound or MRI. The direct and indirect effects of adenomyosis and BMI on overall miscarriage rate by 12 weeks gestation was then assessed using multivariate logistic regression and mediation analysis. Furthermore, the data were also analysed to elucidate the influence of GnRH ultra-long down-regulation therapy on miscarriage rates. MAIN RESULTS AND ROLE OF CHANCE: Overall, the adjusted rate of miscarriage was higher in those patients with adenomyosis compared to those without (44.1 vs 15.3%, P < 0.0001), with most of these miscarriages occurring at the early biochemical stage. The rate of miscarriage was especially high in adenomyosis patients not receiving GnRH agonist pre-treatment (82.4%), compared to those patients who did receive GnRH pre-treatment (35.7%, P = 0.0089). LIMITATIONS, REASONS FOR CAUTION: The study is mainly limited by its small sample size and retrospective design which carries inherent potential for bias (i.e. misclassification and errors due to inadequate clinical notes). The small sample size precluded analysis to distinguish how the extent of adenomyosis disease may modify miscarriage risk (i.e. focal or diffuse disease). Furthermore, the relatively low number of adenomyosis patients not receiving GnRH agonist treatment, plus the non-randomized nature of the decision not to offer such treatment, precludes definitive conclusions on the benefit of GnRH agonist therapy to reduce miscarriage risk. WIDER IMPLICATIONS OF THE FINDINGS: Considering the significant emotional and financial impact of miscarriage, we suggest screening of all women undergoing IVF treatment for the presence of adenomyosis, with consideration given to ultra-long down regulation GnRH agonist treatment in any woman identified as having adenomyosis. Furthermore, given the persistent and often progressive nature of the disease, adenomyosis should also be considered as a potential uterine cause of recurrent miscarriage. Finally, we hope our study highlights the need for high-quality prospective RCT to be undertaken to provide superior evidence for the potential benefit of GnRH agonist pretreatment.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d003b13754d50793881cedb8e25821a1",
  "timestamp": "2025-05-15T03:24:54.876606"
}