{
  "id": 6532,
  "title": "Barriers and facilitators to medical care retention for pediatric systemic lupus erythematosus in South Africa: a qualitative study",
  "abstract": "Background Systemic lupus erythematosus (SLE) is a life-threatening, chronic, autoimmune disease requiring long term subspecialty care due to its complex and chronic nature. Childhood-onset SLE (cSLE) is more severe than adult-onset, and the cSLE population in South Africa has been reported to have an even higher risk than patients elsewhere. Therefore, it is critical to promptly diagnose, treat, and manage cSLE. In this paper, we aim to describe and evaluate barriers and enablers of appropriate long-term care of cSLE South Africa from the perspective of caregivers (parents or family members).Methods Caregivers (n = 22) were recruited through pediatric and adult rheumatology clinics. Individuals were eligible if they cared for youth (<= 19 years) who were diagnosed with cSLE and satisfied at least four of the eleven ACR SLE classification criteria. Individual in-depth, semi-structured interviews were conducted between January 2014 and December 2014, and explored barriers to and facilitators of ongoing chronic care for cSLE. Data were analyzed using applied thematic analysis.Results Four barriers to chronic care engagement and retention were identified: knowledge gap, financial burdens, social stigma of SLE, and complexity of the South African medical system. Additionally, we found three facilitators: patient and caregiver education, robust support system for the caregiver, and financial support for the caregiver and patient.Conclusion These findings highlight multiple, intersecting barriers to routine longitudinal care for cSLE in South Africa and suggest there might be a group of diagnosed children who don't receive follow-up care and are subject to loss to follow-up. cSLE requires ongoing treatment and care; thus, the different barriers may interact and compound over time with each follow-up visit. South African cSLE patients are at high risk for poor outcomes. South African care teams should work to overcome these barriers and place attention on the facilitators to improve care retention for these patients and create a model for other less resourced settings.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d008b4252355cbea0a1e3e479e7fa52a",
  "timestamp": "2025-05-15T02:59:07.507374"
}