{
  "id": 7858,
  "title": "A framework for quality improvement: An analysis of factors responsible for improvement at hospitals participating in the Can Rapid Risk Stratification of Unstable Angina Patients Suppress Adverse Outcomes with Early Implementation of the ACC/AHA Guidelines (CRUSADE) quality improvement initiative",
  "abstract": "Background Hospitals are under increasing pressure to improve their quality of care. However, a key question remains: how can hospitals best design and implement successful quality improvement (Ql) programs? Hospitals currently employ a variety of Ql initiatives but have little empirical evidence on which to base their quality efforts. Methods We designed and applied a hospital cross-sectional survey to 212 hospitals participating in CRUSADE (Can Rapid Risk Stratification of Unstable Angina Patients Suppress Adverse Outcomes with Early Implementation of the American College of Cardiology/American Heart Association Guidelines), a voluntary Ql initiative of patients with non-ST-segment elevation acute coronary syndromes (NSTE ACS). We factor analysis and an ordinary least squares regression model to determine the key hospital factors most associated with unexpected improvements in institutional Ql in the treatment of NSTE ACS. Results From 2002 to 2004, the following factors had a significant association with unexpected increases in the 2004 Ql in NSTE ACS treatment: the use of CRUSADE Q tools, clinical commitment to quality by a cardiology coadvocate, institutional financial commitment to quality, and barriers to Ql related to resource availability and cultural resistance to change (all P <.10). Of these factors, optimal use of CRUSADE Ql tools was associated with the highest absolute improvement in process adherence score relative to other factors. Conclusions We identified several institutional factors associated with improved quality of care in the treatment of high-risk NSTE ACS. We hope that this evidence-based framework will help guide the development and implementation of future Ql programs in order to improve the institutional quality of care for NSTE ACS.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d00b364ee88862fa4d5e537fa20199f4",
  "timestamp": "2025-05-15T03:12:36.555139"
}