{
  "id": 7865,
  "title": "Chronic Obstructive Pulmonary Disease and US Workers: Prevalence, Trends, and Attributable Cases Associated With Work",
  "abstract": "Introduction: Chronic obstructive pulmonary disease is the fourth leading cause of death in the U.S. Workplace exposures are important modifiable contributors to the burden of chronic obstructive pulmonary disease. Among U.S. workers, 19% of chronic obstructive pulmonary disease cases are attributable to workplace exposures. This study examines the trends in chronic obstructive pulmonary disease prevalence during 2012-2018 among workers and assesses the population attributable fraction for chronic obstructive pulmonary disease associated with work by smoking status, industry, and occupation. Methods: The 2012-2018 National Health Interview Survey data for workers aged >= 18 years employed during the 12 months before the interview were analyzed in 2019. Annual trends were examined using the Poisson regression model. Multivariate logistic regression was used to calculate adjusted prevalence ORs. Results: During 2012-2018, an estimated age-adjusted annual average of 4.1% of workers had chronic obstructive pulmonary disease, and prevalence varied by industry and occupation. Overall, chronic obstructive pulmonary disease prevalence increased by an estimated annual average of 1.5% (p<0.05). The prevalence trends increased significantly among workers in the merchant wholesale nondurable and the arts, entertainment, and recreation industries and among financial specialists; supervisors, other food services workers; supervisors, building grounds workers, and maintenance workers; personal care and services workers; supervisors and office and administrative support workers; and motor-vehicle operators and material moving workers. The proportion of chronic obstructive pulmonary disease cases attributable to work was 27.3% among all workers and 24.0% among never smokers. Conclusions: Public health efforts to increase the awareness and understanding of chronic obstructive pulmonary disease associated with occupational risk factors are needed to prevent chronic obstructive pulmonary disease among workers, especially among those employed in industries and occupations with increasing prevalence trends. Published by Elsevier Inc. on behalf of American Journal of Preventive Medicine.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d025fdd983907895f2ecbda48ec399ba",
  "timestamp": "2025-05-15T03:13:04.856150"
}