{
  "id": 3728,
  "title": "Data-Driven Digital Twins for Technical Building Services Operation in Factories: A Cooling Tower Case Study",
  "abstract": "Cyber-physical production systems (CPPS) and digital twins (DT) with a data-driven core enable retrospective analyses of acquired data to achieve a pervasive system understanding and can further support prospective operational management in production systems. Cost pressure and environmental compliances sensitize facility operators for energy and resource efficiency within the whole life cycle while achieving reliability requirements. In manufacturing systems, technical building services (TBS) such as cooling towers (CT) are drivers of resource demands while they fulfil a vital mission to keep the production running. Data-driven approaches, such as data mining (DM), help to support operators in their daily business. Within this paper the development of a data-driven DT for TBS operation is presented and applied on an industrial CT case study located in Germany. It aims to improve system understanding and performance prediction as essentials for a successful operational management. The approach comprises seven consecutive steps in a broadly applicable workflow based on the CRISP-DM paradigm. Step by step, the workflow is explained including a tailored data pre-processing, transformation and aggregation as well as feature selection procedure. The graphical presentation of interim results in portfolio diagrams, heat maps and Sankey diagrams amongst others to enhance the intuitive understanding of the procedure. The comparative evaluation of selected DM algorithms confirms a high prediction accuracy for cooling capacity (R-2 = 0.96) by using polynomial regression and electric power demand (R-2 = 0.99) by linear regression. The results are evaluated graphically and the transfer into industrial practice is discussed conclusively.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d035492a03507e2b44f64d20448d9528",
  "timestamp": "2025-05-15T01:20:03.610874"
}