{
  "id": 8202,
  "title": "Worry in Head and Neck Cancer Caregivers The Role of Survivor Factors, Care-Related Stressors, and Loneliness in Predicting Fear of Recurrence",
  "abstract": "Background: Fear of recurrence (FOR) is a primary concern for both cancer survivors and their caregivers, yet little is known about what care-related factors exacerbate this worry. Objectives: This study aimed to establish the role of care-related stressors-as distinct from survivor characteristics-in predicting FOR in head and neck cancer caregivers. Methods: HNC survivor-caregiver dyads took part in a mailed survey. Survivors provided information on health and quality of life (using the Functional Assessment of Cancer Therapy Questionnaire). Caregivers provided sociodemographic information, impact of caring on their time and finances, as well as their level of social support (Oslo Support Scale), loneliness (3-point loneliness scale), and completed the Worry of Cancer Scale (to measure FOR). Results: Data from 180 dyads were available for analysis. Multiple regression analysis was used to examine the role of caregiver stressors, social support, and loneliness while controlling for caregiver and survivor characteristics. The model explained 28% of the variance in Worry of Cancer scores (FOR). Caregivers who reported more loneliness, spent more time caring, and had greater financial stress from caring had higher scores on Worry of Cancer (FOR). Female caregivers, those caring for younger survivors, and those with survivors who had undergone less extensive forms of surgery also reported higher FOR. Discussion: A combination of factors place caregivers at greater risk of cancer-related worry, paving the way for designing interventions aimed at reducing FOR in caregivers of patients with head and neck cancers.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d036d1dfa74067d286ddf80ad73c5df1",
  "timestamp": "2025-05-15T03:16:17.447763"
}