{
  "id": 4660,
  "title": "Him Leaving Me - That is My Fear Now: A Mixed Methods Analysis of Relationship Dissolution Between Ugandan Pregnant and Postpartum Women Living with HIV and Their Male Partners",
  "abstract": "High rates of relationship dissolution among pregnant women living with HIV (PWLHIV) and their male partners might increase mothers' and children's vulnerability to financial hardship and poor health outcomes. This mixed methods analysis identified factors associated with separation between PWLHIV and their male partners. We utilized data from a randomized controlled trial (www.ClinicalTrials.gov NCT03484533) of 500 PWLHIV attending antenatal care in Uganda and 237 male partners between 2018 and 2020 and followed until 12 months postpartum. Multivariate regression models estimated the impact of relationship factors on the adjusted relative risk of separation during follow up, and we conducted in-depth interviews with 45 women and 45 men enrolled in the trial. Overall, 23% of PWLHIV reported separation during the study period. HIV serodifferent status, financial burdens and gender expectations were sources of relationship conflict. Significant factors associated with separation included unmarried, non-cohabitating, shorter, polygamous relationships, as well as HIV non-disclosure and verbal abuse. Participants discussed potential positive and negative consequences of separation, including impact on their mental health, treatment continuation, financial security, and safety. Addressing relationship dynamics is essential to improve counseling messaging and support PWLHIV who are experiencing relationship conflict.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d039ff73926f73ef8e78a739260d9199",
  "timestamp": "2025-05-15T02:39:27.067121"
}