{
  "id": 5952,
  "title": "Equity market information, bank holding company risk, and market discipline",
  "abstract": "For market discipline to be effective, market factors such as changes in firm equity and debt values and returns, must influence firm decision making. In banking, this can occur directly via bank management or indirectly though supervisory examinations and oversight influencing bank management. In this study, we investigate whether equity market variables can provide timely information and add value to accounting models that predict changes in bank holding company (BOPEC) risk ratings over the 1988-2000 period. Using a variety of equity market indicators, the findings suggest that one-quarter lagged market data adds forecast value to lagged financial statement data and prior supervisory information in the logistic regressions. Furthermore, using extensive out-of-sample testing for the years 2001-2003, we find: (1) that multiple models estimated over different phases of the business and banking cycles are superior to a single model for forecasting BOPEC rating changes; (2) that equity data adds economically significant power in forecasting BOPEC rating upgrades and performs well for identifying no changes; (3) that for downgrades, the accounting model forecasts the best; (4) that modeling the three possible risk ratings categories simultaneously (downgrade, no change and upgrade) minimizes both Type I and Type II classification errors; and (5) that using multiple models to forecast risk ratings enhances the overall percentage of correct classifications. (C) 2007 Elsevier B.V. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d03fadff66382abac705a038e48a6703",
  "timestamp": "2025-05-15T02:53:03.155272"
}