{
  "id": 8094,
  "title": "The impact of the IFRS adoption reform on audit market concentration, auditor choice and audit quality",
  "abstract": "PurposeThe study examines the changes in audit market concentration, auditor choice and audit quality in Russia following International Financial Reporting Standards (IFRS) adoption. Scholars have called for further examination of the effects of IFRS adoption on auditors, with an emphasis on the importance of analyzing emerging markets that are characterized by enforcement challenges and lack of proper infrastructure. It focuses on a unique feature of Russian companies - dual audits under Russian Accounting Standards (RAS) and IFRS - and investigates changes in audit concentration and audit quality for the two audit markets.Design/methodology/approachThe authors rely on the audited financial statements of Russian public companies and perform pre-/post-IFRS adoption estimation using a logit regression to ascertain whether public firms change auditors from local firms with limited IFRS expertise to those with global reputation, namely Big 4 audit firms. Further, they examine whether the change in audit market concentration post-2012 affects audit quality as proxied by companies' propensity to receive a modified audit opinion and discretionary accruals. Auditor attributes were hand-collected from audited financial statements and matched with financial variables from Datastream.FindingsThe IFRS audit market was dominated by the Big 4 audit firms prior to 2012, and there is strong evidence that audit market share (concentration) increases for IFRS reports but not for RAS reports. In addition, companies are more likely to choose a Big 4 audit firm for an RAS audit, conditional upon a Big 4 firm conducting the IFRS audit. The authors do not find evidence of decrease in the probability of audit firms issuing a modified audit opinion under either RAS or IFRS, indicating that, in the Russian setting, increased auditor concentration post-IFRS adoption does not lead to enhanced risk or decline in audit quality. Moreover, they find that discretionary accruals decline post-2012. Overall, the findings indicate that the concern of global regulators regarding audit market concentration is not justified.Research limitations/implicationsThe Russian reporting environment is unique and generally characterized by significant agency problems, and the study's estimation sample is not large, compared to prior studies conducted predominantly in Western jurisdictions. Nevertheless, the authors shed light on the audit concentration phenomenon within emerging markets, for which empirical evidence is scarce. Future research could explore the impact of other capital market events and exogenous shocks, not limited to IFRS adoption, on the characteristics of Russia's audit market.Practical implicationsThe IFRS reporting regime is commonly associated with enhanced reporting quality and improved information transparency among public companies. Yet, impairment of audit quality as a result of IFRS-driven increase in audit market share of Big 4 can potentially negate these capital market effects. This study shows that the concerns of global regulators are not valid and that audit quality does not change with increased share of Big 4 post-IFRS adoption.Originality/valueDual audits, whereby companies must prepare two sets of financial statements per the IFRS mandate, are not unique to Russia, and the evidence of IFRS reporting on the structural changes in the audit market and implications for audit quality under a dual regime is scarce. Accordingly, the study's findings are important and timely and are expected to aid regulators of countries that have announced or are contemplating the adoption of IFRS for public reporting purposes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d0455d1875bc73750671ae7495825315",
  "timestamp": "2025-05-15T03:15:09.386052"
}