{
  "id": 4088,
  "title": "Self-reported prevalence and potential factors influencing cardio-cerebral vascular disease among the Chinese elderly: A national cross-sectional study",
  "abstract": "BackgroundAging is an essential national condition throughout China in the 21st century. Cardio-cerebral vascular disease (CCVD) is a common chronic vascular disease in the elderly. Despite aging becoming an increasingly pressing issue, there has been no comprehensive national investigation into the risk factors, prevalence, and management of CCVD among the elderly population in China. Materials and methodsThrough the 4th Survey of the Aged Population in Urban and Rural China (SSAPUR), a nationally representative sample of 224,142 adults aged more than 60 years was surveyed using a multistage, stratified sampling method. The 4th SSAPUR was used to investigate CCVD in the elderly. Univariate and multivariate logistic proportional regression analyses explored the risk factors. These risk factors were then entered into a multivariate linear regression model to identify independent predictive factors for CCVD. Disease management was assessed from the self-reported history of physician diagnosis, treatments, and hospital visits among individuals with CCVD. ResultsAfter excluding samples with missing information, 215,041 individuals were included in the analysis. The overall prevalence of CCVD was 26%. Living in a rural area, being older, being female, having low literacy, smoking, getting little sleep, losing a spouse, being single, not getting enough exercise, having a bad financial situation, and not taking part in public welfare programs were the main risk factors for CCVD among the elderly in China (P < 0.05). In the multivariate linear regression model, holding all other variables at any fixed value, CCVD remained associated with urban and rural (beta = 0.012, P < 0.001), age (beta = -0.003, P < 0.001), sex (beta = -0.022, P < 0.001), education level (beta = -0.017, P < 0.001), marriage (beta = 0.004, P = 0.047), smoking (beta = 0.012, P = 0.003), drinking (beta = -0.015, P = 0.001), and sleep (beta = 0.008, P = 0.005). There were no collinearity problems among these factors. ConclusionMajor risk factors for prevalent CCVD among the elderly in China include the following: rural residence, female, low literacy level, poor sleep quality, bereavement, non-marriage, living alone, lack of exercise, poor financial situation, and non-participation in public welfare activities. Chinese national policies for preventing, controlling, and managing risk factors for CCVD in the elderly must be urgently developed.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d050f345e5ccc41b494448b487aae31f",
  "timestamp": "2025-05-15T02:33:03.424537"
}