{
  "id": 3195,
  "title": "Exploring the influence of risk management capabilities on SMEs' export intentions: a cross-country analysis",
  "abstract": "Although small and medium-sized enterprises (SMEs) play a vital role in countries' entrepreneurship and export activities, their lack of financial assets and human resources makes them more vulnerable to difficult-to-control external risks, including financial, legal, and market risks. Since the exposure to these risks might reduce their willingness to export, SMEs' risk management capabilities included in the dynamic capabilities of Resource-based View (RBV) might enable them to reduce their exporting concerns and stimulate their entrepreneurial spirit. In this regard, this paper purposes to investigate the impacts of financial, legal, and market risk management capabilities on export intentions of SMEs. The effects of risk management capabilities on the export intention of SMEs might differ depending on the countries where SMEs operate because locally specific government bureaucracy, documentation, standards, regulations, and cultural values make companies face various circumstances that might differently affect their management of multiple risk factors and export entrepreneurship. Thus, this paper also aims to determine whether the effects of risk management capabilities on the export intention of SMEs differ depending on their country of origin. In line with the research aims, this paper employs the Binary Logistic Regression Test to analyze 1221 SMEs in various countries. The results indicate that while financial risk management does not have any significant impacts on the export intention of SMEs, the effects of legal and market risk management on export intention differ depending on SMEs' country of origin. This paper explains the reasons for those results by the institutional factors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d058761882a758b698b1d402f16fe95c",
  "timestamp": "2025-05-15T02:23:33.562783"
}