{
  "id": 5639,
  "title": "A behavioral economic risk aversion experiment in the context of the COVID-19 pandemic",
  "abstract": "We investigated what degree of risk of infection with COVID-19 is necessary so that people intend to stay home, even when doing so means losing their salary. We conducted an online survey across Brazil during the initial outbreak, in which 8,345 participants answered a questionnaire designed to identify the maximum tolerated risk (k') necessary for them to disregard social distancing recommendations and guarantee their salaries. Generalized linear mixed models, path analysis structural equation, and conditional interference classification tree were performed to further understand how sociodemographic factors impact k' and to establish a predictive model for the risk behavior of leaving home during the pandemic. We found that, on average, people tolerate 38% risk of infection to leave home and earn a full salary, but this number decreased to 13% when the individual risk perception of becoming ill from severe acute respiratory syndrome coronavirus-2 is considered. Furthermore, participants who have a medium-to-high household income and who are older than 35 years are more likely to be part of the risk-taking group who leave home regardless of the potential COVID-19 infection level; while participants over 45 years old and with good financial health are more likely to be part of the risk-averse group, who stay home at the expense of any salary offered. Our findings add to the political and public debate concerning lockdown strategies by showing that, contrary to supposition, people with low socioeconomic status are not more likely to ignore social distancing recommendations due to personal economic matters.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d0735cc4cf1b7a2761905349964198aa",
  "timestamp": "2025-05-15T02:49:50.323652"
}