{
  "id": 5862,
  "title": "Sustainable Investment Attitudes Based on Sustainable Finance Literacy and Perceived Environmental Impact",
  "abstract": "The aim of this study is to examine whether sustainable finance literacy and the perceived environmental impact of sustainable finance instruments exert substantial influence over the sustainable investment attitudes of investors within the developing country setting of Ankara, Turkiye. Following a systematic literature review, an online survey was designed and conducted. Multivariate regression models were used for the analysis. The findings illustrate that individuals with a greater level of sustainable finance literacy and a positive perception of the favorable environmental effects of sustainable finance instruments tend to exhibit a positive investment stance and are more likely to invest in sustainable finance instruments. Among the questions related to sustainable finance literacy, the most significant factor in explaining sustainable investment attitude is the knowledge of how sustainable finance instruments can be utilized for risk diversification. In addition, it is depicted that individuals with higher income levels exhibit a favorable disposition toward sustainable finance instruments. The results of our study imply that, to stimulate sustainable investments in developing countries, regulatory authorities and sustainable fund issuers such as financial corporations can enhance promotional campaigns and workshops aimed at increasing awareness and understanding of sustainable finance literacy, sustainable financial instruments, and their positive impact on the environment.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d07c6774c8b22fa1c10f5680558980ab",
  "timestamp": "2025-05-15T02:51:58.727266"
}