{
  "id": 8481,
  "title": "Association between caregiver type and catastrophic health expenditure among households using inpatient medical services: using Korean health panel",
  "abstract": "BackgroundCaregiving services often place a financial burden on individuals and households that use inpatient medical services. Consequently, this study aimed to examine the association between the type of caregiver and catastrophic health expenditure among households utilizing inpatient medical services.MethodsData were extracted from the Korea Health Panel Survey conducted in 2019. This study included 1126 households that used inpatient medical and caregiver services. These households were classified into three groups: formal caregivers, comprehensive nursing services, and informal caregivers. Multiple logistic regression was used to analyze the association between caregiver type and catastrophic health expenditure (CHE).ResultsHouseholds receiving formal caregiving had an increased likelihood of CHE at threshold levels of 40% compared to those who received care from family (formal caregiver: OR 3.11; CI 1.63-5.92). Compared to those who received formal caregiving, households using comprehensive nursing services (CNS) had a decreased likelihood of CHE (CNS: OR, 0.35; CI 0.15-0.82). In addition, considering the economic value associated with informal care, there was no significant relationship between households received formal caregiving and informal caregiving.ConclusionThis study found that the association with CHE differed based on the type of caregiving used by each household. Households using formal care had a risk of developing CHE. Households using CNSs were likely to have a decreased association with CHE, compared to households using informal and formal caregivers. These findings highlight the need to expand policies to mitigate the burden on caregivers for households forced to use formal caregivers.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d08e6ebf25b5654353748dfb9acb3d94",
  "timestamp": "2025-05-15T03:19:21.315118"
}