{
  "id": 8396,
  "title": "Study on the dynamic relationship between the excess returns of the stock market and idiosyncratic volatility and the information efficiency",
  "abstract": "Recently in financial theory, the issues on the relation between the market excess returns and idiosyncratic volatility attract interest among researchers. We have, thus, explored the relation between volatilities in the stock market and the excess returns by investigating the structure of the volatility. The samples are drawn. from the KOSPI and KOSDAQ markets in Korea. In this study, the volatility is estimated from the cross-section, and we use the time series regression for the analysis on the relation between the volatility and the excess returns. Thus, this study is unlike the CAPM which analyzes the cross-section relation between the returns and systematic risk. In addition, based on Bookstaber and Pomeratz (1989), which explains that information arrives in discrete packets and that it takes time for the market to digest this information, we investigate what kind of volatility is more quickly reflected on the price when the information arrives at the stock market in a discrete packet affect the price change. For the analysis, we have estimated volatilities measures using the indirect decomposition method which is suggested by Goyal and Santa-Clara (2003). The analysis period for the KOSPI is from January 1987 to December 2005 and for the KOSDAQ from July 1996 to December 2005. The sample data for the analysis includes all listings on the Korean Securities Exchange. We use the time-series regression model for making a prediction and the GARCH model suggested by Bollerslev (1986; 1987) for the information efficiency. Specifically, for the time-Series regression analysis, we also take into consideration the analysis results using control variables, idiosyncratic volatility estimated with a market model, and expected and unexpected volatility. On the other hand, in the test of information efficiency, we focus on how long it takes for certain information to get reflected on stock values. For this analysis, we compare the autoregressive structure to the returns volatility. Empirical results are as follow: as for the idiosyncratic volatility which represents a risk of an individual firm in the aggregate volatility, the KOSPI market shows 60%, and KOSDAQ market, 77%. Thus, the idiosyncratic volatility appears to be a primary factor which is composed of the aggregate volatility. Further, after reclassifying the aggregate volatility into the market volatility and the idiosyncratic volatility, we test whether each volatility can be an effective tool to forecast the excess returns for the next period. In this result, the KOSPI market shows that through the aggregate and idiosyncratic volatilities we can accurately forecast the excess returns. In the KOSDAQ market, on the other hand, all the volatility measures including the aggregate, market, and idiosyncratic volatility indicate that it is only possible to forecast the excess returns. In addition, when using the control variables and the idiosyncratic volatility estimated by the standard market model, we also investigate whether the idiosyncratic volatility can predict the next period's excess returns. We also find that our results contradict the study of Bali et al. (2005), which claims that the value-weighted idiosyncratic volatility can't forecast the value-weighted the excess returns. As for the speed of the price reflection of the market volatility and the idiosyncratic volatility, all markets show that the information concerning systematic risk is reflected faster than the idiosyncratic volatility concerning unsystematic risk. However, small-sized KOSPI firms and small- and medium-sized KOSDAQ firms show results which are opposed to the findings. This result seems to indicate that those smaller stocks have lower liquidity. The implication of this study is as follows: first, the idiosyncratic volatility in each market has significant presence. In fact, it is a dominant constitution factor of the aggregate volatility. Second, it is possible to predict the excess returns based on the idiosyncratic volatility in the Korean securities market. Last but not least, an empirical evidence in terms of information efficiency suggests that although the stock price is affected by both systematic and unsystematic risks, information concerning systematic risk is reflected on the prices faster than information concerning unsystematic risk.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d09855a11e7266aa1a126d1ebb45bcf3",
  "timestamp": "2025-05-15T03:18:19.640375"
}