{
  "id": 5101,
  "title": "Risk of Material Misstatement in the Stage of Audit Planning: Empirical Evidence from Vietnamese Listed Enterprises",
  "abstract": "The purpose of this study is to investigate factors influencing risk assessment of material misstatement in Vietnamese enterprises listed on stock market. Expert interview method was conducted to discover the scales for three variables including information system, trademark, and risk assessment of material misstatement. Survey method was used to examine the impacts of eight factors on risk assessment of material misstatement. Data is collected from 317 auditors who have excellent experience in auditing financial statements of companies listed on stock market. Then, data is processed by descriptive statistics, reliability analysis, factor extracted analysis, correlative regression analysis, and analysis variance of residual change. The research findings showed that business characteristic, stakeholder pressure, and economic environment have positive relationships with risk assessment of material misstatement. Three variables including operation control and monitor, control environment, and information system negatively affect to risk assessment. Specially, business characteristic and information system, which are elements in internal control, have strongest impact on risk assessment. One the other hand, assessment of internal control plays an important role not only in the audit plan stage but also throughout the stages of the audit implementation and ending. Therefore, appropriate solutions are proposed to carry out all audit stages.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d0a447df0b30ad78592e190d2f5f3d1a",
  "timestamp": "2025-05-15T02:44:11.078292"
}