{
  "id": 7216,
  "title": "Disparities in mortgage lending, bank performance, economic influence, and regulatory oversight",
  "abstract": "This study investigates factors affecting changes in the disparity of home mortgage denial rates between white and minority loan applicants in the U.S. during the period 1991-1997. We develop a two-stage least-squares regression model that incorporates applicant-level characteristics, neighborhood characteristics, regional economic data, and bank-specific data as explanatory variables. Some have argued that mortgage lenders were under increasing pressure from industry regulators to extend additional credit to minorities and low-income groups during the period under study. The model includes each institution's periodic CRA rating as a proxy for regulatory influence. An alternative explanation is that market forces, such as improvements in economic conditions and in bank financial condition and performance, affected default loss estimates and credit standards in a way that disproportionally benefited minority and low-income applicants. The empirical findings are consistent with the latter hypothesis. We conclude that policy makers should consider the impact of market factors when assessing the allocation of mortgage credit in a particular demographic market. The findings also underscore the importance of controlling for lender assessments of credit risk when evaluating compliance with CRA and fair lending statutes.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d0a9574563ceacda9752548f25b80b6f",
  "timestamp": "2025-05-15T03:06:35.240910"
}