{
  "id": 3527,
  "title": "Home-Based Intervention to Test and Start (HITS): a community-randomized controlled trial to increase HIV testing uptake among men in rural South Africa",
  "abstract": "IntroductionThe uptake of HIV testing and linkage to care remains low among men, contributing to high HIV incidence in women in South Africa. We conducted the Home-Based Intervention to Test and Start (HITS) in a 2x2 factorial cluster randomized controlled trial in one of the World's largest ongoing HIV cohorts in rural South Africa aimed at enhancing both intrinsic and extrinsic motivations for HIV testing. MethodsBetween February and December 2018, in the uMkhanyakude district of KwaZulu-Natal, we randomly assigned 45 communities (clusters) (n = 13,838 residents) to one of the four arms: (i) financial incentives for home-based HIV testing and linkage to care (R50 [$3] food voucher each); (ii) male-targeted HIV-specific decision support application, called EPIC-HIV; (iii) both financial incentives and male-targeted HIV-specific decision support application and (iv) standard of care (SoC). EPIC-HIV was developed to encourage and serve as an intrinsic motivator for HIV testing and linkage to care, and individually offered to men via a tablet device. Financial incentives were offered to both men and women. Here we report the effect of the interventions on uptake of home-based HIV testing among men. Intention-to-treat (ITT) analysis was performed using modified Poisson regression with adjustment for clustering of standard errors at the cluster levels. ResultsAmong all 13,838 men >= 15 years living in the 45 communities, the overall population coverage during a single round of home-based HIV testing was 20.7%. The uptake of HIV testing was 27.5% (683/2481) in the financial incentives arm, 17.1% (433/2534) in the EPIC-HIV arm, 26.8% (568/2120) in the arm receiving both interventions and 17.8% in the SoC arm. The probability of HIV testing increased substantially by 55% in the financial incentives arm (risk ratio (RR)=1.55, 95% CI: 1.31 to 1.82, p < 0.001) and 51% in the arm receiving both interventions (RR = 1.51, 95% CI: 1.21 to 1.87 p < 0.001), compared to men in the SoC arm. The probability of HIV testing did not significantly differ in the EPIC-HIV arm (RR = 0.96, 95% CI: 0.76 to 1.20, p = 0.70). ConclusionsThe provision of a small financial incentive acted as a powerful extrinsic motivator substantially increasing the uptake of home-based HIV testing among men in rural South Africa. In contrast, the counselling and testing application which was designed to encourage and serve as an intrinsic motivator to test for HIV did not increase the uptake of home-based testing.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d0ac4af75d340c4dec45307729933b09",
  "timestamp": "2025-05-15T02:27:19.088481"
}