{
  "id": 3896,
  "title": "Foreign Capital Flows, Banking Stability and the Role of International Trade Cooperation and Distribution an Empirical Analysis from the ASEAN Region",
  "abstract": "Purpose: Although foreign capital flows have played a vital role in fostering the economic growth in recipient countries, there are some concerns about the adverse impact of international capital flows on the banking stability. Hence, the study revisits this issue to explore the relationship between the different types of foreign investments and banking stability in ASEAN region. Research design, data and methodology: Based on the bank-level data of 96 commercial banks and country-level in six ASEAN countries from 2008 to 2019, we perform the multivariate regression analysis and provide a variety of robustness tests. Results: Our empirical evidence shows the volatility of foreign portfolio investments has significantly negative effect on the banking stability, besides that of foreign other investments has the similar influence but the result is relatively less pronounced in some robustness tests. Additionally, increasing trade cooperation and international distribution may lead countries to face higher risk of banking instability driven from these international investments. Meanwhile, the impact of foreign direct investments is positive, but the evidence is the least obvious. Conclusions: Our findings suggest policy-makers in ASEAN and emerging nations as a whole should carefully consider when building policies-related to mitigate the adverse impact of foreign capital flows.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d0d082434f46185c577fe3b893c6552e",
  "timestamp": "2025-05-15T01:22:11.798354"
}