{
  "id": 9001,
  "title": "Factors affecting delays in seeking treatment among malaria patients during the pre-certification phase in China",
  "abstract": "BackgroundDelays in malaria treatment can not only lead to severe and even life-threatening complications, but also foster transmission, putting more people at risk of infection. This study aimed to investigate the factors influencing treatment delays among malaria patients and their health-seeking behaviour.MethodsThe medical records of 494 patients diagnosed with malaria from 6 different malaria-endemic provinces in China were analysed. A bivariate and multivariable regression model was used to investigate the association between delays in seeking treatment and various factors. A Sankey diagram was used to visualize the trajectories of malaria patients seeking medical care. Total treatment delays were categorized as patient delays and doctor delays.ResultsThe incidence of total delays in seeking malaria treatment was 81.6%, of which 28.4% were delayed by patients alone and 34.8% by doctors alone. The median time from the onset of symptoms to the initial healthcare consultation was 1 day. The median time from the initial healthcare consultation to the conclusive diagnosis was 2 day. After being subjected to multiple logistic regression analysis, living in central China was less likely to experience patient delays (OR = 0.43, 95% CI 0.24-0.78). The factors significantly associated with the lower likelihood of doctor delays included: age between 30 to 49 (OR = 0.43, 95% CI 0.23-0.81), being single/divorce/separated (OR = 0.48, 95% CI 0.24-0.95), first visiting a county-level health institution (OR = 0.25, 95% CI 0.14-0.45), first visiting a prefectural health institution (OR = 0.06, 95% CI 0.03-0.12) and first visiting a provincial health institution (OR = 0.05, 95%CI 0.02-0.12). Conversely, individuals with mixed infections (OR = 2.04, 95% CI 1.02-4.08) and those experiencing periodic symptoms (OR = 1.71, 95% CI 1.00-2.92) might face increased doctor delays. Furthermore, higher financial burden and complications were found to be associated with patient delays. Doctor delays, in addition to incurring these two consequences, were associated with longer hospital stays.ConclusionThere was a substantial delay in access to health care for malaria patients before China was certified malaria free. Region, marital status, periodic symptoms and the level of health institutions were factors contributing to delays in treatment-seeking among malaria patients.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d0d0d775a8fb7edd107cf6e236c9db92",
  "timestamp": "2025-05-15T03:24:26.401628"
}