{
  "id": 17,
  "title": "A new portfolio approach integrating three-way decision and Encoder-Decoder network",
  "abstract": "In the stock market, it can be challenging to predict stock trends and identify stocks with investment potential due to uncertainty and risk. Accurate predictive models and reliable asset preselection methods are essential for portfolio management. This paper proposes an integration of the deep learning model, the three-way decision (3WD) theory, and the Mean-Variance (MV) method for asset preselection and optimal asset allocation. In the initial stage, an attention-based Encoder-Decoder model is used to predict asset returns and calculate volatility. It outperforms other benchmark models regarding relative error, absolute error, and directional accuracy. The subsequent stage involves selecting stocks based on expected returns and volatility characteristics. The 3WD theory is then used to identify the delayed decision set for implementing additional investment strategies to hedge portfolio risk and enhance returns. Finally, the MV model is employed for investment portfolio optimization. The proposed model is validated using a substantial dataset from the A-share market's SSE 50 Index from January 2010 to December 2022. Results indicate that the proposed model outperforms benchmark models in terms of daily average returns, annualized Information ratio, Sortino ratio, and other aspects under certain trading costs. However, further exploration is required to establish a mechanism that limits the quantity of preselected assets to ensure its broad applicability.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d0d835e9bd80650efd425a71b690e138",
  "timestamp": "2025-05-15T00:31:16.774996"
}