{
  "id": 5316,
  "title": "Bayesian spatial modelling of intimate partner violence and associated factors among adult women and men: evidence from 2019/2020 Rwanda Demographic and Health Survey",
  "abstract": "Background Intimate partner violence (IPV) remains a global public health concern for both men and women. Spatial mapping and clustering analysis can reveal subtle patterns in IPV occurrences but are yet to be explored in Rwanda, especially at a lower small-area scale. This study seeks to examine the spatial distribution, patterns, and associated factors of IPV among men and women in Rwanda.Methods This was a secondary data analysis of the 2019/2020 Rwanda Demographic and Health Survey (RDHS) individual-level data set for 1947 women aged 15-49 years and 1371 men aged 15-59 years. A spatially structured additive logistic regression model was used to assess risk factors for IPV while adjusting for spatial effects. The district-level spatial model was adjusted for fixed covariate effects and was implemented using a fully Bayesian inference within the generalized additive mixed effects framework.Results IPV prevalence amongst women was 45.9% (95% Confidence interval (CI): 43.4-48.5%) while that for men was 18.4% (95% CI: 16.2-20.9%). Using a bivariate choropleth, IPV perpetrated against women was higher in the North-Western districts of Rwanda whereas for men it was shown to be more prevalent in the Southern districts. A few districts presented high IPV for both men and women. The spatial structured additive logistic model revealed higher odds for IPV against women mainly in the North-western districts and the spatial effects were dominated by spatially structured effects contributing 64%. Higher odds of IPV were observed for men in the Southern districts of Rwanda and spatial effects were dominated by district heterogeneity accounting for 62%. There were no statistically significant district clusters for IPV in both men or women. Women with partners who consume alcohol, and with controlling partners were at significantly higher odds of IPV while those in rich households and making financial decisions together with partners were at lower odds of experiencing IPV.Conclusion Campaigns against IPV should be strengthened, especially in the North-Western and Southern parts of Rwanda. In addition, the promotion of girl-child education and empowerment of women can potentially reduce IPV against women and girls. Furthermore, couples should be trained on making financial decisions together. In conclusion, the implementation of policies and interventions that discourage alcohol consumption and control behaviour, especially among men, should be rolled out.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d0db891040ab86d6d7e84a38228ef653",
  "timestamp": "2025-05-15T02:46:44.848022"
}