{
  "id": 6123,
  "title": "Effects of anxiety, depression, and fatigue on quality of life in early esophageal cancer patients following endoscopic submucosal dissection",
  "abstract": "Background: Emotional problems such as anxiety, depression, and fatigue may affect the quality of life (QoL) of cancer patients. However, there are no related studies investigating the effects of emotional problems on the QoL of early esophageal cancer (EC) patients receiving endoscopic submucosal dissection (ESD). Methods: This is a prospective observational study enrolling 75 early EC patients. Demographic and clinical characteristics of enrolled patients were recorded. QoL was assessed according to the European Organization for Research and Treatment of Cancer QoL (EORTC QLQ-C30). The Beck Anxiety Scale and the Beck Depression Scale were used to measure the severity of anxiety symptoms and depression intensity, respectively. Fatigue was assessed according to the symptom subscale of the EORTC QLQ-C30. Multivariable logistic regression models were constructed to determine the causes of emotional problems and linear regression models were employed to identify the independent risk factors for reduced QoL. Results: Of the enrolled early EC patients, 21, 15, and seven had symptoms of mild, moderate and severe anxiety, respectively. Also, 15, 19, and two patients had symptoms of mild, moderate, and severe depression, respectively. In total, 27 patients frequently felt fatigue. The multivariable logistic regression model revealed that the financial capacity to pay for treatment had an important effect on the prevalence of anxiety and depression symptoms in enrolled patients (both P values <0.001). Age, gender, education status, and tumor size also played a role in emotional problems. Meanwhile, fatigue was found to be related only to age and gender. The mean score for QoL was 76.9 +/- 15.2. After adjusting for confounding factors using the multivariable linear regression model, moderate or severe symptoms of anxiety, depression, and fatigue, older age, and insufficient capacity to pay were identified as independent risk factors for reduced QoL. Conclusions: Emotional distress is a significant problem for early EC patients receiving ESD treatment as it may affect their QoL.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d0dfcfc630ccca2c21e90f8c687c8769",
  "timestamp": "2025-05-15T02:55:12.844846"
}