{
  "id": 7890,
  "title": "Unraveling the effect of resource use, environmental innovation and financing access in developed and emerging economies",
  "abstract": "PurposeThe purpose of this study is to investigate the effects of resource use and environmental innovation on firms' financial costs.Design/methodology/approachThe sample consists of 2,588 firm-year observations from 647 companies collected from Thomson Reuters over a five-year period (year 2014 to year 2018). The authors analyze the data using panel-corrected standard errors, which corrects heteroskedasticity issues and contemporaneous error in the data. Further, the authors adopt cluster analysis based on the year and industry. The authors also adopt the generalized method of moments and two-stage least squares regression to check for endogeneity issues and validate the findings.FindingsThe findings generally indicate that resource use is negatively associated with firms' cost of capital. Firms' engagement with operational activities improves savings in the usage of resources, but environmental innovation is found to be positively associated with the cost of capital. This may be attributable to higher capital investment, stringent risk assessment and third-party assurance associated with firms' environmental innovation.Research limitations/implicationsThe findings urge regulators, practitioners and stakeholders to engage in more dialogues to reduce the costs associated with environmental sustainability innovation. This may be in the form of new technologies, energy-saving products, waste recycling and green innovations. Government intervention via greater infrastructure, tax incentives and regulatory reform may support the growth of innovation in emerging market economies.Practical implicationsEfforts are needed to encourage a dynamic, innovative and entrepreneurial mindset among the people living in emerging countries. Also, government regulatory reform is imperative in encouraging innovations in the environmental, social and governance ecosystem.Social implicationsThe effect on society would be in the form of a new product innovation that creates better living standards and environments for the communities.Originality/valueTo the best of the authors' knowledge, this is one of the few studies that focuses on the impact of firms' resource use and environmental innovativeness and its implications on business financial costs in both emerging and developed markets.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d104f517558039558cf0af46198b7033",
  "timestamp": "2025-05-15T03:13:04.929989"
}