{
  "id": 8703,
  "title": "Obesity and eating disorders in integrative prevention programmes for adolescents: protocol for a systematic review and meta-analysis",
  "abstract": "Introduction Obesity and eating disorders are public health problems that have lifelong financial and personal costs and common risk factors, for example, body dissatisfaction, weight teasing and disordered eating. Obesity prevention interventions might lead to the development of an eating disorder since focusing on weight may contribute to excessive concern with diet and weight. Therefore, the proposed research will assess whether integrating obesity and eating disorder prevention procedures ('integrated approach') do better than single approach interventions in preventing obesity among adolescents, and if integrated approaches influence weight-related outcomes. Methods and analysis Integrated obesity and eating disorder prevention interventions will be identified. Randomised controlled trials and quasi-experimental trials reporting data on adolescents ranging from 10 to 19 years of age from both sexes will be included. Outcomes of interest include body composition, unhealthy weight control behaviours and body satisfaction measurements. MEDLINE/PubMed, PsycINFO, Web of Science and SciELO will be searched. Data will be extracted independently by two reviewers using a standardised data extraction form. Trial quality will be assessed using the Cochrane Collaboration criteria. The effects of integrated versus single approach intervention studies will be compared using systematic review procedures. If an adequate number of studies report data on integrated interventions among similar populations (k>5), a meta-analysis with random effects will be conducted. Sensitivity analyses and meta-regression will be performed only if between-study heterogeneity is high (I-2 >= 75%). Ethics and dissemination Ethics approval will not be required as this is a systematic review of published studies. The findings will be disseminated through conference presentations and peer-reviewed journals.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d117b9d6fbd2e6c38a992a4e914ad457",
  "timestamp": "2025-05-15T03:21:24.725538"
}