{
  "id": 3339,
  "title": "Legislation Used to Apply Artificial Intelligence for the Management of Records at the Council for Scientific and Industrial Research in South Africa",
  "abstract": "This study sought to investigate how legislation can be applied in the use of artificial intelligence (AI) for records management at the Council for Scientific and Industrial Research (CSIR), South Africa. The legislative framework does not only include the major element of legislation, but also the administrative, political, organisational, social and economic circumstances or arrangement, which make the legislation available, accessible, enforceable and effective. The legislative framework is the heart of attainment of commercial goals in all corporate industries, including archives and records management particularly using AI and robotic machines. AI refers to a robotic machine that has the capability for automated digitisation, automated classification, and records storage and retrieval. A convergent mixed-methods research was conducted, and data were collected, using interviews and questionnaires data collection techniques. Data was collected from sampled population of one portfolio manager, one records manager, three professional repositories and indexers, two archives technicians and one data librarian. Questionnaire was administered to three professional repositories and indexers, two archives technicians and one data librarian. Interviews was conducted to one portfolio manager and one records manager. Data were analysed thematically and statistically and presented in tables and figures. The study revealed that the CSIR utilised the South Africa legislative framework to manage their records. The study concluded that the CSIR should ensure that their legislative framework is reviewed to allow them to effectively apply AI for records management. The study proposed a framework to guide the application of the legislations when using AI for records management at the CSIR. It is trusted that the proposed framework will serve as a guideline for the implementation of legislation when utilising AI in the archives and records management industry.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d125764f295e3282bc082fe5c6fce7bc",
  "timestamp": "2025-05-15T01:15:54.883459"
}