{
  "id": 4677,
  "title": "Risk and Protective Factors for Suicide Among Patients With Methamphetamine Dependence: A Nested Case-Control Study",
  "abstract": "Objective: Methamphetamine as a recreational drug has undergone cycles of popularity, with a recent surge worldwide since the 1990s. This study aimed to identify clinical characteristics associated with suicide mortality in patients with methamphetamine dependence by means of a nested case-control design. Method: In a consecutive series of 1,480 inpatients with methamphetamine dependence (diagnosed according to DSM-III-R and DSM-IV criteria) admitted to a psychiatric center in northern Taiwan from January I, 1990, through December 31, 2006, 38 deaths due to suicide were identified as cases via record linkage, and 76 controls were randomly selected using risk-set density sampling in a 2:1 ratio, matched for age, sex, and the year of index admission. A standardized chart review process was adopted to collate sociodemographic and clinical information for each study subject. Multivariate conditional logistic regression analysis was used to identify correlates of suicide among these patients. Results: For the sociodemographic and symptom profiles at the latest admission, financial independence lowered the risk for suicide (adjusted risk ratio [ARR] = 0.33, P<.05), whereas visual hallucinations elevated the risk (ARR = 2.57, P<.05) for suicide. For the profiles during the postdischarge period, financial independence (ARR = 0.11, P<.05) remained associated with reduced risk for suicide, whereas suicide attempt (ARR = 8.78, P<.05) and depressive syndrome (ARR = 3.28, P = .059) were associated with increased risk of suicide. Conclusions: Both protective and risk factors for suicide mortality were found among inpatients with methamphetamine dependence, and the findings have implications for clinical intervention and prevention. J Clin Psychiatry 2011;72(4):487-493 (C) Copyright (C) 2010 Physicians Postgraduate Press, Inc.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d12c988ad83a728ffa3ece1a9dfa94c3",
  "timestamp": "2025-05-15T02:39:57.444920"
}