{
  "id": 8813,
  "title": "Psychosocial comorbidities of diabetes during the COVID-19 pandemic in Iran",
  "abstract": "BACKGROUND: The psychosocial impacts of the COVID-19 pandemic are mainly focused on the general population, while pandemics do not impact the mental health of the entire population uniformly, especially vulnerable populations with underlying health conditions. This study aimed to investigate diabetes psychosocial comorbidities among Iranians with type 1 diabetes (T1D) during the COVID-19 pandemic.MATERIALS AND METHODS: This was a cross-sectional study of 212 adults with T1D in different cities in Iran. Study participants completed an online survey in April-June 2020. The survey collected self-reported data on diabetes psychosocial comorbidities (i.e. diabetes burnout, diabetes distress, and depressive symptoms). Demographic and COVID-19 data before and during the pandemic were also collected. Responses were analyzed using ordinary least squares and logistic regression methods.RESULTS: Around 17.5% reported being tested for COVID-19 virus, 8% were diagnosed positive, 10.8% were hospitalized, and 92.9% followed precaution recommendations during the pandemic. Participants had high levels of diabetes distress (57.1%), depressive symptoms (60.8%), and diabetes burnout (mean score = 3.1 out of 5). During the pandemic, trouble paying for the very basic needs was a consistent factor increasing the risk of diabetes distress, diabetes burnout, and depressive symptoms. Lack of access to diabetes care was only associated with diabetes burnout, while diabetes hospitalization/emergency department (ED) visit was associated with diabetes distress. Existing diabetes disparities before the pandemic were also associated with higher scores of diabetes psychosocial comorbidities [accessing diabetes supplies and medications (P < 0.0001) and places for physical exercise (P < 0.0333)].CONCLUSION: The negative impact of the COVID-19-related changes on individuals with diabetes, as one of the most vulnerable populations, must be recognized alongside the physical, financial, and societal impact on all those affected. Psychological interventions should be implemented urgently in Iran, especially for those with such characteristics.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d136122961ed962ac973ffd4956b2a36",
  "timestamp": "2025-05-15T03:22:57.842875"
}