{
  "id": 8452,
  "title": "Older adults' experiences of loneliness over the lifecourse: An exploratory study using the BBC loneliness experiment",
  "abstract": "Purpose: : To explore older adults' experiences of loneliness across the lifecourse and the relationship with current loneliness. Methods: : Our sample is 6,708 people aged 65 years and older, resident in the UK, who participated in the BBC Loneliness Experiment in spring 2018. Loneliness was assessed using the 3 item UCLA Loneliness Scale, using a threshold score of 6+ to define loneliness. Participants were asked if they had experienced loneliness in 5 life-stages ranging from childhood to old age and, if so, at which stage had they experienced loneliness most intensely. Multivariate logistic regression analysis was used to estimate the odds ratios of experiencing loneliness in relation to previous experiences of loneliness and key covariates. Findings: : 41% of participants reported current feelings of loneliness and were more likely than those who did not to spend time alone, have poorer self-rated health, be unmarried, have fewer financial resources, and lower levels of neighbourhood trust. 71% reported they had experienced loneliness at some previous stage in their life, with 26% experiencing it in childhood (5-15 years and 39% as a young adult (16-24 years). Having had three or more prior life stage experiences of loneliness was an independent risk factor for current loneliness. Conclusion: : We highlight the potential importance of examining older adults' experience of loneliness within a lifecourse perspective. We suggest a research agenda that examines the importance of the number and timing of previous loneliness experiences and investigates the strategies used to cope with loneliness across the lifecourse as a pathway to developing more effective and personalised loneliness interventions.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d14887ba4b3bcc2f821230f8a67081ed",
  "timestamp": "2025-05-15T03:18:51.698301"
}