{
  "id": 4339,
  "title": "Socio-demographic drivers of the risk-taking propensity of micro farmers Evidence from the Czech Republic",
  "abstract": "Purpose Risk attitude is an elementary attribute of entrepreneurial behaviour. Determinants of risk-taking propensity have been widely investigated in the group of entrepreneurs and non-entrepreneurs so far. There is a lack of evidence on determinants of risk-taking propensity in the farming business, which is considered as risky business because of the ongoing climate change and epidemic outbreaks. Alternatively, the risk of lower European Union budget raised the question, how to implement publicly supported financial instruments for micro and small farmers which have lower credit rating. The purpose of this study is to find socio-demographic determinants of the risk-taking propensity of the Czech micro farms, controlling for the type of farming. Design/methodology/approach The survey of 747 micro farmers was processed through ordinal logistic regression. The study is based on the subjective self-assessment of the risk-taking behaviour which is frequently used to measure risk-taking attitude. The results are representative from the type of farming point of view. Findings The model provided clear evidence that age, household size, living with the partner/wife/husband and level of education have a significant relationship with risk-taking propensity. The most risk-tolerant farmers are young with less formal education and living in small households. The risk-taking propensity varies by the type of farming. Specialized crop farms have significantly higher risk-taking propensity than farms with a substantial share of livestock production. Alternatively, gender, feeling about household income and religion are not significantly related to the risk-taking propensity of the Czech micro farms. Originality/value The originality of this study is from the perspective of agricultural sector as well as from the micro farms point of view. The results have commercial and political implications. Younger farmers, singles and lower-educated farmers have significantly higher risk-taking propensity and can be potentially risky clients for banks. Such farmers represent the financial gap in the credit market, and their viable development projects could be subject for implementation of financial instruments co-financed by the European Agricultural Fund for Rural Development in the forthcoming programming period past 2020.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d17a15840fd3f76b5cbb57494c18d51f",
  "timestamp": "2025-05-15T02:36:05.210183"
}