{
  "id": 8342,
  "title": "Relationship Between Hospital Performance on a Patient Satisfaction Survey and Surgical Quality",
  "abstract": "IMPORTANCE The Centers for Medicare and Medicaid Services include patient experience as a core component of its Value-Based Purchasing program, which ties financial incentives to hospital performance on a range of quality measures. However, it remains unclear whether patient satisfaction is an accurate marker of high-quality surgical care. OBJECTIVE To determine whether hospital performance on a patient satisfaction survey is associated with objective measures of surgical quality. DESIGN, SETTING, AND PARTICIPANTS Retrospective observational study of participating American College of Surgeons National Surgical Quality Improvement Project (ACS NSQIP) hospitals. We used data from a linked database of Medicare inpatient claims, ACS NSQIP, the American Hospital Association annual survey, and Hospital Compare from December 2, 2004, through December 31, 2008. A total of 103 866 patients older than 65 years undergoing inpatient surgery were included. Hospitals were grouped by quartile based on their performance on the Hospital Consumer Assessment of Healthcare Providers and Systems survey. Controlling for preoperative risk factors, we created hierarchical logistic regression models to predict the occurrence of adverse postoperative outcomes based on a hospital's patient satisfaction scores. MAIN OUTCOMES AND MEASURES Thirty-day postoperative mortality, major and minor complications, failure to rescue, and hospital readmission. RESULTS Of the 180 hospitals, the overall mean patient satisfaction score was 68.0% (first quartile mean, 58.7%; fourth quartile mean, 76.7%). Compared with patients treated at hospitals in the lowest quartile, those at the highest quartile had significantly lower risk-adjusted odds of death (odds ratio = 0.85; 95% CI, 0.73-0.99), failure to rescue (odds ratio = 0.82; 95% CI, 0.70-0.96), and minor complication (odds ratio = 0.87; 95% CI, 0.75-0.99). This translated to relative risk reductions of 11.1%(P = .04), 12.6%(P = .02), and 11.5%(P = .04), respectively. No significant relationship was noted between patient satisfaction and either major complication or hospital readmission. CONCLUSIONS AND RELEVANCE Using a national sample of hospitals, we demonstrated a significant association between patient satisfaction scores and several objective measures of surgical quality. Our findings suggest that payment policies that incentivize better patient experience do not require hospitals to sacrifice performance on other quality measures.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d191b6b32ea7a2524332d0f51029b161",
  "timestamp": "2025-05-15T03:17:49.155915"
}