{
  "id": 6150,
  "title": "Gendered Poverty Perceptions: How Do RetiredWomen Fare?",
  "abstract": "This paper examines the poverty perceptions of retired women by assessing the extent to which demographic characteristics, economic considerations, household adequacy levels and satisfaction measures influence perceptions of poverty. Based on data from a South African national survey, binomial logistic regression models were employed, whereby demographic characteristics (first level variables) were assessed relative to the respondents' poverty perceptions. Thereafter, economic considerations (second level variables) were included in the model to draw more inferences on the conditions leading to poverty perceptions. Finally, respondents' household adequacy levels and satisfaction measures (third level variables) were nested into the model for a complete investigation of the antecedents of poverty perceptions. Many of the retired women in this study perceive themselves to be impoverished or at risk of poverty. The results indicate that marital status and education levels have a significant influence on perceptions of poverty. Furthermore, the study found that monetary measures do not sufficiently explain the pathway leading to retirement poverty perceptions. Instead, perceptions of financial security and the satisfaction with one's standard of living influence gendered poverty perceptions. This study advances our understanding of the conditions influencing the poverty perceptions of retired women. As most of the respondents in this sample rely on the government for financial support, this study provides pertinent suggestions to government agencies on the conditions associated with gendered poverty perceptions at retirement.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d19bb461d50367c13804566befd975cf",
  "timestamp": "2025-05-15T02:55:12.961451"
}