{
  "id": 8691,
  "title": "Cognitive impairment, all-cause and cause-specific mortality among non-demented older adults",
  "abstract": "Background: cognitive impairment is widespread among older adults even in the absence of dementia, but very little is known about the association between cognitive impairment not due or not yet converted to dementia and mortality. The association between cognitive impairment and mortality contributes to assessing cognitive impairment-related risk constellation in old age in the absence of manifest dementia. Objective: to assess the impact of cognitive impairment on all-cause and cause-specific mortality among non-demented older adults and to explore the nature of the association between cognitive impairment and mortality. Design: an observational cohort study (ESTHER study; 2000-present). Setting: German state of Saarland. Subjects: a subsample of 1,622 participants aged >= 70 with measurement of cognitive function through the Cognitive Telephone Screening Instrument (COGTEL) and exclusion of a possible dementia diagnosis at both COGTEL baseline (2005-08) and over the mortality follow-up (2005-13). Results: during an average follow-up of 6.1 years, 231 participants (14.2%) died. Participants with low COGTEL total scores had similar to 60% increased mortality compared with participants with higher COGTEL total scores in Cox regression models adjusting for a wide range of possible confounders (hazard ratio = 1.62; confidence interval 1.13-2.33). Dose-response analyses with restricted cubic splines indicate a monotonic inverse relationship between cognitive function and mortality. Conclusion: cognitive impairment in the absence of manifest dementia is an important independent predictor of mortality, especially among men. The administration of cognitive tests among older adults may provide relevant information for patient care and treatment decisions. Sources of funding: financial sponsors played no role in the design, execution, analysis and interpretation of data.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d19c5c85bc8b12411d798ce28f59fe6c",
  "timestamp": "2025-05-15T03:21:24.688008"
}