{
  "id": 7728,
  "title": "Epilepsy and employment: A qualitative interview study with heads of human resources and occupational physicians in Austria - A call for legislative optimization according to the WHO Intersectoral Global Action Plan",
  "abstract": "ObjectivePeople with epilepsy (PWEs) often face difficulties in obtaining or keeping employment. To determine the views on this topic of the heads of human resources (HHRs) and occupational physicians (OCPs).MethodTwelve HHRs and five OCPs underwent a telephone interview concerning the opportunities and limitations of job applications for PWEs. The interviews were performed in May 2020, in the federal state of Salzburg, Austria, and they were analyzed using the qualitative method of content analysis (Kuckartz). The legal situation was investigated according to Global target 5.2 of the Intersectoral Global Action Plan (IGAP) on epilepsy and other neurological disorders 2022-2031 by WHO.ResultsEmployers were confident that employees with epilepsy could be managed well in a positive company culture and with first responders in place. The Austrian law predisposes to uncertainty among both employers and employees. In particular, it allows only retrospective juridical clarification of health-related questions in the job interview. The authors developed a classification system of workplaces, with D0 (D-zero) meaning no health or financial danger, for example, office workers and D1 posing still no health hazard but includes regular work with cash, for example, salespersons. D2 means potential medical implications for the person with epilepsy or any other person at the workplace, for example, industrial worker. Measures taken to abandon the risk in D2 workplaces, for example, a total sheath for a machine, leads to reclassification as D2-0. With D2, OCPs evaluate the applicant's medical fitness for the job without disclosing medical details to the employer. The compartment model of medical information in the job application process guarantees that OCPs are the only persons who learn about the applicant's medical details.SignificanceThe practical and simple classification of workplaces according to the D-system, and the concept of making medical information accessible only to OCPs may diminish stigma and discrimination in the working world for PWEs.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d1b6b8f30585c2a4765e90e035614c35",
  "timestamp": "2025-05-15T03:11:38.464340"
}