{
  "id": 7702,
  "title": "Dose-response relationships between body-mass index and pressure injuries occurrence in hospitalized patients: A multi-center prospective study",
  "abstract": "Background: Pressure injuries (PIs) are one of the leading potentially preventable hospital-acquired complications associated with prolonged hospital length, poor quality of life and financial burden. The relationship between body mass index (BMI) and PIs occurrence is controversial. Objective: The aim of this study was to further examine relationships between BMI and PIs occurrence in hospitalized patients. Design: A multi-center prospective study. Setting: 39 hospitals located in northwest China from April 2021 to July 2023. Participants: 175,960 hospitalized patients aged over 18 years were enrolled, and 170,800 patients were included in the final analysis. Methods: BMI and clinical characteristics were assessed at baseline. PIs assessment were performed by trained nurses, with data recorded for the presence, the location and stage of each PI. For staging PIs, the National Pressure Ulcer Advisory Panel (NPUAP) staging system were used. The multivariate logistic regressions analysis and restricted cubic splines (RCS) models were used to explore associations between BMI and PIs, adjusting for potential confounders. Results: Of 175,960 participants, 5160 were excluded from analyses. The multivariate logistic regression model identified a positive relationship between under-weight BMI and risk of PIs occurrence (OR = 1.60, 95% CI:1.18-2.17). We also found U shaped association between BMI and PIs occurrence (non-linear P < 0.001). BMI less than 23 kg/m(2) significantly increased risk of PIs, and there was a tendency to increase risk of PIs at BMI higher than 30 kg/m(2). We stratified participants by sex to further investigate their association and found the risk of PIs increases substantially in women at BMI below 17 kg/m(2) and in men at BMI below 23 kg/m(2). Conclusions: The present study indicated that there was an approximate U shaped relationship between BMI and PIs occurrence, and this association was potentially different between men and women.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d1b70409f54ce954946393df75f432b8",
  "timestamp": "2025-05-15T03:11:04.628894"
}