{
  "id": 4395,
  "title": "Innovative deep matching algorithm for stock portfolio selection using deep stock profiles",
  "abstract": "Construction of a reliable stock portfolio remains an open issue in quantitative investment. Multiple machine learning models have been trained for stock portfolio selection, but their practical applicability remains limited due to the challenges posed by the characteristic of a low signal-to-noise ratio (SNR), the nature of time-series data, and non-independent identical distribution in financial data. Here, we transformed the stock selection task into a matching problem between a group of stocks and a stock selection target. We proposed a novel representation algorithm of stock selection target and a novel deep matching algorithm (TS-Deep-LtM). Then we proposed a deep stock profiling method to extract the optimal feature combination and trained a deep matching model based on TS-Deep-LtM algorithm for stock portfolio selection. Especially, TS-Deep-LtM algorithm was obtained by setting statistical indicators to filter and integrate three deep text matching algorithms. This parallel framework design made it good at capturing signals from time-series data and adapting to non-independent identically distributed data. Finally, we applied the proposed model to stock selection and tested long-only portfolio strategies from 2010 to 2017. We demonstrated that the risk-adjusted returns obtained by our portfolio strategies outperformed those obtained by the CSI300 index and learning-to-rank approaches during the same period.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d1bcb5fd366f4385d772bdff72e05d42",
  "timestamp": "2025-05-15T02:36:38.509505"
}