{
  "id": 2736,
  "title": "Multiplicative Effects of Social and Psychological Risk Factors on College Students' Suicidal Behaviors",
  "abstract": "Less is known about the multiplicative effects of social and psychological risk and protective factors of suicidality on college campuses. The current study aimed to investigate the multiplicative effects of social (identifying oneself as gay/lesbian, financial difficulty, violence victimization, and religiosity) and psychological (anxiety, depression, problem alcohol use, drug use) and risk/protective factors on suicidal behaviors among college students in the United States. Using a cross-sectional design, the Healthy Mind Study (HMS; 2016-2017), is a national online survey of college students in the United States. Social (identifying oneself as gay/lesbian, violence victimization, financial difficulty, and religiosity) and psychological (anxiety, depression, problem alcohol use, and drug use) risk/protective factors were assessed among 27,961 individuals. Three aspects of suicidality, including ideation, plan, and attempt, were also assessed. Logistic regression models were used for data analysis. Financial difficulty, violence victimization, identifying oneself as gay/lesbian, anxiety, depression, and drug use increased, while religiosity reduced the odds of suicidal behaviors. Multiplicative effects were found between the following social and psychological risk factors: (1) financial difficulty and anxiety; (2) financial difficulty and depression; (3) depression and drug use; (4) problem alcohol use and drug use; and (5) depression and problem alcohol use. There is a considerable overlap in the social and psychological processes, such as financial stress, mood disorders, and substance use problems, on risk of suicide in college students. As social and psychological risk factors do not operate independently, comprehensive suicidal risk evaluations that simultaneously address multiple social and psychological risk factors may be superior to programs that only address a single risk factor.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d1ca9d7b56d0870980502c8cb36aebe7",
  "timestamp": "2025-05-15T02:18:37.141985"
}