{
  "id": 6525,
  "title": "SEISMIC RISK IN THE STATE OF COLIMA, MEXICO: APPLICATION OF A SIMPLIFIED METHODOLOGY OF THE SEISMIC RISK EVALUATION FOR THE LOCALITIES WITH LOW-RISE, NON-ENGINEERED HOUSING",
  "abstract": "The study of seismic risk is important element in the natural hazard assessment, especially in the regions of high seismic activity and low structural quality of housing. The new technologies, developed to reduce risk against natural hazards in large modern cities, are expensive and need in continuous instrumental monitoring of strong motions. The main problem in estimation of the seismic risk for the localities, representing with the vulnerable low-rise, non-engineered (LRNE) housing in many states of Africa, Asia and Latin America, consists in a search of an optimal and low-cost tool for estimation of the extent of physical damage to property for different type of housing. This article proposes a simplified methodology of the seismic risk evaluation for the localities, where the vulnerable LRNE houses represent most residential constructions. The methodology is based on evaluation of the following sources of information: the internet-available catalogs of world-wide recent and historical earthquakes and visual inspection and classification of the vulnerability level of residential LRNE houses as well as a visual macroseismic inspection of the residential house damage after destructive earthquakes. This methodology is applied to the localities of the State of Colima, Mexico characterizing with the LRNE type of residential houses. The prognostic of damage probability during large earthquake for residential houses in Colima city, based on this methodology, was firsdy proposed in 1999 and then was updated in 2007 after the analysis of damage distribution during the M-w 7.5 earthquake of 2003 (MM VII in Colima city). This article presents microzoning of the seismic risk for two localities of Colima State together with a probabilistic prognostic of the expected damage in housing and financial losses during the maximum intensity earthquakes at the localities.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d1d205473451c7a3dbdb6738a5f84c05",
  "timestamp": "2025-05-15T02:59:07.462974"
}