{
  "id": 6650,
  "title": "Parent psychological distress and parent-child relationships two years into the COVID-19 pandemic: Results from a Canadian cross-sectional study",
  "abstract": "BackgroundMental health impacts of the COVID-19 pandemic have not been felt equally within populations. Parents with children living at home were early on identified as a population at heightened mental health risk, with concerns about the potential long-term impacts of the pandemic on parents' mental health, family functioning, and children's well-being. This study investigates impacts of the pandemic on parents' psychological distress, contextual sources of distress, and associations with family functioning nearly two years into the pandemic.Methods and findingsData were drawn from a national cross-sectional survey of adults living in Canada in November and December 2021 that was representative by age, gender, household income, and region. Parents with children < 18 years old living at home (N = 553) reported their experiences of psychological distress, pandemic-related stressors, coping mechanisms, and family functioning (changes in parent-child interactions, children's anxiety). Chi-square tests, logistic regression, and linear regression analyses examined sociodemographic inequities in parents' levels of psychological distress, sources and mitigating mechanisms of distress, and associations between psychological distress and family functioning. Nearly two years into the pandemic, parents with children at home reported nearly double pre-pandemic population estimates of moderate to severe psychological distress. Psychological distress was more frequently reported among parents with pre-existing mental health conditions, disabilities, and financial stressors. Parents with greater psychological distress reported increases in negative parent-child interactions due to the pandemic and higher anxiety among their children.ConclusionsThis study identifies sustained negative impacts of the pandemic on parents' mental health and family functioning in Canada nearly two years into the pandemic, despite high vaccine uptake and declining infection rates. Disparities in financial stress, social support structures, and pre-existing mental health were identified as underlying sources of psychological distress. These results highlight that meaningful responses to promote mental health among parents and families must address social and structural inequities.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d1e562b4c48e7c8c807de5e524a54e97",
  "timestamp": "2025-05-15T03:00:05.059095"
}