{
  "id": 5795,
  "title": "Catastrophic expenditures and impoverishment due to out-of-pocket health payments in Kosovo",
  "abstract": "Background: The current health system reforms in Kosovo aim to improve health status through universal health coverage. Risk pooling and ensuring access to necessary care without financial hardship are envisaged through compulsory health insurance. We measure the level of financial risk protection through two commonly applied concepts: catastrophic health expenditures and impoverishment. Methods: Data from the 2014 Kosovo Household Budget Survey were used to estimate catastrophic health expenditures as a percentage of household consumption expenditures at different thresholds. Poverty head counts and gaps were estimated before and after out-of-pocket (OOP) health payments. Results: Approximately 80% of the households in Kosovo incurred OOP health payments. Most of these expenditures were for medicine, pharmaceutical products and medical devices, followed by diagnostic and outpatient services. Hospital services and treatment abroad were less frequent but highly costly. Although households from the upper consumption groups spent more, households from the lower consumption groups spent a greater share of their consumption expenditures on healthcare. The catastrophic health expenditure head count showed an increase, while the impoverishment and poverty gap remained stable compared to 2011. Regression analysis showed that age of the household head, insurance coverage, household size, belonging to the lowest consumption expenditure quintiles, and having disabled and aged household members were significant predictors of the probability of experiencing catastrophic health expenditures. Conclusions: Ongoing financing reforms should target the lower income quintiles and vulnerable groups, pharmaceutical policies should be revisited, and the internal referral system should be strengthened to overcome excessive spending for treatment abroad.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d1eca9de2e7423b0f5e43404908738d8",
  "timestamp": "2025-05-15T02:51:30.078330"
}