{
  "id": 588,
  "title": "Patterns of spread and adoption of millet agriculture along the eastern rim of the Tibetan Plateau: Archaeobotanical evidence from Houzidong, Southwest China (4200-4000 cal. BP)",
  "abstract": "The spread of domesticated crops has commonly occurred alongside broad patterns of long-and short-distance human movements and culture contact across regions. While exchange across Eurasia along the so-called Silk Road has been much discussed, recent work has revealed increasingly more evidence for early north-south contact along the eastern rim of the Tibetan Plateau. Main points of debate concern the timing and direction of the spread of agriculture and domesticated crops. This paper contributes to these discussions by presenting new data from macrobotanical remains and phytoliths from Houzidong in southwest Sichuan, a Neolithic site on the eastern rim of the Tibetan Plateau. The results show that the main crops during the late Neolithic (4200-4000 cal. BP) were foxtail millet (Setaria italica) and broomcorn millet (Panicum miliaceum), with a small amount of rice (Oryza sativa), but that agriculture was overall not a major focus. Rather, the subsistence at Houzidong like at other sites in the region was highly diverse, relying on gathering, hunting, and small-scale cultivation with considerable crop diversity aimed at minimizing the impact of potential crop failure. This paper shows that subsistence practices differed markedly between sites, local populations exploiting the rich natural resources in the respective ecological niches in various ways. We argue that the wide variety of food sources available in southwest China allowed people to mitigate risk but also made them more receptive to new food sources such as plant crops, experimenting with them and adding them to their portfolio. Similar patterns can be seen in the adoption and adaptation of other outside influences with each community picking and choosing what suited them best, thus creating the rich and varied patchwork of highly localized cultural phe-nomena that came to characterize southwest China.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d1ef34814b8f959e6d6c3657be4d9fd0",
  "timestamp": "2025-05-15T00:37:38.203855"
}