{
  "id": 7416,
  "title": "Assessment of adherence to treatment recommendations among patients with heart failure: a cross-sectional study",
  "abstract": "BackgroundHeart failure (HF) is a chronic condition characterized by significant impairment of the cardiovascular system, leading to a decline in health-related quality of life, recurrent hospitalizations, and increased mortality risk. It poses a substantial challenge for modern medicine, particularly when patients fail to adhere to therapeutic recommendations. The primary aim of this study was to evaluate the level of adherence to therapeutic guidelines among patients with HF and identify factors influencing adherence levels. MethodsThe study comprised 105 HF patients admitted to the cardiology department. A diagnostic survey approach was utilized, employing the Adherence in Chronic Diseases Scale (ACDS) along with a self-developed questionnaire. ResultsThe findings revealed that 39.05% of participants exhibited a moderate level of adherence to therapeutic recommendations, while 34.29% reported high adherence and 26.67% displayed low adherence. Most of the patients (n = 66) had a rather good level of knowledge. Factors such as higher education (p < 0.001), engagement in mental work (p = 0.001), favorable socioeconomic status (p < 0.001), being in a stable relationship (p < 0.001), and residing with family (p < 0.001) were associated with increased adherence levels. The multivariable linear regression model indicated significant (p < 0.05) independent predictors that positively influenced the ACDS score, including being in a relationship, widowhood, and average or poor financial situation. Conversely, factors such as obesity and respiratory diseases were associated with a decrease in the ACDS score (p < 0.05). ConclusionsThis study underscores the moderate adherence level to therapeutic recommendations among HF patients. Sociodemographic factors including education level, relationship status, occupation, financial stability, and living arrangements significantly impact adherence. Conversely, patients with obesity, respiratory conditions, or frequent HF-related hospitalizations demonstrate lower adherence. Patient education emerges as a pivotal factor influencing adherence. Tailored interventions targeting these factors could enhance adherence and optimize HF management outcomes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d2178e30f784d0c7c381f8d544686213",
  "timestamp": "2025-05-15T03:08:37.737118"
}