{
  "id": 8213,
  "title": "Association of Posttraumatic Growth and Illness-Related Burden With Psychosocial Factors of Patient, Family, and Provider in Pediatric Cancer Survivors",
  "abstract": "Research has indicated that childhood cancer may lead to posttraumatic growth (PTG), given cancer's association with posttraumatic stress. PTG may be associated with family/home and health care dynamics, as well as parental resilience, distress, and coping. This cross-sectional study investigated the associations of psychosocial factors of the patient, family, and health care team with PTG and illness-related burden (IRB) in childhood cancer survivors. The sample comprised 61 children and adolescents (7-18 years of age), their parents, and their nurses. Respondents completed their assessment an average of 1.73 years after the end of treatment for the child's disease, which was either leukemia, a solid tumor, or lymphoma. Regression analyses showed that PTG was positively associated with the patients' posttraumatic stress symptoms. It was also positively associated with the parents' religious coping, and with measures of stronger family and oncologist relationships (R-2 = .32). IRB was positively associated with patient-reported posttraumatic stress symptoms, negatively associated with the nurse's trust in the family, and positively associated with parent-reported mental distress, lower family socioeconomic status, and female gender (R-2 = .53). There was no significant association with parenting style or parent-reported posttraumatic stress symptoms in the child. The findings suggested that the young cancer patient's psychosocial and resource milieu (e.g., financial) may be instrumental in PTG and IRB. Psychosocial interventions with high-risk families and their health care teams could increase growth and reduce burden.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d21c1a1311c04c0e6adac9c2304dd6a5",
  "timestamp": "2025-05-15T03:16:48.838753"
}