{
  "id": 6157,
  "title": "Predictors of loneliness and different types of social isolation of rural-living older adults in the United Kingdom",
  "abstract": "Loneliness and social isolation are recognised, conceptually distinct threats to health and wellbeing in older age but limited evidence is available on their predictors in rural populations. This study performed logistical regression modelling to explore the predictors of loneliness, isolation from one's family and isolation from one's community in 884 British rural-living older adults (57.9% female; mean age = 71.5, standard deviation = 8.1 years) within the Grey and Pleasant Land data-set. While 13 per cent of participants reported feeling lonely, 49 per cent reported isolation from their family and 9 per cent reported isolation from their community. Minimal cross-over between groups was observed. Widowhood, financial difficulties, area deprivation, and self-reported impairments in physical and mental health predicted loneliness. Greater financial difficulty gave lower odds of isolation from one's family, and higher levels of community engagement gave lower odds of isolation from the community. Ageing in place (longer residency) was the only common predictor for all three dependent variables. Initiatives aimed at tackling loneliness and social isolation in rural-living older people must recognise that the two concepts are distinct, affecting different population sub-groups with mostly different risk factor profiles. Future interventions and policies should clearly identify whether their target is loneliness or social isolation and tailor their interventions appropriately.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d2200094aa09e95f64c314f979d971b6",
  "timestamp": "2025-05-15T02:55:12.992336"
}