{
  "id": 3465,
  "title": "Investigation of stock price network based on time series analysis and complex network",
  "abstract": "Complex network is now widely used in a series of disciplines such as biology, physics, mathematics, sociology and so on. In this paper, we construct the stock price trend network based on the knowledge of complex network, and then propose a method based on information entropy to divide the stock network into some communities, that is, a gathering study of stock price trend. We construct time series networks for each stock in Chinese A-share market based on time series network model, and then use these networks to divide the stock market into communities. We find that the average trend of stocks in the same community is the same as the trend of market value weighting, but the average trend of stocks in different communities is quite different and the sequence correlation is low. This conclusion shows that stocks in the same community share the same price trend, while the stock trend in different communities varies. This paper is a successful application of complex network and information entropy in stock trend analysis, which mainly includes two contributions. First, the success of the visibility graph algorithm provides a new perspective for enriching stock price trend modeling. Second, our conclusion proves that the clustering based on information entropy theory is effective, which provides a new method for further research on stock price trend, portfolio construction and stock return prediction.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d2323e21085c72ef0faced121a0ec9a5",
  "timestamp": "2025-05-15T01:17:25.495433"
}