{
  "id": 3304,
  "title": "Exploring the Evolution of Core Technologies in Agricultural Machinery: A Patent-Based Semantic Mining Analysis",
  "abstract": "The semi-automatic construction and analysis of technology roadmaps are at the forefront of applying artificial intelligence techniques. To clarify the development path of the core technologies in the field of agricultural machinery, we propose a core technology evolution path analysis method based on patent text semantic mining. First, the key sentences in the text were extracted, and the BERT model was used to represent the topic's key sentences in semantic vectorization. Then, the technology roadmap was constructed through the unsupervised LDA topic clustering method, and the main fields of activity, blank fields, and fields of agricultural machinery were visually analyzed. Next, investment in research fields was strengthened. Finally, we mapped the technology roadmap and patent IPC codes and found that the evolution of core technologies in the field of agricultural machinery could be divided into the technology development stage, technology focus stage, and technology transformation stage; this allows us to analyze the evolution and integration of these core technologies. The internal laws of the technology evolution provide a reference for future research plans of governments, enterprises, and institutions, aiding in the patent portfolio planning by revealing the microlevel process of technology integration and the technological trends in agricultural machinery.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d26bc366ad1b9390b1e98cb01939a445",
  "timestamp": "2025-05-15T01:15:54.722368"
}