{
  "id": 6704,
  "title": "Are there financial savings associated with supplementing current diagnostic practice for preeclampsia with a novel test? Learnings from a modeling analysis from a German payer perspective",
  "abstract": "Objective: To quantify the financial impact of adding a novel serum test to the current diagnostic toolkit for preeclampsia (PE) detection in Germany. Methods: A decision-analytic model was created to quantify the economic impact of adding a recently developed novel diagnostic test for PE (Roche Diagnostics, Rotkreuz, Switzerland) to current diagnostic practice in Germany. The model simulated a cohort of 1000 pregnant patients receiving obstetric care and quantified the budget impact of adding the novel test to current German PE detection and management practices. Results: The model estimates that the costs associated with managing a typical pregnancy in Germany are (sic)941 when the novel test is used versus (sic)1579 with standard practice. This represents savings of (sic)637 per pregnant woman, even when the test is used as a supplementary diagnostic tool. The savings are attributed to the novel test's ability to better classify patients relative to current practice, specifically, its ability to reduce false negatives by 67% and false positives by 71%. Conclusion: The novel PE test has the potential to provide substantial cost savings to German healthcare payers, even when used as an addition to standard practice. Better classification of patients at risk for developing PE and declassification of those that are not compared to current practice leads to economic savings for the healthcare system. Furthermore, by reducing the rates of false-positive and false-negative classification relative to current standard of care, the test helps better target healthcare spending and lowers overall costs associated with PE care.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d26f094178413fcba9c624ff7f5b3f6d",
  "timestamp": "2025-05-15T03:00:35.531505"
}