{
  "id": 9312,
  "title": "Dental practice closure during the first wave of COVID-19 and associated professional, practice and structural determinants: a multi-country survey",
  "abstract": "Background The coronavirus outbreak (COVID-19) in China has influenced every aspect of life worldwide. Given the unique characteristics of the dental setting, the risk of cross-infection between dental practitioners and patients is high in the absence of adequate protective measures, and dentists may develop severe anxiety in relation to the current pandemic. The limited provision of services and widespread closure of dental practices have raised concerns among dental professionals about the financial impact. The present study assessed the frequency of dental practice closure during the pandemic's first wave in several countries and whether closures and their associated factors differ between the private and non-private sectors. Methods An electronic cross-sectional survey questionnaire was sent to dentists in several countries, from April to May 2020. The survey assessed professional, practice related and country-level structural factors elucidating the reason for practice closure. Multilevel logistic regression was used to assess the association between practice closure and these factors, and differences were evaluated by sector type. Results Dentists from 29 countries (n = 3243) participated in this study. Most of the participants (75.9%) reported practice closure with significantly higher percentage in the private sector than the non-private sector. Greater pandemic-related fears were associated with a significantly higher likelihood of practice closure in the private (odds ratio [OR] = 1.54, 95% confidence interval [CI] 1.24, 1.92) and non-private (OR = 1.38, 95% CI 1.04, 1.82) sectors. Dentists in non-private rural areas (OR = 0.58, 95% CI 0.42, 0.81), and those in hospitals (overall OR = 0.60, 95% CI 0.36, 0.99) reported a low likelihood of closure. A high likelihood of closure was reported by dentists in the academia (OR = 2.13, 95% CI 1.23, 3.71). More hospital beds at the country-level were associated with a lower likelihood of closure in the non-private sector (OR = 0.65, 95% CI 0.46, 0.91). Private- sector dentists in high- income countries (HICs) reported fewer closures than those in non-HICs (OR = 0.55, 95% CI 0.15, 1.93). Conclusions Most dentists reported practice closure because of COVID-19, and greater impacts were reported in the private sector than in the non-private sector. Closure was associated with professional, practice, and country-levels factors.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d26f15f2ab5ddb2da5fbbc556ff6a6f6",
  "timestamp": "2025-05-15T03:27:25.152155"
}