{
  "id": 3149,
  "title": "The differences in the impact of entrepreneurial abilities of various European SMEs on their financial risk perceptions",
  "abstract": "Objective: The objective of the article is to investigate whether the impact of innovativeness and competitiveness of small and medium-sized enterprises (SMEs) on their financial risks differ depending on the countries where SMEs are located. Research Design & Methods: The researchers created an online questionnaire and gained data from 1221 Czech, Slovak, and Hungarian SMEs. Moreover, the researchers applied ordinal logistic regression analyses to achieve the goal of this study. Findings: According to the results, the impact of competitiveness on the bankruptcy risk perception of SMEs differ depending on the countries where they operate. Concerning the impact of innovativeness on financial performance and financial risk management, this article also proves that international differences between SMEs exist. Implications & Recommendations: The developments in the financial literacy of company executives and their managerial experiences and the improvements in credit access conditions, intellectual property rights, and tax legislation can make SMEs reduce their concerns about their financial risks. Thus, policymakers' implementations are crucial to providing equal opportunities for SMEs even if they operate in various markets. Contribution & Value Added: This current research does not only make international comparisons among the investigated variables but also analyses the impacts of entrepreneurial competencies on various indicators of financial risk. These facts not only make this research become a unique study in the literature but also the reason why it should garner the interest of prospective readers such as policymakers, academicians, and SME owners.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d27fb94334d1b67f741f1130f5d30c99",
  "timestamp": "2025-05-15T02:22:56.795648"
}