{
  "id": 3771,
  "title": "Can Fund Managers Select Outperforming REITs? Examining Fund Holdings and Trades",
  "abstract": "Despite at least six empirical studies published since 2000 designed to assess fund managers' Real Estate Investment Trust (REIT)-selection ability, their skill remains in question. Unlike previous studies, we examine fund holdings and trades of REITs to answer this question. This approach allows us to explicitly account for portfolio rebalancing that alters REIT-characteristic weights of fund portfolios. Results show that fund managers, after controlling for property type, size and momentum, generated significant positive alpha with their securities-selection ability. To understand the sources of such ability, we examine whether fund managers who followed certain trading strategies outperformed relative to other managers. The potential trading strategies are based on public information related to geographic concentration, net-asset-value-to-price ratios, income and appreciation styles and leverage of the underlying REITs. Comparative and regression analyses show that none of the strategies fully explains why fund managers were able to select REITs that outperformed. We surmise that the outperformance mainly derives from the endemic abilities of managers to uniquely process REIT-specific information and generate private valuation beliefs that lead to profitable investment decisions.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d2832bebd0264a51a867a079ffc4405e",
  "timestamp": "2025-05-15T01:20:36.101269"
}