{
  "id": 4176,
  "title": "Launching a new brand in the multi-brand portfolio: real world observational study evaluating mediating role of detailing priority and detailing time on physicians' prescription behavior",
  "abstract": "PurposeLaunching a new product successfully in a multi-brand portfolio is one of the major challenges a pharmaceutical marketer faces. This study aims to examine the role of detailing of new brands on physicians' prescription behaviour as compared to established brands. Further, the study explores mediating role of detailing priority and detailing time on the relationship between detailing of new versus established brands and physician's prescription behaviour. Design/methodology/approachThis study was conducted as a real-world observational study involving field research. In total, 338 physicians, 90 PSRs and 44 field managers participated in this study. A serial mediation model (Hayes, Model 6) was used to examine the relationship. Regression analysis with bootstrapping was used to test the hypotheses. FindingsDetailing of new versus established brands has a differential effect on physicians' prescription behaviour. In addition, this relationship is serially mediated by detailing priority and detailing time. Research limitations/implicationsResults suggest that detailing priority and detailing time positively and significantly alter the relationship between the detailing of new brands and physicians' prescription behaviour as compared to established brands. While, in the absence of mediators, established brands generate higher prescriptions than new brands, the serial mediating effect helps new brands to generate more prescriptions as compared to established brands. Practical implicationsThis research highlights the importance of detailing priority and detailing time for the successful launch of the new products. It presents compelling evidence for practicing managers to effectively use a predetermined detailing plan vis-a-vis individualized detailing strategy during the launch of a new brand. Originality/valueTo the best of the authors' knowledge, this is the first study to evaluate the role of detailing priority and detailing time as mediators between the relationship of detailing and physicians' prescription behaviour. This is also one of the rare studies to use real-world observational study methodology for conducting research.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d29c9fbfb0340f3d2671ccb4cf1f53b3",
  "timestamp": "2025-05-15T01:24:25.439886"
}