{
  "id": 2773,
  "title": "Study on the Relationship between the Policy of Working Capital Management and Profitability in Listed Company of Liquor Industry",
  "abstract": "Working capital is the most vigorous part in the enterprise. The policies of working capital management reflect level of operating management directly. This paper based on financial data of listed company of liquor industry about 2002-2012, utilizing earning rate of net asset reflect multiple indicator of profitability and policy of working capital management in listed company. By regression analysis, research the relationship between policy of working capital management and profitability, to provide beneficial mirror for improving the level of working capital management policy. Working capital management is an important part of financial management of enterprises, an company must have moderate working capital for normal revolve, no matter good or bad, management of working capital will impact production and operating activities and profitability. The main content measuring enterprise policies of working capital management include financing combination asset portfolio and policy of asset portfolio. Return on equity is the primary indicator to weigh enterprise's profitability. This article based on financial data of listed company of liquor industry; research the relationship between policy of working capital management and profitability, to provide countermeasure and advice for improving efficiency of working capital management in listed company of liquor industry.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d2dae9b20c5c0bb58eb098f5e655679d",
  "timestamp": "2025-05-15T01:10:16.506920"
}