{
  "id": 5597,
  "title": "Research on the impact of green insurance on regional environmental quality: evidence from China",
  "abstract": "Green insurance (GI), as an innovative product integrating environmental protection and the financial sector, not only contributes to improving regional environmental quality (EQ) but also enhances corporate environmental risk management and awareness, driving the flourishing development of green finance and the environmental protection industry. Therefore, understanding the relationship between GI and EQ is crucial. This article delves into the mechanisms through which GI influences EQ, proposing a hypothesis that suggests an inverted U shape impact. Subsequently, based on panel data from 30 provinces in China spanning from 2000 to 2021, nonlinear regression models and threshold regression models were constructed to test the hypothesis. The research findings indicate: (1) Results from the fixed-effects regression model demonstrate that the impact of GI on China's EQ follows an inverted U shape. (2) Results from the threshold regression model also reveal an inverted U shape impact of GI on China's EQ, with a threshold value of 2.196. (3) Economic level and industrial structure exhibit significant inhibitory effects on EQ improvement. Technological level and environmental regulations demonstrate notable promotional effects. Population size shows no significant impact on EQ improvement. The study identifies a nonlinear effect of GI on EQ improvement, surpassing existing linear effect research, deepening the understanding of its impact on EQ, and contributing to the enhancement of regional EQ.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d2dda11622371f5339d4937439017ddd",
  "timestamp": "2025-05-15T02:49:21.726878"
}