{
  "id": 627,
  "title": "A Hybrid Approach for the Assessment of Risk Spillover to ESG Investment in Financial Networks",
  "abstract": "In this paper, we present a framework for evaluating risk contagion by merging financial networks with machine learning techniques. The framework begins with building a financial network model based on the inter-institutional correlation network, followed by analyzing the structure and overall value changes of the financial network under the stress of a liquidation shock. We then examine the network's evolution over time. We also use three machine learning techniques to assess the abnormal volatility of important financial institutions in the financial network. Finally, we evaluate the spillover effects of risk volatility in financial networks on ESG investments. The findings suggest that the financial network becomes more robust as the connections among financial institutions become more intricate. This leads to an improvement in the ability of the financial network to withstand systemic risk events. Overall, our study provides evidence of the negative impact of risk spillovers in financial networks on ESG investments, highlighting the need for a more sustainable and resilient financial system. This innovative framework combining financial network modeling and machine learning prediction provides a deeper understanding of the evolution of financial networks and a more accurate evaluation of abnormal volatility in financial networks.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d2eab3029e54888271c8c79d586c4077",
  "timestamp": "2025-05-15T01:53:24.788972"
}