{
  "id": 3864,
  "title": "The role of geopolitical risks on the Turkish economy opportunity or threat",
  "abstract": "The aim of this paper is to assess the extent of geopolitical risk (GPR) on the Turkish financial stability. Financial stability is calculated by constructing a New Financial Stress Index (NFSI), which includes for the first time in Turkey, the dollarization rate. Using monthly data from January 2006 to November 2018, we apply Threshold Vector Auto Regression method (Threshold VAR) to evaluate the impact of GPR stemming from Saudi Arabia (regional) and Russia (global) on financial stress in Turkey. This method defines two regimes (high-stress and low-stress) and captures a nonlinearity association between GPR and NFSI. We use the model to run Granger causality tests to study whether the consumer confidence, financial stability and geopolitical risks at the regional and the global levels predict future financial crises in Turkey. Interestingly, our data covers the recent trade spat between Turkey and the US. Our results reveal that: (i) The FSI without the dollarization rate underestimates the severity of financial crises, while the FSI that includes the dollarization rate has detected a turning point dated -December 2013-, where the financial market, or more precisely, the foreign exchange market has become more vulnerable and exposed to future financial crises; (ii) higher GPR in Russia results in higher financial stability in Turkey, while higher GPR in Saudi Arabia results in higher financial vulnerability in Turkey. Consequently, we deduce that GPRs stemming from Saudi Arabia and Russia affect Turkish financial stability differently. Russia appears to be a political and economic competitor for Turkey, while Saudi Arabia is more likely to be dependent geopolitically.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d2f6dd7f3e8b540ea7c00bbe0180e97e",
  "timestamp": "2025-05-15T02:30:58.161013"
}