{
  "id": 7315,
  "title": "Prevalence of elder abuse and its related factors in Iran: A community-based study",
  "abstract": "Elder abuse is a major problem that has physical, sexual, psychological, financial, and negligence dimensions. This can lead to physical ailments such as fractures and mental disorders such as anxiety and depression. The aim of this study was to determine the prevalence and related factors of elder abuse in Shahroud county, northeast of Iran. This cross-sectional study was conducted on 360 Iranian older people referred to Shahroud health centers by using cluster sampling method with inclusion criteria of; age over 60 years and mental and cognitive health and exclusion criteria of severe physical disease and disrupting the process of completing the questionnaire. Elder abuse was measured using a Vulnerability to Abuse Screening Scale (VASS) with a score higher than 2 and the relationship between age, gender, education, housing status, number of children, employment status, marital status, insurance status, and living arrangement with elder abuse was examined in a logistic regression model. The prevalence of elder abuse was 38.6%. Living with spouse and children (OR = 0.20) and living with spouse (OR = 0.43) were associated with lower risk of elder abuse compared with living alone in the regression model. A significant number of Iranian older people are exposed to abuse and health care systems need to take steps to reduce this social problem. It is suggested that the older adults live at least in marriage status as much as possible and that a cultural context to deal with the phenomenon be adopted through education and planning.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d2f81604402a9fc1166a9236907ff5d8",
  "timestamp": "2025-05-15T03:07:31.833496"
}