{
  "id": 6512,
  "title": "Corruption Risks in Public Construction",
  "abstract": "Public construction is an important driver of a country's economy and has an overarching significance in the context of good governance. However, massive financial volumes and complex processes make it highly vulnerable to corruption. Various stages of a typical public works project are exposed to different corruption risks. This study comprehensively examines these risks using extensive literature survey, interactive workshops with practitioners, and a Delphi survey with India's top anticorruption experts. The inventory of 30 significant identified risks was evaluated through a survey conducted between February and May 2022 across 143 practitioners in large public organizations in India. A risk priority number (RPN) obtained using failure mode effect analysis was used to rank the risk criticality. The post-tendering stage has the highest concentration of the critical risks with an RPN over 20. Underlying attributes of the corruption risks were identified, and the interpretive structural model (ISM) followed by impact matrix cross-reference multiplication applied to a classification analysis (MICMAC) were applied to these factors to facilitate a structured and systematic visualization of the problem of corruption in public works procurement. Violation of professional standards and ethics and lack of fairness emerge as the most influential drivers of corruption in construction. The study provides appealing insights into the problem of corruption while offering practical managerial inputs.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3123685e7bccdf4185f96c8e772454f",
  "timestamp": "2025-05-15T02:58:34.357939"
}