{
  "id": 3469,
  "title": "The effect of stress exposure on depressive symptoms and major depressive episode among US Afro-Caribbean women",
  "abstract": "Purpose This study examines whether stress exposures experienced within and across various life domains (e.g., interpersonal, financial) are predictors of depression among Afro-Caribbean women, an understudied ethnic group within the US Black female population. Methods A sample of Afro-Caribbean women (N = 878) was drawn from the National Survey of American Life (NSAL), the first nationally representative psychiatric epidemiology survey focused on the mental health of the US Afro-Caribbean and African American populations. Negative binomial regression analysis was conducted for depressive symptoms, and binary logistic regression results are presented for past-year and lifetime major depressive episode. Analyses examined the relative effect of five stress exposures on depression: major discrimination, everyday discrimination, past-month chronic stress, financial strain, and negative interactions with family. Results Of the five stress exposures, chronic stress and financial strain were associated with increased risk for both recent (e.g., past week) and more distal (i.e., past-year and lifetime) experiences of depression. Though experiences with discrimination were associated with depression, its effects were attenuated when other stressors were taken into account. Conclusions Mental health prevention and intervention programs must address stress concerns that are chronic in nature and stressors that reflect financial instability for Afro-Caribbean women.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3171f87af2ced2507f934b83aead528",
  "timestamp": "2025-05-15T02:26:48.444946"
}