{
  "id": 3592,
  "title": "A systematic scoping study exploring opioid use across a variety of disability conditions",
  "abstract": "Background: Opioid use experiences among people with disability (PWD) as a group has not been clearly articulated in the current literature, despite links between pain and measures of disability. Objective: To conduct a systematic search and scoping study examining the characteristics of current literature focused on opioid use among PWD. Methods: Four databases were queried (i.e., Medline, PsycINFO, Embase, and CINAHL) for peer-reviewed, empirical, English-language, journal articles focused on long-term opioid use among PWD. Collected data points included: disability details (specific condition, onset of disability), opioid details (category of opioid use, and specified substance), study details, and design. Results: A total of 196 articles were included, with 83.7% published since 2000 largely from the US. The majority of articles (70.4%) focused on the use of opioids as medical treatment, with fewer articles focusing on recreational opioid use or substance use disorders. The majority of included sources (73%) focused on opioid use in acquired conditions; neuropathic pain (21.9%) and attention deficit hyperactivity disorder (20.4%) were the most commonly studied. Differences were observed in the distribution of disability conditions across category of opioid use and study design classification; 73.5% were considered observational in design. Conclusions: The varied representation of disability conditions, and differences across opioid use category and study design classification point to a complicated relationship between opioid use and disability. The present research portfolio would benefit from research matching informational needs of a specific disability area or opioid use category to provide the evidence necessary to advance current knowledge and promote inclusion in national agendas. Published by Elsevier Inc.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d31997f871a68b2e88bd89f32fc632c5",
  "timestamp": "2025-05-15T01:19:00.621813"
}