{
  "id": 5915,
  "title": "Do ownership structures affect the establishment of a risk management committee? Evidence from an emerging market",
  "abstract": "The main aim of this paper is to examine the determinants that contribute to the establishment of a risk management committee (RMC) in a firm. Unlike previous studies, this paper investigates the types of ownership structure, comprising family, institutional, government, managerial, and foreign ownership, as the factor that leads to the establishment of an RMC. This is based on the observation of 2,173 non-financial public listed firms from 2015 until 2017 in the Malaysian business market. By using logistic regression, the results depict that government and foreign ownership are significantly and positively related to the establishment of an RMC. In contrast, the establishment of an RMC in family and managerial ownership firms shows a negatively significant effect. The results indicate that family and managerial ownership have less of an agency problem in the firm, thus requiring less monitoring as compared to other types of ownership, which require more monitoring, especially in terms of managing risks, which affirm the argument of the agency theory. As a result, this study provides empirical evidence on the determinants of the establishment of RMCs and informs regulators and policymakers about the potential requirement for RMC establishment in Malaysian non-financial publicly traded firms.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d31bc8fbc69aa18c8bf0360bbf91e7ab",
  "timestamp": "2025-05-15T02:53:02.961678"
}