{
  "id": 2446,
  "title": "What attracts decision makers' attention? Managerial allocation of time at product development portfolio meetings",
  "abstract": "Purpose - Managers' attention is a scarce resource in complex innovation settings. Prior research on the factors to which managers pay attention is mostly based on surveys. The present study aims to address the need for knowledge about the behavior of decision makers based on observations from portfolio meetings. The study seeks to investigate how managers allocate their attention and the role of different factors for their attention. Observations also make it possible to compare prior research and expectations with the actual observed behavior of decision makers. Design/methodology/approach - The present analysis draws on insights from previous research into decision making in product and portfolio management and studies on organizational decision making. The authors frame why the attention of decision makers is so critical in complex situations. Data for this study were collected through direct observation, from a portfolio management system, and from an information quality measurement system in an internationally operating petrochemical company. Observations were transcribed, coded and analyzed with regression analysis using the Proc Lifereg procedure in SAS. Findings - Six potential factors that might explain decision makers' attention are identified. The analysis shows that the quality of information was not significant for explaining variations of decision makers' attention; but, even more surprisingly, differences in project status did not explain variations in attention. Delayed projects did not get significantly more attention than those delivered on time. By controlling for other project characteristics, the newness of projects to the corporate portfolio was found to be the most important parameter. Originality/value - First, the analysis is based on observations from actual meetings rather than from surveys. Second, several observations contradict prior research on product development, e.g. it has been argued that decision makers should pay special attention to certain phases and projects having trouble meeting expectations towards planned deadlines. It is also new that findings on the different treatment of new projects and ongoing projects have been brought forward in research on product and portfolio management.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d31f998da22a475768345b86ec4e8ab3",
  "timestamp": "2025-05-15T01:07:02.964562"
}