{
  "id": 4335,
  "title": "Skin color and investment performance in South Africa's mutual funds industry",
  "abstract": "Purpose Using data for the period 1965-2016, we investigate whether there are systematic differences between the investment performance of Black fund managers and those of other races in South Africa and whether investors recognize these differences. The two-tailed test results show that there is no significant difference between the two means considering the 12 months yield return at a hypothesized mean difference of zero. There is no statistical difference at 5% level of significance implying that the performance of Black fund managers is as equally as that of managers of other races. Our results also show that the percentage of Black fund managers in South Africa is still too low even as the workforce gets diverse. There's no single explanation for what is happening in this industry. The findings cannot be explained by differences in fund characteristics such as age, total assets under management or expenses or from the performance lenses. The results seem hard to reconcile with an explanation of differences in portfolio characteristics such as return volatility or market, size, value and momentum exposures. Design/methodology/approach We test the glass cliff hypothesis by employing conditional logistic regression (CLR). The approach enables the use of case/control style of analysis where White/majority fund managers are the control population and professional minorities are the case group. The selection of these as fund managers is our event or outcome variable. To test savior effect hypothesis, we employ analysis of variance (ANOVA). The technique enables us to compare variances between the groups: when a White male fund manager replaces a professional minority, when a White male fund manager replaces a White male fund manager and when a professional minority replaces a professional minority. Findings Our analyses so far have documented a woeful underrepresentation of Black fund managers in South Africa's mutual funds industry. We explore potential explanations for these trends. Our analysis is meant to be suggestive. Are Blacks, women, people of color and ethnic minorities finding success in the investment industry? Are they having rewarding and fulfilling careers? Or is the industry still homogenous (just a White man's world) with a thin veneer of diversity layered on for public relations effect? The percentage of Black fund managers in South Africa is still too low even as the workforce gets diverse. There is no single explanation for what is happening in this industry. The findings cannot be explained by differences in fund characteristics such as age, total assets under management or expenses or from the performance lenses. Also, the results seem hard to reconcile with an explanation of differences in portfolio characteristics such as return volatility or market, size, value and momentum exposures. Research limitations/implications The two-tailed test results show that there is no significant difference between the two means considering the 12 months yield return at a hypothesized mean difference of zero. There is no statistical difference at 5% level of significance. Our results so far establish that, ceteris paribus, the performance of Black fund managers is as equally as that of managers of other races. Practical implications The two-tailed test results show that there is no significant difference between the two means considering the 12 months yield return at a hypothesized mean difference of zero. There is no statistical difference at 5% level of significance. Our results so far establish that, ceteris paribus, the performance of Black fund managers is as equally important as that of managers of other races. Social implications The two-tailed test results show that there is no significant difference between the two means considering the 12 months yield return at a hypothesized mean difference of zero. There is no statistical difference at 5% level of significance. Our results so far establish that, ceteris paribus, the performance of Black fund managers is as equally important as that of managers of other races. Originality/value This paper investigates whether there are systematic differences between the investment performance of Black fund managers and those of other races in South Africa and whether investors recognize these differences. Our hypothesis is that due to Broad-Based Black Economic Empowerment (BBBEE) laws in the country and possibly, due to a perception of discrimination in the market, it is only Black fund managers with superior fund management skills that enter the profession. As such, we expect to find superior performance among Black fund managers. We also conjecture that investors recognize this phenomenon and reward Black fund managers with more fund flows and more investment mandates than others.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d328e6f0fbf82f54e6651323e8ce1914",
  "timestamp": "2025-05-15T01:25:50.612458"
}