{
  "id": 5793,
  "title": "ACCOUNTING AS A TOOL FOR ASSESSING INDICATORS OF ACHIEVING SUSTAINABLE DEVELOPMENT GOALS",
  "abstract": "Purpose. The purpose of the study is to substantiate the functionality of accounting as a tool for monitoring indicators of achieving the Sustainable Development Goals (SDGs). Methodology / approach. The following methods were used in the study: generalisation and formalisation (to systematise the information under study and present the proposed assessment), economic and statistical analysis (to assess the state and trends of the index of achieving the SDGs), correlation and regression analysis (to determine the impact of factors on the SDG index), graphical and tabular (for visual presentation of data). Results. Using the example of agricultural enterprises, the importance of monitoring SDG indicators at the micro level is proved. In particular, the corporate level of research on sustainable development policy is developed, which declares the goal of achieving the SDGs as an integral part of the business model of the enterprise. It is established that, along with global monitoring of SDG indicators based on statistical data from individual countries, it is important to monitor them at the level of individual enterprises. Such monitoring is proposed to be carried out using accounting tools and methods. To carry out a comprehensive monitoring, an algorithm for accounting support for the analysis and evaluation of indicators of achieving the SDGs by an agricultural enterprise is proposed. The algorithm includes four stages: determination of the purpose, parameters and scope of the analysis; inventory of activities, collection and documentation of sectoral indicators of achievement of the SDGs; identification, analysis (correlation, regression) and evaluation of sectoral factors influencing the indicators of achievement of the SDGs; interpretation of the results and their generalisation in reporting. To take into account data that do not have a financial expression, three scales for assessing the qualitative parameters of the impact of an activity (product) on the achievement of social and environmental SDGs have been developed. The approach for assessing the risk and uncertainty of the research results according to the developed algorithm are also proposed. Originality / scientific novelty. An algorithm for accounting support for the analysis and evaluation of indicators of achieving the SDGs by an agricultural enterprise is proposed, which, unlike the existing ones, makes it possible to take into account indicators that do not have a financial expression. The developed algorithm declares the expansion of the accounting functionality by supplementing it with the function of monitoring the SDG indicators. The theoretical component of the research includes an improved classification of accounting with regard to the criteria of sustainable development. Practical value / implications. The results of the study can be used by agricultural enterprises of various sizes, specialisations and forms of ownership that seek to operate in the vector of sustainable development in order to identify problem areas and formulate alternatives to solve existing problems.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d339dc45dce1140ddb20ff4bf11c8234",
  "timestamp": "2025-05-15T02:51:30.063802"
}