{
  "id": 4954,
  "title": "Association of Do-Not-Resuscitate Patient Case Mix With Publicly Reported Risk-Standardized Hospital Mortality and Readmission Rates",
  "abstract": "This cross-sectional study examines the association between rates of mortality and readmission used by Medicare to determine financial penalties and to rank hospital quality with the case mix of patients with do-not-resuscitate status at US hospitals. Question Are risk-standardized mortality and readmission rates used in financial penalties and quality star ratings associated with the case mix of patients with do-not-resuscitate status in US hospitals? Findings In this cross-sectional study of mortality cohorts comprising 4 & x202f;884 & x202f;237 inpatient encounters and readmission cohorts including 4 & x202f;450 & x202f;378 inpatient encounters, hospitals with a greater relative volume of patients with present-on-admission do-not-resuscitate status had statistically significantly higher 30-day risk-standardized mortality rates and statistically significantly greater odds of avoiding a Hospital Readmission Reduction Program financial penalty. Meaning Results of this study suggest that risk-standardized hospital outcomes should control for do-not-resuscitate status to avoid potential biases in pay-for-performance programs and hospital quality rankings. Importance The Centers for Medicare and Medicaid Services's (CMS's) 30-day risk-standardized mortality rate (RSMR) and risk-standardized readmission rate (RSRR) models do not adjust for do-not-resuscitate (DNR) status of hospitalized patients and may bias Hospital Readmissions Reduction Program (HRRP) financial penalties and Overall Hospital Quality Star Ratings. Objective To identify the association between hospital-level DNR prevalence and condition-specific 30-day RSMR and RSRR and the implications of this association for HRRP financial penalty. Design, Setting, and Participants This cross-sectional study obtained patient-level data from the Medicare Limited Data Set Inpatient Standard Analytical File and hospital-level data from the CMS Hospital Compare website for all consecutive Medicare inpatient encounters from July 1, 2015, to June 30, 2018, in 4484 US hospitals. Hospitalized patients had a principal diagnosis of acute myocardial infarction (AMI), heart failure (HF), stroke, pneumonia, or chronic obstructive pulmonary disease (COPD). Incoming acute care transfers, discharges against medical advice, and patients coming from or discharged to hospice were among those excluded from the analysis. Exposures Present-on-admission (POA) DNR status was defined as an International Classification of Diseases, Ninth Revision diagnosis code of V49.86 (before October 1, 2015) or as an International Statistical Classification of Diseases and Related Health Problems, Tenth Revision diagnosis code of Z66 (beginning October 1, 2015). Hospital-level prevalence of POA DNR status was calculated for each of the 5 conditions. Main Outcomes and Measures Hospital-level 30-day RSMRs and RSRRs for 5 condition-specific cohorts (mortality cohorts: AMI, HF, stroke, pneumonia, and COPD; readmission cohorts: AMI, HF, pneumonia, and COPD) and HRRP financial penalty status (yes or no). Results Included in the study were 4 & x202f;884 & x202f;237 inpatient encounters across condition-specific 30-day mortality cohorts (patient mean [SD] age, 78.8 [8.5] years; 2 & x202f;608 & x202f;182 women [53.4%]) and 4 & x202f;450 & x202f;378 inpatient encounters across condition-specific 30-day readmission cohorts (patient mean [SD] age, 78.6 [8.5] years; 2 349 799 women [52.8%]). Hospital-level median (interquartile range [IQR]) prevalence of POA DNR status in the mortality cohorts varied: 11% (7%-16%) for AMI, 13% (7%-23%) for HF, 14% (9%-22%) for stroke, 17% (9%-26%) for pneumonia, and 10% (5%-18%) for COPD. For the readmission cohorts, the hospital-level median (IQR) POA DNR prevalence was 9% (6%-15%) for AMI, 12% (6%-22%) for HF, 16% (8%-24%) for pneumonia, and 9% (4%-17%) for COPD. The 30-day RSMRs were significantly higher for hospitals in the highest quintiles vs the lowest quintiles of DNR prevalence (eg, AMI: 12.9 [95% CI, 12.8-13.1] vs 12.5 [95% CI, 12.4-12.7]; P < .001). The inverse was true among the readmission cohorts, with the highest quintiles of DNR prevalence exhibiting the lowest RSRRs (eg, AMI: 15.3 [95% CI, 15.1-15.5] vs 15.9 [95% CI, 15.7-16.0]; P < .001). A 1% absolute increase in risk-adjusted hospital-level DNR prevalence was associated with greater odds of avoiding HRRP financial penalty (odds ratio, 1.06; 95% CI, 1.04-1.08; P < .001). Conclusions and Relevance This cross-sectional study found that the lack of adjustment in CMS 30-day RSMR and RSRR models for POA DNR status of hospitalized patients may be associated with biased readmission penalization and hospital-level performance.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d33bbbe963445699141d62d750574638",
  "timestamp": "2025-05-15T02:42:36.287122"
}