{
  "id": 8988,
  "title": "Patho-epidemiology of cancer cervix in Karachi South",
  "abstract": "Introduction: The present study was conducted with the objective of examining descriptive epidemiological and pathological characteristics of cancer cervix in Karachi South, an all urban district population of Karachi, Pakistan. Methodology: A total of 74 cases of cancer cervix, ICD-10 (International Classification of Diseases 10th Revision) category C53 were registered at the Karachi Cancer Registry, for Karachi South, during a 3 year period, 1st January, 1995 to 31st December 1997. Results: The age standardized incidence rate (ASR) world and crude incidence rate (CIR) per 100,000 were 6.81 (5.2, 8.43) and 3.22 (2.49 to 3.96). Cancer cervix accounted for approximately 3.6% of all cancers in females and was the sixth malignancy in hierarchy. The mean age of the cancer cases was 53.27 years [standard deviation (SD) 11.6; 95% confidence interval (CI) 50.58, 55.96; range (R) 32-85 years)]. The distribution by religion was Muslims (90.5%), Christians (8.1%) and Hindus (1.4%). There were no cases reported in Parsees. The frequency distribution by ethnicity was Urdu speaking Mohajirs (20.3%), Punjabis (17.6%), Gujrati speaking Mohajirs (4.1%), memon Mohajirs (8.1%), Sindhis (10.8%), Baluchs (8.1%), Pathans (5.4%) and Afghan migrants (2.7%). The ethnicity was not known in approximately a fourth (23.0%) of the cases. The socio-economic distribution was 27.0% financially deprived class, 24.4% lower middle class and 48.7% upper middle and affluent classes. The majority of the women were married (86.5%); a smaller number were unmarried (2.7%) or widows (10.8%). The age-specific curves showed a gradual increase in risk from the fourth up till the seventh decade, followed by an actual apparent decrease in risk after 64 years of age. The peak incidence was observed in the 60-64 year age group. The morphological categorization was squamous cell carcinoma (86.5%), adenocarcinoma (10.9%) and adenosquamous carcinoma (2.6%). The majority of cases presented with moderately differentiated or grade 2 lesions (45.9%). There were no in-situ cases. Approximately half the cancers (58.1%) had spread regionally and 8.1% to a distant site at the time of diagnosis. Odds ratios (OR) were calculated for socioeconomic residential categories, religion, ethnicity, age groups and education. The OR, for socioeconomic residential categories ranged between 0.69 and 2.9 with a marginally higher risk in the lower [OR 2.09 (95% CI .97; 4.49)] and lower middle class [OR 2.08 (95% CI 0.95; 4.58)]. Hindus [OR 1.2 (95% CI 0.18; 2.2)] had a slightly higher risk then the Muslims [OR 0.14 (95% CI 0.17; 1.2)]. A higher risk was also observed for Christians [OR 7.76 (95% CI 1.74; 34.5)]. Conclusion: The incidence of cervical cancer in Karachi South (1995-97) reflects a low risk population with a late presentation and a high stage disease at presentation. It is suggested that cervical screening if implemented should focus on once a life time methodology involving 36-45 year old women. This should be combined with HPV vaccination for the young and public health education for all. A regular cervical screening program would require mobilization of considerable financial, structural and human resources along with training for personnel. This may burden the already stretched health resources of a developing country.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d345bddbc45b32807e28539450ab39de",
  "timestamp": "2025-05-15T03:24:26.352402"
}