{
  "id": 6090,
  "title": "Who pays for poor surgical quality? Building a business case for quality improvement",
  "abstract": "BACKGROUND: Both providers and payors bear the financial risk associated with complications of poor quality care. But the stakeholder who bears the largest burden of this risk has a strong incentive to support quality improvement activities. The goal of the present study was to determine whether hospitals or payors incur a larger burden of increased hospital costs associated with complications. STUDY DESIGN: We merged clinical data for 1,008 surgical patients from the private sector National Surgical Quality Improvement Program to the internal cost-accounting database of a large university hospital. We then determined the marginal costs of surgical complications from the perspective of both hospitals (changes in profit and profit margin) and payors (increase in reimbursement paid to the hospital). In our analyses of cost and reimbursement, we adjusted for procedure complexity and patient characteristics using multivariate linear regression. RESULTS: Reimbursement for patients without complications ($14,266) exceeded hospital costs ($10,978), generating an average hospital profit of $3,288 and a profit margin of 23%. When complications occurred, hospitals still received reimbursement in excess of their costs, but the profit margin declined: reimbursement ($21,911) exceeded hospital costs ($21,156), yielding an average profit of $755 and a profit margin of 3.4%. Complications were always associated with an increase in costs to health-care payors: complications were associated with an average increase in reimbursement of $7,645 (54%) per patient. CONCLUSIONS: Hospitals and payors both suffer financial consequences from poor-quality health care, but the greater burden falls on health-care payors. Strong incentives exist for health-care payors to become more involved in supporting quality improvement activities.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d34895102d17e784ef56beade3cd93b7",
  "timestamp": "2025-05-15T02:54:38.832110"
}