{
  "id": 9330,
  "title": "Insights into the knowledge, practices and training needs of veterinarians working with smallholder livestock producers in Australia",
  "abstract": "The location of properties holding livestock is fluid; edging towards the boundaries of urban Australia, increasing the likelihood that veterinarians will be exposed to livestock as part of the provision of routine veterinary services. This study was conducted to ascertain the challenges, knowledge level and training needs of veterinarians working within this landscape, with the ultimate aim of informing the development of resources and training to better equip them in this capacity. For this purpose, a cross-sectional study, using a self-administered questionnaire was conducted among Australian veterinarians. The questionnaire comprised a mixture of 47 short closed, semi-closed and open-ended questions and was available for electronic distribution. Data was analysed descriptively and logistic regression analysis was used to identify potential factors associated with knowledge and practices of veterinarians in relation to smallholders. Complete responses were obtained from 91 veterinarians. The main livestock species kept by smallholder clients were sheep, goats, and cattle; with on-farm visits reported the most frequent interaction type, and responding to emergency situations the most frequently performed activity. The challenges experienced by veterinarians when working with smallholders were mostly related to external factors such as; lack of facilities, lack of client knowledge on animal health management and client's financial constraints. Over 95% of respondents provided some level of biosecurity advice and zoonotic disease information as part of their routine veterinary service. Although veterinarians provide advice and support to smallholders, only 14.5% considered themselves to be highly influential on smallholder practices. Confidence level in investigating disease differed by livestock species, with lower confidence reported in pigs, poultry and alpaca. Respondents were open to receiving assistance to support smallholders on matters related to disease, welfare or biosecurity, with other veterinarians (government and private), reported as the most frequently utilised resource. Having access to materials that could be distributed to smallholders was considered to be an effective way in which to provide information. While the risk of zoonotic disease was considered a challenge associated with working with smallholders, respondent's use of personal protective equipment (PPE), whilst performing common veterinary activities, was in many instances inadequate. Similarly, vaccination levels among veterinarians and other workers within the veterinary practice to prevent zoonotic diseases were variable. This study provides an insight into the way in which veterinarians engage with smallholders and highlight the importance of providing both groups with the tools necessary to manage the livestock to which are exposed.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d35ea11f71666376ab682264f857e78e",
  "timestamp": "2025-05-15T03:27:53.328207"
}