{
  "id": 1940,
  "title": "Identification of Model Risk of Selected Systemic Risk Measures for The Polish Banking Industry",
  "abstract": "There are many approaches to measure systemic risk (Hansen 2013), but the main distinction entails financial soundness indicators and advanced systemic risk models. The advanced models are based on the statistical multivariate distributions or on the stochastic processes. In the paper the Conditional Value-at-Risk (CoVaR) proposed by Adrian and Brunnermeier (2011, 2016) will be used to assess systemic risk. Two methods, i.e. the conditional (DCC-GARCH) and unconditional (quantile regression) will be applied for these estimations. As a proxy of a financial system a construction of an index, free from disadvantages as opposed to the stock market index, will be proposed by the author. The empirical analysis for the Polish financial system will contain: a model risk analysis, comparison of results for selected measure of systemic risk and estimation methods, an evaluation of results (back testing and a financial condition assessment of financial institutions). In the study existence of the strong and positive relationship between results of the delta CoVaR gained while applying the DCC-GARCH and quantile regression confirmed complementarity of both approaches. The relationship between the systemic risk measure for an individual bank and measure of its financial condition was confirmed, but the results were not consistent. The delta CoVaR was more influenced by the size of a bank rather than its financial condition. This study indicated that the delta CoVaR and a composite indicator contained different sets of information.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3624c11f56e27324a56f9edc54822ab",
  "timestamp": "2025-05-15T02:09:14.401337"
}