{
  "id": 8127,
  "title": "A Baby Was an Added Burden: Predictors and Consequences of Unintended Pregnancies for Female Sex Workers in Mombasa, Kenya: A Mixed-Methods Study",
  "abstract": "Introduction Female sex workers (FSW) have high rates of unintended pregnancy, sexually transmitted infections including HIV, and other adverse sexual and reproductive health outcomes. Few services for FSWs include contraception. This mixed-methods study aimed to determine the rate, predictors and consequences of unintended pregnancy among FSWs in Mombasa, Kenya. Methods A prospective cohort study of non-pregnant FSWs was conducted. Quantitative data were collected quarterly, including a structured questionnaire and testing for pregnancy and HIV. Predictors of unintended pregnancy were investigated using multivariate logistic regression. Qualitative data were gathered through focus group discussions and in-depth interviews with FSWs who became pregnant during the study, and interviews with five key informants. These data were transcribed, translated and analysed thematically. Results Four hundred women were enrolled, with 92% remaining in the cohort after one year. Fifty-seven percent reported using a modern contraceptive method (including condoms when used consistently). Over one-third (36%) of women were using condoms inconsistently without another method. Twenty-four percent had an unintended pregnancy during the study. Younger age, having an emotional partner and using traditional or no contraception, or condoms only, were independent predictors of unintended pregnancy. Women attributed pregnancy to forgetting to use contraception and being pressured not to by clients and emotional partners, as well as bad luck. They described numerous negative consequences of unintended pregnancy. Conclusion Modern contraceptive uptake is surprisingly low in this at-risk population, which in turn has a high rate of unintended pregnancy. The latter may result in financial hardship, social stigma, risk of abandonment, or dangerous abortion practices. FSWs face considerable barriers to the adoption of dual method contraceptive use, including low levels of control in their emotional and commercial relationships. Reproductive health services need to be incorporated into programs for sexually transmitted infections and HIV, which address the socially-determined barriers to contraceptive use.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3826d28002b178eec66dbef49f459b2",
  "timestamp": "2025-05-15T03:15:38.368879"
}