{
  "id": 5023,
  "title": "A study of risk-perceptions of consumers based on online shopping environment",
  "abstract": "It is always the focal point of foreign consumer's behavior research that explains the purchase behavior on Internet by using perceived risk, and now it has also attracted domestic scholars. By analyzing the characteristics of network environment, this paper fist redefines the categories of perceived risk in new network environment based on the classification of conventional shopping environment, and suggests the perceived risks in the network environment during consumers' shopping process should include: financial risk, performance risk, time risk, privacy risk, service risk, information risk, social risk, psychological risk and technical risk. Then for more in-depth study of Chinese consumer's perceived risk types and the importance of this types, this paper, subdivides the 9 kinds of perceived risks into more specific elements, and Put them into the five online shopping behavior stages including the demand confirmation stage, the information searching stage, the program evaluation stage, the purchase decision-making stage and the after-purchasing stage. Then this paper adopts a Survey by using various Communication tools like interviews, the Internet and postal service to send 250 copies of the questionnaire, of which 214 retrieved, including 168 effective ones. This Survey contains basic information of respondents and risks perceived by respondents when they experience the online shopping process, and tries to recognize the importance of various perceived risks at each stage. Combining predecessors' theoretical study with this investigation, the paper finally analyzes how these consumers' perceived risk formed and makes conclusions.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d38404ce2cd40b9b3f64dbebcbbdc97f",
  "timestamp": "2025-05-15T02:43:40.114779"
}