{
  "id": 4526,
  "title": "ESG lending, technology investment and banking performance in BRICS: navigating sustainability and financial stability",
  "abstract": "PurposeThis study examines the impact of ESG lending and technology-related capital expenditures on banking performance in BRICS economies. It assesses how these factors influence return on risk-weighted assets and nonperforming loans, providing insights into the role of sustainable finance and digital transformation in banking stability.Design/methodology/approachUsing quarterly panel data (2015-2023) from commercial banks in Brazil, Russia, India, China and South Africa (BRICS), this study employs fixed-effects regression models to estimate the effects of ESG lending and technology investment on banking performance. A robustness check is conducted by segmenting the sample into large and small banks to assess the moderating role of institutional scale.FindingsThe results indicate that greater exposure to high-ESG firms enhances banking performance by improving RoRWA and reducing NPLs. Similarly, borrowers investing in technology exhibit more substantial financial stability, leading to lower credit risk for banks. The effects are more pronounced in smaller banks, suggesting that sustainable and technology-driven lending strategies provide greater risk mitigation benefits for institutions with resource constraints.Practical implicationsThe findings highlight the strategic importance of integrating ESG and technology factors into banking credit risk frameworks. Banks should develop specialized financial products and enhance ESG and technology-based credit assessments to optimize lending strategies. Policymakers should introduce incentives to promote sustainable finance, encourage digital transformation and standardize ESG reporting across emerging markets.Originality/valueThis study contributes to the sustainable banking literature by jointly examining the impact of ESG and technology investments on banking performance in emerging economies. It provides empirical evidence from BRICS, highlighting the role of institutional scale in shaping the effectiveness of sustainable finance strategies. The results offer actionable insights for banks and regulators seeking to balance financial performance and sustainability in high-growth but volatile markets.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d38e1b7410f4af53417563c8f227c836",
  "timestamp": "2025-05-15T02:38:20.309553"
}