{
  "id": 9075,
  "title": "Disaster Preparedness Among Older Japanese Adults With Long-Term Care Needs and Their Family Caregivers",
  "abstract": "Objective:In the 2011 Great East Japan Earthquake, as in Hurricanes Katrina and Rita in the United States, older individuals were at the greatest risk of mortality. Much concern has been raised about developing plans to reduce these risks, but little information has been provided about preparedness, and the key role played by caregivers has been largely unexplored. The aims of this study were thus to examine the preparedness of family caregivers of older adults with long-term care needs and to identify the characteristics of older adults and their caregivers that are associated with poor preparedness and greater concern about disasters. Methods:Shortly after the Great East Japan Earthquake, the second wave of the Fukui Longitudinal Caregiver Study was administered to the family caregivers of older Japanese individuals with long-term care needs. The sample included 952 caregivers from 17 municipalities in Fukui prefecture. Logistic regression analyses were used to identify the factors associated with self-assessed preparedness, evacuation planning, and caregivers' concerns about preparedness. Results:The majority (75%) of the caregivers had no concrete plans for evacuation in an emergency, and those caring for persons with dementia were 36% less likely to have any plan. In multivariate models, caregivers who were more experienced and wealthier and who reported more family and community support were more likely to feel well prepared. Caregivers with poor health or limited financial resources or who were responsible for older persons with mobility difficulties reported higher levels of anxiety about their disaster preparedness. Conclusions:This study indicates that most caregivers are ill prepared to respond in emergencies and that caregiver resources, community support, and the needs of older care recipients influence both preparedness and concern about disasters. Education for caregivers and the development of community support programs could provide important sources of assistance to this vulnerable group. (Disaster Med Public Health Preparedness. 2017;11:31-38)",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d39516534837436c3aabb66e818c1dce",
  "timestamp": "2025-05-15T03:25:27.653175"
}