{
  "id": 9064,
  "title": "The Impacts of Inclusionary State Immigrant Policies on Psychosocial Outcomes Among Latinx Adolescents",
  "abstract": "Objective: State -level policies that exclude immigrants, primarily undocumented, from public services and benefits have been found to have negative psychosocial impacts on Latinx adults, regardless of nativity. The effects of inclusionary policies-that is, extending public benefits to all immigrants- remain underexamined, as well as the impacts on adolescents. Method: We used data from the Youth Risk Behavior Survey from 2009 to 2019 to examine the association between 7 state -level inclusionary policies and bullying victimization, low mood, and suicidality among Latinx adolescents via 2 -way fixed -effects log -binomial regression models. Results: Banning the use of eVerify in employment was associated with decreased bullying victimization (prevalence ratio [PR] = 0.63, 95% CI: 0.530.74), low mood (PR = 0.87, 95% CI: 0.78-0.98), and suicidality (PR = 0.73, 95% CI: 0.62-0.86). Extending public health insurance coverage was associated with decreased bullying victimization (PR = 0.57, 95% CI: 0.49-0.67), and mandating Culturally and Linguistically Appropriate Services (CLAS) training for health care workers was associated with decreased low mood (PR = 0.79, 95% CI: 0.69-0.91). Extending in -state tuition to undocumented students was associated with increased bullying victimization (PR = 1.16, 95% CI: 1.04-1.30), and extending financial aid was associated with increased bullying victimization (PR = 1.54, 95% CI: 1.08-2.19), low mood (PR = 1.23, 95% CI: 1.08-1.40), and suicidality (PR = 1.38, 95% CI: 1.01-1.89). Conclusion: The relationships between inclusionary state -level policies and Latinx adolescent psychosocial outcomes were mixed. Although most inclusionary policies were associated with improved psychosocial outcomes, Latinx adolescents residing in states with inclusionary policies related to higher education had worse psychosocial outcomes. Results suggest the importance of elucidating the unintended consequences of well-intentioned policies and the importance of continued efforts to reduce anti -immigrant sentiment.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3a06e5213d1d236195ccb125f0750d9",
  "timestamp": "2025-05-15T03:25:27.625674"
}