{
  "id": 5488,
  "title": "Microeconomic Costs, Insurance, and Catastrophic Health Spending Among Patients With Acute Myocardial Infarction in India Substudy of a Randomized Clinical Trial",
  "abstract": "IMPORTANCE Ischemic heart disease is the leading cause of death in India, and treatment can be costly. OBJECTIVE To evaluate individual- and household-level costs and impoverishing effects of acute myocardial infarction among patients in Kerala, India. DESIGN, SETTING, AND PARTICIPANTS This investigation was a prespecified substudy of the Acute Coronary Syndrome Quality Improvement in Kerala study, a stepped-wedge, cluster randomized clinical trial conducted between November 2014 and November 2016 across 63 hospitals in Kerala, India. In this cross-sectional substudy, individual- and household-level cost data were collected 30 days after hospital discharge from a sample of 2114 respondents from November 2014 to July 2016. Data were analyzed from July through October 2018 and in March 2019. EXPOSURES Health insurance status. MAIN OUTCOMES AND MEASURES The primary outcomes were detailed direct and indirect cost data associated with acute myocardial infarction and respondent ability to pay as well as catastrophic health spending and distress financing. Catastrophic health spending was defined as 40% or more of household expenditures minus food costs spent on health, and distress financing was defined as borrowing money or selling assets to cover health costs. Hierarchical regression models were used to evaluate the association between health insurance and measures of financial risk. Costs were converted from Indian rupees to international dollars (represented herein as $). RESULTS Among 2114 respondents, the mean (SD) age was 62.3 (12.7) years, 1521 (71.9%) were men, 1144 (54.1%) presented with an ST-segment elevation myocardial infarction, and 1600 (75.7%) had no health insurance. The median (interquartile range) expenditure among respondents was $480.4 ($112.5-$1733.0) per acute myocardial infarction encounter, largely driven by in-hospital expenditures. There was greater than 15-fold variability between the 25th and 75th percentiles. Individuals with or without health insurance had similar monthly incomes and annual household expenditures, yet individuals without health insurance had approximately $400 higher out-of-pocket cardiovascular health care costs (median [interquartile range] total cardiovascular expenditures among uninsured, $560.3 [$134.1-$1733.6] vs insured, $161.4 [$23.2-$1726.9]; P < .001). Individuals without health insurance also had a 24% higher risk of catastrophic health spending (adjusted risk ratio, 1.24; 95% CI, 1.07-1.43) and 3-fold higher risk of distress financing (adjusted risk ratio; 3.05; 95% CI, 1.45-6.44). CONCLUSIONS AND RELEVANCE The results of this study indicate that acute myocardial infarction carries substantial financial risk for patients in Kerala. Expansion of health insurance may be an important strategy for financial risk protection to disrupt the poverty cycle associated with cardiovascular diseases in India.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3b62a5f2c61f5fb999a8f7a5eb9d9dc",
  "timestamp": "2025-05-15T02:48:23.706852"
}