{
  "id": 8223,
  "title": "Variation in ambulatory surgery utilization in Michigan",
  "abstract": "Background: The practice of ambulatory surgery has expanded greatly as a result of advances in surgical technology and rising financial pressures. We sought to characterize the utilization of ambulatory surgical practices for common general surgical procedures in Michigan. Materials and methods: We identified 33,655 patients within the Michigan Surgery Quality Collaborative clinical registry undergoing general surgical procedures performed on an ambulatory basis between 25% and 75% of the time. Our primary outcome was the incidence of ambulatory surgery. Using multilevel mixed-effects logistic regression models, we adjusted ambulatory surgery utilization rates for patient comorbidities, procedure composition, and hospital characteristics. We then assessed the incidence of postoperative complications across hospitals grouped by their ambulatory surgery utilization rates. Results: Adjusted utilization rates of ambulatory surgery varied widely across 34 hospitals from 29%-75% (mean = 54%). Risk-adjusted complication rates for ambulatory cases were similar between hospitals performing the least (2.2%) and the most ambulatory surgery (2.3%, P = 0.365). Patient factors and hospital characteristics accounted for 23.3% of the between-hospital variability in ambulatory surgery utilization, whereas most variation was explained by effects at the surgeon level. Conclusions: Despite wide variation in ambulatory surgery utilization for general surgical procedures, we were unable to explain observed differences by patient comorbidities, case mix, or hospital characteristics. These data suggest that understanding factors associated with ambulatory surgery utilization may represent a novel avenue for quality improvement within our statewide surgical collaborative. (C) 2014 Elsevier Inc. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3b63c08dd65da03ab16253ddec978a9",
  "timestamp": "2025-05-15T03:16:48.862449"
}