{
  "id": 288,
  "title": "Users Sentiment Analysis Using Artificial Intelligence-Based FinTech Data Fusion in Financial Organizations",
  "abstract": "Innovative applications surprised the research communities in the 21st by presenting in diverse domains. Financial technology (FinTech) is an example of these innovative applications. Financial technology applications have renovated traditional banking systems into improved smart business models. Financial technology applications enable the customers with minimum risk or other possible attacks and can make transactions through credit cards and mobile applications from anywhere and anytime. However still the customer doesn't fully trusted and preferred the uncertain behavior about FinTech-driven applications. To precisely solve this uncertain behavior of customer sentiments, this paper identifies and encourage them towards the use of FinTech-assisted applications. This paper proposed a pipelined model to evaluate user sentiments for their uncertain behaviors towards these FinTech-assisted applications. The proposed model consists of a convolutional neural network (CNN) and support vector machine (SVM), where the CNN is used for classifying the sentiments of different behaviors while SVM is used for statistical information to measure to what extent the users reflect negative behavior. The simulation results are based on the sentiments of users against the OVO application and Mint application on Google Play Store. An overall accuracy rate of 91.7% is recorded for the OVO application. This high accuracy rate reflects the satisfaction of the users with the OVO application and Mint application. Furthermore, this automatic analysis of negative reviews can be used as evidence for future contributions in the revised versions of these applications to secure a safer and more competitive position in the market.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3b7fa9e6ebc25ef929a7fc79cc8590b",
  "timestamp": "2025-05-15T01:49:04.601023"
}