{
  "id": 391,
  "title": "HFTCRNet: Hierarchical Fusion Transformer for Interbank Credit Rating and Risk Assessment",
  "abstract": "As a prominent application of deep neural networks in financial literature, bank credit ratings play a pivotal role in safeguarding global economic stability and preventing crises. In the contemporary financial system, interconnectivity among banks has reached unprecedented levels. However, many existing credit risk models continue to assess each bank independently, resulting in inevitable suboptimal performance. Thus, developing advanced neural networks to model intricate temporal dynamics and interconnected relationships in the banking system is essential for an effective credit rating and risk assessment learning system. To this end, we propose a novel hierarchical fusion transformer for interbank credit rating and risk assessment (HFTCRNet), which includes the long-term temporal transformer (LT3) module, short-term cross-graph transformer (STCGT) module, attentive risk contagion transformer (ARCT) module, and hierarchical fusion transformer (HFT) module to capture the long-term growth trajectories of banks, the short-term interbank network variance, the potential propagation of risks within interbank network, and integrate these information hierarchically. We further develop an interbank credit rating dataset, encompassing quarterly financial data, interbank lending networks, and key indicators such as credit ratings and systemic risk (SRISK) for 4548 banks from 2016Q1 to 2023Q1. Notably, we also adapt the minimum density algorithm to stabilize the interbank loan network over time, aiding in the analysis of long-term and short-term network effects. Our learning system uses semi-supervised learning to handle labels of varying sparsity, integrating credit ratings and SRISK for a comprehensive assessment of individual bank creditworthiness and systemic interbank risk. Extensive experimental results on our interbank dataset show that HFTCRNet not only outperforms all the baselines in terms of credit rating accuracy but also can evaluate the systemic risk within the interbank network. Code will be available at: https://github.com/AI4Risk/HFTCRNet.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3b99ef6a4e3e1882ea69cf06e6765ea",
  "timestamp": "2025-05-15T01:50:14.073200"
}