{
  "id": 9015,
  "title": "Effects of Educational Messaging on Urgent and Emergent Care-Seeking Behaviors Among Publicly Insured Populations",
  "abstract": "BACKGROUND: The impact of messaging campaigns on influencing urgent care-and emergent care-seeking behaviors, including the use of in-network providers, is not well-understood. Although out-of-network healthcare utilization can have negative financial consequences for patients in narrow network Affordable Care Act plans, individuals with time-sensitive medical conditions, and especially patients visiting the emergency department, may not think about out-of-network issues. Inappropriate or avoidable emergency department visits can also create unnecessary costs for patients. OBJECTIVE: To evaluate the impact of 5 messaging strategies to educate individuals about the use of in-network providers and when care should be sought in the emergency department, urgent care center, or other sites of care. METHODS: Using a retrospective analysis, individuals aged >= 18 years who were enrolled in an individually purchased Affordable Care Act-compliant Humana plan as of July 1, 2015, were randomized to 1 of 5 messaging arms (e-mail, magnet mailer with or without e-mail, and key-tag mailer with or without e-mail) or to a control group. The outreach was implemented and evaluated in 2 distinct, geographically defined populations of Orlando, Palm Beach, and Tampa, Florida (Population 1); and Atlanta, Georgia, and San Antonio and Austin, Texas (Population 2). The relative number of each emergency department, urgent care, and out-of-network visits during follow-up was modeled using negative binomial regression. Cox proportional hazard models were used to calculate the risk for >= 1 of each visit type (assessed separately) and high emergency department utilization (defined as >= 3 visits during follow-up) relative to the control, while accounting for variable follow-up time. RESULTS: The relative numbers of each visit type assessed were not significantly different for any message group compared with the control in either population. The risk for an emergency department visit was 4%lower in the e-mail arm of Population 2 (hazard ratio [HR], 0.96; 95% confidence interval [CI], 0.94-0.99; P = .005) and 7% lower in the e-mail/key-tag arm of Population 1 (HR, 0.93; 95% CI, 0.890.97; P = .001). The risk for high emergency department utilization was significantly reduced by the key-tag, magnet, and e-mail/key-tag strategies in Population 1, but no impact was found in Population 2. CONCLUSION: Despite the mixed results, the study provides new insights into how different messaging strategies could be used to educate patients and influence healthcare utilization decisions by people with health insurance.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3bef508b264d8ae5c6d1ef893e12316",
  "timestamp": "2025-05-15T03:24:54.865976"
}