{
  "id": 3530,
  "title": "Clustering of multiple health-risk factors among vocational education students: a latent class analysis",
  "abstract": "Physical and mental health risks often commence during young adulthood. Vocational education institutions are an ideal setting for understanding how health-risks cluster together in students to develop holistic multiple health-risk interventions. This is the first study to examine clustering of tobacco smoking, fruit intake, vegetable intake, alcohol consumption, physical inactivity, overweight/obesity, depression, and anxiety in vocational education students and the socio-demographic characteristics associated with cluster membership. A cross-sectional survey with vocational education students (n = 1134, mean age = 24.3 years) in New South Wales, Australia. Latent class analysis identified clusters and latent class regression examined characteristics associated with clusters. Four clusters were identified. All clusters had moderate inadequate fruit intake and moderate overweight/obesity. Cluster 1 (13% of sample) had high anxiety, high inadequate vegetable intake, low tobacco, and low alcohol use. Cluster 2 (16% of sample) had high tobacco smoking, high alcohol use, high anxiety, high depression, and high inadequate vegetable intake. Cluster 3 (52% of sample) had high risky alcohol use, high inadequate vegetable intake, low depression, low anxiety, low tobacco smoking, and low physical inactivity. Cluster 4 (19% of sample) was a lower risk cluster with high inadequate vegetable intake. Compared to cluster 4, 16-25-year-olds and those experiencing financial stress were more likely to belong to clusters 1, 2, and 3. Interventions for vocational education students should address fruit and vegetable intake and overweight/obesity and recognize that tobacco use and risky alcohol use sometimes occurs in the context of mental health issues.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3cfbd53ebacecd7e644e7156e1acc88",
  "timestamp": "2025-05-15T02:27:19.094000"
}