{
  "id": 565,
  "title": "Development of an intelligent information system for financial analysis depend on supervised machine learning algorithms",
  "abstract": "The development of Management Information Systems (MIS) is impossible without the use of machine learning (ML). It's a type of Artificial Intelligence (AI) that makes predictions using statistical models. When it comes to financial analysis, there are numerous risk-related concerns to contend with today (FI). In the financial sector, machine learning algorithms are used to detect fraud, automate trading, and provide financial advice to investors. To better serve its customers, the financial sector can now save borrower data according to specific criteria thanks to MIS. In fact, there is a large amount of data about debtors, making load management a difficult task. ML can examine millions of data sets in a short period of time without being explicitly programmed to improve the results. This type of algorithm can aid financial institutions in making grant selections for their clients. For the objective of classifying FI in terms of fraud or not, the Intelligent Information System for Financial Institutions (IISFI) relying on Supervised ML (SML) Algorithms has been created in this work. Bayesian Belief Network, Neural Network, Decision trees, Naive Bayes, and Nearest Neighbor has been compared for the purpose of classifying FI risks using the performance measures asfalse positive rate, true positive rate, true negative rate, false negative rate, accuracy, F-Measure, Mean Absolute Error (MAE), Mean Squared Error (MSE), Root Mean Square Error (RMSE), Med AE, Receiver Operating Characteristic (ROC) area,Precision Recall Characteristic (PRC) area, and measures of PC.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3d39959333bf3b9ae116b42deeb63dc",
  "timestamp": "2025-05-15T01:52:49.379211"
}