{
  "id": 3094,
  "title": "Interbank market, stock market, and bank performance in East Asia",
  "abstract": "This paper investigates the role of stock and interbank markets in measuring bank performance in Korea, Malaysia, and Thailand. Research on whether financial markets served in terms of assessment and discipline of banks has been done in advanced countries; however, there has been limited research on this question as it applies to banks in East Asian countries. The stock price of individual banks can reflect a bank's risk profile, interbank loans to domestic banks with higher risk and bad performance may decline, and interbank borrowing rates charged to banks can respond to bank performance. This functioning of the stock and interbank markets is particularly important from the view of maintaining and strengthening the domestic banking sectors and the financial system in East Asia. This paper employs panel regression techniques and examines whether interbank transactions and stock prices of domestic commercial banks responded to bank risk and performance in those Asian countries. The regression results suggest that interbank borrowing, the borrowing rate, and foreign currency borrowing were affected by bank risk variables subsequent to the 1997 crisis in Thailand. In Korea, foreign currency borrowing of domestic banks may respond to bank risk after the crisis. In the case of stock markets, the regression shows that bank risk influenced each bank's stock price in Korea and Malaysia. The results for Thailand suggest that bank risk and cost affected bank stock prices after the crisis. These findings imply that improving both the interbank market and the stock market may play a role in establishing a sound banking system through market discipline effects. (C) 2013 Elsevier B.V. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3f2781625e3b700a2cb760c6736e8d9",
  "timestamp": "2025-05-15T02:22:25.156243"
}