{
  "id": 7189,
  "title": "Factors influencing cardiovascular patients' knowledge of CVD risk factors",
  "abstract": "Background: Considering the morbidity, mortality, and financial burden of cardiovascular diseases(CVDs), investigating measures to prevent these disorders is highly prioritized. In this regard, improving the patients' knowledge level is essential. This study aimed to determine influencing factors on knowledge level regarding cardiovascular risk factors. Methods: This research is a descriptive-analytic study in which 351 hospitalized patients were selected as participants. The study was conducted in the cardiovascular services of a state hospital in Northern Nicosia, Cyprus, between 2019 and 2020. Data were gathered using a questionnaire through face-to-face interviews. The questionnaire was composed of two sections: the Cardiovascular Diseases Risk Factors Knowledge Level (CARRIF-KL) and a researchers-designed tool for demographic and influencing factors. Data were analyzed by IBM SPSS Statistics 25. The Mann-Whitney U, Pearson chi-square, Spearman correlation, Kruskal Wallis, and Linear Regression were used for data analysis. Results: The highest proportion of participants were aged 55-69 years ( N = 154; 44%), male ( N = 245; 70%), and married ( N = 320; 91%). The most common reported chronic conditions were hypertension ( N = 66; 44%) followed by obesity ( N = 48; 32%). Also, 63.53% ( N = 222) of the participants reported smoking, and 71% ( N = 249) reported alcohol consumption. The mean Body Mass Index (BMI) of the participants was calculated as 30.37 (5.92) for women and 31.30 (4.75) for men. There was a statistically significant difference in the quantity of CARRIF-KL between age groups, educational level, job, personality type, housing, number of daily meals, and being on a diet. The Linear Regression confirmed two predictors for CARRIF-KL, including education level and personality trait. Conclusion: Despite the common belief that people of the Mediterranean region practice a healthy lifestyle, results showed that obesity, smoking, sedentary life, and alcohol consumption are significant problems in Northern Cyprus. Considering the influencing factors and the predictors of the CARRIF-KL, we may recommend focusing on education at younger ages, increasing awareness about the importance of CVD risk factors, and keeping a normal body weight by reducing the number of daily meals and diet. & COPY; 2023 Society for Vascular Nursing, Inc. Published by Elsevier Inc. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3fd4b11ae26d16216b2b7166f585109",
  "timestamp": "2025-05-15T03:06:01.235451"
}