{
  "id": 795,
  "title": "Effectiveness of self-financing patient-led support groups in the management of hypertension and diabetes in low- and middle-income countries: Systematic review",
  "abstract": "ObjectiveThere is insufficient evidence on the role of self-financing patient support groups in the control of blood pressure (BP) and/or diabetes in low- and middle-income countries (LMICs). We conducted a systematic review to investigate the effectiveness of these groups in BP and glycaemic control. MethodsWe searched PubMed, Embase, SCOPUS, Web of Science, Global Health, African Journals Online, CINAHL and African Index Medicus for published peer-reviewed articles from inception up to November 2021. Grey literature was obtained from OpenGrey. Studies on patient support groups for hypertension and/or diabetes with a component of pooling financial resources, conducted in LMICs, were included. Narrative reviews, commentaries, editorials and articles published in languages other than English and French were excluded. Study quality and risk of bias were assessed using the National Institutes of Health Quality assessment tool and the revised Cochrane risk-of-bias tool. Results are reported according to PRISMA guidelines. ResultsOf 724 records screened, three studies met the criteria: two trials conducted in Kenya and a retrospective cohort study conducted in Cambodia. All studies reported improvement in BP control after 12 months follow-up with reductions in systolic BP of 23, 14.8, and 16.9 mmHg, respectively. Two studies reported diabetes parameters. The first reported improvement in HbA1c (reduction from baseline 10.8%, to 10.6% at 6 months) and random blood sugar (baseline 8.9 mmol/L, to 8.5 mmol/L at 6 months) but these changes did not achieve statistical significance. The second reported a reduction in fasting blood glucose (baseline-216 mg/dl, 12 months-159 mg/dl) in diabetic patients on medication. ConclusionSelf-financing patient support groups for diabetes and hypertension are potentially effective in the control of BP and diabetes in LMICs. More studies are needed to add to the scarce evidence base on the role of self-financing patient support groups.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d3fe00e684f1dc794fc6a3cc06ef4c5b",
  "timestamp": "2025-05-15T01:42:44.461621"
}