{
  "id": 6938,
  "title": "The influence of showrooming on Millennial generational cohorts online shopping behaviour",
  "abstract": "Purpose Omnichannel retailing has changed the behaviour of consumers by empowering activities like showrooming which is the process of collecting product information in store then making the purchase online. Since individuals, particularly Millennials, interact with multiple touchpoints throughout their shopping journey, retailers must consider how these experiences influence purchasing behaviour. Literature regarding showrooming has focussed primarily on antecedents to the phenomenon and the negative effects to brick and mortar retailers, however limited studies have investigated the quantitative influence of showrooming from the consumers' perspective. While data show that interest in online shopping is spiking, a vast majority of retail sales are made in-store suggesting barriers to online shopping still exist. Thus, the purpose of this research is to identify the role of showrooming in decreasing risk in an online shopping context. Additionally, Millennial generational cohorts (MGCs) were proposed as moderators in exploring the differences between the dimensions of perceived risk and online shopping intention. Design/methodology/approach To explore the relationship between showrooming and MGCs online shopping behaviour an online survey was administered. Data were collected from 480 Millennial consumers at a large southwestern university. Multiple linear regression was used to determine the direction, magnitude and significance of relationships within the models. Findings Results from the analysis revealed showrooming and MGCs influence online shopping behaviour as it relates to dimensions of risk. Moreover, showrooming increased online shopping intention specifically in relation to product and financial risk. Originality/value This paper contributes to the relevant literature by proposing a relationship between showrooming and online shopping behaviour. This research provides evidence that Millennials are not a monolithic generation and consume differently.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d40debaa9b3ddba993921e6f77ba748f",
  "timestamp": "2025-05-15T03:03:13.482643"
}