{
  "id": 7460,
  "title": "Mortgage recourse provisions and housing prices",
  "abstract": "In light of the large swings in housing prices in the United States in recent years, there has been considerable interest in trying to understand the various factors which led to the boom and bust of the housing market. In this paper, we explore the impact of the legal environment from provisions for mortgage default across U.S. states. To do so, we develop a rigorous framework with microeconomic foundations for financial intermediaries. To be specific, we introduce a housing market and a residential mortgage market in the Diamond and Dybvig framework which emphasizes the role of depository institutions to help depositors manage idiosyncratic liquidity risk. Notably, we think of non-recourse provisions as a legal arrangement to protect risk-averse homeowners from the loss of housing value. While housing demand should be higher in markets where mortgage borrowers have full insurance, lenders also adjust the amount of mortgage credit provided to protect their risk-averse depositors. Thus, a priori, there is not an obvious connection between mortgage recourse provisions and housing prices. To draw further insights into the issue, we proceed to look at empirical evidence on housing prices at the MSA-level using the Case-Shiller Home Price Index. Once one controls for regional level unobservables, the evidence suggests that the demand side factors dominate in which prices are higher in non-recourse states, following the prediction from the model that the demand for mortgages would be higher. We next move to obtain more concrete predictions from our theoretical framework with calibration exercises to study the effects of mortgage recourse. Upon calibrating the model to match some stylized evidence on housing market conditions, the theoretical predictions are consistent with the regression analysis. In this manner, our work sheds numerous insights into the implications of the legal landscape regarding mortgage default for housing market activity.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d40d591486f398c09ef7a068e0e3f8f5",
  "timestamp": "2025-05-15T03:08:37.990012"
}