{
  "id": 5323,
  "title": "A STUDY ON THE EFFECTIVENESS OF CORPORATE GOVERNANCE ON THE CREDIT RISK MANAGEMENT OF COMMERCIAL BANKS: EVIDENCE FROM MALDIVES",
  "abstract": "The specific monetary field from your Maldives will be centered by way of a financial field, gathering 62% through the counts property in the economic industry. In addition nearly all their own economical field will be held simply by internet mortgages. Therefore it is advisable to study the way the banking institutions might handle their particular home loan profile reducing the specific contact with credit score risk. This particular research investigates the potency of business governance around the credit rating risikomanagement of economic financial institution inside Maldives, addressing a period period associated with 10 years through 08 to be able to 2017. This specific papers utilizes several regression design to look at the bond among company governance aspects plus credit rating risikomanagement regarding financial institutions. To get the particular objectives, this particular examine integrated Business Governance elements, the particular table dimensions, panel structure, along with the scale credit standing danger panel, while come back upon source utilized like an overall performance indication. The actual scientific evaluation indicated that typically the formula from plank involving company directors as well as the dimension from your credit score chance screen does not have any substantial effect on the particular administration related to credit rating threat. Aside from, the dimensions of typically the Table in addition to go back on resource had been found out to become considerable.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d40f414ad83759bf608df0f6ee43f235",
  "timestamp": "2025-05-15T02:46:44.868821"
}