{
  "id": 6046,
  "title": "Predictors of US public support for climate aid to developing countries",
  "abstract": "Effectively responding to global warming requires mitigation and adaptation efforts worldwide. Although developed countries have pledged substantial financial support to help developing countries respond to climate change, these pledges have yet to be fulfilled. A majority of American voters support providing aid to developing nations, however, levels of support differ sharply between Democrats and Republicans. To investigate the predictors of support for climate aid among registered voters in the United States and to assess the effect of political party identification, we conducted hierarchical regression and relative weight analysis on a nationally representative sample of U.S. registered voters (n = 898) surveyed in 2021. Among all voters, the predictors of support for climate aid were: party identification (with more support among Democrats), perceived risk to developing countries, worry about global warming, injunctive beliefs that the U.S. should do more, and global warming belief certainty. Among Democrats, the predictors were: perceived risk to the U.S., worry, injunctive beliefs the U.S. should do more, education, and income. Among Republicans, the predictors were: perceived risk to developing countries, and injunctive beliefs the U.S. should do more. These findings have both theoretical and practical relevance for efforts to build public support for development assistance aimed at reducing climate change.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d41ef9ed6d2871fdf09234804b10246a",
  "timestamp": "2025-05-15T02:54:03.477144"
}