{
  "id": 2918,
  "title": "Exploring the role of corruption and money laundering (ML) on bank's loan portfolio quality: a cross-country investigation",
  "abstract": "Purpose Corruption and money laundering (ML) are severe concerns for both developing and developed countries. According to international organizations, such as Transparency International, the Basel Institute on Governance and the International Country Risk Guide, corruption and ML exist in every country. This research aims to investigate the impact of corruption and ML on the loan portfolio quality of banks. Design/methodology/approach From 2013 to 2019, this study used the panel data of 132 countries, including 87 highly corrupt and 45 least corrupt countries: the fixed effect and random effect econometric regression techniques for data analysis. Additionally, this study used the generalized methods of moment technique to check the result's robustness. Findings This study shows that corruption and ML have diverse relationships with non-performing loans in highly corrupt and low corrupt countries. It is potentially because of the differences in the regulatory structure of a highly corrupt and least corrupt environment. Originality/value To the best of the authors' knowledge, this study is the first attempt that provides a unique perspective on corruption, ML and its effect on the loan's portfolio quality of banks. Furthermore, this study suggests that governments in highly corrupt environments develop robust anti-corruption and anti-ML regulations.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4268b9ce49d6ac7f6eea6a09dcc47b9",
  "timestamp": "2025-05-15T01:11:48.409508"
}