{
  "id": 8803,
  "title": "Prevalence and predictors of parenting outcomes in a cohort of mothers with schizophrenia admitted for joint mother and baby psychiatric care in England",
  "abstract": "Objectives: Most women with schizophrenia have children. Schizophrenia has been identified as an independent predictor of poor parenting outcome following joint mother and baby psychiatric admission. We aimed to describe the characteristics of these women postnatally and to estimate the prevalence of, and identify independent predictors of, parenting outcomes. Method: Clinical and psychosocial data from consecutive joint psychiatric admissions of mothers and infants between September 1996 and September 2002 were collected. Diagnoses were based on ICD-10 criteria (N = 239 schizophrenia; N = 693 affective disorders). The prevalence of each parenting outcome at discharge, assessed according to social services intervention and staff-rated measures of parenting ability, was estimated. Factors associated with poor parenting outcomes and independent predictors were identified using modified Poisson regression, and prevalence of these parenting outcomes was estimated in subgroups of mothers stratified by combinations of protective/risk factors. Results: Mothers with schizophrenia were characterized as having more complex clinical and psychosocial problems and were considerably more likely to experience all types of poor parenting outcomes, compared to mothers with affective disorders. Mothers with schizophrenia reporting supportive marital and other relationships, those whose partners were well, and those of higher social class showed the best parenting outcomes. Conclusions: Mothers with schizophrenia who experience better parenting outcomes may be protected by certain factors. Successful parenting is related, partly, to stability within the family and access to financial and social resources. The nature of the relationship between identified predictors and parenting outcomes in this group is unclear but may suggest that parenting outcome varies with clinical outcome in schizophrenia. Future research and service development should focus on potential protective factors that may encourage successful parenting outcomes in this vulnerable group.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d42b0726cab9ae78d62ea6599e3a06b4",
  "timestamp": "2025-05-15T03:22:26.113078"
}