{
  "id": 4094,
  "title": "Potential risks of liquidity and credit affecting the efficiency of Islamic banks in Bangladesh",
  "abstract": "Recently worldwide Islamic finance has gained considerable attention. However, Islamic financial institutions face multiple risks to sustaining and growing further. Against this backdrop, the paper examines the impact of both liquidity and credit risk on the efficiency of Islamic banks (IBs) operating in Bangladesh. This paper uses IB's data from 2007 to 2018 and offers a two-stage assessment. In the first stage, it uses data envelopment analysis (DEA), and in the second stage regression models to assess the impact of both liquidity and credit risk on the efficiency of the IBs. Efficiency scores confirm that IBs are operating with an 86% efficiency level through a 68% share in the constant returns to scale (CRS). Our results also confirm that both liquidity risk (LR) and credit risk (CR) have a significant impact on the efficiency of the IBs in Bangladesh. A higher score for efficiency is shown by a higher liquidity risk, whereas mixed results are confirmed by credit risk indicators. Moreover, the Z-score (a bank stability measurement) and number of branches (a measurement of the bank's network coverage), have a positive impact on efficiency. On the other side, the size of the bank and the financial crisis period show a negative relationship with the bank's efficiency. The findings of our paper significantly contribute to the Islamic banking sector, especially for the policymakers and academic researchers.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d42e640adb060ebdb34447c317af3fb0",
  "timestamp": "2025-05-15T02:33:03.470144"
}