{
  "id": 1047,
  "title": "Identification of the Most Critical Factors in Bankruptcy Prediction and Credit Classification of Companies",
  "abstract": "Banks and financial institutions strive to develop and improve their credit risk evaluation methods to reduce financial loss resulting from borrowers' financial default. Although in previous studies, many variables obtained from financial statements - such as financial ratios - have been used as the input to the bankruptcy prediction process, seldom a machine learning method based on computing intelligence has been applied to select the most critical of them. In this research, the data from companies that are were listed in Tehran's Stock Exchange and OTC market during 26 years since 1992 to 2017 has been investigated, with 218 companies selected as the study sample. The ant colony optimization algorithm with k-nearest neighbor has been used to feature the selection and classification of the companies. In this study, the problem of the imbalanced dataset has been solved with the under-sampling technique. The results have shown that variables such as EBIT to total sales, equity ratio, current ratio, cash ratio, and debt ratio are the most effective factors in predicting the health status of companies. The accuracy of final research model is estimated that the bankruptcy prediction ranges between 75.5% to 78.7% for the training and testing sample.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d431d1eeabb9dfabdfd88a5f35fa90e8",
  "timestamp": "2025-05-15T01:58:08.585524"
}