{
  "id": 8636,
  "title": "PRENATAL RECORDS - A NATIONAL SURVEY OF CONTENT",
  "abstract": "The uses of prenatal records extend well beyond management of patient care. They are also vehicles for communication, quality assurance, financial compensation, and legal documentation. To serve each of these functions, records should be systematic and detailed. This nationwide study was conducted to assess the extent to which prenatal records in current use include sufficient detail to serve these functions. A random sample of 2746 physicians who listed obstetrics and gynecology, obstetrics, or maternal-fetal medicine as a primary or secondary specialty in the American Medical Association file were contacted by mail and were requested to submit a blank copy of their prenatal records. The records of 969 respondents were examined for the presence or absence of 53 items that corresponded to the five functions identified above. The items of interest were present in 1% to 98% of the records. More than 90% included items of traditional medical-obstetric significance. The percentages of records with items of more contemporary relevance (e.g., cigarette smoking, risk-assessment checklists, psychological stress) were found in lower percentages of the records. Stratified and logistic regression analyses revealed that the most systematic and detailed records were commercially available, were used by physicians in hospital and government program-based practices, and were used by physicians who had completed medical school less-than-or-equal-to 15 years before the survey. The findings suggest that physicians who do not use commercially available forms or those who are in private or health maintenance organization practice or have been practicing for more than 15 years should reconsider their prenatal records in light of the functions they will serve in the 1990s and beyond.",
  "year": 1991,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4421bd57fb600549872a5baf2cfc23a",
  "timestamp": "2025-05-15T03:20:55.929739"
}