{
  "id": 6562,
  "title": "The role of ESG in enhancing firm resilience to geopolitical risks: An eastern European perspective",
  "abstract": "Geopolitical risk (GPR) presents a profound challenge to firms, particularly in regions with persistent political instability. In Eastern Europe, where conflicts like the Russia-Ukraine war heighten uncertainty, firms face immediate financial threats and long-term strategic vulnerabilities. This study examines the impact of GPR on firm performance, focusing on the moderating role of environmental, social, and governance (ESG) practices as a resilience mechanism. Using a comprehensive dataset of 1360 publicly listed firms across Poland, Russia, and Ukraine from 2014 to 2023, the analysis employs a base panel data regression model, followed by a two-step generalized method of moments (GMM) approach to account for endogeneity and ensure robustness. The findings reveal a significant negative relationship between GPR and firm performance, measured by return on assets (ROA). Firms exposed to higher geopolitical risks exhibit weaker profitability. However, firms with stronger ESG performance demonstrate greater resilience, as the GMM results show that ESG engagement moderates the adverse effects of GPR on profitability. This suggests that ESG initiatives enhance adaptive capacity in volatile geopolitical environments. In terms of policy implications, ESG should be promoted as a key strategy for firms operating in politically unstable regions. Governments and regulatory bodies may consider mandatory ESG disclosures and incentivizing sustainability practices to help firms mitigate external risks, improve financial resilience, and attract stable investment. Aligning corporate strategies with global ESG standards is essential to ensuring business sustainability amid ongoing geopolitical threats.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d452d056a380ea472b28f661106ac430",
  "timestamp": "2025-05-15T02:59:07.642531"
}