{
  "id": 3963,
  "title": "Is control still an important managerial function? An examination of structural and control process factors in strategic alliances",
  "abstract": "In this paper we aimed to find an answer to the question: is control still important for modern organization in order to favor achievement of superior performances? We have tried to find answer to this question through an empirical investigation in the field of strategic alliances. Thus, we have analyzed the relationship between alliance monitorization and control and various measures of alliance performances. Based on a statistical analysis of data provided by 46 best performers medium and large companies operating in Romania, we found that control is still important for superior performances, whether productivity (e.g. revenues growth) or innovation related performances (e.g. new product development). We used multiple multilinear regressions and found positive associations between alliance monitorization and control, structural control factors and productivity, respectively innovation related performances. Surprisingly, we found that control process factors are not associated with superior innovation performances and for productivity related performances there is only a low intensity association. In terms of explanatory potential of regression models, in five models out of six, the control factors significantly explained why some companies extracted higher value from their portfolio of strategic alliances, as compared to companies extracting more modest value. The various measures of alliance performances (revenues growth, competitive position, customer satisfaction, operations improvement, product improvement, new product development) were also separately investigated.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d45729b22d26b01f139024a07020aa2a",
  "timestamp": "2025-05-15T01:22:39.371256"
}