{
  "id": 2283,
  "title": "Geopolitical risk and gold price bubbles",
  "abstract": "PurposeThis study aims to investigate the relationship between geopolitical risk (GPR) and gold price bubbles to determine whether rising GPR can drive deviations in the fundamental value of gold, thus leading to speculative bubbles.Design/methodology/approachUsing a data set that spans from January 2002 to December 2023 and covers both GPR data and gold price data, this study applies the log-periodic power law singularity (LPPLS) model to identify gold price bubbles. The analysis explores the effects of GPR and its sub-indices - geopolitical risk-acts (GPRA) and geopolitical risk-threats (GPRT) - on gold price bubbles. The causal relationships are examined through logistic regression, Tobit modelling and machine learning, with a focus on different countries, including major gold producers and consumers.FindingsThe results indicate a significant relationship between GPR and gold price bubbles, particularly with GPRA, which exerts a stronger influence than GPRT does. Peaks in GPR often align with the formation of gold price bubbles, both positive and negative. Additionally, geopolitical instability in Russia has a significant effect on US gold price bubbles.Practical implicationsThe findings provide valuable insights for investors and policymakers by emphasizing the importance of GPR in shaping gold price dynamics. Investors are advised to consider the nuanced roles of GPRA and GPRT when using gold as a hedge during periods of heightened geopolitical tension.Social implicationsUnderstanding the role of GPR in gold price bubbles can help mitigate the financial risk associated with speculative bubbles, thereby offering a better framework for managing assets during geopolitical crises.Originality/valueThis study extends existing research by directly linking GPR with gold price bubbles via the LPPLS model, with a novel emphasis on the differentiation between GPRA and GPRT, providing new perspectives on the safe-haven role of gold during geopolitical uncertainty.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d460524f90cfc8dea6573112776c49ff",
  "timestamp": "2025-05-15T02:13:31.787006"
}