{
  "id": 8118,
  "title": "The Optimal Capital Structure under the Conditions of Employment: An Application of Theory X and Theory Y",
  "abstract": "The traditional theories governing the capital structure decisions completely ignore the human side of the enterprise (e.g. attitude to work). The objeclive of this paper is to identify the optimal mix of Theory X and Theory Y type employees to he employed by an organization in order to maintain (i.e. unaffected by the type of employees at work) the optimal level of capital structure. The classification of an employee into Theory X and Theory of Y is made based on the organizational contribution conditional on motivation rather than merely considering the attitude to work. Internal motivation of an employee (i.e. inherently likes or dislikes) alone cannot be identified as the criterion of recognizing employees under Titeory X and Theory of Y Level of attainment of needs within the organization, psychological state of mind and cultural dimension (i.e. individualism-collectivism) of the individual attached to the organization are the main behavioural criteria that distinguish between Theory X-type and Theory Y-type employees. This paper shows that the optimal capital structure is unaffected by the employment inix at the optimal level of Theory X and Theory Y type employees employed by an organization. The firms' managers must therefore consider the behavioral aspects of employees (e.g. attitude to risk) when making organizational decisions such as financial decisions. For example, mismatches in the capital structure can be explained by o careful analysis of behavioral aspects of employees. By making necessary adjusnnents to the current employment mix, the firm could eliminate the mismatches in the firm's capital structure.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d47d9b70038ac0c22bdf27e746c307cf",
  "timestamp": "2025-05-15T03:15:38.346008"
}