{
  "id": 134,
  "title": "Landslide susceptibility mapping of mountain roads based on machine learning combined model",
  "abstract": "Landslide susceptibility mapping of mountain roads is frequently confronted by insufficient historical landslide sample data, multicollinearity of existing evaluation index factors, and inconsistency of evaluation factors due to regional environmental variations. Then, a single machine learning model can easily become overfitting, thus reducing the accuracy and robustness of the evaluation model. This paper proposes a combined machine-learning model to address the issues. The landslide susceptibility in mountain roads were mapped by using factor analysis to normalize and reduce the dimensionality of the initial condition factor and generating six new combination factors as evaluation indexes. The mountain roads in the Youxi County, Fujian Province, China were used for the landslide susceptibility mapping. Three most frequently used machine learning techniques, support vector machine (SVM), random forest (RF), and artificial neural network (ANN) models, were used to model the landslide susceptibility of the study area and validate the accuracy of this evaluation index system. The global minimum variance portfolio was utilized to construct a machine learning combined model. 5-fold cross-validation, statistical indexes, and AUC (Area Under Curve) values were implemented to evaluate the predictive accuracy of the landslide susceptibility model. The mean AUC values for the SVM, RF, and ANN models in the training stage were 89.2%, 88.5%, and 87.9%, respectively, and 78.0%, 73.7%, and 76.7%, respectively, in the validating stage. In the training and validation stages, the mean AUC values of the combined model were 92.4% and 87.1%, respectively. The combined model provides greater prediction accuracy and model robustness than one single model.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d48911cf8cff0e43354e26be73463e2d",
  "timestamp": "2025-05-15T00:39:32.662673"
}