{
  "id": 8416,
  "title": "Prevalence and Predictors of Stress, anxiety, and Depression among Healthcare Workers Managing COVID-19 Pandemic in India: A Nationwide Observational Study",
  "abstract": "Background: The coronavirus disease 2019 (COVID-19) pandemic has caused great financial and psychological havoc. Healthcare professionals (HCPs) are among the many groups of people who are in the frontline and facing a risk of direct exposure to the virus. This study aimed to assess the prevalence and predictors of stress, depressive, and anxiety symptoms among HCPs of India. Methods: It was a cross-sectional, online survey conducted in April 2020 among HCPs who are directly involved in the triage, screening, diagnosing, and treatment of COVID-19 patients and suspects. Stress was estimated using Cohen's perceived stress scale. Depression and anxiety were assessed using the tools Public Health Questionnaire-9 and Generalized Anxiety Disorder-7. Predictors were analyzed using univariate and multivariate binary logistic regression. Results: A total of 433 online responses were obtained, and N = 350 were finally included. The prevalence (95% CI) of HCPs with high-level stress was 3.7% (2.2, 6.2), while the prevalence rates of HCPs with depressive symptoms requiring treatment and anxiety symptoms requiring further evaluation were 11.4% (8.3, 15.2) and 17.7% (13.9, 22.1), respectively. Women had approximately two times the increased odds of developing moderate- or high-level stress, depressive symptoms requiring treatment, and anxiety symptoms requiring further evaluation. Similarly, women staying in a hostel/temporary accommodation had two times the increased odds of developing depression or anxiety symptoms. Conclusion: The prevalence of stress, depressive, and anxiety symptoms among HCPs in India during the pandemic is comparable with other countries.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d489949369c95f0bda2a3060becba6e2",
  "timestamp": "2025-05-15T03:18:51.524175"
}