{
  "id": 1618,
  "title": "Statistical considerations of progressive value and risk in mineral exploration",
  "abstract": "Financial markets recognise maximisation of expected value (E) in an essentially risk-neutral context, as the main corporate financial objective of private enterprise. This may be valid for large, integrated mining companies. Yet, most junior and middle-size exploration companies behave in a risk-averse fashion when making decisions about progressively more expensive exploration programs. From their perspective, a potential increase in expected value front either an increase in target value or related probability of discovery, or both, may not be I sufficient incentive to embark in an exploration programme if the resultant increase in expected value is accompanied by a significant increase in possible maximum loss. Risk-averse explorers may be unwilling to bear larger, albeit less probable losses, when the Cost Of Successive exploration programmes is taken into account. The paper provides a practical methodology for such explorers to optimise the decision whether to progress to the next stage of exploration or to farm out a risky project. It uses a decision-tree model incorporating the effectiveness of the proposed exploration programme, the explorer's risk tolerance and related utility values and the probability distribution of the possible value of the exploration target. (C) 2008 Elsevier Ltd. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d49ab6f834bb7a5285bf6d93903b019e",
  "timestamp": "2025-05-15T02:05:42.475675"
}