{
  "id": 4296,
  "title": "Network resource mobilisation limitations and the alliance portfolio network",
  "abstract": "Purpose The purpose of this study is to examine how access and mobilisation of network resources influence a firm's performance. It has been established that alliance portfolio (AP) network parameters shape the access to network resources; however, resource access understood as value creation differs from resource mobilisation understood as value capture. Hence, the paper contributes towards the comprehension of AP performance by examining the extent to which a firm's level of network resource mobilisation (NRM) plays a role in improving financial performance and how this strategy conditions the benefits obtained from a firm's AP. Design/methodology/approach This study employs an interorganisational network approach to describe the APs of firms; subsequently, it examines how AP network parameters and resource mobilisation determine financial performance. To this end, sequential multiple regression models are applied to a sample from the Top International Airlines database, covering 135 portfolios that correspond to 1117 codeshare partnerships. Findings The analyses show that the NRM level has an inverted U-shaped relationship with revenue performance, thereby revealing the limitations and considerations in the strategic alliance strategy. In addition, the authors show how the resource mobilisation decision moderates the faculty of AP parameters to influence a firm's financial performance, thereby exposing the nuanced relationship between AP size, diversity and redundancy. The findings convey strategic and practical implications for managers regarding how to capture value from their APs. Practical implications The findings suggest the need for NRM to form part of a firm's AP management capability, so that, by acquiring superior strategic knowledge in NRM, the firm is able to extract value from its AP through the optimal exploitation of complementary assets. Originality/value Previous research has highlighted the multidimensional nature of APs at the theoretical level; however, no simultaneous empirical analysis of various AP parameters has yet been produced. The research empirically analyses an AP network and how its parameters affect financial performance in the presence of a resource mobilisation strategy. Not only do the authors introduce the analysis of the curvilinear relationship between the level of NRM and a firm's performance, but also of its role in advancing the AP literature.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4a87e5d6118c3315689196047e26888",
  "timestamp": "2025-05-15T01:25:50.477424"
}