{
  "id": 5706,
  "title": "Unit-linked Insurances as an Element that Shapes the Savings Portfolio of Households in Poland after the Accession to the European Union",
  "abstract": "Household savings constitute a very important factor that triggers the economic growth. Savings accumulation is also an element that shapes the pension policy system, particularly in the segment of individual, voluntary savings products that can be burdened with a considerable value impairment risk, which results from macroeconomic factors. This is a current problem in the face of the financial crisis, where diversification of household savings portfolio that provides security to households under changing economic conditions gains significance. The aim of this research is to present one of the constituents of this portfolio - unit-linked life insurances where the investment risk is borne by the policy holder - compared to other savings products available on the Polish market in the years 2004-2013. In order to set the mathematical model that describes the variable, i.e. a provision in unit-linked life insurances where the investment risk is borne by the policy holder, the analysis of multiple regression has been carried out. The results of analyses indicate that as part of inspected savings schemes the importance of insurances gradually increases and they are more and more frequently chosen as an element that shapes household savings portfolios.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4abca4e87115a3905b7f4dc070c9858",
  "timestamp": "2025-05-15T02:50:21.358606"
}