{
  "id": 8269,
  "title": "The burden of acute renal failure in nonrenal solid organ transplantation",
  "abstract": "Background. Recipients of nonrenal solid organ transplants are at risk for acute renal failure resulting from cardiac or hepatic failure, prolonged surgery, and nephrotoxic effects of immunosuppression. Single-center studies have suggested a variable incidence of acute renal failure in this population, with an associated increase in mortality. This study examines the incidence of acute renal failure and its associated mortality and morbidity in a modern multicenter cohort. Methods. All adult liver, heart, and lung transplant recipients from 2002 were identified from the New York Statewide Planning and Research Cooperative System database. The impact of acute renal failure on mortality, length of stay, and charges was analyzed using multivariate regression models. Results. Among 519 liver, heart, and lung transplant recipients, the incidence of acute renal failure was 25%, with 8% of patients requiring renal replacement therapy. Acute renal failure requiring renal replacement therapy was associated with increased mortality among both heart (odds ratio, 9.0; 95% confidence interval, 1.8-45.8) and liver transplant recipients (odds ratio, 12.1; 95% confidence interval, 3.9-37.3). This degree of acute renal failure also increased length of stay by nearly 3 weeks and charges by more than $115,000. Even among patients who did not require renal replacement, acute renal failure was strongly associated with increased mortality, length of stay, and charges. Conclusions. Acute renal failure remains a common complication of nonrenal solid organ transplantation and is associated with increased mortality, prolonged hospitalization, and significant financial costs.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4b2669cd86bb405f8ea0e65cfc6997d",
  "timestamp": "2025-05-15T03:17:21.438721"
}