{
  "id": 8782,
  "title": "Discrepancies in the Concordance of Self-Reported Vision Status and Visual Acuity in the Salisbury Eye Evaluation Study",
  "abstract": "Purpose: To examine the association between self-rated vision and distance visual acuity by race and other factors. Design: Cross-sectional analysis within a longitudinal, population-based cohort study. Participants and Controls: Two thousand five hundred twenty individuals, 65 to 84 years of age, including 666 black participants and 1854 white participants. Methods: All participants reported their self-rated vision score. Binocular distance visual acuity was assessed. Based on the level of visual acuity and the self-reported vision score, participants were placed into concordant and discrepant groups. Main Outcome Measures: Multinomial logistic regression models were used to examine the characteristics associated with concordant and discrepant groups. Results: Black participants were more likely to be represented in the discordant group that reported good vision but had acuity worse than 20/40. In the multivariate analysis, a per-year decrement in years of education received increased the odds of being in both discrepant groups, one that reported good vision but had a visual acuity worse than 20/40 (odds ratio, 1.21; P < 0.0001) and the other discrepant group that reported bad vision but had a visual acuity of 20/40 or better (odds ratio, 1.04; P < 0.0001). A per-year decrement in years of education received also seemed to explain the excess risk of black race in the discrepant group that reported good vision but had a visual acuity worse than 20/40. Conclusions: Given the socioeconomically driven discrepancies in self-reported vision status, self-reported vision status should be used cautiously in surveillance surveys, especially when assessing vision inequalities between socioeconomic groups. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012; 119: 106-111 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4ba31d30eb6bff296528b6b37d242c8",
  "timestamp": "2025-05-15T03:22:26.032337"
}