{
  "id": 2186,
  "title": "Flood susceptibility mapping through geoinformatics and ensemble learning methods, with an emphasis on the AdaBoost-Decision Tree algorithm, in Mazandaran, Iran",
  "abstract": "Floods, as natural disasters, impose significant human and financial burdens, necessitating stringent mitigation measures. The recurrent annual incidence of floods precipitates considerable economic setbacks and tragic human casualties. In the realm of disaster management, flood susceptibility mapping has evolved into an indispensable instrument for preemptive intervention. In recent years, the amalgamation of machine learning (ML) methodologies and geographic information systems (GIS) has demonstrated remarkable promise in the realm of flood susceptibility mapping. Nonetheless, the inherent limitations of standalone ML models have constrained their predictive efficacy. Several shortcomings are evident in prior research. These include the failure to utilize contemporary ensemble approaches capable of enhancing performance and the limited exploration of diverse classifier combinations, which are instrumental in augmenting reliability. Simultaneously, there is an absence of current and up-to-date flood susceptibility maps on recent floods within the study area. Hence, this study endeavors to enhance the precision of flood susceptibility mapping, within the Haraz-Neka River basin across Mazandaran province, by harnessing an ensemble of ML models. The research methodology encompassed several pivotal phases. Initially, data about 240 flood sites were meticulously compiled. Subsequently, 70% of this dataset was allocated for training and cartographic elucidations, whereas the remaining 30%, selected at random, served to validate the resultant maps. The analytical framework incorporated a spectrum of influential parameters, encompassing Elevation, Slope, Aspect, Rainfall, land use, Vegetation Differentiation Index (NDVI), Soil Hydrology Groups, Proximity to the River, Distance from Landslides, Topographic Wetness Index (TWI), Stream Power Index (SPI), and Sediment Transport Index (STI) for spatial modeling. The results undeniably highlight the superior performance of the ensemble model compared to its individual counterparts. Validation exercises, leveraging historical flood data, prominently endorsed the AdaBoost algorithm integrated with the Decision Tree classifier as the most efficacious. Garnering an Area Under ROC curve surpassing 0.96, accompanied by an accuracy of 0.93%, a sensitivity of 0.95%, and a specificity of 0.92%, this amalgamation substantiates its prowess. The proposed framework stands poised to empower decision-makers in identifying vulnerable regions and devising efficacious flood risk mitigation strategies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4c10d168ccd446d31878dbbb65ec228",
  "timestamp": "2025-05-15T02:12:17.403880"
}