{
  "id": 3425,
  "title": "Earnings Volatility, the Use of Financial Derivatives and Earnings Management: Evidence from an Emerging Market",
  "abstract": "In the face of crises such as Covid-19, businesses become devastated by greater risk exposure, particularly in currency exchange, supply chain disruption, and fluctuation in commodity prices that cause volatile earnings trends. Higher earnings volatility is frequently associated with greater risk. Consequently, firms could be inspired to engage in earnings management or derivative use as attempts to mitigate earnings volatility. Using a sample of 169 of the largest non-financial firms with 507 firm-years observations from an emerging market, the researchers examined the relationship among derivative use, earnings volatility, and earnings management. The results of a panel regression analysis showed that derivative use by Malaysian public listed companies was positively connected with earnings volatility, inferring that the use of derivatives did not mitigate earnings volatility as intended. This study also found that both earnings volatility and derivative use have a positive relationship with earnings management. This implies that firms engage in earnings management to curb earnings volatility under circumstances where derivative use is associated with higher earnings volatility. Evidence derived from this study contributes to extant literature on financial risk management involving financial instruments, an area that is very much understudied in the contexts of emerging markets.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4c8a9a4462a56e753703e0f5da04ff9",
  "timestamp": "2025-05-15T02:26:09.131770"
}