{
  "id": 7306,
  "title": "Forensic Outpatient Variables That May Help to Prevent Further Detention",
  "abstract": "Background Forensic outpatient treatment in Germany helps forensic patients back into society while managing the risk that these individuals present to public safety. Measures used to achieve this objective include ongoing psychiatric treatment and monitoring, case management, and controlling risk factors that may cause criminal behavior. In addition to the effects of treatment and control, good living conditions have been hypothesized to help prevent criminal recidivism and a number of studies have examined variables related to poor outcomes including recidivism among former prison inmates and sexual offenders. Yet, little is known about the predictive validity of certain candidate variables on the outcomes of German forensic outpatients. Methods In order to investigate variables that are likely to reduce the risk of unfavorable outcomes such as subsequent confinement or back-referral to inpatient treatment, we analyzed data from a forensic outpatient data project run by the federal state of Baden-Wurttemberg (Forensic outpatient documentation system). Based on data provided by six forensic treatment units throughout the federal state of Baden-Wurttemberg since 2015, we compared 61 forensic outpatients that had either regularly ended treatment (group one, n = 25), or were referred back to a forensic hospital or prison (group two, n = 36). Information on the patients' working, living, and financial situation as well as information on their social network and relationship status, was used. The predictive validity of these factors on treatment outcome was tested with a logistic regression model. Results There were a number of a priori differences between the groups, but pro-social leisure activities in an outpatient environment and migration status were the only significant predictors of positive vs. negative outcome. Discussion Implications of these findings are discussed.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4d961b37e5c4e3ff566833a990cbc6a",
  "timestamp": "2025-05-15T03:07:02.708722"
}