{
  "id": 4353,
  "title": "Financial Toxicity in Adults With Cancer: Adverse Outcomes and Noncompliance",
  "abstract": "Purpose Because of the escalating cost of cancer care coupled with high insurance deductibles, premiums, and uninsured populations, patients with cancer are affected by treatment-related financial harm, known as financial toxicity. The purpose of this study was to describe individuals reporting financial toxicity and to identify rates of and reasons for affordability-related treatment noncompliance. Methods From May 2010 to November 2015, adult patients (age >= 18 years) with cancer were identified from a Health Registry/Cancer Survivorship Cohort. Financial toxicity was defined as agreement with the phrase You have to pay for more medical care than you can afford from the Patient Satisfaction Questionnaire-18. Logistic regression and Fisher exact tests were used to compare groups. Results Of 1,988 participants, 524 (26%) reported financial toxicity. Patients reporting financial toxicity were more likely age 65 years or younger, female, nonwhite, non-English speaking, not married, less educated, and to have received a diagnosis more recently (all P < .001). Participants with financial toxicity were more likely to report noncompliance with medication, owing to inability to afford prescription drugs (relative risk [RR], 3.55; 95% CI, 2.53 to 4.98), and reported forgoing mental health care (RR, 3.89; 95% CI, 2.04 to 7.45), doctor's visits (RR, 2.98; 95% CI, 1.97 to 4.51), and medical tests (RR, 2.54; 95% CI, 1.49 to 4.34). The most endorsed reasons for delayed care were not having insurance coverage and being unable to afford household expenses. Conclusion More than 25% of adults with cancer reported financial toxicity that was associated with an increased riskfor medical noncompliance. Financial toxicity remains a major issue in cancer care, and efforts are needed to ensure patients experiencing high levels of financial toxicity are able to access recommended care.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4e2327b5d60d47d2a984eec8f1276cc",
  "timestamp": "2025-05-15T02:36:05.248492"
}