{
  "id": 6546,
  "title": "Comparing marriage and cohabitation dissolution risks across municipalities: Which characteristics matter?",
  "abstract": "Research has shown considerable municipal-level variation in divorce rates within countries. Given the large increase in cohabitation over the past decades, this study examines whether similar differences can also be observed in the union dissolution risks of cohabitants. By investigating whether six municipal-level factors important in understanding spatial variation in divorce are also associated with spatial variation in the dissolution of cohabiting unions (financial uncertainty, gender roles, religiosity, social ties, alternative opportunities and educational attainment), this article aims to improve our understanding of municipal differences in the dissolution of cohabiting unions. This study is conducted on register data from Statistics Netherlands (2017-2018). For this study, unique union dissolution information per union type (marriage and cohabitation) is constructed for 355 Dutch municipalities. Nearly all explanatory factors are defined using publicly available municipal-level information. We use spatial lag regression models to analyse differences in municipal union dissolution risks for different union types. We find that municipal-level union dissolution risks of cohabiting and married couples are only moderately correlated, suggesting that the risk of union dissolution for cohabiting couples is not necessary high in municipalities with high divorce rates. Municipal-level indicators of social ties, religiosity and alternative opportunities are linked to municipal-level variation in union dissolution risks of married and cohabiting couples, whereas municipal-level variation in financial uncertainty and educational attainment are only linked to municipal-level variation in union dissolution risks of married couples.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4e36ae45f275cb4b4163691ea58d75b",
  "timestamp": "2025-05-15T02:59:07.541820"
}