{
  "id": 290,
  "title": "Enhancing customer-centric retailing through AI-driven total offer management strategies for airline users",
  "abstract": "The new distribution capability has extended a new world of customer- centric total offer management strategies for airline users, where airlines must respond to each customer's booking instantly with a personalized set of offers and prices. Currently the process of creating offers is unrefined and is controlled by several organizations, procedures, and IT (Information Technology) systems. However, the present method is inadequate and the path to profitability lies in maintaining a continuous offer management system within an integrated total offer management framework. The extant research on customer-centric personalized offer management is lacking in terms of Total Offer Management systems (TOMs). The researchers primarily concentrated on creating a single offer along with a limited number of ancillary options, often neglecting to consider customer behavior in the process. This is where the deficiency in Total Offer Management Systems (TOMs) to the customers become evident. The current research introduces an innovative solution for addressing the total offer management problem outlined by (Wang KK, Wittman MD, Fiig T (2023) Dynamic offer creation for airline ancillaries using a Markov chain choice model. J Revenue Pricing Manag 22(2):103-121) and (Kummara MR, Guntreddy BR, Vega IG, Tai YH (2021) Dynamic pricing of ancillaries using machine learning: one step closer to full offer optimization. J Revenue Pricing Manag 20(6):646-653). This work advances existing knowledge by considering four different segments of customers, each associated with multiple ancillary options. In this research the proposed approach was compared with the existing algorithms in terms of purchase probability. The results obtained from the current work demonstrate a substantial 14.5% increase in the likelihood of offer purchases for each segment of customers. The research is expanded by generating all essential rules and patterns from the customer database to assess the effectiveness of the proposed methodology.",
  "year": 2024,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4e6f9dbb53ed5fda1e0fe877db11d33",
  "timestamp": "2025-05-15T01:30:19.167649"
}