{
  "id": 5816,
  "title": "Auditing ethics: the pricing of Shariah non-compliant business activities",
  "abstract": "Purpose This study aims to investigate whether firms' involvement in socially provocative business activities or businesses that are inconsistent with Shariah principles affect auditor's perceived risk associated with the financial reporting information. Design/methodology/approach This study uses a median regression with measures that are consistent with prior literature. This study comprises of 11,799 firm-year observations obtained from MSCI environmental, sustainable and governance STATS database. Findings The results provide evidence indicating that auditors relatively charge higher audit fees for Shariah non-compliant firms except for firms that are involved with alcohol and gambling businesses. Firms that are involved in gambling activities report relatively lower audit fees, whereas firms with high involvement in alcohol business activities report non-significant relationship with audit fees. Research limitations/implications The findings suggest that on average, ethical contextualisation on perceived acceptable behaviours is relatively consistent across beliefs and the severe lack of it has implications on auditors' business risk assessment. However, as a social construct, the conception of ethical behaviour is highly dependent on the change in the societal values and therefore this explains the variance in the expected findings for gambling and alcohol business activities. Originality/value This study adds to the existing business risk literature, by examining the under-explored association between Shariah non-compliant risk and auditors' perceived risk, measured by audit fees in a non-Muslim majority setting.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4f070fc1722838be0c4cedf8fa2650a",
  "timestamp": "2025-05-15T02:51:58.511286"
}