{
  "id": 5416,
  "title": "Psychosocial factors associated with symptoms of depression, anxiety and stress among single mothers with young children: A population-based study",
  "abstract": "Background: Abundant evidence highlights single parenthood as a common risk factor for depression, anxiety and stress but few studies have comprehensively examined psychosocial factors (adversities), particularly during early parenting. We investigated symptom prevalence and potential risk factors among mothers with very young children. Methods: Data stem from the 2015 National Psychosocial Burdens Prevalence Study (KiD 0-3). Mothers with children up to 3 years of age (n=6925) were recruited from random probability-sampled paediatric clinics (n=271) across Germany and reported on depression or anxiety, general and parenting stress using the Patient Health Questionnaire (PHQ-4), Perceived Stress Scale (PSS-4) and Parenting Stress Index (PSI). Multivariable logistic regression models determined risk factors and quantified potential mediation of psychosocial factors for all 3 outcomes. Results: Approximately 30% of single mothers (n=517) reported depressive or anxiety symptoms and 37% general stress, twice as high compared to partnered mothers (n=6408; p < 0.0001). Parenting stress was also elevated (p < 0.0001). Adjusted regression models confirm that single mothers are twice as likely to report symptoms of depression or anxiety (OR 1.9, CI95% 1.4-2.5). Risk factors for stress correspond to those for depression and anxiety. Inadequate social support and history of partner or childhood maltreatment were also consistent risk factors across all outcomes. Limitations: The study design and self-reported symptoms are limitations to consider. Conclusions: Single mothers with young children are more predisposed to mental health disorders than partnered mothers, especially when facing financial, social or distal adversities. Appropriate social support programs and screening measures are necessary to reduce further disparities.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4f3883ed9fb4ed562174fa8e1521df3",
  "timestamp": "2025-05-15T02:47:42.874952"
}