{
  "id": 3267,
  "title": "The internal audit dilemma - the impact of executive directors versus audit committees on internal auditing work",
  "abstract": "Purpose - The purpose of this study is to analyze how internal audit function (IAF) activities differ, depending on the impact of executive boards (EBs) and audit committees (ACs). Design/methodology/approach - This study is based on data collected from the Common Body of Knowledge (CBOK) study conducted by the Institute of Internal Auditors Research Foundation in 2010. Using 524 responses from US Chief audit executives the authors examine the direct and interaction effects of ACs and EBs on the probability to perform specific activities with a logistic regression model. Findings - This manuscript shows that ACs and EBs have different direct and interaction effects on the portfolio of activities performed by the IAF. Furthermore, a varying prevalence among activities was identified, which pinpoints to the maturity of IAFs. All findings contribute to the prior and recent discussion about the position of IAFs between the stakeholders' AC and EB. Research limitations/implications - When the CBOK study was designed by the Institute of Internal Auditors, the investigators did not have the research questions in mind. The authors are therefore limited to those variables that have been collected as part of a larger questionnaire. Nevertheless, the new approach tries to open a new research direction, analyzing different activities performed by IAFs. Practical implications - The identified portfolio of IAF activities can help practitioners to double-check their own work and to evaluate the impact of the EB and the AC on their activities. Originality/value - This study provides the first empirical evidence of the influence of ACs and EBs on IAF activities.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d4f71740e9507d5e7e339b610c3098cd",
  "timestamp": "2025-05-15T01:15:26.126174"
}