{
  "id": 924,
  "title": "The Effectiveness of Self-Management of Hypertension in Adults Using Mobile Health: Systematic Review and Meta-Analysis",
  "abstract": "Background: Effective treatment of hypertension requires careful self-management. With the ongoing development of mobile technologies and the scarcity of health care resources, mobile health (mHealth)-based self-management has become a useful treatment for hypertension, and its effectiveness has been assessed in many trials. However, there is a paucity of comprehensive summaries of the studies using both qualitative and quantitative methods. Objective: This systematic review aimed to measure the effectiveness of mHealth in improving the self-management of hypertension for adults. The outcome measures were blood pressure (BP), BP control, medication adherence, self-management behavior, and costs. Methods: A systematic search was conducted using 5 electronic databases. The snowballing method was used to scan the reference lists of relevant studies. Only peer-reviewed randomized controlled trials (RCTs) published between January 2010 and September 2019 were included. Data extraction and quality assessment were performed by 3 researchers independently, adhering to the validation guideline and checklist. Both a meta-analysis and a narrative synthesis were carried out. Results: A total of 24 studies with 8933 participants were included. Of these, 23 studies reported the clinical outcome of BP, 12 of these provided systolic blood pressure (SBP) and diastolic blood pressure (DBP) data, and 16 articles focused on change in self-management behavior and medication adherence. All 24 studies were included in the narrative synthesis. According to the meta-analysis, a greater reduction in both SBP and DBP was observed in the mHealth intervention groups compared with control groups, -3.78 mm Hg (P<.001; 95% CI -4.67 to -2.89) and -1.57 mm Hg (P<.001; 95% CI -2.28 to -0.86), respectively. Subgroup analyses showed consistent reductions in SBP and DBP across different frequencies of reminders, interactive patterns, intervention functions, and study duration subgroups. A total of 16 studies reported better medication adherence and behavioral change in the intervention groups, while 8 showed no significant change. Six studies included an economic evaluation, which drew inconsistent conclusions. However, potentially long-term financial benefits were mentioned in all economic evaluations. All studies were assessed to be at high risk of bias. Conclusions: This review found that mHealth self-management interventions were effective in BP control. The outcomes of this review showed improvements in self-management behavior and medication adherence. The most successful mHealth intervention combined the feature of tailored messages, interactive communication, and multifaceted functions. Further research with longer duration and cultural adaptation is necessary. With increasing disease burden from hypertension globally, mHealth offers a potentially effective method for self-management and control of BP. mHealth can be easily integrated into existing health care systems.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d513cd18b3bd8ba80c0518ebfd5a8086",
  "timestamp": "2025-05-15T01:44:35.375206"
}