{
  "id": 7042,
  "title": "The sustainability factor in asset pricing: Empirical evidence from the Indian market",
  "abstract": "This study investigates the feasibility of including the sustainability performance of firms in the asset pricing problem. The data of 500 firms from the NIFTY 500 index are used for this study. The stock prices and financial data are downloaded from the CIME database. The sustainability factor is computed using the ESG scores from the Bloomberg database. In order to test the influence of the sustainability factor, the Fama-French Five -Factor model is extended by including the sustainability factor as an additional factor. The dependent variables are the excess returns on 36 size and book -to -market ratio sorted portfolios, 36 size and operating profitability sorted portfolios, and 36 size and investment sorted portfolios. The impact of the sustainability factor on excess portfolio return is tested using the Fama-MacBeth two -pass regression and the Fama-French methodology. The results show that the price of ESG risk (or ESG risk premium) is positive, indicating that firms with lower ESG performance yield more returns than those with higher ESG performance. About one-third of the portfolios witness the significant impact of the sustainability factor on their returns. However, the insignificant relationship in two third of the portfolios between the sustainability factor and excess portfolio returns conveys that in the Indian market, corporate investors have the flexibility to decide on ESG investment. Smaller firms are exposed to a higher ESG risk, and Firms which do not integrate environmental and social costs into their strategies may bear a higher cost of equity.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d52642f8ae6fb5e799abe545f327ee10",
  "timestamp": "2025-05-15T03:04:23.024258"
}