{
  "id": 6522,
  "title": "Association between physical activity, functional fitness and fall risk in the elderly: a cross-sectional population-based study from the Oporto region",
  "abstract": "BACKGROUND: Falls among the elderly are important clinical and health problems being one of the major causes of morbidity and mortality worldwide. Its high incidence and functional and social repercussions cause a significant financial burden on older adults, health systems and communities. According to different methodologies, the relationship between fall risk, physical activity and physical fitness found some inconsistent results. This study aims to examine the association between objective physical activity (PA) levels, fall risk (FR) and different components of functional fitness (FF) creating an appropriate model to explain variability in fall risk. METHODS: One hundred and seventy elderly adults (72.34 +/- 6.70 years old, 124 female), completed a Functional-Fitness-Test (FFT) and a Performance-Orientated-Mobility-Assessment (POMA). Ambulatory-PA was assessed by 7-day accelerometry. Pearson's correlation was used to verify association between FR, PA and FF. Analyses were adjusted either for gender, age, or both. Inferential stepwise multiple linear regression (MLR) was used to investigate the impact of PA and components of FF on FR. RESULTS: MLR Showed that FR variability was mainly explained by motor agility (46.0%) and also by lower-body strength (14.1%) independently, and 49% when associated. Physical activity and also age were excluded from the models. MLR analysis by gender, only motor agility explains fall risk variability, more in female (45.0%) than in male (23.6%). CONCLUSIONS: The authors concluded that low motor agility and lower-body strength may increase fall risk. However, further evidence from a prospective study is required to establish directions of causality between physical activity behavior and risk of falls.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d530a409e467aec0a6a61ac60b296a82",
  "timestamp": "2025-05-15T02:59:07.435802"
}