{
  "id": 8471,
  "title": "Enduring corporate political connections and loan contracting: evidence from the GCC countries",
  "abstract": "Purpose An important question is whether lenders perceive politically connected firms as having less or higher default risk, and thus provide them with more or less preferential loan terms compared with non-connected firms. This paper aims to examine the relationship between political connections of corporate board members and cost of debt and loan contracting in the Gulf Cooperation Council (GCC) countries. Design/methodology/approach The initial sample comprises 288 GCC firm-year observations from 227 publicly listed firms in Oman, Qatar, Saudi Arabia and United Arab Emirates for the period from 2011 to 2015. It includes all the GCC publicly listed firms, excluding those in the financial, insurance and banking sectors because these entities are subject to different regulations. The ordinary least squares, logit regression and other sensitivity tests have been used to analyse the data and enhance reliability of the results. Findings This study finds that politically connected firms, particularly those connected through ruling royal family members, are associated with lower cost of debt, greater amounts of loans and longer-term government loans. Therefore, these findings support the prediction that political connections benefit GCC firms in the form of access to favourable terms from both government and commercial banks. Originality/value This study contributes to the extant literature by providing insightful analysis using unique political features of the GCC, integrated with agency and resource dependency theories. In particular, this study fills the gap in understanding the nature of loan contracting offered by government and commercial banks in the presence of politically connected boards within GCC setting.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d531ea535d5111d3c4acc8dd0ab20ba9",
  "timestamp": "2025-05-15T03:19:21.265881"
}