{
  "id": 6638,
  "title": "Casino Gambling in Adolescents: Gambling-Related Attitudes and Behaviors and Health and Functioning Relationships",
  "abstract": "Recreational and problem gambling have been linked with adverse health and functioning outcomes among adolescents. Youth may gamble and engage in other risk-taking behaviors in casinos. There are limited data available regarding casino gambling in high-school students, and factors linked to adolescent gambling in casinos have yet to be systematically investigated. To address this gap, we analyzed cross-sectional data from 2010 Connecticut high-school students with chi-square tests and logistic regression models to examine casino gambling in relation to at-risk/problem gambling (ARPG) with respect to sociodemographic characteristics, gambling perceptions & attitudes, health/functioning measures and gambling behaviors. Approximately 11 % of adolescents acknowledged gambling in casinos. ARPG was more frequent and gambling perceptions were more permissive among adolescents endorsing casino gambling. Stronger relationships between ARPG and heavy alcohol and drug use and weaker relationships between ARPG and engagement in extracurricular activities, gambling with friends, gambling with strangers and gambling for financial reasons were observed among adolescents endorsing casino gambling. In conclusion, gambling in casinos was endorsed by a sizable minority of adolescents who gamble, and prevention efforts should consider targeting permissive attitudes towards gambling, adolescent drinking and participation in extracurricular activities when addressing underage casino gambling.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5386a776bc4e71fe4333149ff4827c3",
  "timestamp": "2025-05-15T03:00:05.011033"
}