{
  "id": 8019,
  "title": "Factors associated with pressure ulcers in patients with complete or sensory-only preserved spinal cord injury: is there any difference between traumatic and nontraumatic causes? Clinical article",
  "abstract": "Object. Pressure ulcers (PUs) are common complications in patients with complete spinal cord injury (SCI) or incomplete SCI in which sensory function is spared. Most studies analyzing associated factors of PU and SCI have been performed in cases of traumatic SCI and in just a few cases of nontraumatic SCI. This study was designed to look specifically at the differences in causative factors of PU in cases of traumatic and nontraumatic SCIs. Methods. The authors performed a retrospective, cross-sectional study evaluating patients with complete and incomplete SCIs (American Spinal Injury Association Grades A and B) under the coverage of the financial, medico-social, and rehabilitative support provided by the State Welfare Organization of Iran (SWOI). There were 3791 cases of traumatic SCI (63.2%) and 2110 cases of nontraumatic SCI (35.2%). For 94 patients (1.6%), sufficient data were not available. Results. A PU was detected in 39.2% of all patients with an SCI (71.8% of those with traumatic SCI vs 28.2% of those with nontraumatic SCI). A univariate analysis showed a significant association between occupation, education, and the presence of PU in patients with a traumatic SCI (p < 0.05). This contrasted with nontraumatic SCI in which an association between PU and age was noted (p < 0.05). Using logistic regression, traumatic cause, older age, an interval less than 1 year since the onset of SCI, male sex, and single status were found to significantly increase the risk of PU in all patients with an SCI. However, a higher education level had a preventive effect on PU. Conclusions. This study revealed some risk factors for PU in the authors' setting. The authors' findings suggest a possible difference between the risk factors for PU in patients with both types of SCI. Further study on the pathoetiology of these differences is paramount in the future. (DOI: 10.3171/2009.5.SPINE08896)",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d542b283acc8f8707cc7b541e2851547",
  "timestamp": "2025-05-15T03:14:37.270143"
}