{
  "id": 8476,
  "title": "Psychological distress and coping strategies in parents of children with cancer in Lebanon",
  "abstract": "ObjectivesTo determine the prevalence of psychological distress (PD) among parents of Lebanese children with cancer and to investigate the associated stressors and coping strategies. MethodsA cross-sectional study conducted at the American University of Beirut Medical Center-Children Cancer Center of Lebanon in 2012. Parents of all children with cancer admitted for treatment were eligible participants. The General Health Questionnaire (GHQ-12) was used to estimate the prevalence of PD. Coping strategies were measured via the Coping Health Inventory for Parents (CHIP). Bivariate and multiple regression analyses were conducted to evaluate the relationship between GHQ-12 (scores 0-36), stressors, family/social support, and coping strategies. ResultsOne hundred fourteen parents (68.2%) completed the anonymous questionnaire. Based on GHQ-12, significant PD was considered among 56.0% of the parents. It was found to be significantly positively associated with the degree of family financial problems and significantly negatively associated with the child's disease duration. A significant negative relationship was also found between PD and Coping (CHIP) scale, coping pattern I (Maintaining Family Integration and an Optimistic Outlook for the Situation), pattern II (Seeking Social Support), yet not with pattern III (Seeking Information). ConclusionsPD is prevalent among parents of Lebanese children hospitalized because of cancer. Screening for PD in the latter population is feasible, would identify those who are at risk for disruptive PD, and facilitate the provision of support towards better adjustment and coping. Alleviating parental PD may facilitate the realization of optimal health outcomes. Copyright (c) 2015 John Wiley & Sons, Ltd.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5593b2182e8e1936d60002c71c0d9ea",
  "timestamp": "2025-05-15T03:19:21.283002"
}