{
  "id": 371,
  "title": "Portfolio-based learning in surgery Making competencies visible",
  "abstract": "Background Due to an increasing competence orientation of medical studies, surgical curricula are being adapted in many places. In addition to surgical knowledge and practical skills, these should also teach competencies in differential diagnostics and treatment. The teaching of surgical knowledge through lectures and seminars and the demonstration of practical skills, e.g., through the use of logbooks in the Bock Practical Surgery (BP), only allows limited active engagement with surgical competencies on differential diagnostics and treatment. A reflection-based portfolio allows, through the independent written elaboration of surgical topics, an active engagement with the competencies and promises a higher learning effect. In the context of the implementation of such a portfolio as part of the proof of activity in BP, the effects on the acquisition of competencies and on the way of learning were investigated. Material and methods Using a mixed methods approach, we compared competence acquisition using a reflection-based portfolio with learning using a logbook. Students conducted a self-assessment of competencies using questionnaire surveys before and after the BP. Through focus group interviews with discussions among students using a guideline, we explored the different ways of acquiring competencies. In addition, the examination and evaluation results of both cohorts were compared. Results and discussion Students' self-assessed competency acquisition and examination and evaluation results showed no differences when comparing the two cohorts. During the focus group interviews, we were able to show that in the perception of the students, surgical competencies can be made more visible and thus more explicit with the help of a reflection-based portfolio. In addition, self-regulated learning was promoted without neglecting practical skills. Students demanded greater supervision and guidance by mentors in both groups.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d56000099612d9dfcba4275b47f33777",
  "timestamp": "2025-05-15T00:35:17.475761"
}