{
  "id": 3453,
  "title": "Financial market risk, technology and natural resources nexus: Evidence from China",
  "abstract": "Natural resources are considered a vital organ of the economy and play an important role in economic growth, creating jobs and enhancing the standard of life across the globe. However, Natural resources remained a dilemma for researchers in the past; several studies suggest it as a curse while some authors suggest it as a blessing for the country's economic growth This research examines the resource curse hypothesis along with the interactive relationship of technological innovations, financial risk index and economic growth of china for the period of 1984-2021. Few researchers in previous studies have analyzed the financial risk index and tech-nological innovations in the nexus with natural resources. This novel study aims to examine the impact of natural resources on the economic growth of china in the presence of technological innovations and financial risk index. Time series methods and Quantile regression is employed to examine the impact of indicators on economic performance. For the stationarity, ADF (Augmented Dicky-Fuller tests) are used, for better co-integrations Bayer-Hanck model is employed, to check the robustness of the study we use FMOLS model (fully modified ordinary least square) and DOLS model (Dynamic ordinary least square) and in the last the granger causality test is used. The results of the study are concluded on the point that natural resources negatively affect the economic growth of china which means there is resource curse hypothesis in china. Furthermore, the technological innovations, enhancement in the financial risk index and trade lead to the improvement in China's economic growth. We also find that investment and improving technological innovations can bring significant changes in the country's economic performance. Last we find an inverse relationship between financial risk and the economic perfor-mance of China.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d580700f8392af6362963fe3dd619f73",
  "timestamp": "2025-05-15T02:26:09.240698"
}