{
  "id": 3708,
  "title": "Mobile investment technology adoption among investors",
  "abstract": "Purpose The purpose of this study is to examine investors' internal characteristics, including investment literacy, risk tolerance and familiarity with mobile financial services, as antecedents of mobile investment technology adoption among American investors. Design/methodology/approach Using the 2018 National Financial Capability Study and its supplemental Investor Survey, this study examined antecedents, including investors' internal characteristics, in relation to mobile investment technology adoption. Nested logistic regression analyses were performed for adopting mobile apps for investment decisions and for investment trading. Findings This study found that objective and subjective investment knowledge, experience using mobile banking for payments and money transfers, and certain ownerships of investment vehicles (such as whole-life insurance policies and ETFs) were significant determinants of mobile investment decision-making. On the other hand, subjective investment literacy, risk tolerance, familiarity with mobile financial services, and portfolio value, as well as certain types of investment vehicles were significantly associated with mobile investment trading. Originality/value This study is among the first to examine investors' investment literacy, risk tolerance and familiarity with mobile financial services as investors' internal characteristics in relation to mobile investment technology adoption. The diffusion of innovations theory and related concepts provide theoretical support for this study. The findings provide new insights into mobile investing as an emerging FinTech subject and provide implications for practitioners and FinTech developers, as well as contribute to the literature of mobile investment service adoption among retail investors.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d597cc0b037a000888072923c93ed7aa",
  "timestamp": "2025-05-15T02:29:00.226224"
}