{
  "id": 1705,
  "title": "IMPROVING FORECASTING ACCURACY OF THE S&P500 INTRA-DAY PRICE DIRECTION USING BOTH WAVELET LOW AND HIGH FREQUENCY COEFFICIENTS",
  "abstract": "Numerous research works have successfully applied the wavelet analysis for the decomposition and forecasting of financial data. Particularly, using the discrete wavelet transform (DWT) stock price time series were analyzed following a fixed sub-band coding scheme, which provides a low time resolution for low frequencies and a high time resolution for high frequencies. Following the standard approach found in the literature, only low frequency components were considered as main features to predict stock prices. However, this approach lacks of details about the generative process of the original data. In this paper, we rely on DWT high frequency sub-band to extract short interval hidden information for better classification of future Standard and Poors (S&P500) one minute ahead direction using artificial neural network trained with backpropagation algorithm. The simulation results show that our approach that uses both low (approximation) and high (detail) frequency coefficients provides better classification rates than the standard one. In addition, simulation results show that low frequency components are appropriate to detect future downshifts in S&P500, whilst our approach is suitable to predict future upwards. Thus, the standard approach provides valuable information for risk averse investors trading S&P500, and our approach that combines low and high frequency coefficients is strongly useful for aggressive investors seeking short-term profits when trading S&P500.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d59e4c193436d730d11aea032aab4faa",
  "timestamp": "2025-05-15T02:06:22.515380"
}