{
  "id": 6364,
  "title": "The health effects of emigration on those who remain at home",
  "abstract": "Background The health effects of emigration on relatives staying behind has received little attention in the recent literature. Our aim was to assess the association of spouse and offspring emigration with acute coronary syndrome (ACS) in Albania, a country which is undergoing a particularly rapid socio-economic transition accompanied by intensive emigration. Methods A population-based case-control study, conducted in Tirana, Albania, in 2003-06, included 467 non-fatal consecutive ACS patients (370 men, 97 women; 88% response) and 737 population-representative controls (469 men, 268 women; 69% response) aged 35-74 years. Information on emigration of family members and financial support, socio-demographic characteristics and conventional coronary risk factors was obtained by a structured questionnaire and examination. Associations of emigrational variables with ACS were assessed by logistic regression. Results Forty five percent of female and 25% of male patients, and 17 and 15% of controls, respectively, reported emigration of a close family member. These were younger and of lower education, income and social status than controls without emigrants. Forty nine percent of patient emigrants vs 76% of control emigrants remitted funds. Excess risk of ACS was confined to individuals whose emigrant relatives did not remit monies home [multivariable-adjusted odds ratio (OR)=10.8, 95% confidence interval (Cl)=2.6-44.8 in women, and OR=2.0, 95% CI=0.9-4.3 in men; P for sex-interaction=0.03] and was attributable largely to spouse emigration. Conclusions Our findings, which require confirmation, suggest that emigration of close family, but especially of spouses, coupled with non-remittance of financial support is associated with marked health effects in the spouse or parent left behind, and that women are more vulnerable than men.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d59f22cca0b28cfd583e32fc95b2e03a",
  "timestamp": "2025-05-15T02:57:38.676687"
}