{
  "id": 7433,
  "title": "Loss of Paid Employment up to 4 Years after Colorectal Cancer Diagnosis-A Nationwide Register-Based Study with a Population-Based Reference Group",
  "abstract": "Simple Summary Previous research indicated that cancer survivors have a higher risk of loss of paid employment. This is unfortunate as work is important for cancer survivors because it contributes to financial independency and quality of life. Not much work has been done on patients diagnosed with colorectal cancer while it is one of the most common cancers in the working population. We compared a group of 12,007 colorectal cancer survivors up to four years after diagnosis with the general population. We found that colorectal cancer survivors had a 56% higher risk of loss of paid employment, mainly due to work disability. Within the group of colorectal cancer survivors, those being younger, having a higher cancer stage and receiving radiotherapy, had a higher risk of loss of paid employment. Colorectal cancer survivors at high risk of loss of paid employment may benefit from work support interventions as part of cancer survivorship care. Cancer survivors consider work as a key aspect of cancer survivorship while previous research indicated that cancer survivors have a higher risk of unemployment. The objectives were to assess: (1) whether colorectal cancer survivors less often have paid employment at diagnosis compared to a population-based reference group, (2) whether colorectal cancer survivors with paid work have a higher risk of loss of employment up to 4 years after diagnosis compared to a population-based reference group and (3) which colorectal cancer survivors are at highest risk of loss of paid employment. In a nationwide register-based study, persons diagnosed with colorectal cancer (N = 12,007) as registered in the Netherlands Cancer Registry, were compared on loss of paid employment with a sex and age-matched population-based reference group (N = 48,028) from Statistics Netherlands. Cox regression analyses were conducted. Colorectal cancer survivors had a higher risk of loss of paid employment (HR 1.56 [1.42, 1.71]). Within the group of colorectal cancer survivors, risk of loss of paid employment was lower for older survivors (>60 vs. 45-55) (HR 0.64 [0.51, 0.81]) and higher for those with a more advanced cancer stage (IV vs. I) (HR 1.89 [1.33, 2.70]) and those receiving radiotherapy (HR 1.37 [1.15, 1.63]). Colorectal cancer survivors at high risk of loss of paid employment may benefit from work support interventions as part of cancer survivorship.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5a3d36946d13a410967e32db89a8c25",
  "timestamp": "2025-05-15T03:08:37.823166"
}