{
  "id": 7903,
  "title": "The Impact of External Financial Factors on the Eco-Innovation Practices of Small and Medium-Sized Businesses",
  "abstract": "This paper explains how different external financing factors influence SMEs' eco-innovation adoption using the Flash Eurobarometer 441 dataset. This survey was carried out in 28 Member States of the European Union in 2016. The effect of various external financial variables on adopting green operations of 5873 SMEs were examined using binary logistic regression. The findings indicate that traditional external financing approaches, including standard bank loans and green loans, positively affect renewable energy but have no significant impact on other circular eco-innovation applications. Established forms of external public financing, including EU funds and government grants, positively impact the application of water re-design, renewable energy, and energy re-planning activities, but no influence on waste minimization and product re-design practices. The effects of newer forms of external funding are markedly different; the results reveal that crowdfunding has a significant favorable effect on implementing all green actions. Green banks can significantly impact the adoption of water re-planning and waste minimization practices. Peer-to-peer lending is positively correlated to the adoption of actions to minimize waste. Furthermore, business angels and the capital market positively influence product re-design related to green innovations. Risk or venture capital does not affect any form of circular eco-innovations. As a result, some important managerial implications for decision-makers are given.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5b41fccc7eeb99e0c953e884429582b",
  "timestamp": "2025-05-15T03:13:04.973112"
}