{
  "id": 425,
  "title": "Predicting financial losses due to apartment construction accidents utilizing deep learning techniques",
  "abstract": "This study aims to generate a deep learning algorithm-based model for quantitative prediction of financial losses due to accidents occurring at apartment construction sites. Recently, the construction of apartment buildings is rapidly increasing to solve housing shortage caused by increasing urban density. However, high-rise and large-scale construction projects are increasing the frequency and severity of accidents occurring inside and outside of construction sites, leading to increases of financial losses. In particular, the increase in severe weather and the surge in abnormal weather events due to climate change are aggravating the risk of financial losses associated with accidents occurring at construction sites. Therefore, for sustainable and efficient management of construction projects, a loss prediction model that prevents and reduces the risk of financial loss is essential. This study collected and analyzed insurance claim payout data from a main insurance company in South Korea regarding accidents occurring inside and outside of construction sites. Deep learning algorithms were applied to develop predictive models reflecting scientific and recent technologies. Results and framework of this study provide critical guidance on financial loss management necessary for sustainable and efficacious construction project management. They can be used as a reference for various other construction project management studies.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5b5c800a8dc6b547c893b9c74cd9323",
  "timestamp": "2025-05-15T01:38:17.317348"
}