{
  "id": 6811,
  "title": "Competition, Survival Issue, and Performance Constraints of Banks: Evidence from Ethiopian Private Commercial Banks",
  "abstract": "Banks are financial institutions that are crucial to the accomplishment of development objectives because they transfer money from surplus to deficit parties. This study examines the competition, survival, and performance constraints of commercial banks in Ethiopia using the DEA and CAMEL frameworks from 2015 to 2020. The nonparametric (DEA) approach was applied to approximate the overall technical efficiency score of the banks under consideration. The empirical study used twelve private commercial banks operating in Ethiopia, excluding four banks because of a lack of appropriate and audited financial data and no risk assessment between the study periods. The result of the study reveals that under CRS, except for Abyssinia, Anbesa, and Nib International Banks, the remaining banks are more efficient. Under VRS, while Abyssinia Bank was less efficient, other banks were found to be more efficient. Under scale efficiency, Abyssinia, Anbesa, and Nib International Banks were found to be less efficient, while the remaining banks were more efficient. The composite ranking of the CAMEL framework portrays that Awash International Bank, Zemen, and Wegagen Banks were found in the top three ranks, while Cooperative Bank of Oromia, Dashen, and Abyssinia Banks were found in the bottom position. The regression result demonstrates that the ratios of total capital to total assets, loans to assets, total loans to total deposits, and CAR have a positive effect on bank profitability, whereas the ratio of total loans to the number of branches has a statistically negative and significant influence on the return on assets.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5b884f5d8f37e43955ba3bf05658ccd",
  "timestamp": "2025-05-15T03:01:31.516885"
}