{
  "id": 8004,
  "title": "The value and growth effect in the Vietnamese stock market: a mispricing explanation",
  "abstract": "PurposeAlthough the value effect is comprehensively investigated in developed markets, the number of studies examining the Vietnamese stock market is limited. Hence, the first aim of this research is to provide empirical evidence regarding returns on value and growth stocks in Vietnam. The second aim is to explain abnormal returns on Vietnamese growth and value stocks using both risk-based and behavioral points of view.Design/methodology/approachFrom the risk-based explanation, the Capital Asset Pricing Model (CAPM), Fama-French three- and five-factor models are estimated. From the behavioral explanation, to construct the mispricing factor, this paper relies on the method of Rhodes-Kropf et al. (2005), one of the most popular mispricing estimations in the financial literature with numerous citations (Jaffe et al., 2020).FindingsWhile the CAPM and Fama-French multifactor models cannot capture returns on growth and value stocks, a three-factor model with the mispricing factor has done an excellent job in explaining their returns. Three out of four Fama-French mimic factors do not contain additional information on expected returns. Their risk premiums are also statistically insignificant according to the Fama-MacBeth second-stage regression. By contrast, both robustness tests prove the explanatory power of a three-factor model with mispricing. Taken together, mispricing plays an essential role in explaining returns on Vietnamese growth and value stocks, consistent with the behavioral point of view.Originality/valueThere are several value-enhancing aspects in the field of market finance. First, this paper contributes to the literature of value effect in emerging markets. While the evidence of value effect is obvious in numerous developed as well as international markets, both growth and value effects are discovered in Vietnam. Second, the explanatory power of Fama-French multifactor models is evaluated in the Vietnamese context. Finally, to the best of the author's knowledge, this is the first paper that incorporates the mispricing estimation of Rhodes-Kropf et al. (2005) into the asset pricing model in Vietnam.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5bd0d416759bd4ec2c6b5d3932c89ae",
  "timestamp": "2025-05-15T03:14:07.316011"
}