{
  "id": 6389,
  "title": "The migrant Hazara Shias of Pakistan and their social determinants for PTSD, mental disorders and life satisfaction",
  "abstract": "Background: Ensuring safety and wellbeing of all the minority populations of Pakistan is essential for collective national growth. The Pakistani Hazara Shias are a marginalized non-combative migrant population who face targeted violence in Pakistan, and suffer from great challenges which compromise their life satisfaction and mental health. In this study, we aim to identify the determinants of life satisfaction and mental health disorders in Hazara Shias and ascertain which socio-demographic characteristics are associated with post-traumatic stress disorder (PTSD).Methods: We used a cross-sectional quantitative survey, utilizing internationally standardized instruments; with an additional qualitative item. Seven constructs were measured, including household stability; job satisfaction; financial security; community support; life satisfaction; PTSD; and mental health. Factor analysis was performed showing satisfactory Cronbach alpha results. A total of 251 Hazara Shias from Quetta were sampled at com-munity centers through convenience method based on their willingness to participate.Results: Comparison of mean scores shows significantly higher PTSD in women and unemployed participants. Regression results reveal that people who have low community support, especially from national and ethnic community, religious community, and other community groups, had higher risk of mental health disorders. Structural equation modeling identified that four study variables contribute to greater life satisfaction, including: household satisfaction (I3 = 0.25, p < 0.001); community satisfaction (I3 = 0.26, p < 0.001); financial security (I3 = 0.11, p < 0.05); and job satisfaction (I3 = 0.13, p < 0.05). Qualitative findings revealed three broad areas which create barriers to life satisfaction, including: fears of assault and discrimination; employment and education problems; and financial and food security issues.Conclusions: The Hazara Shias need immediate assistance from state and society to improve safety, life oppor-tunities, and mental health. Interventions for poverty alleviation, mental health, and fair education and employment opportunities need to be planned in partnership with the primary security issue.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5cd200adbcd4b2c1508d61f19b3b22f",
  "timestamp": "2025-05-15T02:57:38.759906"
}