{
  "id": 7547,
  "title": "Association of Inflammatory Bowel Disease and Urolithiasis in Hospitalized Pediatric Patients",
  "abstract": "Background: Urolithiasis is rare in pediatric patients. All patients with inflammatory bowel disease (IBD) have an increased risk of urolithiasis, but this risk is poorly quantified in children. The objective of this study is to evaluate the association of IBD with urolithiasis, assess surgical outcomes, and analyze the financial burden for children hospitalized with urolithiasis and comorbid IBD. Methods: The triennial Healthcare Cost and Utilization Project Kids' Inpatient Database for years 1997 to 2012 was used to evaluate the association between urolithiasis and IBD in hospitalized, nonpregnant children ages 5 to 20 years old. Billing codes were used to define conditions. Logistic regression analysis quantified the association between IBD types and urolithiasis. Length of hospital stay, costs, procedures, and complications were compared between urolithiasis patients with and without IBD. Results: Among 8,828,522 hospital admissions, we identified 36,771 admissions with a primary diagnosis of urolithiasis. Of these cases, 230 were associated with Crohn's disease (odds ratios, 1.99; 95% confidence interval, 1.74-2.27) and 102 with ulcerative colitis (odds ratio, 1.63; 95% confidence interval, 1.34-1.99). Urolithiasis patients with ulcerative colitis, but not Crohn's disease, had significantly increased length of stay and costs. Patients with either IBD had a decreased number of urologic procedures. Conclusions: The diagnosis of urolithiasis in pediatric patients is associated with IBD, and those with ulcerative colitis have longer hospital stays and greater costs. Patients with IBD have fewer urologic procedures associated with their urolithiasis diagnosis.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5d9d2bced714fc35af5ca318ff3bad9",
  "timestamp": "2025-05-15T03:09:36.939182"
}