{
  "id": 8833,
  "title": "Corporate social responsibility and tax avoidance: the case of French companies",
  "abstract": "Purpose The purpose of this paper is to shed light on the effect of tax avoidance on corporate social responsibility performance. It also investigates whether audit quality affects tax avoidance practices by socially responsible performance. Design/methodology/approach Based on a sample of French non-financial companies over the period 2005 to 2016, this paper uses panel data regressions. The authors apply generalized least square panel regression to overcome autocorrelation and heteroscedasticity problems. For further robustness, this paper runs instrumental variable regressions using the three-stage instrument variable method (three-stage least square). Findings The results show that firms with high CSR scores are more likely to engage in aggressive tax avoidance. The findings also show that firms audited by high-quality auditors are more likely to get involved in CSR for hedging against the potential consequences of aggressive tax avoidance practices. Research limitations/implications The findings are consistent with risk management theory, which suggests that firm's hedge against any reputational risks that might arise from avoiding taxes by engaging more in CSR. Practical implications Results have implications for policymakers in that CSR firms audited by high-quality auditors may engage in CSR to overcome any negative reactions that could be caused as a result of tax avoidance. Thus, they need to be cautious about managers' opportunistic behavior and enhance monitoring to enforce social compliance and to be tax compliant. Originality/value This paper extends the existing literature by examining the effect of audit quality on the relationship between CSR performance and corporate tax avoidance. Audit quality is deemed to be an important governance feature that is likely to constraint managerial opportunistic behaviors. Audit quality, along with CSR performance, are associated with a higher level of tax avoidance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5e4acefa8178f722d90da47f175a8dc",
  "timestamp": "2025-05-15T03:22:57.900367"
}