{
  "id": 256,
  "title": "Construction and application of computerized risk assessment model for supply chain finance under technology empowerment",
  "abstract": "This study seeks to assist small and medium enterprises break free of the constraints of the conventional financing model and lessen the supply chain finance risks they face. First, the supply chain financial business model and credit risk are analyzed, followed by a discussion of the application principle of blockchain in the control of supply chain financial credit risk. The next topic up for discussion is the emancipation of individuals and the application of financial technology toward the management of financial risk in supply chains. In the final stage of the development of the computerized risk assessment model, the Fuzzy Support Vector Machine (FSVM) is optimized, and the effectiveness and efficiency of risk classification are enhanced by introducing a variable penalty factor C. To test the efficacy of the C-FSVM risk assessment model, the Chinese auto sector is used as the study's object. According to the results of the study, the C-FSVM model has a classification accuracy of 96.35% for the entire sample, 96.45% for credible firms, and 95.34% for default enterprises. The training time of the C-FSVM model is 473.9s, which is far lower than the SVM and FSVM models' training times of 1631.6s and 1870.2s. In summary, the C-FSVM supply chain financial risk assessment model is effective and has great application value in banking practice.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d5f40fc460a50d2717a1945f9d9cf684",
  "timestamp": "2025-05-15T01:48:30.810909"
}