{
  "id": 5055,
  "title": "Beyond Subsidies: A Study of Sustainable Public Subordinated Debt in Spain",
  "abstract": "Evidence from business shows that small- and medium-sized enterprises (SMEs) are fragile. They suffer from a high mortality rate that primarily owes to difficulties in securing financing as a result of major information asymmetries. Despite these difficulties, SMEs provide the economic backbone of all economically developed countries. Aware of the key role of SMEs in national economic stability and of the financial problems that SMEs face, governments have designed a range of financial and tax measures to protect them. These financial measures include a highly specific form of public financing called subordinated debt. This concept refers to debt with the lowest credit seniority, just before equity. Subordination makes sense when companies go into liquidation because subordinated debt creditors are the last creditors to receive repayment, making recovery of this debt virtually impossible. Therefore, the risk borne by lenders of subordinated debt is similar to that of shareholders of the borrowing firm. This paper presents an ordinary least squares regression model to estimate the cash flows of SMEs financed by public subordinated debt. This provides public authorities with a tool to estimate the ability of SMEs to repay their debt and to thereby ensure that public subordinated debt financing is sustainable.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d603f88d7be0871247d622b683b91933",
  "timestamp": "2025-05-15T02:43:40.272495"
}