{
  "id": 389,
  "title": "Natural Gas Prices in the Framework of European Union's Energy Transition: Assessing Evolution and Drivers",
  "abstract": "This study analyzes European natural gas (NG) prices since the eve of the 2008 financial crisis. Spearman's rank correlation coefficients associate prices with and without taxation, whereas a hierarchical clustering analysis clarifies similarities in NG pricing behavior. After performing econometric tests to ensure the satisfaction of classical hypotheses and identify a system of endogenous variables, structured unrestricted and restricted vector autoregressive models are applied to panel data composed of 34 spatial units and 31 units of time drawn from 2007-2022 to confirm the presence of short-term and long-term causal dependencies. The nonparametric analysis identifies three groups of countries that exhibit a differentiated pricing behavior. The parametric analysis reveals a significant and asymmetric short run relation, which is imposed by liquefied natural gas (LNG) imports from Nigeria on the logarithm of NG prices. However, the sign of coefficients associated with lagged LNG imports varies across spatial units belonging to the sample. The error correction term is negative and significant, which implies evidence of cointegration. Since the main result identifies ambiguous short-term effects emerging from the diversification in favor of LNG imports from Nigeria, a straightforward policy recommendation is that this strategic option may be ill advised for Europe and, indirectly, it legitimizes the suggestion that alternative decarbonization options can play a prominent role in European NG markets in the near future.",
  "year": 2023,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d60f9d1993bb225e53ee91aefa058f98",
  "timestamp": "2025-05-15T01:31:13.210449"
}