{
  "id": 2800,
  "title": "Investors' Aspirations toward Social Impact: A Portfolio-Based Analysis",
  "abstract": "In the last ten years, we have witnessed a proliferation of investors claiming blended value strategies, i.e., pursuing both economic and social returns in their investments. Aside from this rush for self-selecting in a blended value finance context, we still do not know to what extent the investors' claims actually reflect investment decisions. Evidence suggests that, in some cases, such investors tend to maximize the social performance over the financial performance; in some others, the effect is reverted, but literature currently lacks studies aligning the analysis of the investment decisions with the investment portfolios. Yet, it is still unclear whether blended value investment decisions are enacted as a result of investors' deliberate strategies and what influences this relationship. In this paper we tackle this issue, analyzing the extent to which investors' finance firms pursuing goals aligned with their strategic aspirations. Specifically, adopting a Fractional Logistic Regression model, we test the effect of investors' aspirations toward social impact on the extent to which their investees (i.e., the portfolio of firms in which they invest) pursue social returns. Results suggest the existence of a positive and significant investor-portfolio alignment effect (i.e., the higher the investors' aspirations toward social impact, the higher the number of investees with higher social aspirations). Yet, this effect is influenced by contingencies at both investor and portfolio levels. Investors with strong aspirations toward social impact that: (i) invest in countries with high levels of social inequality, and (ii) are located in countries that support social progress and maximize, in their portfolios, the presence of businesses pursuing social impact. We discuss implications for future researchers, policymakers and practitioners.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d61809a2aff90878b7fd63df749b8f08",
  "timestamp": "2025-05-15T01:10:49.441338"
}