{
  "id": 1397,
  "title": "Improving audit opinion prediction accuracy using metaheuristics-tuned XGBoost algorithm with interpretable results through SHAP value analysis",
  "abstract": "This study aims to create a machine learning model that can predict opinions in external audits and surpass the benchmark set in a prior study from the literature. This tool could reduce audit risk, which is a crucial task in external audits. Previous studies have shown that it is possible to create models that can predict the audit opinion a company will receive. In these studies, authors used statistics and machine learning models, and both non-financial (e.g. audit lag) and financial data (e.g. financial ratios, or absolute value items available from financial statements) to make predictions. In this study, the performance of the XGBoost model optimized by metaheuristics algorithms is examined and evaluated. This study compares the performance of six different metaheuristic algorithms used to tune the XGBoost model in two separate scenarios. The first scenario represents a realistic client portfolio, where a majority of the clients are known, while the second scenario simulates a new clients-only portfolio, a more difficult scenario where prior information such as audit lag is not available. The study uses a dataset of 12,690 observations of Serbian companies and their audit opinions from 2016 to 2019. The findings indicate an improvement over the benchmark due to a more optimized hyperparameter tuning process and the use of the iterative sine-cosine algorithm for the XGBoost model.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d637b3157c794d89eefe83cd996730ea",
  "timestamp": "2025-05-15T02:02:22.752481"
}