{
  "id": 89,
  "title": "Intelligent Financial Risk Warning for Enterprises Through Knowledge Graph-Based Deep Learning",
  "abstract": "The financial risk warning methods for enterprises have always been a practical concern. In digital society, the computational intelligence has brought more spirit to this demand. This paper first introduces the current situation of the development of Knowledge graph technology, describes the deep learning fusion method based on Knowledge graph, and expresses the feasibility of this study. Then, according to the requirements of Knowledge graph, it completes the method fusion of core data training and extraction, and completes the adaptive deep learning design for the Beautiful SCOP database, and establishes a STDE-FG financial risk early warning model. Through empirical analysis, the shortcomings of this model were identified, and a comparison of optimized and optimized results was completed. Two aspects of phenomenon can be found from experimental results. For one thing, the accuracy of the unoptimized STDE-FG early warning model has been improved by 37.5-55.3% compared to traditional prediction models, but the prediction value during legal person changes has a greater error than traditional prediction values. For another, the optimized STDE-FG early warning model has also improved its accuracy in predicting new investments and equity changes, with improvements of 17-32% and 16-28%, respectively, with significant changes. This model will have a positive impact on improving enterprise risk management capabilities and reducing financial risk costs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d637a0690f1f6011a11d6b1f68a5bcb0",
  "timestamp": "2025-05-15T01:33:49.035238"
}