{
  "id": 3881,
  "title": "AGILE OR TRADITIONAL PROJECT ORGANISATION: A QUANTITATIVE ASSESSMENT OF DECISION CRITERIA AMONG FIRMS IN THE DACH REGION",
  "abstract": "The so-called agile approach is increasingly popular in the world of project management as a response to more dynamic and competitive environments. This study follows the question: What are the decisive criteria that result in the use of agile process models in practice? Therefore, a broad range of decision criteria is investigated, representing different reasons for firms to decide in favour or against the usage of agile process models, namely: Time-saving, increased efficiency, availability of qualified personnel, uniform terminology, project comparability and functions as a knowledge base. Most existing research on agile project management is of qualitative nature; this study uses a quantitative approach to assessing 51 firms and nine different industries within the DACH region. The collected data was analysed in a binary logistic regression model. Results reveal that time-saving positively predicts the use of agile process models, while high ratings in function as a knowledge base and project comparability predict the absence of agile process models. Therefore, practitioners are suggested to educate project and portfolio managers in the creation of hybrid environments and integration of agile process models in traditional project portfolios.Implications for Central European audience: The results of this study provide valuable insights into the selection of project management approaches across different industries in the DACH region.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d65f28745dd4fdd51725691abc337f9e",
  "timestamp": "2025-05-15T01:21:41.413412"
}