{
  "id": 5846,
  "title": "A Technique to Predict Bankruptcy Using Ultimate Ownership Network as Key Indicators",
  "abstract": "Predicting bankruptcy is crucial to avert company failures, which could lead to a systemic collapse of the economy. This study examines the network of executives, directors, and shareholders to identify conglomerates, which are often characterized by a lack of explicit connections between these individuals or institutions. Understanding these networks is crucial for mitigating the risk of bankruptcy and its potential systemic effects. We proposed a technique that uses non-financial factors that could serve as predictors of bankruptcy, as well as the link among the ultimate owners. A regression analysis is employed to evaluate the network's effect on bankruptcy prediction. The findings indicate a significant impact of the directors' degree of centrality and the direct bankruptcy rate of director and executive networks on the likelihood of bankruptcy. Additionally, the predictions for one and two years ahead are significantly influenced by the strength or weighted degree of centrality and betweenness centrality of directors. Notably, the influence of executive and shareholder indirect bankruptcy rates becomes increasingly prominent in predicting distress. These results offer a novel perspective on incorporating network variables into bankruptcy prediction models, with an accuracy of 86% using random forest and XGBoost models. The findings indicate that bankruptcy prediction techniques can employ network variables, as alternative data to financial indicators.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d66550ef48cd179a4c52525a1ce4eed7",
  "timestamp": "2025-05-15T02:51:58.638954"
}