{
  "id": 3941,
  "title": "Enterprise Resource Planning and Business Intelligence, Advanced Management Methods for Romanian Companies",
  "abstract": "Purpose - The aim of the paper is to study the use of the advanced management methods in the 2010 year in Romania. The study set sights on Romanian organizations which implemented a Siveco ERP and BI software. Methodology/approach - The methodology used is both quantitative and qualitative. The research results were obtained with the use of a questionnaire, and our purpose was to demonstrate some hypothesis concerning the size of the organisation, the management method and the IT&C based decision. The questionnaire was operated with SPSS 17, through a linear regression analysis and a t test. Research limitations/implications - The study is limited to the Siveco companies portfolio and deals with the dependence between existing computers, software programs and the level of business software implementation in every business function or department of 14 Romanian organizations. Practical implications - The practical value of this study was to test die impacts of contingency factors, including size, on die one hand, and ERP systems success, on the other. We try to demonstrate that the relationship between firm size and ERP success will be moderated by IT assets. Originality/value - The research has revealed the global IT and specific ERP and BI implementing level, as advanced management methods, in the 2010 Romanian organizations, and has a high level of originality, such a study has been never conducted before for computer based advanced management methods implementation.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d667c7f63a3707e85ea51b6442c94201",
  "timestamp": "2025-05-15T01:22:39.298319"
}