{
  "id": 9297,
  "title": "Social work contact in a UK cohort study: Under-reporting, predictors of contact and the emotional and behavioural problems of children",
  "abstract": "Background: There is little evidence on the degree of underreporting of social work contact in survey studies. There are also few studies about the emotional and behavioural problems of children in families who have contact with social workers, despite the adversities they face. Objective: We examine underreporting of social work contact; the predictors of social work contact with families; and links between social work contact and emotional and behavioural outcomes for children. Participants and setting: The Avon Longitudinal Study of Parents and Children follows the health and development of 14,062 children born in 1991-2 to women living in and around the City of Bristol. The study includes self-reported information about mothers' contact with social workers and children's emotional and behavioural outcomes using the Strengths and Difficulties Questionnaire (SDQ). Methods: Self-reporting of social work contact in ALSPAC is compared with administrative data from the child protection register to examine rates of underreporting. We use a fixed-effects model to account for measurement error in estimating the association between social work contact and potential predictors, namely gender of the child and maternal factors: marital status, trouble with law, hospitalisation, cannabis and alcohol use, employment, financial difficulty and experience of cruelty from a partner. SDQ scores are explored using linear regression with lagged indicators of social work contact. Results: The probability of a false negative for self-report of social work contact ranged from 22% to 34% across three survey waves. Mothers who married within the last 12 months were less likely to receive social work contact (OR: 0.13, CI95%: 0.01-1.34). Those who had either been hospitalised (OR: 1.52, CI95%: 1.01 - 2.28) or increased their rate of alcohol consumption (OR: 2.14, CI95%: 0.91 - 5.07) within the last 12 months were more likely to receive such contact. Overall children whose mothers report social work contact were much more likely to have emotional and behavioural problems within the first seven years of their lives (p < 0. 01). Conclusion: There is potentially a high degree of underreporting of social work contact in social surveys and cohort studies. Researchers should adopt methods to account for this issue in the future. The risk of emotional and behavioural problems is greater among children whose mothers have had contact with social workers compared to other children with seemingly similar adversities.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d66cd2cbc2b2462a57b2d94d07ff4dc3",
  "timestamp": "2025-05-15T03:27:25.028067"
}