{
  "id": 5037,
  "title": "A genetic type-2 fuzzy logic based system for the generation of summarised linguistic predictive models for financial applications",
  "abstract": "The global economic meltdown of the late 2000s exposed many organisations around the world, this drove the need to build robust frameworks for predicting and assessing risks in financial applications. Such predictive frameworks helped organisations to increase the quality and quantity of their transactions hence increasing the revenues and reducing the risks. Many organisations around the World still use statistical regression techniques which are well established for many problems such as fraud detection or risk analysis. However, recent years have seen the application of computational intelligence techniques to develop predictive models for financial applications. Some of the computational intelligence techniques like neural networks provide good predictive models, nevertheless they are considered as black box models which do not provide an easy to understand reasoning about a given decision or even a summary of the generated model. However, in the current economic situation, transparency became an important factor where there is a need to fully understand and analyze a given financial model. In this paper, we will present a Genetic Type-2 Fuzzy Logic System (FLS) for the modeling and prediction of financial applications. The proposed system is capable of generating summarized models from a specified number of linguistic rules, which enables the user to understand the generated financial model. The system is able to use this summarized model for prediction within financial applications. We have performed several evaluations in two distinctive financial domains, one for the prediction of good/bad customers in a financial real-world lending application and the other domain was in the prediction of arbitrage opportunities in the stock markets. The proposed Genetic type-2 FLS has outperformed white box models like the Evolving Decision Rule procedure (which is a white based on Genetic Programming and decision trees) and gave a comparable performance to black box models like neural networks while the proposed genetic type-2 FLS provided a white box model which is easy to understand and analyse by the lay user.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d67ba6b4c8773c0927dbbb5d9e31fb27",
  "timestamp": "2025-05-15T02:43:40.170561"
}