{
  "id": 5698,
  "title": "Public health insurance and the risk of cancer-specific mortality in patients with cervical cancer: A Chinese prospective cohort study",
  "abstract": "ObjectiveCervical cancer has one of the highest incidence and mortality rates of any malignant tumor of the female reproductive tract, and its longer treatment period will place significant financial strain on patients and their families. Little is known about how health insurance policies influence cervical cancer prognosis, particularly in developing countries. The relationship between cervical cancer specific death and cervical cancer all-cause mortality with public health insurance, self-payment rate, and the combined effect of public health insurance and self-payment rate was investigated in this study. Materials and methodsFrom 2015 to 2019, a prospective longitudinal cohort study on cervical cancer was carried out in Chongqing, China. We chose 4,465 Chongqing University Cancer Hospital patients who had been diagnosed with cervical cancer between 2015 and 2019. The self-payment rate and public health insurance are taken into account in our subgroup analysis. After applying the inclusion and exclusion criteria, we describe the demographic and clinical traits of patients with various insurance plans and self-payment rates using the chi-square test model. The relationship between cervical cancer patients with various types of insurance, the self-payment rate, and treatment modalities is examined using the multivariate logistic regression model. After applying the inclusion and exclusion criteria, we summarize the demographic and clinical traits of patients with various insurance plans and self-payment rates using the chi-square test model. The association between cervical cancer patients with various types of insurance, the self-payment rate, and treatment modalities is examined using the multivariate logistic regression model. The cumulative hazard ratio of all-cause death and cervical cancer-specific mortality for various insurance types and self-payment rates was then calculated using the Cox proportional hazard model and the competitive risk model. ResultsThis study included a total of 3,982 cervical cancer patients. During the follow-up period (median 37.3 months, 95% CI: 36.40-38.20), 774 deaths were recorded, with cervical cancer accounting for 327 of them. Patients who obtained urban employee-based basic medical insurance (UEBMI) had a 37.1% lower risk of all-cause death compared to patients who received urban resident-based basic medical insurance (URBMI) (HRs = 0.629, 95% CI: 0.508-0.779, p = 0.001). Patients with a self-payment rate of more than 60% had a 26.9% lower risk of cervical cancer-specific mortality (HRs = 0.731, 95% CI: 0.561-0.952, p <0.02). ConclusionsThe National Medical Security Administration should attempt to include the more effective self-paid anti-tumor medications into national medical insurance coverage within the restrictions of restricted medical insurance budget. This has the potential to reduce not only the mortality rate of cervical cancer patients, but also their financial burden. High-risk groups, on the other hand, should promote cervical cancer screening awareness, participate actively in the state-led national cancer screening project and enhance public awareness of HPV vaccine. This has the potential to reduce both cervical cancer patient mortality and the financial burden and impact.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d67e6c763622a8fa586b8d5f2c084048",
  "timestamp": "2025-05-15T02:50:21.322529"
}