{
  "id": 4442,
  "title": "Effect of Psychological Factors on Credit Risk: A Case Study of the Microlending Service in Mongolia",
  "abstract": "This paper determined the predefining factors of loan repayment behavior based on psychological and behavioral economics theories. The purpose of this research is to identify whether an individual's credit risk can be predicted based on psychometric tests measuring areas of psychological factors such as effective economic decision-making, self-control, conscientiousness, selflessness and a giving attitude, neuroticism, and attitude toward money. In addition, we compared the psychological indicators to the financial indicators, and different age and gender groups, to assess whether the former can predict loan default prospects. This research covered the psychometric test results, financial information, and loan default information of 1118 borrowers from loan-issuing applications on mobile phones. We validated the questionnaire using confirmatory factor analysis (CFA) and achieved an overall Cronbach's alpha reliability coefficient greater than 0.90 (alpha = 0.937). We applied the empirical data to construct prediction models using logistic regression. Logistic regression was employed to estimate the parameters of a logistic model. The outcome indicates that positive results from the psychometric testing of effective financial decision-making, self-control, conscientiousness, selflessness and a giving attitude, and attitude toward money enable individuals' debt access possibilities. On the other hand, one of the variables-neuroticism-was determined to be insignificant. Finally, the model only used psychological variables proven to have significant default predictability, and psychological variables and psychometric credit scoring offer the best prediction capacities.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d67f898445f1a10bbe26062d2ab5a7fe",
  "timestamp": "2025-05-15T02:37:16.903773"
}