{
  "id": 4604,
  "title": "Quality of Corporate Governance on Dividend Payouts: The Case of Nigeria",
  "abstract": "Corporate governance (CG) safeguards shareholders' portfolios and ensures optimal returns in terms of dividend payouts (DPs) on investment. The association between CG and DPs could be significant in relation to risk exposure, operational and financing activities across firms and sectors. The relationship between CG and DPs has been well documented, however; the role of industry classification on the relationship has not been given adequate consideration in the literature. This study, therefore, examines the moderating effects of sector classification of CG on DPs in Nigeria. Agency theory underpins the model which captures the effects of CG on DPs. Governance indicators and dividend per share of 97 non-financial listed companies in Nigeria from 1995-2012 are utilized. The system generalized method of moments estimation technique is employed in the analysis. The empirical findings indicate a positive association between CG and DP. Additionally, the analysis underlines the importance of the mode of operations (sector classification) in the relationship between CG practices and DPs in Nigeria. Based on the results of the study, it is suggested that more independent directors should be on the boards of corporate firms and the proportion of institutional shareholding also be increased to improve monitoring.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d6806cef28fe211a78545b5ad3c54bf4",
  "timestamp": "2025-05-15T02:38:56.434634"
}