{
  "id": 7818,
  "title": "Impact of pregnancy on psychoactive substance use among women with substance use disorders recruited in addiction specialized care centers in France",
  "abstract": "Pregnancy can be a motivation for decrease in drug abusing but may also represent a period of high vulnerability for relapse. We aimed to assess psychoactive substance use among women with substance use disorders followed in addiction care centers in France. We analyzed data from women aged 15-44 years included in the Observation of illegal drugs and misuse of psychotropic medication (OPPIDUM) survey', an annual cross-sectional survey collecting details on psychoactive substances used. Characteristics of women included in 2005-2012 yearly surveys were compared depending on their pregnant or not pregnant status. Factors, including pregnancy, associated with illicit substance use and medication misuse were investigated through logistic regression. The study included 518 pregnant and 6345 nonpregnant women; 85.3% pregnant women were on opioid maintenance therapy (OMT) (vs. 77.1% of nonpregnant). Pregnancy was associated with lower illicit substance use (adjusted OR 0.71 [0.58-0.88]) and with lower medication misuse (0.66 [0.49-0.89]), whereas financial insecurity and living as a couple were associated with increased risk. Raising children was significantly associated with less risk of substance use. Each substance taken separately, the part of women using illicit substance or misusing medication did not differ depending on whether they were pregnant or not, except for heroin (24.5% in pregnant vs. 17.9% nonpregnant; <0.001). This nationwide study provides new insights into psychoactive substance use in a large mixed population of women with drug use disorders. Results outline the challenge of preventing drug use and initiating care strategies with a specific approach on socio-economic environment.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d68462c86646afe9e8b37e88e262e57f",
  "timestamp": "2025-05-15T03:12:36.393420"
}