{
  "id": 2342,
  "title": "Optimal Life Extension Management of Offshore Wind Farms Based on the Modern Portfolio Theory",
  "abstract": "The present study aims to develop a risk-based approach to finding optimal solutions for life extension management for offshore wind farms based on Markowitz's modern portfolio theory, adapted from finance. The developed risk-based approach assumes that the offshore wind turbines (OWT) can be considered as cash-producing tangible assets providing a positive return from the initial investment (capital) with a given risk attaining the targeted (expected) return. In this regard, the present study performs a techno-economic life extension analysis within the scope of the multi-objective optimisation problem. The first objective is to maximise the return from the overall wind assets and the second objective is to minimise the risk associated with obtaining the return. In formulating the multi-dimensional optimisation problem, the life extension assessment considers the results of a detailed structural integrity analysis, a free-cash-flow analysis, the probability of project failure, and local and global economic constraints. Further, the risk is identified as the variance from the expected mean of return on investment. The risk-return diagram is utilised to classify the OWTs of different classes using an unsupervised machine learning algorithm. The optimal portfolios for the various required rates of return are recommended for different stages of life extension.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d69032a0fed0b4307d39ca9c433e99e6",
  "timestamp": "2025-05-15T01:06:10.634479"
}