{
  "id": 3233,
  "title": "Gender diversity, corporate governance and financial risk disclosure in the UK",
  "abstract": "Purpose This study aims to investigate the impact of corporate governance (CG) mechanisms on financial risk reporting in the UK. Design/methodology/approach The study uses a panel data of 50 non-financial firms belonging to 10 industrial sectors listed on the London Stock Exchange in the period 2011-2015. Multivariate regression techniques are used to examine the relationships. Findings The findings of this study reveal that CG has a significant influence on financial risk disclosure. Specifically, it is found that block ownership and board gender diversity have a positive effect on the level of corporate financial risk disclosure (FRD). While there is no significant relationship between board size and corporate FRD. Research limitations/implications This study has significant implications for policy-makers, investors and regulators. Evidence of growing FRD implies that efforts by several stakeholders have had some positive impact on the level of FRD in the firms examined. Examples of such changes include, namely, increasing board size and gender diversity acting as effective firm level advisors and monitors of FRD. As a consequence, regulators and policymakers should continually pursue reforms to encourage firms to follow CG principles that are promoted as good practice. Originality/value This study adds to the emerging body of literature on CG-risk disclosure relationships in the UK context using content analysis. The study also highlights that gender diversity enhances FRD.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d6a642c2e1d54b8525652edcd44cbc1f",
  "timestamp": "2025-05-15T02:24:05.104499"
}