{
  "id": 8113,
  "title": "Overdiagnosis Problems in the DSM-IV and the New DSM-5: Can They Be Resolved by the Distress Impairment Criterion?",
  "abstract": "Criticisms of psychiatry for overdiagnosing, for pathologizing normality, are not new, dating at least from the antipsychiatry critiques in the 1960s. Inevitably, revisions of the diagnostic manuals, the International Classification of Diseases and the Diagnostic and Statistical Manual of Mental Disorders (DSM), provide an occasion for renewed criticism, and the revision process of the DSM-IV became a focus for further debates on overdiagnosis. The debates are typically not about the presence or absence of a decisive marker of specific illnesses or of illness in general a complex matter on which there is hardly a consensus but rather about the relative medical, psychosocial, and financial harms and benefits that may accrue from overdiagnosis on the one side and underdiagnosis on the other. It is proposed in this In Review paper that a useful and valid principle for use in these debates is the tight conceptual linkage between illness and distress and impairment of day-to-day functioning. This linkage is fundamental to the conceptualization of mental disorder in the DSM-IV and can still serve to reduce overdiagnosis by excluding cases where distress and impairment are absent or minimal. The same conceptual linkage provides a way of understanding how conditions may warrant a diagnosis even though they are not associated with current distress or impairment, namely, if they carry risk for such in the future. For these conditions, assessments of costs and benefits of overdiagnosis and underdiagnosis depend crucially on high-quality, replicated data on the sensitivity and specificity of the early diagnostic test.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d6acc5e34806027fa72bd6217cff2722",
  "timestamp": "2025-05-15T03:15:38.316355"
}