{
  "id": 7603,
  "title": "ENVIRONMENTAL DISCLOSURES EFFECT ON COST OF CAPITAL STRUCTURE FINANCING OF THE NIGERIAN LISTED COMPANIES",
  "abstract": "The paper examined the relationship between environmental disclosure and cost of capital structure financing of the Nigerian listed companies. This is due to a concern about the environmental behaviour of the companies that result in stakeholders' interest in environmental disclosure. Though the disclosure is voluntary (to a certain extent) its inadequacy creates information asymmetric and risk that affect the cost of capital structure financing. The study was on listed Nigerian companies whose activities have an environmental repercussion. Where the data was gathered from content analysis of the companies' annual reports. A regression analysis based on the pool, 2SLS and 3SLS were made to improve the robustness of the results. It provides evidence in support of companies' stakeholders' engagement through disclosure to manage the cost of capital structure financing. The disclosure level effect on the cost of capital structure will help curtailed negative environmental activities of the companies. However, the sample size is small due to the limited number of publically listed companies in the Nigerian. Additionally, the data is cross-sectional which may not be stable over time and across industries level. Recommend for further study that will look into financial stakeholders' perception about the environmental disclosure and its value relevance in financing decision.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d6c29665d0e7f113d6f2a531df305ddb",
  "timestamp": "2025-05-15T03:10:05.661139"
}