{
  "id": 838,
  "title": "Design of Quantitative Trading System Based on Data Mining Method under Software and High-Performance Computing",
  "abstract": "The size of funds managed by all hedge funds in the world has exceeded 2.7 trillion US dollars. The funds of various funds and asset management products managed by quantitative investment account for about 30% of the total global trading volume, and in various large stock exchanges around the world, various quantitative investment methods contribute nearly 50% volume of transactions. The construction of a quantitative trading strategy requires first statistical analysis of the information in the securities and futures market and then backtesting the quantitative model with historical data. In view of the practical application of quantitative trading, this study designs a quantitative trading system based on the data mining method. The main development tool used is the numerical computing software MATLAB, and four cores are designed: quantitative stock selection, strategy backtesting, time-series analysis, and portfolio management. The system supports modules for simple trading decisions. It abandons the traditional method of predicting the absolute value of the future price of stock index futures and adopts a new method of predicting the future price trend of stock index futures. This method avoids the huge impact of the accuracy of the absolute value of the prediction on the final investment in the traditional method and also reduces the high dependence of investors on the accuracy of the absolute value. This study also introduces the support-vector machine algorithm in data mining and the quantitative trading system model in data mining. The accuracy of investment transactions in the experiment is also simulated by using the support-vector machine.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d6c559b18cd19815593c5b8f6e8d81f6",
  "timestamp": "2025-05-15T00:48:22.537490"
}