{
  "id": 3725,
  "title": "How fintech affects financial sustainability in the electric power industry?-evidence from Chinese companies",
  "abstract": "Introduction: The financial sustainability of the electric power industries is of significant practical significance for achieving carbon neutrality and peak carbon emissions.Methods: We innovatively use web crawler technology to obtain keywords related to fintech in the search index and constructs a regional fintech indicator system. Based on this indicator system, we explore the impact of fintech on the financial sustainability of the electric power industry by panel regression model. The result shows that fintech significantly improved the financial sustainability of electric power companies. Further evidence indicates that fintech can promote financial sustainable development by enhancing corporate risk-taking ability, increasing operating income, and alleviating financing constraints. Heterogeneity analysis indirectly proves that compared to state-owned electric power enterprises, private electric power enterprises face a more severe financing environment. But private enterprises can obtain more credit funds through new financing channels opened by financial technology. So, the role of fintech in alleviating the phenomenon of ownership discrimination in the financial system cannot be ignored. In addition, we also find that fintech is more significant in helping small and medium-sized electric-power enterprises in financial sustainability, while it is less helpful for large enterprises.Discussion: In the context of the fusion development of technology and financial markets, the research conclusions of this article provide important references for governments, enterprises, and traditional financial institutions to make corresponding reforms.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d6d2bd8b68b815397dcfba0ebbc28ff5",
  "timestamp": "2025-05-15T02:29:27.979630"
}