{
  "id": 5628,
  "title": "Bank risk, profit efficiency and profitability in a frontier market",
  "abstract": "Purpose The study examines the impact of risk on the profit efficiency and profitability of banks in Ghana. Design/methodology/approach Data envelopment analysis was used to estimate profit efficiency scores and accounting ratios were used to measure profitability. The panel corrected standard error regression was used to assess the nexus using a dataset of 32 banks from 2000 to 2015. Findings The paper found that the Ghanaian banking industry exhibits a variable return to scale property, suggesting that average costs change with output size. Profit efficiency score for banks closer to the efficiency frontier is 61%. Credit risk is significant in enhancing profit efficiency and return on equity. Market risk is relevant in improving profit efficiency, return on asset and asset turnover. To drive profitability, bank managers have to be committed to effective liquidity risk, insolvency risk and capital risk management. Operational risk reduces shareholders' returns. The impact of size, age, stock exchange listing, cost efficiency and competition have are all been discussed extensively. Practical implications The findings contribute to the knowledge on the risk-performance nexus and provide information that is valuable to academics, bankers and regulators for policy formulation. The findings are relevant to the newly established Financial Stability Council. Originality/value This paper appears to be among the premier attempts to examine the effect of various risk types identified in the Basel III framework on bank performance in Africa.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d6ee1f2b660c774981773958fb2b712b",
  "timestamp": "2025-05-15T02:49:50.257633"
}