{
  "id": 9209,
  "title": "Low HBV knowledge is associated with low HBV vaccination uptake in general adult population despite incentivization of HBV vaccination",
  "abstract": "Background Hepatitis B virus (HBV) vaccination in Vietnamese adults remains low and unequally distributed. We conducted a study on HBV-na & iuml;ve adults living in Ho Chi Minh City, Viet Nam, to determine barriers associated with HBV vaccination uptake after removing the financial barrier by providing free coupons for HBV vaccination.Methods After being screened for HBsAg, anti-HBs, and anti-HBc, 284 HBV-na & iuml;ve study participants aged 18 and over (i.e., negative for HBsAg, anti-HBs, and anti-HBc total) were provided free 3-dose HBV vaccine coupons. Next, study participants' receipt of 1st, 2nd, and 3rd doses of HBV vaccine was documented at a pre-specified study healthcare facility, where HBV vaccines were distributed at no cost to the participants. Upon study entry, participants answered questionnaires on sociodemographics, knowledge of HBV and HBV vaccination, and related social and behavioral factors. The proportions of three doses of HBV vaccine uptake and their confidence intervals were analyzed. Associations of HBV vaccine initiation with exposures at study entry were evaluated using modified Poisson regression.Results 98.9% (281 of 284) of study participants had complete data and were included in the analysis. The proportion of participants obtaining the 1st, 2nd, and 3rd doses of HBV vaccine was 11.7% (95% Confidence Interval [95% CI] 8.0-15.5%), 10.7% (95%CI 7.1-14.3%), and 8.9% (95%CI 5.6-12.2%), respectively. On the other hand, participants were more likely to initiate the 1st dose if they had adequate knowledge of transmission (adjusted relative risk [aRR] = 2.58, 95% CI 1.12-5.92), adequate knowledge of severity (aRR = 6.75, 95%CI 3.38-13.48), and annual health-checking seeking behavior (aRR = 2.04, 95%CI 1.07-3.87).Conclusion We documented a low HBV vaccination uptake despite incentivization. However, increased vaccine initiation was associated with better HBV knowledge and annual health check-up adherence. When considering expanding HBV vaccination to the general adult population, we should appreciate that HBV knowledge is an independent predictor of vaccine uptake.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d6f9c95175903a67a014c9556c1ab935",
  "timestamp": "2025-05-15T03:26:26.072262"
}