{
  "id": 4037,
  "title": "THE PREDICTION OF EARNINGS MOVEMENT USING MANDATED XBRL DATA - INDUSTRY ANALYSIS",
  "abstract": "The immediate availability and easy accessibility of the XBRL filings will allow researchers and investors, especially small investors, to implement investment strategies based on this information. The objective of this study is to examine whether previous studies, predicting the direction of movement of earnings, are still relevant when using the newly SEC required, XBRL database (standardized financial reporting system). The study analyzes NYSE companies' XBRL quarterly data, from 2011 to 2015, using a two-step Logit regression model. The model is then used to arrive at the probability of the directional movement of earnings between current quarter and subsequent quarter, adjusted for a drift. Additional models are created by dividing the sample into industry membership (based on SIC codes). The results classified the companies as ones that would realize an increase in earnings or a decrease in earnings. The final model indicated a significant ability to predict subsequent earnings changes. The predictions appear to be correct on average about 70.7% of the time (higher than those of previous studies based on COMPUSTAT). The industry based models, although do not increase the accuracy of the model (an average of 68%) do increase the portfolio size. In other words, the model, based on industry, is able to classify more companies with a higher probability. These results suggest that XBRL data can be used as a means for forecasting movements in earnings, and creating a profitable investment strategy.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d70b1af3bdeb2ae5afffa74cafacbdac",
  "timestamp": "2025-05-15T01:23:07.437119"
}