{
  "id": 7706,
  "title": "Hospitalizations for severe complications of pregnancy, 1987-1992",
  "abstract": "Objective: To compute ratios of severe pregnancy complications (the number of hospitalizations for pregnancy complications per 100 deliveries) and to examine factors associated with their prevalence. Methods: Using population-based California hospital discharge data to estimate hospitalization ratios of pregnancy complications during 1987-1992, we defined cases by preselected pregnancy complication codes from the International Classification of Diseases, Ninth Revision, Clinical Modification, excluding induced abortions and delivery-associated complications. All hospital deliveries of liveborn or stillborn infants were included in our denominator. We examined ratios by age, race-ethnicity, payment source, total hospitalization charges, and length of hospital stay. Results: There were 833,264 hospitalizations for pregnancy complications in California (25 complications per 100 deliveries), which included admissions for preterm labor (33%), genitourinary infection (16%), and pregnancy-induced hypertension (15%). Age-specific ratios were highest for women 14 years old and younger (38 per 100 deliveries) and lowest for women 25-29 years old (23 per 100 deliveries). Ratios of complications varied by race-ethnicity; black women had the highest (42 per 100 deliveries), and Asian-Pacific Islander women had the lowest (21 per 100 deliveries). Ratios were unaffected by payment source. In 1987, Medicaid charges were $118 million for 33% of the number of total hospitalizations for complications. In 1992, such Medicaid hospitalizations accounted for $356 million (49%) of the $734 million in total charges and for 183,295 (45%) of the 409,000 total hospital days. Conclusion: Our results showed disparities in ratios of severe complications of pregnancy by age and race-ethnicity as well as a shift of financial burden to Medicaid. These findings suggest that such complications may be reduced by identifying risk factors and targeting high-risk groups. ((C) 1997 by The American College of Obstetricians and Gynecologists.)",
  "year": 1997,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d70c52b7987cfad296a41d7e4def8f10",
  "timestamp": "2025-05-15T03:11:04.641594"
}