{
  "id": 7018,
  "title": "Beyond the First Trimester: Social Determinants of Delayed Prenatal Care at a Community Health Center Using the PRAPARE Tool",
  "abstract": "Social determinants of health have been used to explore associations with pregnancy outcomes and the birth weight of infants; however, research employing individually based social risk measures has not examined associations among underserved populations, including pregnant persons at community health centers. Data were collected from a sample (n = 345) of pregnant persons who sought care at a community health center between January 2019 and December 2020. Social risks of pregnant patients were measured using the PRAPARE tool. First, associations between patients' social risks and trimester in which they initiated care were assessed using ANOVAs, grouping social risk by PRAPARE social determinant domains (persona characteristics, family and home, money and resources, and social and emotional health). ANOVAs were stratified by ethnicity. Next, a multivariate logistic regression examined associations between social measures and seeking care after the first trimester. Patients who sought care in the first trimester reported more financial needs than those who sought care in the second (p = .02) or the third (p = .049). Hispanic patients who sought care in the first trimester reported more monetary needs than those who sought care in the second trimester (p = .048), and non-Hispanic patients who sought care in the first trimester reported greater family and home needs than those who sought care in the second trimester (p = .47). Those who experienced stress were 3.07 times as likely to seek care after the first trimester as those who reported no stress. CHC may reduce social risk among poor and underserved communities by reducing barriers to access to care.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d714d34e6beaee0ce2eab21dc35d8872",
  "timestamp": "2025-05-15T03:04:22.978932"
}