{
  "id": 3937,
  "title": "Risk Factors for Financial Toxicity in Patients With Pancreatic Cancer",
  "abstract": "BackgroundThe increasing costs of cancer treatment impose a tremendous economic burden on patients and their families, adversely impacting their quality of life and patients' outcomes. Financial toxicity (FT), as a concept describing the economic burden on patients, is crucial to comprehend the extent and determinants within specific contexts.ObjectiveTo understand the current status of FT among Chinese pancreatic cancer (PC) patients, identify risk factors for FT, and summarize the characteristics of high-risk groups.MethodsA cross-sectional study involving 296 PC patients was conducted to investigate their general information, financial toxicity, quality of life, positive and negative affects, and social support. Univariate and multiple linear regression analyses were used to examine the correlation between FT and other variables.ResultsThe PC patient's FT score was 54.27 +/- 14.50, with 25.7% being forced to change their work status due to the disease diagnosis and 29.4% exhibiting economically related treatment nonadherence behaviors. Factor analysis showed financial toxicity associated with fewer household savings, more total out-of-pocket (OOP) costs, treatment nonadherence, unemployment, diminished positive affect, and insufficient social support.ConclusionsFT was highly prevalent among PC patients and associated with factors such as household savings and total OOP costs. There was a need to identify and manage patients exhibiting high-risk characteristics and to implement targeted interventions to mitigate their economic burden.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d723c81f79f197fce7d71d926bf06f5a",
  "timestamp": "2025-05-15T02:31:28.424890"
}