{
  "id": 7647,
  "title": "Excess costs of hospital care associated with neonatal candidemia",
  "abstract": "Background: Nosocomial bloodstream infections are associated with increased hospital costs in adult and pediatric patients. Candida is an increasingly important nosocomial pathogen within intensive care nurseries. The purpose of this study was to determine the attributable cost of candidemia in neonates. Methods: This case-control study included all neonates with candidemia receiving care in hospitals in Connecticut and in Baltimore County and the city of Baltimore, MD. We identified 47 cases and 130 control patients. Multivariable linear regression was used to control for state, birth weight and mortality to determine the effect of candidernia on length of stay, cost per day and total hospital costs. Results: Candidemia was associated with a $28,000 increase in total hospital costs in multivariable analysis. This increase in total cost was the result of both an increase in costs per day and length of hospital stay. Other cost-increasing variables included in the analysis were: state of origin (Connecticut), survival and decreasing birth weight. Conclusions: This represents the first study of the adjusted costs of candidemia in neonates. In addition to high mortality, candidernia was associated with increased hospital costs. This cost analysis could be helpful in determining the financial benefits of preventing candidemia in high risk neonates.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7244a28fcd6f82428e85fdef0357f8f",
  "timestamp": "2025-05-15T03:10:33.077377"
}