{
  "id": 575,
  "title": "Performance Appraisal from the Perspective of Organizational Justice: Review and Research Agenda",
  "abstract": "Objective: Explore the literature on Performance Appraisal (PA) from the perspective of Organizational Justice, to collaborate with the construction of knowledge and with the identification of research gaps. Theoretical approach: The Knowledge Development Process-Constructivist instrument was used to select and analyze, in a systematic and reflective way, the Bibliographic Portfolio (BP) representative of the theme. Results: It was found the existence of: a literature focused on consequences for people, involving variables such as satisfaction and commitment; preponderance of studies that address PA at the individual level; and, lack of investigations into perceptions of interpersonal and informational justice. The articles mainly analyzed the antecedents and consequences of PA justice perceptions. Among the gaps there is the need to develop models customized to the context that integrate the perceptions of the four factors of justice and of each unit or organization; and the development of studies involving interpersonal and informational justice and perceptions at the organizational level. Originality/Relevance: The study presents aspects of PA justice perceptions as a relevant factor that influences employee behavior and points out research gaps for the evolution of the theme. Theoretical/methodological contributions: This study contributes scientifically as it compiles recognized articles and proposes a research agenda with topics for future investigation. Social contributions/to management: The findings contribute to managers throughout the life cycle of a PAS, by showing how the perception of justice impacts the behavior of employees in achieving organizational goals.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d743f04395e76bcb4e8106948afa9614",
  "timestamp": "2025-05-15T00:37:38.174203"
}