{
  "id": 2462,
  "title": "The Relationship between Default Risk and Asset Pricing: Empirical Evidence from Pakistan",
  "abstract": "This paper examines the efficacy of the default risk factor in an emerging market context using the Fama-French five-factor model. Our aim is to test whether the Fama-French five-factor model augmented with a default risk factor improves the predictability of returns of portfolios sorted on the firm's characteristics as well as on industry. The default risk factor is constructed by estimating the probability of default using a hybrid version of dynamic panel probit and artificial neural network (ANN) to proxy default risk. This study also provides evidence on the temporal stability of risk premiums obtained using the Fama-MacBeth approach. Using a sample of 3,806 firm-year observations on non-financial listed companies of Pakistan over 2006-2015 we found that the augmented model performed better when tested across size-investment-default sorted portfolios. The investment factor contains some default-related information, but default risk is independently priced and bears a significantly positive risk premium. The risk premiums are also found temporally stable over the full sample and more recent sample period 2010-2015 as evidence by the Fama-MacBeth regressions. The finding suggests that the default risk factor is not a useless factor and due to mispricing, default risk anomaly prevails in the Pakistani equity market.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d74e63f01caa5681864178b17b4012da",
  "timestamp": "2025-05-15T02:15:27.146115"
}