{
  "id": 3988,
  "title": "Predicting 30-day unplanned hospital readmission after revision total knee arthroplasty: machine learning model analysis of a national patient cohort",
  "abstract": "Revision total knee arthroplasty (TKA) is associated with a higher risk of readmission than primary TKA. Identifying individual patients predisposed to readmission can facilitate proactive optimization and increase care efficiency. This study developed machine learning (ML) models to predict unplanned readmission following revision TKA using a national-scale patient dataset. A total of 17,443 revision TKA cases (2013-2020) were acquired from the ACS NSQIP database. Four ML models (artificial neural networks, random forest, histogram-based gradient boosting, and k-nearest neighbor) were developed on relevant patient variables to predict readmission following revision TKA. The length of stay, operation time, body mass index (BMI), and laboratory test results were the strongest predictors of readmission. Histogram-based gradient boosting was the best performer in distinguishing readmission (AUC: 0.95) and estimating the readmission probability for individual patients (calibration slope: 1.13; calibration intercept: -0.00; Brier score: 0.064). All models produced higher net benefit than the default strategies of treating all or no patients, supporting the clinical utility of the models. ML demonstrated excellent performance for the prediction of readmission following revision TKA. Optimization of important predictors highlighted by our model may decrease preventable hospital readmission following surgery, thereby leading to reduced financial burden and improved patient satisfaction.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7853b4fad9cbf245bae7bcde3bc7ed1",
  "timestamp": "2025-05-15T02:31:58.641311"
}