{
  "id": 1833,
  "title": "AI against money laundering networks: the Colombian case",
  "abstract": "Purpose The purpose of this paper is to examine the artificial intelligence (AI) methodologies to fight against money laundering crimes in Colombia. Design/methodology/approach This paper examines Colombian money laundering situations with some methodologies of network science to apply AI tools. Findings This paper identifies the suspicious operations with AI methodologies, which are not common by number, quantity or characteristics within the economic or financial system and normal practices of companies or industries. Research limitations/implications Access to financial institutions' data was the most difficult element for research because affect the implementation of a set of different algorithms and network science methodologies. Practical implications This paper tries to reduce the social and economic implications from money laundering (ML) that result from illegal activities and different crimes against inhabitants, governments, public resources and financial systems. Social implications This paper proposes a software architecture methodology to fight against ML and financial crime networks in Colombia which are common in different countries. These methodologies complement legal structure and regulatory framework. Originality/value The contribution of this paper is how within the flow already regulated by financial institutions to manage the ML risk, AI can be used to minimize and identify this kind of risk. For this reason, the authors propose to use the graph analysis methodology for monitoring and identifying the behavior of different ML patterns with machine learning techniques and network science methodologies. These methodologies complement legal structure and regulatory framework.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d78f0477aa9fe4e9b75089109d7d0193",
  "timestamp": "2025-05-15T02:08:03.936581"
}