{
  "id": 2013,
  "title": "Identifying nonhazardous substances in pharmaceutical manufacturing and setting default health-based exposure limits (HBELs)",
  "abstract": "Contract Development and Manufacturing Organizations (CDMOs) that manufacture large, diverse portfolio of chemical and pharmaceutical substances require pragmatic risk-based decisions with respect to the safe carry-over between different chemical entities, as well as for worker protection. Additionally, CDMOs may not have access to primary study data, or data are generally lacking for a specific substance. While pharmaceuticals require the establishment of health-based exposure limits (HBELs) (e.g., occupational exposure limits [OELs] and permitted daily exposure [PDE] limits), the limits for nonhazardous substances could be set in a protective and pragmatic way by using default values, when internally required. Because there is no aligned definition provided by authorities, nor agreed default values for nonhazardous substances, we provide a decision tree in order to help qualified experts (such as qualified toxicologists) to identify the group of nonhazardous substances and to assign default HBEL values for specific routes of exposure. The nonhazardous substances discussed within this publication are part of the following subgroups: (I) inactive pharmaceutical ingredients, (II) pharmaceutical excipients or cosmetic ingredients, (III) substances Generally Recognized as Safe (GRAS), and (IV) food ingredients, additives, and contact materials. The proposed default limit values are 1 mg/m(3) for the OEL and 50 mg/day for the PDE oral and intravenous (IV) route.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7ac886b6269186d7ed32931b8f9acb5",
  "timestamp": "2025-05-15T01:02:10.206608"
}