{
  "id": 3832,
  "title": "Identifying the systemically important banks of Turkey with the CoVaR method",
  "abstract": "The purpose of this paper is to measure the systemic risk contributions of Turkish banks and to identify the systemically important banks of Turkey during the period from 2005 to 2016. We apply the conditional value-at-risk (CoVaR) method proposed by Adrian and Brunnermeier (2009) using quantile regression. The study includes thirteen major banks of Turkey, including both public and private banks, out of a total of 52 banks. The banks are ranked in terms of their systemic risk contribution to the Turkish financial system based on their asset returns, macroeconomic variables and individual bank variables. The study reveals that Akbank, Garanti, Yapi Kredi and Isbank have the highest systemic risk contribution to the financial system when adding macroeconomic variables to the model. This ranking is changed to Yapi Kredi, Garanti, TEB, Sekerbank and Akbank when taking into account bank-specific variables. One surprising result is that risk in isolation and the spillover risks of public banks are smaller than in large private banks. Furthermore, the marginal systemic risk contributions of public banks are smaller than those of private banks. In conclusion, authorities improve the regulatory framework according to the context of CoVaR in addition to monitor the idiosyncratic risks of banks.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7ac1ab0c03d45b30c8286706d772f3a",
  "timestamp": "2025-05-15T02:30:28.695767"
}