{
  "id": 4902,
  "title": "Business Strategy and Audit Efforts - Focusing on Audit Report Lags: An Empirical Study in Korea",
  "abstract": "This study examines the association between a firm's business strategy and audit report lags. This study employs 5,072 firm-year observations from 2015 to 2019. Our sample comprises all of the firms listed on the Korea Composite Stock Price Index (KOSPI) market and Korea Securities Dealers Automated Quotation (KOSDAQ). We perform OLS regression analysis to test our hypothesis. The OLS regression analysis was conducted through the SAS and STATA programs. We find that business strategy is positively associated with audit report lags. Especially, we find that defender firms are negatively associated with audit report lags. The findings of this study suggest that prospector-like firms would increase their performance uncertainty as well as audit risk. Therefore, prospector-like firms interfere with the efficient audit procedures of auditors. On the other hand, our findings indicate that defender-like firms would decrease their performance uncertainty as well as an audit risk because they focus on simple product lines and cost-efficiency. For this reason, auditors will be able to carry out the audit procedures much more easily. Our results present that a prospector-like business strategy degrades audit effectiveness as it exacerbates a company's financial risk, willingness to accept uncertainty, and the complexity of organizational structure.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7b4a4455cc1f6fc1c4eae933e0329dd",
  "timestamp": "2025-05-15T02:42:04.922782"
}