{
  "id": 1910,
  "title": "Environmental data and scores: Lost in translation",
  "abstract": "This paper investigates methodological issues and limited coverage of providers' environmental scores, which are increasingly employed by investors, financial institutions and policymakers for corporate environmental assessment. The contribution of the paper is twofold. First, regression analysis shows a substantial heterogeneity among the environmental scores of seven providers in the reliance on raw data. However, as some variables are found meaningful across providers, the request to enhance disclosure should focus on such variables. The heterogeneity of the unexplained component of the regression across providers can be arguably referred to as judgemental factors and underlines the providers' different focus on financial risk or environmental impact. Second, we propose a classification system based on corporate disclosure data that aims to enable investors to extend the environmental assessment of companies not rated by providers. This system has been calibrated to implement two common investment strategies, that is, best-in-class and exclusion and allows to build portfolios with both environmental and financial profiles similar to portfolios based on providers' scores. The work aims to contribute to the intersection between the analysis of methodologies of E-scores and their practical use for investment purposes. Rather than asking for a mirage of full comparability of E-scores, the paper substantiates that is of utmost importance to improve the disclosure of corporate data to enhance the environmental assessment as well as the transparency on providers' methodologies to enable investors to select E-scores consistent with their risk-impact preferences. Such transparency will foster the development of sustainable finance.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7b8f57edacd4c93b2009e939fe25d65",
  "timestamp": "2025-05-15T02:08:39.111812"
}