{
  "id": 2457,
  "title": "Financial time series prediction using a dendritic neuron model",
  "abstract": "As a complicated dynamic system, financial time series calls for an appropriate forecasting model. In this study, we propose a neuron model based on dendritic mechanisms and a phase space reconstruction (PSR) to analyze the Shanghai Stock Exchange Composite Index, Deutscher Aktienindex, N225, and DJI Average. The PSR allows us to reconstruct the financial time series, so we can prove that attractors exist for the systems constructed. Thus, the attractors obtained can be observed intuitively, in a three-dimensional search space, thereby allowing us to analyze the characteristics of dynamic systems. In addition, using the reconstructed phase space, we confirmed the chaotic properties and the reciprocal to determine the limit of prediction through the maximum Lyapunov exponent. We also made short-term predictions based on the nonlinear approximating dendritic neuron model, where the experimental results showed that the proposed methodology which hybridizes PSR and the dendritic model performed better than traditional multi-layered perceptron, the Elman neural network, the single multiplicative neuron model and the neuro-fuzzy inference system in terms of prediction accuracy and training time. Hopefully, this hybrid technology is capable to advance the research for financial time series and provide an effective solution to risk management. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7ce5c825746168f16f913b3ea6221b2",
  "timestamp": "2025-05-15T02:15:27.107169"
}