{
  "id": 1389,
  "title": "Constrained optimization algorithms for the computation of investable portfolios analytics: evaluation of economic-capital parameters for performance measurement and improvement",
  "abstract": "Purpose This paper aims to empirically test, from a regulatory portfolio management standpoint, the application of liquidity-adjusted risk techniques in the process of getting optimum and investable economic-capital structures in the Gulf Cooperation Council financial markets, subject to applying various operational and financial optimization restrictions under crisis outlooks. Design/methodology/approach The author implements a robust methodology to assess regulatory economic-capital allocation in a liquidity-adjusted value at risk (LVaR) context, mostly from the standpoint of investable portfolios analytics that have long- and short-sales asset allocation or for those portfolios that contain long-only asset allocation. The optimization route is accomplished by controlling the nonlinear quadratic objective risk function with certain regulatory constraints along with LVaR-GARCH-M (1,1) procedure to forecast conditional risk parameters and expected returns for multiple asset classes. Findings The author's conclusions emphasize that the attained investable economic-capital portfolios lie-off the efficient frontier, yet those long-only portfolios seem to lie near the efficient frontier than portfolios with long- and short-sales assets allocation. In effect, the newly observed market microstructures forms and derived deductions were not apparent in prior research studies (Al Janabi, 2013). Practical implications The attained empirical results are quite interesting for practical portfolio optimization, within the environments of big data analytics, reinforcement machine learning, expert systems and smart financial applications. Furthermore, it is quite promising for multiple-asset portfolio management techniques, performance measurement and improvement analytics, reinforcement machine learning and operations research algorithms in financial institutions operations, above all after the consequences of the 2007-2009 financial crisis. Originality/value While this paper builds on Al Janabi's (2013) optimization algorithms and modeling techniques, it varies in the sense that it covers the outcomes of a multi-asset portfolio optimization method under severe event market scenarios and by allowing for both long-only and combinations of long-/short-sales multiple asset. The achieved empirical results, optimization parameters and efficient and investable economic-capital figures were not apparent in Al Janabi's (2013) paper because the prior evaluation were performed under normal market circumstances and without bearing in mind the impacts of the 2007-2009 global financial crunch.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7e4140020f2a2aae70b596d396b2451",
  "timestamp": "2025-05-15T02:02:22.742373"
}