{
  "id": 7997,
  "title": "High Prevalence and Partner Correlates of Physical and Sexual Violence by Intimate Partners among Street and Off-Street Sex Workers",
  "abstract": "Objectives: Intimate partner violence (IPV) is associated with increased risk of HIV among women globally. There is limited evidence and understanding about IPV and potential HIV risk pathways among sex workers (SWs). This study aims to longitudinally evaluate prevalence and correlates of IPV among street and off-street SWs over two-years follow-up. Methods: Longitudinal data were drawn from an open prospective cohort, AESHA (An Evaluation of Sex Workers Health Access) in Metro Vancouver, Canada (2010-2012). Prevalence of physical and sexual IPV was measured using the WHO standardized IPV scale (version 9.9). Bivariate and multivariable logistic regression using Generalized Estimating Equations (GEE) were used to examine interpersonal and structural correlates of IPV over two years. Results: At baseline, 387 SWs had a male, intimate sexual partner and were eligible for this analysis. One-fifth (n = 83, 21.5%) experienced recent physical/sexual IPV at baseline and 26.2% over two-years follow-up. In multivariable GEE analysis, factors independently correlated with physical/sexual IPV in the last six months include: childhood (<18 years) sexual/physical abuse (adjusted odds ratio [AOR] = 2.05, 95% confidence interval [CI]: 1.14-3.69), inconsistent condom use for vaginal and/or anal sex with intimate partner (AOR = 1.84, 95% CI: 1.07-3.16),, daily prescription opioid use (AOR = 1.72, 95% CI: 1.02-2.89), providing financial support to intimate partner (AOR = 1.65, 95% CI: 1.05-2.59), and sourcing drugs from intimate partner (AOR = 1.62, 95% CI: 1.02-2.26). Discussion: Our results demonstrate that over one-fifth of SWs in Vancouver report physical/sexual IPV in the last six months. The socio-structural correlates of IPV uncovered here highlight potential HIV risk pathways through SWs' intimate, non-commercial partner relationships. The high prevalence of IPV among SWs is a critical public health concern and underscores the need for integrated violence and HIV prevention and intervention strategies tailored to this key population.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7e56b2bd09012f9ecb2b1e309ab294d",
  "timestamp": "2025-05-15T03:14:07.287315"
}