{
  "id": 8938,
  "title": "Associations of hair cortisol levels with violence, poor mental health, and harmful alcohol and other substance use among female sex workers in Nairobi, Kenya",
  "abstract": "Violence, poor mental health, and harmful substance use are commonly experienced by female sex workers (FSWs) in sub-Saharan Africa, all of which are associated with increased HIV susceptibility. We aimed to investigate the associations between violence, poor mental health and harmful alcohol/substance use with hair cortisol concentration (HCC) levels as a potential biological pathway linking the experiences of these stressors and HIV vulnerability. We used the baseline data of the Maisha Fiti study of FSWs in Nairobi, Kenya. Participants reported recent violence, poor mental health, and harmful alcohol/substance use. Hair samples proximal to the scalp were collected to measure cortisol levels determined by ELISA. We analysed the data of 425 HIV-negative respondents who provided at least 2 cm of hair sample. The prevalence of recent violence was 89.3% (physical 54.6%; sexual 49.4%; emotional 77.0% and financial 66.5%), and 29.1% had been arrested due to sex work. 23.7% of participants reported moderate/severe depression, 11.6% moderate/severe anxiety, 13.5% PTSD and 10.8% recent suicidal thoughts and/or attempts. About half of the participants (48.8%) reported recent harmful alcohol and/or other substance use. In multivariable linear regression analyses, both physical and/or sexual violence (adjusted geometric mean ratio (aGMR) = 1.28; 95% CI 1.01-1.62) and harmful alcohol and/or other substance use (aGMR = 1.31; 95% CI 1.03-1.65) were positively and independently associated with increased HCC levels. Findings suggest a role of violence and substance use in elevated HCC levels, which could increase HIV risk due to cortisol-related T cell activation. However, longitudinal and mechanistic studies are needed to confirm this hypothesis.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7e98a5eb43024aee362cf31b8c44692",
  "timestamp": "2025-05-15T03:23:56.093458"
}