{
  "id": 6696,
  "title": "Do PCAOB Inspections Change the Effect of Litigation Risk on Audit Quality?",
  "abstract": "SynopsisThe research problemThis study examines whether the effect of litigation risk on audit quality changes when auditors face high versus low regulatory risk under the Public Company Accounting Oversight Board (PCAOB) inspection regime.MotivationThe establishment of the PCAOB under the Sarbanes-Oxley Act marked a fundamental change in the regulatory environment for the auditors. At the core of the PCAOB's oversight of the audits of public companies are the inspections of individual audit engagements. While prior studies have found a positive effect of the PCAOB inspection program on audit quality, little is known about whether and how the regulatory risk imposed by PCAOB inspections influences the effect of litigation risk on audit quality. To the extent that both regulatory oversight and litigation threat share the common objective of motivating auditors to exert sufficient effort and perform high-quality audits, we are motivated to examine whether and how the stringent regulatory environment under the PCAOB regime affects auditors' perception of, and response to, litigation risk.HypothesisWe posit that the significant and constant regulatory threat imposed by PCAOB inspections may change auditors' perception of litigation, which is more remote and less frequent relative to regulatory inspections, such that litigation risk has a smaller effect on audit quality/effort when auditors face high versus low regulatory risk arising from the PCAOB inspections. However, there also exists opposing arguments that would suggest a nondecreasing effect of litigation risk on audit quality in the presence of high regulatory risk. Thus, we present our hypothesis in the null form: the effects of litigation risk on audit quality are not associated with regulatory risk under the PCAOB inspection regime.Target populationResearchers, audit practitioners, regulatory authorities, policymakers, and firms.Adopted methodologyWe employ multivariate regression analysis featuring the ordinary least squares (OLS) estimation to test our hypothesis. In additional tests, we also use the probit estimation for binary dependent variables.AnalysesUsing a sample of 34,559 client-firm year observations for the period between 2005 and 2019, we estimate a multivariate regression model to examine whether and how the audit deficiencies identified in the PCAOB inspections influence the effect of litigation risk on audit quality exhibited at the client level.FindingsOur main findings show that, while regulatory risk (proxied by PCAOB-identified audit deficiencies) and litigation risk (proxied by lawsuits filed against auditors/firms) each has a positive effect on audit quality, the interaction term of the two is negatively associated with audit quality. This rejects our null hypothesis and indicates that litigation risk has a smaller motivational effect when the auditors are faced with greater regulatory risk. Similar results are obtained using audit fees, financial restatements, and the propensity to report small profits as the alternative measures of audit quality. We further validate those results with alternative measures of regulatory risk and litigation risk. Our empirical evidence corroborates the views of audit practitioners, surveyed in Westermann et al. (2019), that auditors are increasingly concerned about regulatory risk, as opposed to litigation risk, under the PCAOB regime.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7eaa994f659d25ceb7d2c927ecb32db",
  "timestamp": "2025-05-15T03:00:35.481313"
}