{
  "id": 6673,
  "title": "Employees' Baseline Food Choices and the Effect of a Workplace Intervention to Promote Healthy Eating: Secondary Analysis of the ChooseWell 365 Randomized Controlled Trial",
  "abstract": "Background Little is known about whether the effectiveness of workplace wellness programs differs by employees' baseline health behaviors.Objective This study examined the association of baseline cafeteria food choices with the effect of a workplace intervention on cafeteria food choices, dietary quality, and body mass index (BMI).Design This was a secondary analysis of the ChooseWell 365 randomized controlled trial, testing a set of behavioral interventions to improve diet and prevent weight gain.Participants/Setting Participants were 602 employees of a Boston, MA, hospital who had purchased food from cafeterias, which used traffic-light food labeling. Data were collected in 2016e2020. Intervention The 12-month intervention (plus 12 months' follow-up) involved financial incentives and personalized feedback on cafeteria purchases. The control group received monthly letters with generic healthy eating and exercise tips.Main outcome measures Healthy purchasing scores (HPS) were calculated by weighting color categories (red = 0, yellow = 0.5, green = 1) and scaling from 0 to 100 (healthiest); employees were categorized into baseline (pre-intervention) HPS tertiles (T1 = least healthy, T3 = healthiest). Healthy eating index (HEI-2015) scores were calculated from two 24-hour dietary recalls. Intervention effects on 12-and 24-month changes in HPS (primary outcome), HEI-2015 score, and BMI were compared among tertiles. Subgroup analyses examined whether changes by tertile varied with financial rewards received.Statistical analyses Adjusting for baseline characteristics, multivariable linear regression assessed intervention effects across baseline HPS tertiles.Results Compared with T3, T1 employees had lower education; higher obesity, hypertension, and pre-diabetes; and lower HEI-2015 scores. The intervention increased HPS, but no change was observed in HEI-2015 scores or BMI; the intervention effect did not differ among tertiles at 12 or 24 months. Financial incentives were associated with a larger effect on 12-month HPS changes for T1 than for T2/T3 (P-interaction < 0.001).Conclusion Compared with employees with healthier baseline food choices, employees with the least healthy food choices and highest cardiometabolic risk had similar improvements in the nutritional quality of cafeteria purchases as a result of the behavioral intervention, and they appeared to be more responsive to financial incentives.J Acad Nutr Diet. 2023;123(11):1586-1595.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d7fb5284edabfda0a2eb38ea00b3bcb1",
  "timestamp": "2025-05-15T03:00:35.341932"
}