{
  "id": 5219,
  "title": "Evaluating associations between social risks and health care utilization in patients with chronic low back pain",
  "abstract": "Supplemental Digital Content is Available in the Text. Introduction:Care and outcomes for patients with chronic low back pain (cLBP) are influenced by the social risk factors that they experience. Social risk factors such as food insecurity and housing instability have detrimental effects on patient health and wellness, healthcare outcomes, and health disparities.Objectives:This retrospective cross-sectional study examined how social risk factors identified in unstructured and structured electronic health record (EHR) data for 1,295 patients with cLBP were associated with health care utilization. We also studied the impact of social risk factors, controlling for back pain-related disability on health care utilization.Methods:Included patients who received outpatient spine and/or physical therapy services at an urban academic medical center between 2018 and 2020. Five identified social risks were financial insecurity, housing instability, food insecurity, transportation barriers, and social isolation. Outcomes included 4 categories of health care utilization: emergency department (ED) visits/hospitalizations, imaging, outpatient specialty visits related to spine care, and physical therapy (PT) visits. Poisson regression models tested associations between the presence of identified social risks and each outcome measure.Results:Identified social risks in 12.8% of the study population (N = 166/1,295). In multivariate models, social isolation was positively associated with imaging, specialty visits, and PT visits; housing instability was positively associated with ED visits/hospitalizations and imaging; food insecurity was positively associated with ED visits/hospitalizations and specialty visits but negatively associated with PT visits; and financial strain was positively associated with PT visits but negatively associated with ED visits/hospitalization.Conclusion:These associations were seen above and beyond other factors used as markers of socioeconomic marginalization, including neighborhood-level social determinants of health, race/ethnicity, and insurance type. Identifying and intervening on social risk factors that patients with cLBP experience may improve outcomes and be cost-saving.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d810a5c067153a68b6dde99ef0005ae7",
  "timestamp": "2025-05-15T02:45:47.319299"
}