{
  "id": 504,
  "title": "Application of life cycle assessment as a tool for evaluating the sustainability of contaminated sites remediation: A systematic and bibliographic analysis",
  "abstract": "As the discussion surrounding sustainable remediation has advanced, numerous tools have been developed to evaluate the sustainability of remediation technologies, including life cycle assessment (LCA). In the present study, a systematic and bibliometric analysis of scientific articles indexed in the databases of Scopus and the Web of Science in the field of LCA was performed, particularly studies relating to the remediation of contaminated sites from a sustainability perspective. We selected a bibliographic portfolio (BP) of papers related to sustainable remediation using LCA. Then, we performed a bibliometric analysis of the selected BP, presenting theoretical development, highlighting the authors, journals, and countries associated with these publications. Finally, we conducted a thematic synthesis and reviewed the prospects for future research. The BP was composed of 44 papers from 2007 to 2018. In 2018 there was the highest number of publications, corresponding to 27% of the total BP. The results showed that developed countries have generated the largest number of publications, whereas developing countries had lower representation in the BP. However, China stands out as the second country with the highest number of publications. The thematic analysis showed that most articles have aimed to assess the environmental impacts of remediation techniques. However, several publications have performed a broader analysis considering the economic and social pillars of sustainability through using LCA in conjunction with other tools. The study also highlights the main application of LCA in decision-making on the remediation processes in the context of sustainable remediation. The present research study makes several new contributions, providing academics and practitioners with an overview of the implementation of LCA in the field of sustainable remediation of contaminated sites through sorting published data according to scientific indexes and bibliometric, describing the main research approaches, and highlighting prospects for new research. (C) 2019 Elsevier B.V. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d81a937549a9658a37ce59804cc02ea7",
  "timestamp": "2025-05-15T00:37:01.660292"
}