{
  "id": 8985,
  "title": "Pediatric eye injury-related hospitalizations in the United States",
  "abstract": "OBJECTIVE. An estimated 2.4 million eye injuries occur in the United States each year, with nearly 35% of injuries among persons aged 17 years or less. Although previous research has identified some of the characteristics of pediatric eye injuries, many studies focused only on a specific patient population or type of eye injury or relied on self-reported data. In addition, little information has been reported on the total charges associated with treating pediatric eye injuries. Using a large national database, our aim was to examine hospitalizations for the treatment of pediatric eye injuries in the United States, including the demographic, medical care, and financial characteristics associated with major categories of eye injury. METHODS. Cross-sectional data were derived from the 2000 Kids' Inpatient Database of the Healthcare Cost and Utilization Project. Eye injury-related hospitalizations were identified by using International Classification of Disease, Ninth Revision, Clinical Modification codes. Discharges were selected if the eye injury was the principal or secondary diagnosis. Guidelines from the Centers for Disease Control and Prevention were used to group external-cause-of-injury codes into broader categories to allow meaningful comparison with previous studies. The reported charges for the treatment of eye injuries and the expected primary payer were determined. Cases were statistically weighted to produce national estimates of hospitalizations for pediatric eye injuries and to determine the characteristics of these injuries. RESULTS. Data were collected by the Kids' Inpatient Database for 3834 actual eye injury-related hospitalizations. These records represent an estimated 7527 eye injury-related hospitalizations among children aged 20 years or less in the United States during 2000. Inpatient charges for the treatment of these injuries were more than $88 million. The rate of hospitalization for pediatric eye injuries in the United States in 2000 was 8.9 per 100000 persons aged 20 years or less. Young adults aged 18 to 20 years accounted for the highest percentage of hospitalizations (23.7%). Males accounted for 69.7% of hospitalizations. A majority of hospitalizations were for open wounds of the ocular adnexa. Motor vehicle crash was the most common cause of injury, followed by being struck by or against an object and being cut or pierced. CONCLUSIONS. These findings illustrate the considerable morbidity, financial burden, and proximal causes for pediatric eye injury-related hospitalizations. Our data support the need for eye injury prevention efforts that consider the age, gender, and developmental stage of children. Educating parents and children about the potential for eye injuries at home and during hazardous activities is an important public health goal. In addition, promoting the use of appropriate protective eyewear by children during activities with a high risk of ocular trauma will help prevent future eye injuries.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d81c97e3f1b7fdf010d91f26fa2ecc88",
  "timestamp": "2025-05-15T03:24:26.341318"
}