{
  "id": 3783,
  "title": "Cost drivers of operating charges and variation over time: An analysis based on semiparametric SUR models",
  "abstract": "Although building operating charges have turned out to be a major determinant of profitability for real estate investments, there is a noticeable lack of reports or studies that analyze these costs with state-of-the-art statistical techniques. Specifically, past studies usually assume linear relationships between costs and building attributes, they do not control for cluster-specific or longitudinal effects and do not account for the simultaneous structure of cost categories. Therefore, in this study we provide a novel approach to real estate cost benchmarking: we analyze the effects of building attributes on electricity, heating and maintenance costs for office buildings in Germany in a multivariate structured additive regression (STAR) model simultaneously, modeling potentially nonlinear effects as P(enalized)-splines and controlling for cluster-specific and individual heterogeneity in a three-way random effects structure. This way, we gain insights into how building attributes influence costs, and how cost levels vary across cities, companies and buildings. We furthermore construct quality-adjusted time indexes for the two major German submarkets. The results obtained can be used to derive portfolio allocation strategies and for planning, constructing, operating and redeveloping real estate. (C) 2010 Elsevier B.V. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d82e0ab8aac58edb01752ee43df51d23",
  "timestamp": "2025-05-15T01:20:36.126824"
}