{
  "id": 6794,
  "title": "Choosing Method for Qualitative and Quantitative Risk Analysis for Energy Enterprises",
  "abstract": "The reform of the energy sector in the Republic of Belarus, which in the last few years has moved to the stage of active implementation, will bring significant changes in the management of energy enterprises. The introduction of risk management for energy enterprises will become a necessary stage, which is justified by the transition of the energy sector to market relations. In this regard, it is necessary to consider the main issues of risk assessment for energy enterprises. The paper proposes a method for qualitative and quantitative analysis of all the risks that an energy enterprise may face in the process of energy generation. The approaches of various authors to the algorithm of qualitative risk analysis have been considered in the paper. This has made it possible to clarify the main tasks that need to be solved when conducting a qualitative risk analysis. The paper also presents an analysis of methods for quantitative risk analysis. The most commonly used methods include scenario analysis and mathematical statistics, analogy and analytical methods, methods for assessing losses, expert assessments and the theory of statistical games. Each of these methods has its own advantages and disadvantages. The performed analysis of quantitative risks has permitted to substantiate the choice of methods applicable to the energy sector, taking into account the specificity of activity type. The paper has studied various scales for estimating the probability and possible losses from risks. A comparative analysis of these scales is presented and the choice of a scale for energy enterprises is justified in the paper. Attention has been paid to the problem of probability classification pertaining to occurrence of risk events. The methodology for determining the value of possible losses when performing a risk event has been considered in detail. Potential losses are classified into the following groups: interruptions in the technological process, consequences for people, environmental consequences. Possible financial losses, as well as losses from the position of the law and reputation, have been considered separately. A critical review of risk management methods has been performed in the paper. The paper has identified the most promising methods of risk management for energy enterprises",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d82efccc399eace06a5e5eaaeb1396ac",
  "timestamp": "2025-05-15T03:01:31.460726"
}