{
  "id": 1551,
  "title": "LATVIAN TRADE SECTOR EXTERNAL AND INTERNAL RISKS ASSESSMENT",
  "abstract": "Target of the work is to study the Latvian trade sector external and internal risks, perform risk identification, classification and assessment. In the work are used scientific research methods - analysis and synthesis methods, economic analysis method of enterprises, the special coefficient method and the risk ranking method. The authors had studied the Latvian trade sector in the period from 2004 to 2010. In Latvian trade sector from 2004 to 2006 was observed increment of turnover, but from 2007 was observed decline of turnover. In Latvian trade sector is monopolistic competition. Many enterprises offer a market differentiated trade services. Small and medium companies are merging into trade cooperation and chain stores. The authors had studied average financial indexes of the Latvian trade sector enterprises. Average financial risk coefficient of Latvian trade sector enterprises had increased during the period from 2006 to 2009. The authors have created classification of Latvian trade sector economic and financial risks and classification of the trade technological process risks. The authors have created the algorithms of classification and assessment of the trade sector enterprises' risks. The economic risks are the risk of the country's economic slowdown, the risk of increment of taxes, the risk of reduction in consumer's solvency, the risk of demand's instability and the risk of insufficiency of credit resources. The financial risks are the risk of unpaid credit, the risk of financial instability, the risk of insufficiency of own capital, the risk of liquidity and the risk of debtors. The trade technological process risks are the risk of organization of selling goods, the risk of accounting, the risk of ordering goods, the risk of acceptance of goods and the risk of transportation of goods. In order to develop their business strategies, enterprises need to identify, classify and assess the Latvian trade sector risks. Enterprises can use the authors created algorithms of classification and assessment of the risks to produce their own risk management systems.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d83df1f7af06b77dbd48437d131cd189",
  "timestamp": "2025-05-15T02:04:20.128257"
}