{
  "id": 2838,
  "title": "Archimedes tube crystallizer: Design and characterization for small-scale continuous crystallization",
  "abstract": "Various continuous crystallizer concepts have been developed for the small-scale produc-tion (V <= 100 mL min(-1)) of APIs and fine chemicals. The existing concepts differ in terms of achievable residence times and residence time distribution (RTD) width and can be clas-sified qualitatively in a portfolio on the basis of these characteristics. The classification demonstrates, that it is still challenging to achieve long, flexible residence times in com-bination with narrow RTD width leading to narrow particle size distributions. Thus, an air-segmented coiled tube crystallizer was developed based on the Archimedes screw prin-ciple: The Archimedes tube crystallizer (ATC). In this device, coiled tubing is employed to convey individual fluid batches by rotation. Thereby, the air-segmented flow is generated by a specifically designed inlet tank mounted on the rotational axis. As a first step towards the implementation of the ATC concept in industry, characterization experiments were focused in this work. In a Design of Experiment, liquid phase RTD with tracer sodium chloride/water and solid phase RTD with material system L-alanine/water were investigated. The experi-mental results proved narrow RTD close to ideal plug flow for both liquid and solid phase over the complete operating window. Hence, the ATC represents a reasonable expansion of the continuous crystallizer portfolio. (c) 2021 Institution of Chemical Engineers. Published by Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8453cd22ae9b41961f67c033bf0a8cb",
  "timestamp": "2025-05-15T01:10:49.632938"
}