{
  "id": 6863,
  "title": "Transparency and corruption risk in pharmaceutical procurement practices at public health facilities in Northeast Ethiopia: a multi-facility study",
  "abstract": "BackgroundFraud in pharmaceutical tenders is a severe form of corruption that poses a significant threat to public health, patients, and the community. Due to the substantial financial volume in the pharmaceutical sector, vulnerable points in decision-making for market entry and purchase are at risk. As a result, the objective of this study was to measure the level of transparency and risk of corruption in pharmaceuticals' procurement practices in South Wollo, North-East Ethiopia.MethodologyFrom October 1 to December 15, 2023, a multi-facility, cross-sectional study was conducted. The participants were pharmaceutical procurement committee (PPC) members. The World Health Organization's (WHO's) standardised interviewer-administered questionnaire was used to collect the data. The collected data was entered, cleaned, processed, and analyzed using Statistical Package for Social Sciences (SPSS) version 27. Both descriptive and inferential statistics (univariate and linear regression analyses) were computed. The relationship between the independent (health facility level) and dependent (level of transparency) variables was determined using beta with a p-value of less than 0.05 and a 95% CI.ResultsOne hundred eighty-seven respondents, from 47 health centres (low, medium, and high volume) and 14 hospitals (primary, secondary, and tertiary), participated. The aggregate result showed that pharmaceutical procurement practice was very vulnerable to corruption, with a transparency level of only 33.0% (3.3 out of 10). The univariate analysis demonstrated a significant disparity in the mean transparency scores between health centres and hospitals. The linear regression also showed that for every one standard deviation increase in the facility level, there was an associated 0.39 increase in the transparency level of pharmaceutical procurement (beta = 0.39, 95% CI: 0.02-0.04).ConclusionThe pharmaceutical procurement practice at the health facilities was generally found to be very vulnerable to corruption, which slightly increased with a decrease in facility levels and vice versa.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d86e84a34714473266dd77add2ef61fa",
  "timestamp": "2025-05-15T03:02:41.123127"
}