{
  "id": 4342,
  "title": "Dynamic effects of geopolitical risks and infectious diseases on real estate markets",
  "abstract": "PurposeGeopolitical risks (GPR) and increase in equity market volatility due to health pandemics have great implications on assets prices around the world. Many empirical studies have focused on the effects of these risks on different financial assets. The purpose of this paper is to contribute to this related literature by examining the dynamic effects of GPRs and infectious diseases-induced equity market volatility on regional and global house price indexes. Design/methodology/approachThis paper explores the asymmetric effects of infectious diseases and GPRs on house prices across different market conditions using the quantile regression approach. This technique enables us to examine the nonlinear asymmetric effects of GPRs and infectious diseases on both global and regional house price indexes using daily data from January 1, 2011, to June 3, 2022. It focuses on both the effects of a composite measure of GPR as well as the disaggregated effects of threats and acts (war) on the real estate markets under different market conditions. FindingsThe main findings of this study demonstrates that the effects of geopolitical and infectious diseases-related risks vary differently across regional real estate markets and the nature of the GPR. In particular, the effects of geopolitical threats are stronger than those of geopolitical acts, especially for the European, Asia-Pacific and North American regions during bullish market periods. Except for the effects of geopolitical threats during real estate market downturns, the African real estate market appears to be insulated from the effects of GPRs across all market conditions. Also, the authors show that infectious diseases increase losses in real estate investments when the market condition is bearish for all markets and could extend toward the normal market period for the North American, Asia-Pacific and European markets. However, across all the market conditions, the effects of the composite index of GPRs are not significant for the Asia-Pacific and European regional markets. Results are mixed for the remaining markets, especially for the global market. Whereas during bearish market periods, the effect is positive, it becomes negative when the market condition become normal and insignificant when it becomes bullish. For the North American and African regional markets, the effect is positive under the bearish market state. Originality/valueIncrease in equity market volatility due to infectious diseases as well as conflicts and tensions among major powers, including potential risks of financial instability, all lead to significant increase in shocks to financial markets. To the best of the authors' knowledge, this is the first study to analyze the asymmetric and comparative effects of GPRs and infectious diseases-related equity market volatility on real estate investments across different regions and market conditions. Because of the complexity of these risks and policy shifts, and the characteristics and heterogeneity of different regional financial markets, the impacts of shock from these risks are intuitively diverse, with practical implications for portfolio management.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d88105c11b4bc5a19da2bac47cb9ffcc",
  "timestamp": "2025-05-15T01:26:26.176144"
}