{
  "id": 8624,
  "title": "Does socio- economic status predict grip strength in older Europeans? Results from the SHARE study in non- institutionalised men and women aged 50+",
  "abstract": "Background Reduced hand-grip strength predicts disability, morbidity and mortality, but whether it is shaped by socio-economic experiences is yet unknown. The authors examined the association of education, occupation, income and wealth with grip strength in older Europeans. Methods Data came from the Survey of Health, Ageing and Retirement in Europe comprising 27 351 participants ages 50+ in 11 countries. Grip strength was objectively measured using a handheld dynamometer. Estimates were obtained based on multivariate linear regression controlling for a wide set of confounders, demographics, health and disability measures, and behavioural risk factors. Results In the total sample, education, occupational class, income and wealth predicted grip strength among men, whereas only education and wealth predicted grip strength among women. While education and income effects were inconsistent in most countries, wealth consistently predicted grip strength in each country. A one-point increase in the log of wealth was associated with 0.38 kg (95% CI 0.31 to 0.45) higher grip strength in men and 0.18 kg (95% CI 0.15 to 0.21) higher grip strength in women. While education, income and occupation effects disappeared after adjustment for health measures, log of wealth effects remained significant in both men (0.22, 95% CI 0.15 to 0.29) and women (0.08, 95% CI 0.05 to 0.11). Wealth effects were particularly evident in the two lowest quintiles. Conclusion Old-age socio-economic and financial circumstances as measured by wealth are associated with grip strength, particularly among the least wealthy, while circumstances defined earlier in life as measured by education, income and occupation do not consistently predict grip strength.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d88e398fd0b5e156c6aac865667e77f9",
  "timestamp": "2025-05-15T03:20:55.852318"
}