{
  "id": 7019,
  "title": "Oregon PRAMS 2012-2018: Revealing racial inequity in postpartum depression",
  "abstract": "Researchers have suggested that some women are undiagnosed and untreated for postpartum depression (PPD). However, there are mixed findings of the factors most likely to predict those most at risk. Recognizing historical racial and ethnic disparities existing in health outcomes, we sought to determine the extent of PPD inequity in Oregon. Using data from the Oregon pregnancy risk assessment monitoring system 2012-2018 and univariate weighted logistic regression models, we explored the relationship between PPD, maternal characteristics, and social variables. These variables included race/ethnicity, social support, life stressors, financial security, and perceived healthcare discrimination. A further phased analysis examined whether race/ethnicity remained a predictor of PPD when combined with other significant variables. Over 8000 respondents were included in the full phased analysis. Almost 17% of women reported they did not discuss depression with a provider during pregnancy, including over 12% who reported PPD symptoms. Black, Asian/Pacific Islander (API), American-Indian, and mixed race mothers had increased odds of PPD compared to White women (odds ratio ranged from 1.55 to 1.87). Less than baccalaureate education, lack of social support, and perceived healthcare discrimination also increased the odds of PPD. The phased analysis showed that significant differences in odds of PPD symptoms remained between Black, APIs, and American-Indian mothers compared to White mothers. Our analysis suggests that race is an important predictor of PPD. The knowledge of who is most at risk, and the provision of adequate assessment and screening, is of fundamental importance in today's society.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d89181ee2a67c2af793bee066c46315e",
  "timestamp": "2025-05-15T03:04:22.980435"
}