{
  "id": 6804,
  "title": "Evaluation of quality of life and its influencing factors after transplantation of leukemia patients based on SF-36 score: a cohort study",
  "abstract": "Purpose The aim of this study is to clarify the short-term quality of life (QoL) of acute leukemia (AL) patients early after stem cell transplantation (SCT) and related predictors of QoL recovery. Methods We investigated adult AL patients who underwent SCT at the Institute of Hematology and Blood Diseases Hospital after transplantation. Physical/functional and emotional/mental recovery were evaluated using the Short Form 36 (SF-36) questionnaire to identify its trajectory as well as related predictors for the physical component summary (PCS) and mental component summary (MCS). The score was also used to establish a QoL prediction model. Results A total of 326 AL patients responded to our QoL survey. The results revealed the profile of patient follow-up from 2013 to 2015. Along follow-up after transplantation, there was a significant increase in PCS (p = 0.139) and MCS (p = 0.122). On multivariate regression analysis, apart from follow-up, marriage, financial situation, employment situation, and history of chronic graft-versus-host disease (cGVHD) had clinical significance for both PCS and MCS. A prediction model for patient risk hierarchy estimation was further established. The logistic results revealed that the significant characteristics of patients with high PCS and high MCS were unmarried, without financial burden, reliable on drugs, and with history of acute graft-versus-host disease (aGVHD). Conclusions This well-established study enabled evaluation of the QoL of AL patients post-HSCT in China. The established prediction model could provide more indications and insights into improvement in quality of life for better medical interventions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8921d7eca4487e981dd2de6a0e5e81c",
  "timestamp": "2025-05-15T03:01:31.479256"
}