{
  "id": 5917,
  "title": "Delivery System Integration and Health Care Spending and Quality for Medicare Beneficiaries",
  "abstract": "IMPORTANCE The Medicare accountable care organization (ACO) programs rely on delivery system integration and health care provider risk sharing to lower spending while improving quality of care. OBJECTIVE To compare spending and quality between larger and smaller provider groups and examine how size-related differences vary by 2 factors considered central to ACO performance: group primary care orientation and financial risk sharing by health care providers. EVIDENCE REVIEW Using 2009 Medicare claims and linked American Medical Association Group Practice data, we assigned 4.29 million beneficiaries to health care provider groups based on primary care use. We categorized group size according to eligibility thresholds for the Shared Savings (>= 5000 assigned beneficiaries) and Pioneer (>= 15 000) ACO programs and distinguished hospital-based from independent groups. We assessed the primary care orientation of larger groups' specialty mix and used health maintenance organization market penetration and data from the Community Tracking Study to measure the extent of financial risk accepted by different types of provider groups in different areas for managed care patients. We estimated linear regression models comparing spending and quality between larger and smaller health care provider groups, allowing size-related differences to vary by measures of group primary care orientation and risk sharing. Spending and quality measures included total medical spending, spending by type of service, 5 process measures of quality, and 30-day readmissions, all adjusted for sociodemographic and clinical characteristics. FINDINGS Compared with smaller groups, larger hospital-based groups had higher total per-beneficiary spending in 2009 (mean difference, +$849), higher 30-day readmission rates (+1.3 percentage points), and similar performance on 4 of 5 process measures of quality. In contrast, larger independent physician groups performed better than smaller groups on all process measures and exhibited significantly lower per-beneficiary spending in counties where risk sharing by these groups was more common (-$426). Among all groups sufficiently large to participate in ACO programs, a strong primary care orientation was associated with lower spending, fewer readmissions, and better quality of diabetes care. CONCLUSIONS AND RELEVANCE Spending was lower and quality of care better for Medicare beneficiaries served by larger independent physician groups with strong primary care orientations in environments where health care providers accepted greater risk.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8931e800834635d6e02938976ab419a",
  "timestamp": "2025-05-15T02:53:02.984234"
}