{
  "id": 1849,
  "title": "How are network centrality metrics related to interest rates in the Mexican secured and unsecured interbank markets?☆",
  "abstract": "In financial stability, it is essential to know the determinants of interest rates in interbank markets because they are important vehicles for liquidity allocation among banks and are relevant for monetary policy transmission. Recent research indicates that banks with excess liquidity exercise their market power by rationing liquidity during periods of financial stress. This confirms the value of knowing the banks con-nections and identifying liquidity spreaders in such markets to manage contagion risk, liquidity hoarding and to preserve financial stability. In addition to well studied bank features such as size, liquidity and credit risk, we study which network metrics relate to interest rates during different periods. Using transaction level data on unsecured and secured lending, we apply an approach that employs network theory, econometric models and machine learning to analyze the structural properties of the secured and un-secured interbank markets in Mexico. Our findings support the too-interconnected-to-fail hypothesis. In the secured interbank market, PageRank shows a relationship with interest rates, while metrics associated with the notion of influence and systemic risk (Katz and DebtRank) are relevant in the unsecured interbank market. In general, a bank with high centrality lends at higher rates and gets funding at lower rates. (c) 2021 The Author(s). Published by Elsevier B.V. CC_BY_NC_ND_4.0",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d89532d2eef225a46d93e0991a85b505",
  "timestamp": "2025-05-15T02:08:03.989630"
}