{
  "id": 6510,
  "title": "The ability of the wide range CRP assay to classify individuals with low grade inflammation into cardiovascular risk groups",
  "abstract": "Background: High sensitivity C-reactive protein (hsCRP) has become a routine assessment tool to discriminate between patients at low, intermediate or high risk for cardiovascular events using the threshold values of 1 and 3 mg/L, respectively. Over the past years, several studies have proposed the wide range C-reactive protein (wrCRP) as an alternative to the hsCRP in various clinical scenarios. However, the potential use of wrCRP in assessing the cardiovascular risk has not yet been evaluated. Methods: Both wrCRP and hsCRP were evaluated in 15,780 apparently healthy individuals who underwent a routine annual checkup in the Tel Aviv Sourasky Medical Center. Individuals with CRP levels > 5 mg/L were excluded. Agreement between the two methods was observed using the Bland-Altman method and the concordance correlation coefficient. Deming regression was used to build a calibration equation. Reclassification of individuals' risk level was observed and Cohen's kappa was used to evaluate risk agreement. Results: A high correlation (r = 0.98) along with a significant difference (p < 0.001) between hsCRP and wrCRP raised the need for calibration. A simple calibration equation (Adjusted wrCRP = 0.3136 + 0.8803 x wrCRP) led to high agreement which enabled 8.4% reclassification of the risk group. A change in the intermediate risk threshold value from 1 to 0.9 mg/L led to an almost perfect agreement (kappa = 0.87, p < 0.001) and a low reclassification rate (7.6%), with under 0.05% of the population undergoing a major reclassification (from high to low risk or vice versa). Conclusions: In the era of limited financial resources, wrCRP assay may be used as a reasonable routine assay to evaluate the cardiovascular risk in patients undergoing a routine annual checkup.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8a073dd83abecdf0aadd2a72d262513",
  "timestamp": "2025-05-15T02:58:34.337817"
}