{
  "id": 7474,
  "title": "Characteristics of Veteran and Civilian Suicide Decedents: A Sex-Stratified Analysis",
  "abstract": "Introduction: Few studies have examined characteristics distinguishing Veteran and civilian suicide decedents. An understanding of unique risk factors for Veteran suicide is critical to develop effective preventive interventions. This is particularly imperative for female Veterans, who have near double the suicide mortality rate of same-aged female civilians. The objectives of this study were to examine whether Veteran and civilian suicide decedents differed on risk factors and suicide-event characteristics, and to determine whether predictors changed based on sex. Methods: Data from 116,515 suicides collected by the National Violent Death Reporting System in 27 states between 2003 and 2015 were analyzed in 2018 in sex-stratified analyses. Logistic regression models examined population differences in risk factors and suicide-event characteristics. Results: Relative to male civilians, male Veterans were more likely to have a contributing physical health problem (AOR=1.10, 95% CI=1.06, 1.14) and to use a firearm for their suicide (AOR=1.41, 95% CI=1.36, 1.47); they were less likely to have substance use problems (AOR=0.70, 95% CI=0.66, 0.75), depressed mood (AOR=0.93, 95% CI=0.90, 0.97), or financial problems (AOR=0.91, 95% CI=0.86, 0.97). Female Veterans were more likely to use a firearm for their suicide (AOR=1.39, 95% CI=1.19, 1.63) relative to female civilians. Conclusions: Firearm use as a suicide method was a key distinguishing feature of Veteran suicide. Means restriction and firearm safety are pertinent to preventing Veteran suicide. Given low utilization of mental health care and frequent presence of physical health problems in this population, safe storage messages may have a greater preventive impact if delivered in primary care or other nonpsychiatric settings. (C) 2018 American Journal of Preventive Medicine. Published by Elsevier Inc. All rights reserved.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8a2c4aaa872c095ad6a5f7b927a934f",
  "timestamp": "2025-05-15T03:09:07.242618"
}