{
  "id": 8690,
  "title": "Social adversity in pregnancy and trajectories of women's depressive symptoms: A longitudinal study",
  "abstract": "Background: Sound evidence has linked the experience of adversity with depression. Less is known about this association over time. Aim: The aim of this study is to determine whether or not social adversity experienced by pregnant women is associated with their patterns of depressive symptoms over their reproductive life course. Methods: Data were obtained from a cohort of women collected at their first obstetrical clinic visit of an index pregnancy (time-point 1) and at a further six time-points to 27 years following the birth. Latent Class Growth Modelling was used to estimate trajectories of women's depressive symptoms over this time period. Logistic regression modelling determined the prospective association between measures of adversity in pregnancy and 27-year postpartum depression trajectories, controlling for potential confounders. Findings: Experiencing financial problems, housing problems, serious disagreements with partners and with others, and experiencing serious health problems in pregnancy were associated with membership of high and middle depression trajectories over the 27 years. Having someone close die or have a serious illness was associated with the high depression trajectory only. Younger maternal age and low family-income at first clinic visit were also associated with an increased risk of women's membership of both high and middle depression trajectories. Conclusions: Experiencing adversity during pregnancy predicts subsequent patterns of maternal depression over an extended period of women's reproductive life course. It is not clear whether women's experiences of adversity during pregnancy were causally associated with subsequent depression or whether there are other explanations of the observed association. (c) 2017 Australian College of Midwives. Published by Elsevier Ltd. All rights reserved.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8a66628c333ed1e34e174ce17c72fcb",
  "timestamp": "2025-05-15T03:21:24.686009"
}