{
  "id": 9060,
  "title": "A National Profile of Family and Unpaid Caregivers Who Assist Older Adults With Health Care Activities",
  "abstract": "IMPORTANCE Family and unpaid caregivers commonly help older adults who are at high risk for poorly coordinated care. OBJECTIVE To examine how caregivers' involvement in older adults' health care activities relates to caregiving responsibilities, supportive services use, and caregiving-related effects. DESIGN, SETTING, AND PARTICIPANTS A total of 1739 family and unpaid caregivers of 1171 community-dwelling older adults with disabilities who participated in the 2011 National Health and Aging Trends Study (NHATS) and National Study of Caregiving (NSOC). MAIN OUTCOMES AND MEASURES Caregiving-related effects, including emotional, physical, and financial difficulty; participation restrictions in valued activities; and work productivity loss. EXPOSURES Caregivers assisting older adults who provide substantial, some, or no help with health care, defined by coordinating care and managing medications (help with both, either, or neither activity, respectively). RESULTS Based on NHATS and NSOC responses from 1739 family and unpaid caregivers of 1171 older adults with disabilities, weighted estimates were produced that accounted for the sampling designs of each survey. From these weighted estimates, 14.7 million caregivers assisting 7.7 million older adults, 6.5 million (44.1%) provided substantial help, 4.4 million (29.8%) provided some help, and 3.8 million (26.1%) provided no help with health care. Almost half (45.5%) of the caregivers providing substantial help with health care assisted an older adult with dementia. Caregivers providing substantial help with health care provided more hours of assistance per week than caregivers providing some or no help (28.1 vs 15.1 and 8.3 hours, P <.001 for both). The use of supportive services was low but was greater among caregivers providing substantial vs some or no help (26.7% vs 15.5% and 7.6%, P <.001 for both). In multivariable regression models adjusting for older adults' function and caregivers' sociodemographic and health characteristics, caregivers providing substantial help with health care were significantly more likely to experience emotional difficulty (adjusted odds ratio [aOR], 1.79; 95% CI, 1.20-2.66), physical difficulty (aOR, 2.03; 95% CI, 1.39-2.97), and financial difficulty (aOR, 2.21; 95% CI, 1.52-3.22) than caregivers providing no help. Compared with caregivers providing no help with health care activities, caregivers providing substantial help with health care activities were more than 5 times as likely to experience participation restrictions in valued activities (aOR, 5.32; 95% CI, 3.31-8.59) and more than 3 times as likely to experience work productivity loss (aOR, 3.14; 95% CI, 1.40-7.02). CONCLUSIONS AND RELEVANCE Family caregivers providing substantial assistance with health care experience significant emotional difficulty and role-related effects, yet only one-quarter use supportive services.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8a6d31c4c9e94e7c723f9800b682a4a",
  "timestamp": "2025-05-15T03:24:55.046128"
}