{
  "id": 2260,
  "title": "Acceptability of linking individual credit, financial, and public records data to healthcare records for suicide risk machine learning models",
  "abstract": "Objectives Individual-level information about negative life events (NLE) such as bankruptcy, foreclosure, divorce, and criminal arrest might improve the accuracy of machine learning models for suicide risk prediction. Individual-level NLE data is routinely collected by vendors such as Equifax. However, little is known about the acceptability of linking this NLE data to healthcare data. Our objective was to assess preferences for linking external NLE data to healthcare records for suicide prevention.Materials and Methods We conducted a discrete choice experiment (DCE) among Kaiser Permanente Washington (KPWA) members. Patient partners assisted in the design and pretesting of the DCE survey. The DCE included 12 choice tasks involving 4 data linking program attributes and 3 levels within each attribute. We estimated latent class conditional logit models to derive preference weights.Results There were 743 participants. Willingness to link data varied by type of information to be linked, demographic characteristics, and experience with NLE. Overall, 65.1% of people were willing to link data and 34.9% were more private. Trust in KPWA to safeguard data was the strongest predictor of willingness to link data.Discussion Most respondents supported linking NLE data for suicide prevention. Contrary to expectations, People of Color and people who reported experience with NLEs were more likely to be willing to link their data.Conclusions A majority of participants were willing to have their credit and public records data linked to healthcare records provided that conditions are in place to protect privacy and autonomy. Information about life events such as bankruptcy, foreclosure, and divorce might improve our ability to predict who is at risk of making a suicide attempt. Such information is routinely collected by credit bureaus and could be linked to healthcare records. But, little is known about whether people find this data linkage acceptable. This study asked people to choose which data management strategies they prefer. Of the 7720 people asked to complete the survey, 743 people responded. Preferences varied by demographic characteristics such as age, race, and experience with negative life events. Overall, about 65% of people reported that they would be willing to have their data linked provided certain safeguards were in place. The most important factor in a person being willing to have their data linked was how much they trust Kaiser Permanente to protect their information.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8b42b1ef9f7360e80aa5caca0e05290",
  "timestamp": "2025-05-15T02:12:51.105336"
}