{
  "id": 9341,
  "title": "` An analysis from the Quality Outcomes Database, Part 2. Predictive model for return to work after elective surgery for lumbar degenerative disease",
  "abstract": "OBJECTIVE Current costs associated with spine care are unsustainable. Productivity loss and time away from work for patients who were once gainfully employed contributes greatly to the financial burden experienced by individuals and, more broadly, society. Therefore, it is vital to identify the factors associated with return to work (RTW) after lumbar spine surgery. In this analysis, the authors used data from a national prospective outcomes registry to create a predictive model of patients' ability to RTW after undergoing lumbar spine surgery for degenerative spine disease. METHODS Data from 4694 patients who underwent elective spine surgery for degenerative lumbar disease, who had been employed preoperatively, and who had completed a 3-month follow-up evaluation, were entered into a prospective, multicenter registry. Patient-reported outcomes Oswestry Disability Index (ODI), numeric rating scale (NRS) for back pain (BP) and leg pain (LP), and EQ-5D scores were recorded at baseline and at 3 months postoperatively. The time to RTW was defined as the period between operation and date of returning to work. A multivariable Cox proportional hazards regression model, including an array of preoperative factors, was fitted for RTW. The model performance was measured using the concordance index (c-index). RESULTS Eighty-two percent of patients (n = 3855) returned to work within 3 months postoperatively. The risk-adjusted predictors of a lower likelihood of RTW were being preoperatively employed but not working at the time of presentation, manual labor as an occupation, worker's compensation, liability insurance for disability, higher preoperative ODI score, higher preoperative NRS-BP score, and demographic factors such as female sex, African American race, history of diabetes, and higher American Society of Anesthesiologists score. The likelihood of a RTW within 3 months was higher in patients with higher education level than in those with less than high school level education. The c-index of the model's performance was 0.71. CONCLUSIONS This study presents a novel predictive model for the probability of returning to work after lumbar spine surgery. Spine care providers can use this model to educate patients and encourage them in shared decision-making regarding the RTW outcome. This evidence-based decision support will result in better communication between patients and clinicians and improve postoperative recovery expectations, which will ultimately increase the likelihood of a positive RTW trajectory.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8bc70837ce5de498e17a39e70246d42",
  "timestamp": "2025-05-15T03:27:53.372004"
}