{
  "id": 8010,
  "title": "Development and validation of the head and neck cancer psychosocial distress scale (HNCPDS) to identify patients at high risk for psychological problems : a multicenter study",
  "abstract": "To develop the Head and Neck Cancer Psychosocial Distress Scale (HNCPDS) with the aim of identifying high-risk individuals for psychosocial distress among patients, and to assess its reliability, validity and applicability. Using the classical test theory, a total of 435 head and neck cancer patients from six tertiary hospitals in China were recruited for developing the HNCPDS. Delphi expert consultation and item analysis were used to improve the content validity of the preliminary HNCPDS. Factor analysis (FA) and Structural equation modeling (SEM) were used to test the structural validity of HNCPDS. Cronbach's alpha coefficient, Spearman-Brown coefficient and Intra-class correlation coefficient (ICC) were used to test the internal consistency and retest reliability of HNCPDS. Multiple stepped-linear regression was used to analyze the risk factors of psychological disorder, and Pearson correlation coefficient was used to analyze the correlation between psychosocial distress and quality of life (QOL). The HNCPDS consisted of 14 items, which were divided into 3 subscales: 3 items for cancer discrimination, 5 items for anxiety and depression, and 6 items for social phobia. The HNCPDS had good validity [KMO coefficient was 0.947, Bartlett's test was 5027.496 (P < 0.001), Cumulative variance contribution rate was 75.416%, and all factor loadings were greater than 0.55], reliability (Cronbach's alpha coefficient was 0.954, Spearman-Brown coefficient was 0.955, test-retest reliability was 0.845) and acceptability [average completion time (14.31 +/- 2.354 min) and effective completion rate of 90.63%]. Financial burden, sex, age and personality were found to be independent risk factors for HNCPDS (P < 0.05), and patients with higher HNCPDS scores reported a lower QOL (P < 0.01). The HNCPDS is effective and reliable in early identification and assessment of the level of psychosocial distress in patients with head and neck cancer, which can provide an effective basis for health education, psychological counseling, and social support in the future.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8c34926bb94779adfaf8515a33f196d",
  "timestamp": "2025-05-15T03:14:07.342788"
}