{
  "id": 2826,
  "title": "Cryptocurrency portfolio allocation using a novel hybrid and predictive big data decision support system",
  "abstract": "Establishing a cryptocurrency portfolio management and allocation decision support is vital in enabling investors to thrive in this market. More than nearly 50 0 0 cryptocurrencies are traded daily at cryptocur-rency exchanges, and one of the primary challenges is the optimal selection of the assets. While re-search studies considered cryptocurrency price prediction as a typical time series forecasting problem, a portfolio allocation problem can be defined as a Multiple Criteria Decision-Making (MCDM) problem. To tackle this problem and generate a response to these dynamic challenges, this study developed an analytical and predictive approach to guide investors through their decisions. Time series forecasting was conducted using the Prophet Forecasting Model (PFM) to predict the prices. For the asset alloca-tion stage, this study extended the Cluster analysis for improving the Multiple Criteria Decision Analysis (CLUS-MCDA) algorithm by adding additional features to this large-scale decision-making technique, in-cluding Density-Based Spatial Clustering of Applications with Noise (DBSCAN) and the Visekriterijumsko kompromisno rangiranje (meaning: multi-criteria optimization and compromise solution) (VIKOR) meth-ods. While the concept of Parallel Decision Making (PDM) in massive structured problems was previously introduced in the CLUS-MCDA algorithm, this study also utilized a target-based normalization technique that gives the decision-makers more control over the extended CLUS-MCDA II algorithm. To validate the reliability of the method, a cryptocurrency trade experiment considering more than 70 cryptocurrencies and multiple scenarios based on decision-makers' preferences was analysed. The outcomes of this study showed that the proposed decision support system is a reliable tool for such practical and real-world big data problems.(c) 2022 Elsevier Ltd. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8cfb2c6729b541f777885c655f2755b",
  "timestamp": "2025-05-15T01:10:49.577972"
}