{
  "id": 8052,
  "title": "The Effect of Disease Modifying Therapies on Disease Progression in Patients with Relapsing-Remitting Multiple Sclerosis: A Systematic Review and Meta-Analysis",
  "abstract": "Importance A number of officially approved disease-modifying drugs (DMD) are currently available for the early intervention in patients with relapsing-remitting multiple sclerosis (RRMS). The aim of the present study was to systematically evaluate the effect of DMDs on disability progression in RRMS Methods We performed a systematic review on MEDLINE and SCOPUS databases to include all available placebo-controlled randomized clinical trials (RCTs) of RRMS patients that reported absolute numbers or percentages of disability progression during each study period. Observational studies, case series, case reports, RCTs without placebo subgroups and studies reporting the use of RRMS therapies that are not still officially approved were excluded. Risk ratios (RRs) were calculated in each study protocol to express the comparison of disability progression in RRMS patients treated with a DMD and those RRMS patients receiving placebo. The mixed-effects model was used to calculate both the pooled point estimate in each subgroup and the overall estimates. Results DMDs for RRMS were found to have a significantly lower risk of disability progression compared to placebo (RR = 0.72, 95% CI: 0.66-0.79; p<0.001), with no evidence of heterogeneity or publication bias. In subsequent subgroup analyses, neither dichotomization of DMDs as first and second line RRMS therapies [(RR = 0.72, 95% CI = 0.65-0.80) vs. (RR = 0.72, 95% = 0.57-0.91); p = 0.96] nor the route of administration (injectable or oral) [ RR = 0.75 (95% CI = 0.64-0.87) vs. RR = 0.74 (95% CI = 0.66-0.83); p = 0.92] had a differential effect on the risk of disability progression. Either considerable (5-20%) or significant (>20%) rates of loss to follow-up were reported in many study protocols, while financial and/or other support from pharmaceutical industries with a clear conflict of interest on the study outcomes was documented in all included studies. Conclusions Available DMD are effective in reducing disability progression in patients with RRMS, independently of the route of administration and their classification as first or second line therapies. Attrition bias needs to be taken into account in the interpretation of these findings.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8d1d2a8d66557193930b1db1709c742",
  "timestamp": "2025-05-15T03:14:37.400423"
}