{
  "id": 7465,
  "title": "Association between Glucagon-like Peptide-1 Receptor Agonists and the Risk of Glaucoma in Individuals with Type 2 Diabetes",
  "abstract": "Purpose: To examine the association between glucagon-like peptide-1 receptor agonist (GLP-1RA) use and the development of glaucoma in individuals with type 2 diabetes. Design: Nationwide, nested case-control study. Participants: From a nationwide cohort of 264 708 individuals, we identified 1737 incident glaucoma cases and matched them to 8685 glaucoma-free controls, all aged more than 21 years and treated with metformin and a second-line antihyperglycemic drug formulation, with no history of glaucoma, eye trauma, or eye surgery. Methods: Cases were incidence-density-matched to 5 controls by birth year, sex, and date of second-line treatment initiation. Main Outcome Measures: Conditional logistic regression was used to calculate adjusted hazard ratios (HRs) with 95% confidence intervals (CIs) for glaucoma, defined by first-time diagnosis, first-time use of glaucoma-specific medication, or first-time glaucoma-specific surgical intervention. Results: Compared with the reference group, who received treatments other than GLP-1RA, individuals who were exposed to GLP-1RA treatment exhibited a lower risk of incident glaucoma (HR, 0.81; CI, 0.70-0.94; P = 0.006). Prolonged treatment extending beyond 3 years lowered the risk even further (HR, 0.71; CI, 0.55-0.91; P = 0.007). Treatment with GLP-1RA for 0 to 1 year (HR, 0.89; CI, 0.70-1.14; P = 0.35) and 1 to 3 years (HR, 0.85; CI, 0.67-1.06; P = 0.15) was not significant. Conclusions: Exposure to GLP-1RA was associated with a lower risk of developing glaucoma compared with receiving other second-line antihyperglycemic medication. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2024;131:1056-1063 (c) 2023 by the American Academy of Ophthalmology",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8d72e62c63fb1f7e69d61bffb07fa83",
  "timestamp": "2025-05-15T03:09:07.216147"
}