{
  "id": 5983,
  "title": "Impact of Raw Water Quality and Climate Factors on the Variability of Drinking Water Quality in Small Systems",
  "abstract": "Drinking water quality is mainly influenced by the variable quality of source water, which is affected by both meteorological and climate factors. Contrary to medium and large municipalities, small systems do not have appropriate equipment to face important variations of raw water quality, and they do not have enough information either on the impact of these alterations. The objective of this study is to develop a decision-making tool to small system operators allowing the determination of risk periods, based on easily accessible measures. The impact of several raw water quality parameters and climate factors on drinking water quality was under study. A stepwise regression analysis was applied to determine the most important factors. Two of them were retained: the level of UV254 of raw water and average maximal air temperature of 15 days before measurement. These factors are representative of raw water quality or meteorological conditions and are easily accessible to systems with restricted financial capacities. A logistic regression analysis contributed to the estimation of the probability to provide drinking water of bad quality (defined by a drinking water quality index). Finally, results of the analysis were synthetized in a visual tool, allowing the identification of risk periods using the known values of UV254 and average maximal air temperature of 15 days. This tool may strongly contribute to the improvement of drinking water management in small systems, as it provides easily accessible information on the risks of deterioration of drinking water quality using two simple parameters.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8d79e8bb64d4ac8eee3fa2e7bdd1a34",
  "timestamp": "2025-05-15T02:53:33.400287"
}