{
  "id": 1680,
  "title": "AI-Driven Framework for Predicting Oil Pipeline Failure Causes Based on Leak Properties and Financial Impact",
  "abstract": "The current oil pipeline system is at risk for leaks and ruptures due to aging infrastructure, corrosion, and extreme weather. Addressing these vulnerabilities demands a robust disaster preparedness and response strategy that can be adapted to various incident causes. This study evaluates a data-driven framework with artificial intelligence (AI)-based algorithms for classifying failure causes in oil pipelines. For this purpose, a data set summarizing oil pipeline incidents from 2010 to 2022 obtained from the Pipeline and Hazardous Materials Safety Administration, which comprises various incident attributes, including the severity of incidents and estimated financial impacts, was processed for data balancing with a variation of synthetic minority oversampling technique. Further, this study employs extreme gradient boosting gradient, random forest, K-nearest neighbors, and support vector machine algorithms for multiclassification tasks in predicting the failure cause. The results indicate that majority-class incident causes can be effectively predicted across algorithms, achieving over 90% accuracy for corrosion failures and over 80% for equipment failures. The proposed methods can be integrated into the mitigation stage of a disaster management framework to aid with decision-making in maintenance activities and improve emergency response based on incident urgency.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8d82d8bc76ee15355d8d14e54f0a6e1",
  "timestamp": "2025-05-15T02:06:22.428570"
}