{
  "id": 3867,
  "title": "Exploring the impact of big data analytics and risk management convergence on sustainability performance development: an accounting perspective",
  "abstract": "This paper aims to contribute to understanding the role of big data analytics in corporate risk management and explore its interaction impact on corporate sustainability. This study is an initiative work to investigate the impact of the interaction between big data maturity analytics and risk management practices on the firm's sustainability performance development. A quantitative approach was applied in this study on a sample consisting of 81 individuals from senior and executive financial and operational positions in large Saudi manufacturing corporates, Findings of the multiple regression analysis revealed that that organizations that effectively incorporate big data analytics into their risk management practice improve their sustainability performance In addition, the study is extending big data trends into the future and confirms that they will be leading contributors to corporate long-term sustainability. The use of big data and big data analytics is at its childhood stage in many developing countries, while firms are at the very beginning of applications of big data analytics tools. Big data real-time applications on risk management and corporate long-term sustainability are treated seriously due to the cost-effective advantage they provide in this changing financial and operational environment.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8d8b14926c044d129ec5cda0ad7104b",
  "timestamp": "2025-05-15T02:30:58.180880"
}