{
  "id": 2220,
  "title": "Research on Technological Innovation Investment, Financing Constraints, and Corporate Financial Risk: Evidence from China",
  "abstract": "Technological innovation is the source of generating new momentum. In the context of the financing constraints generally existing in China, it is particularly important to explore the impact of technological innovation investment on corporate financial risk, which also provides a risk identification perspective and development direction for enterprises. Based on the data of China's small and medium-sized listed companies from 2010 to 2019, and from the perspective of moderating effect of financing constraints, this paper uses multiple regression analysis method to test the impact mechanism of technological innovation investment on corporate financial risk and the moderating effect of financing constraints in both. The results show that technological innovation investment can significantly reduce corporate financial risk, while financing constraints can significantly improve the level of financial risk. Financing constraints play a moderating role in technological innovation investment and financial risk. Heterogeneity test found that, compared with large-scale enterprises, small-scale enterprises' technological innovation investment has a more significant impact on financial risk, and the moderating effect of financing constraints is also greater. Compared with private enterprises, state-owned enterprises' technological innovation investment has less impact on financial risk, and the moderating effect of financing constraints is not significant.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8db36a0f5cc9a5a053af8463cf9e972",
  "timestamp": "2025-05-15T02:12:50.954298"
}