{
  "id": 4098,
  "title": "Post-earthquake fire ignition model uncertainty in regional probabilistic shaking-fire cascading multi-hazard risk assessment: A study of earthquakes in Japan",
  "abstract": "Fires following earthquakes have significant impact on urban communities in earthquake-prone countries with wooden buildings, in addition to the main earthquake hazard of ground shaking. Regional-scale post-earthquake fire risk assessments are important for developing effective risk reduction strategies. Such risk assessments require the consideration of epistemic uncertainty, that is, uncertainty caused by lack of knowledge concerning the best models, in addition to aleatoric uncertainty. This study focused on epistemic uncertainty in post-earthquake fire igni-tion estimations, and incorporated it into risk assessments by using alternative empirical ignition models. The key objectives of this study were as follows: (1) correlating the probability of igni-tion per person to the ground motion intensity based on data for different past large earthquakes in Japan; (2) investigating the impact of using ignition models calibrated on different earthquake events in risk assessments through a realistic case study considering possible large earthquakes. A hierarchical Bayesian Poisson regression analysis revealed that the empirical relationship be-tween the ignition probability and ground motion intensity greatly varies across six major large earthquakes in Japan from 1995 to 2022. Particularly, the effects of ignition prevention measures that have been widely implemented in households since the 1995 Kobe earthquake were inferred from much smaller ignition probabilities in approximately the last 10 years. The effects of this high epistemic uncertainty manifested as the large variability of the loss exceedance curve for a portfolio of buildings. These results indicate that the new ignition models can help to foster risk-informed decision-making under epistemic uncertainty.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8dc379ac64c061bb28cd487911c742e",
  "timestamp": "2025-05-15T01:23:58.024192"
}