{
  "id": 2283,
  "title": "STOCK INDEX PATTERN DISCOVERY VIA TOEPLITZ INVERSE COVARIANCE-BASED CLUSTERING",
  "abstract": "In this study, we attempt to discover repeated patterns of stock index through analysis of multivariate time series. Our motivation is based on the notion that financial planning guided by pattern discovery of stock index may be more effective. A two-stage architecture constructed by combining Toeplitz Inverse Covariance-Based Clustering (TICC) with betweenness centrality is applied for pattern discovery of stock index. In the first stage, TICC is used to discover repeated patterns of stock index's multivariate time series. Then, in the second stage, betweenness centrality scores that reveal the relative importance of each influencing factor are plotted by Markov random field (MRF) which is derived from the first experiment. The Hangseng Stock Index and five influencing factors are used in the experiment. Empirical results show that six kinds of time-invariant patterns with flexible and long-term time periods are discovered in Hangseng Stock Index, and that different influencing factors have different betweenness scores in each cluster. This empirical research provides new ideas of stock index prediction and portfolio construction for scholars and investors. Moreover, the long-period repeated patterns that are discovered in this paper increase the possibility to reduce transaction cost for portfolio construction which then, maybe more applicable to the real financial markets.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8de0585ba333d95454e019c63290e86",
  "timestamp": "2025-05-15T01:05:04.529314"
}