{
  "id": 4722,
  "title": "The moderating effect of corporate characteristics on the relationship between climate change risk disclosure and corporate value: evidence from Egypt",
  "abstract": "PurposeThis study aims to investigate the impact of climate change risk disclosure (CCRD) on Corporate Value while exploring how corporate characteristics such as size, financial performance and leverage may moderate this relationship.Design/methodology/approachThis research used a sample of 50 companies from the EGX100 index on the Egypt Stock Exchange, covering the years 2018-2022 (250 observations). For the first hypothesis, the authors use ordinary least squares regression, while for the other hypotheses, the authors use the PROCESS program developed by Andrew F. Hayes to analyze moderation.FindingsThe findings indicate a negative association between CCRD and corporate value. However, the extent of this influence can vary depending on the company's characteristics. Specifically, CCRD negatively affects the value of small-sized, less profitable and highly leveraged corporates. Conversely, it positively impacts the value of large-sized, more profitable and less leveraged corporates.Research limitations/implicationsThe findings have significant implications for stakeholders in Egypt and similar developing countries. This significance stems from the substantial impact of CCRD on corporate value. CCRD can heighten investors' perception of risk as a new risk factor, potentially leading to increased corporate risk. Therefore, CCRD is vital in identifying corporate value reflected in stock prices.Originality/valueAs far as we know, this is the pioneering study in Egypt to offer new evidence on how CCRD affects corporate value. It investigates the moderating role of corporate characteristics, such as corporate size, financial performance and leverage, in this relationship.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8e586cce4b385fe2f4f6dc21450d3d0",
  "timestamp": "2025-05-15T02:40:27.887102"
}