{
  "id": 8032,
  "title": "Developing and Validating Lower Risk Online Gambling Thresholds With Actual Bettor Data From a Major Internet Gambling Operator",
  "abstract": "Objective: To help individuals avoid potential negative consequences associated with their gambling, researchers have developed lower risk limits for time and financial involvement among populations of land-based gamblers. The present study extended these efforts to online gambler populations with prospective longitudinal data. Method: We used receiver operating characteristic curve analysis and logistic regression models predicting a positive Brief Biosocial Gambling Screen (BBGS; Gebauer et al., Canadian Journal of Psychiatry, 55, 2010, 82-90) to develop lower risk limits for six measures of gambling involvement among subscribers to an online gambling operator. We also tested the utility of these six newly developed online limits and three existing land-based limits for the BBGS outcome and proxies for gambling problems including: (a) voluntary self-limiting, (b) voluntary self-exclusion, (c) closing one's account, and (d) being assigned a flag for potential problem gambling by customer service. Results: We identified five optimal limits for lower risk online gambling with adequate sensitivity and specificity for predicting BBGS-positive status, and four of those that also received additional empirical support. These four empirically supported gambling limits were: (a) wagering 167.97 Euros or less each month; (b) spending 6.71% or less of one's annual income on online gambling wagers; (c) losing 26.11 Euros or less on online gambling per month; and (d) demonstrating variability (i.e., standard deviation) in daily amount wagered of 35.14 Euros or less during one's duration active. Conclusions: Our findings have implications for lower risk gambling limits research and suggest that unique limits might apply to online and land-based gambler populations. Public Health Significance Statement This study found that gambling online above specific limits is associated with increased likelihood of experiencing gambling-related problems. Public health guidelines advising gamblers to keep their gambling below certain limits might facilitate safer gambling practices and help reduce the likelihood of emerging gambling-related problems. Individual cases might require more stringent thresholds, and like any behavior with potential for harm, not engaging in gambling at all is the most certain way to prevent gambling problems.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8e8887139c49940515c6feebe81f081",
  "timestamp": "2025-05-15T03:14:37.321841"
}