{
  "id": 7941,
  "title": "Tax benefit and bankruptcy cost of debt",
  "abstract": "Different theories seek to substantiate the main determinants of companies' capital structure. For the trade-off theory, there may be an optimal capital structure in which companies seek a balance between bankruptcy risk and tax benefits generated by the deduction of debt interest. Despite the relevance of both aspects, their joint analysis is not sufficiently studied. Thus, this study seeks to understand whether companies show conservative behavior in relation to their low leverage level. In addition, whether a possible non-optimizing of tax benefits, arising from indebtedness, is due to a higher ex-ante bankruptcy cost for the company or due to the existence of other non-debt tax benefits is intended to verify. For this purpose, tests are performed with simultaneous equations -generalized method of moments and ordered probit -and Tobit regression. The sample comprises non-financial publicly held Brazilian companies. Data are analyzed during the period from 2009 to 2018. As a result, both hypotheses are confirmed -H1 -Increased leverage results from higher debt tax benefits than ex-ante bankruptcy costs and H2 -Companies do not optimize debt tax benefits due to factors other than debt. (c) 2021 The Author(s). Published by Elsevier Inc. on behalf of Board of Trustees of the University of Illinois. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/).",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8e82441f3b95f30f74101ed1c43d00a",
  "timestamp": "2025-05-15T03:13:30.687165"
}