{
  "id": 7478,
  "title": "Association between environmental factors during the COVID-19 pandemic and functioning of infants with biological risk in the first year of life: Cross-sectional exploratory study",
  "abstract": "Background: Child development can be influenced by family and environmental factors, which changed during the COVID-19 pandemic. Thus, it is important to explore how these factors are associated with the functioning of infants with biological risk in the first year of life. Objective: This study aimed to investigate associations between family factors, home opportunities, caregiver perception of environmental support and barriers at home and environmental factors during the COVID-19 pandemic and gross motor skills and home participation in infants with biological risk in the first year of life. Methods: Fifty-six infants aged two to 12 months (M = 5.80 months; +/- 2.44) and their mothers performed remote assessments of gross motor skills using the Alberta Infant Motor Scale (AIMS); participation and environment (phone call) by the Young Children's Participation and Environment Measure (YC-PEM); family factors (income, age and maternal education), home opportunities - The Affordances in the Home Environment for Motor Development - Infant Scale (AHEMD-IS) and environmental factors during the COVID-19 pandemic (social distancing, emotional and financial factors and physiotherapy) (online forms). Regression models were constructed, considering gross motor skills and home participation as outcome variables, with a 5 % significance level. Results: We found that older maternal age (p = 0.001), more home opportunities (p = 0.043), and less rigorous social distancing (as opposed to total social distancing [p = 0.045]) were significantly associated with better gross motor skills; and higher maternal education (p = 0.050) was associated with more involvement in home activities. Conclusion: Family factors, home opportunities and social distancing were differently associated with the gross motor skills and home participation of infants with biological risk in the first year of life.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8eb0d3d6fd1a849ab73734774d3d5ac",
  "timestamp": "2025-05-15T03:09:07.255348"
}