{
  "id": 2294,
  "title": "A Hybrid Forecasting Model for Nonstationary and Nonlinear Time Series in the Stochastic Process of CO2 Emission Trading Price Fluctuation",
  "abstract": "Predicting CO(2)emission prices is an important and challenging task for policy makers and market participants, as carbon prices follow a stochastic process of complex time series with nonstationary and nonlinear characteristics. Existing literature has focused on highly precise point forecasting, but it cannot correctly solve the uncertainties related to carbon price datasets in most cases. This study aims to develop a hybrid forecasting model to estimate in advance the maximum or minimum loss in the stochastic process of CO(2)emission trading price fluctuation. This model can granulate raw data into fuzzy-information granular components with minimum (Low), average (R), and maximum (Up) values as changing space-description parameters. Furthermore, it can forecast carbon prices' changing space with Low,R, and Up as inputs to support a vector regression. This method's feasibility and effectiveness is examined using empirical experiments on European Union allowances' spot and futures prices under the European Union's Emissions Trading Scheme. The proposed FIG-SVM model exhibits fewer errors and superior performance than ARIMA, ARFIMA, and Markov-switching methods. This study provides several important implications for investors and risk managers involved in trading carbon financial products.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8edfb0a521990ecb9b63242d1cf7b84",
  "timestamp": "2025-05-15T02:13:31.862272"
}