{
  "id": 5129,
  "title": "Discovering High-Risk Bank Risk Factors Based on Risk Matrix",
  "abstract": "Bank risk management is a crucial issue in the stability of the financial system. How to select high-risk factors that make banks in trouble and how these factors affect bank risks have always been a core problem. Previous studies comprehensively identified bank risk factors from textual risk disclosures and used the disclosure frequency of risk factors to determine important factors to which banks should pay more attention. This paper creatively constructs the textual risk matrix with frequency and sentiment of risk factors to divide bank risk factors into the high-risk category, mid-risk category, and low-risk category. Then we explore the impact of different categories of risk factors on bank risk and the risk perception of investors. Based on 457,383 sentences of 2,735 Form 10-K reports of 240 American commercial banks from 2006 to 2020, 33 bank risk factors were identified. Three risk factors belong to in high-risk category, including loan loss risk, regulation risk, and interest rate risk. Three factors are classified in the mid-risk category and 27 risk factors are low-risk factors. The regression results show that compared with individual bankruptcy risk, risk factors have better prediction and interpretive ability on the systemic risk. The disclosure of bank risk factors will affect the investors' risk perception, especially the worse risk situation of the high-risk factors will increase the risk perceived by investors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8f1d5cc80d347b704a04097df3407c8",
  "timestamp": "2025-05-15T02:44:43.837720"
}