{
  "id": 4162,
  "title": "Financial report comment letters and greenwashing in environmental, social and governance disclosures: Evidence from China",
  "abstract": "In the context of the double carbon target, the issue of corporate greenwashing in environmental, social, and governance (ESG) disclosures has become more prominent as ESG reports spring up. Subsequently, this study examines the relationship between financial report comment letters and greenwashing in companies' ESG disclosures using OLS regression on A-share-listed companies. We found that greenwashing in companies' ESG disclosures increased after they received financial report comment letters. The higher the number of financial report comment letters and the total number of words, the higher the intensity of the comment letter regulation and the greater the greenwashing in companies' ESG disclosures, which verifies the crisis management hypothesis. Simultaneously, greenwashing in ESG disclosures is mainly carried out by companies through talk more and work less and tone management. Further analysis revealed that financial pressure can increase greenwashing in ESG disclosures in response to comment letters, and improvements in internal and external governance environments can reduce greenwashing in ESG disclosures owing to the receipt of comment letters. Our findings provide a new perspective for understanding greenwashing in ESG disclosures from the insights of financial report comment letters and have important reference value for preventing ESG greenwashing risk and promoting high-quality economic development.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d8f7af86b9362827632b9d19246c393b",
  "timestamp": "2025-05-16T17:50:25.558362"
}