{
  "id": 2806,
  "title": "Exchange Rate Transaction of International Trade Goods Based on Fuzzy Granulation and Deep Learning",
  "abstract": "The change of international trade goods exchange rate transaction has an impact on economic operations and economic stability. Therefore, an international trade goods exchange rate transaction based on fuzzy granulation and in-depth learning is proposed. Based on fuzzy information granulation and BP neural network, this paper analyzes the interest rate evaluation theory. For the future expectation of currency exchange rate, portfolio equilibrium determines the proportional relationship of each component in the portfolio and analyzes the impact of asset price and exchange rate change according to this relationship. Then, it points out the risk evaluation index system, calculates the risk degree of exchange rate transaction of international trade goods, and then evaluates the risk of exchange rate transaction of international trade goods. It completes the research on exchange rate transactions of international trade goods based on fuzzy granulation and in-depth learning. The experimental results show that excessive exchange rate fluctuation will bring the same proportion fluctuation to the asset price in the financial market, and the coordination between exchange rates and the coordination of exchange rate and asset price can promote the steady growth of national economy.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d907fa59fdb8f8a5da7850dc92db7ab6",
  "timestamp": "2025-05-15T02:19:08.504806"
}