{
  "id": 6844,
  "title": "Welfare and social protection: What is the link with secondary migration? Evidence from the 2014-crisis hit Italian region of Lombardy",
  "abstract": "Evidence on the relationship between secondary international migration and welfare state (or formal protection) support is currently limited. Also, the experience of financial support from semiformal and informal social protection networks has seen limited inclusion in current reflections on secondary mobility patterns such as onward and return migration. Our study analyses the relationship between support from formal, informal and semiformal social protection and short-term secondary migration intentions. The study uses open-access data from the Regional Observatory for Integration and Multiethnicity of Lombardy (Italy) and adopts a competing-risk framework through multinomial logistic regression. Our data do not support the hypothesis of an ex-post magnetic effect of the Italian formal social protection on its beneficiaries: individuals on formal welfare are more prone to onward and return migration. However, the positive relationship observed between welfare entitlements and onward migration intentions cannot rule out any effect of welfare magnetism from more generous welfare systems. Monetary aid received from Italian friends is negatively related to return intention. At the same time, economic support from foreign-born friends is correlated to return migration. We interpret results according to social network theory. Economic support and social capital from bridging networks can act as an ex-post integration-driven magnet. Bonding social capital from ties with migrants in Italy cannot secure the migrants' stay in Italy. However, it can support return migration. Networks providing bonding transnational social capital, and expressed in the form of financial support from relatives living abroad, are instead positively correlated to both forms of secondary migration.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d90e714d8d7ecf445bbbb36b99025cb4",
  "timestamp": "2025-05-15T03:02:07.508470"
}