{
  "id": 270,
  "title": "Assessing project portfolio risk via an enhanced GA-BPNN combined with PCA",
  "abstract": "Assessing project portfolio risk (PPR) is essential for organizations to grasp the overall risk levels of project portfolios (PPs) and realize PPR mitigation. However, current research is inadequate to effectively assess PPR, which brings challenges to managing PPR. In this context, the purpose of this study is to develop a PPR assessment model via an enhanced backpropagation neural network (BPNN). First, PPR assessment criteria considering project interdependencies are determined. Second, fuzzy logic is used to obtain original data for assessment criteria. Principal component analysis (PCA) is then employed to reduce the dimensionality of assessment criteria and derive the input and output of BPNN. Third, an improved genetic algorithm (IGA) is designed to optimize the initial weights and thresholds of BPNN. On this basis, the PCA-IGA-BPNN assessment model is constructed, followed by training and testing, possessing a test accuracy of 98.6%. Finally, comparison experiments are conducted from both internal and external perspectives. For internal comparison, the proposed model yields less mean absolute percentage error (MAPE), mean square error (MSE), and root mean square error (RMSE) than PCA-GA-BPNN, IGA-BPNN, PCA-BPNN and BPNN and offers the largest convergence speed (). As for external comparison, the presented model produces lower MAPE, MSE, and RMSE than Decision Tree (DT), Support Vector Machine (SVM), Random Forest (RF), and K-Nearest Neighbor (KNN) and has the largest coefficient of determination (R2). Results indicate that the established model performs more satisfactorily in assessing PPR. This research enriches PPR assessment methods and provides managers with a useful tool to evaluate PPR.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9193f9363244c0ff32e048b20540c43",
  "timestamp": "2025-05-15T00:41:04.791402"
}