{
  "id": 9352,
  "title": "Incidence of perioperative myocardial infarction and cardiac events after noncardiac surgery patients with prior myocardial infarction .1. Clinical data and diagnosis",
  "abstract": "Patients with a prior myocardial infarction (MI) have a high risk of perioperative reinfarction compared with the normal population (5%-8% vs. 0.1%-0.7%) [10]. According to Rao [13], a reduction of this risk is possible when patients are monitored invasively and all haemodynamic parameters are kept within the physiological range. In most institutions it is not feasible to treat patients as Rao recommended: this would overstrain both hospital structure and financial resources. We studied the incidence of perioperative MI and other cardiac events in patients with prior MI. During the study period the anaesthesia and intensive care methods of our institution were neither changed nor influenced. In addition to this clinical evaluation, we performed perioperative Holter electrocardiographic monitoring and measured serum levels of the recently introduced marker troponin T (parts II and III). Methods. Institutional informed consent was obtained. The study was planned prospectively. All patients with prior MI (156) and/or coronary artery bypass grafting (CABG) (4) who were scheduled for elective noncardiac surgery between April 1992 and March 1993 were included. The following information was acquired and tabulated: age, sex, body weight, preoperative risk factors, ASA classification, preoperative blood pressure, pulse rate, and ECG (interpreted by an independent cardiologist) serum electrolytes, haemoglobin, creatine kinase (CK), CKMB fraction, creatinine. Preoperative regular medications, type of anaesthesia, type, site, and duration of surgery, and intraoperative haemodynamic changes were documented. The patients were divided into four groups depending on the time interval between MI and surgery (group I: 0-3 months, group II: 3-6 months, group III: >6 months, group IV silent MI and prior CABG without infarction). We then studied the number of patients who developed a perioperative MI or died of cardiac causes within 7 postoperative days (n=160). Because of early discharge of 21 patients, we could study the occurrence of cardiac events within 7 postoperative days in 139 patients only. Definitions of perioperative MI included [3]: changes of ST pattern (horizontal ST depression >0.1 mV or elevation >0.2 mV) during 30 s and longer; new T-negativation or Q-wave; pathological CKMB fraction (greater than or equal to 6% of total CK); and angina pectoris; two of these criteria were required to be positive (WHO). Definitions of cardiac events included: ischaemia: any reversible horizontal depression of the ST segment of more than 0.1 mV or any ST segment rise of more than 0.2 mV. Patients with bundle branch block (BBB) were excluded. angina pectoris: any chest pain that disappered after application of nitroglycerine; arrhythmia: any change from preoperative rhythm or appearence of ventricular premature beats; and left ventricular failure. clinical and radiological signs of ventricular failure. Statistical evaluation of the demographic data was performed by the Kruskall-Wallis test; categoric variables were examined using the chi(2) rest and Fisher's exact test. P values of less than 0.05 were considered significant. Results. Six of the 160 patients with prior MI developed a perioperative MI (3.8%); 2 of them (33%) died of cardiac causes (3rd and 6th postoperative day). All of these patients were in groups III or IV (interval >6 months). Forty-two patients had one or more other cardiac events; arrhythmias (22) and ischaemia (14) were most common. Intraoperative hypotension was associated with postoperative MI (5 of 58 vs. 1 of 102). Preoperative congestive heart failure (4 of 18 vs. 3 of 121) and major surgery (7 of 68 vs. 0 of 71) led more often to postoperative left ventricular failure. Patients who received beta-blocking agents preoperatively had significantly fewer ischaemic cardiac events (0 of 28 vs. 14 of 90, 21 patients excluded with BBB) but differed in mean age (67 vs. 71 years). The use of beta-blocking agents was not associated with a reduction in the incidence of perioperative MI (5 of 119 without vs. 1 of 41 with beta-blockers). Conclusions. It is possible to achieve a low incidence of perioperative reinfarction even without invasive monitoring. Intraoperative haemodynamic changes should be treated adequately. The preoperative assessement of congestive heart failure is of great value in risk evaluation for patients with coronary artery disease.",
  "year": 1996,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d932e556ebd44ce9afea560a2462d0fa",
  "timestamp": "2025-05-15T03:27:53.401129"
}