{
  "id": 4119,
  "title": "The effects of a non-cognitive versus cognitive admission procedure within cohorts in one medical school",
  "abstract": "In medical school selection, non-cognitive performance in particular correlates with performance in clinical practice. It is arguable, therefore, that selection should focus on non-cognitive aspects despite the predictive value of prior cognitive performance for early medical school performance. The aim of this study at Radboud University Medical Center, the Netherlands, is to determine the effects of admitting students through an autonomous non-cognitive procedure on early medical school performance. We compared their performance to the performance of students selected through an autonomous cognitive selection procedure, enrolling in the Bachelor's curriculum simultaneously. 574 students (2013 and 2014 cohorts), admitted through non-cognitive selection (based on portfolio, CASPer and MMI, n = 135) or cognitive selection (curriculum sample selection, n = 439) were included in the study. We compared dropout rates, course credits and grades, using logistic and linear regression. The dropout rate was the highest in the non-cognitive selection group (p < 0.001). Students admitted through non-cognitive selection more often obtained the highest grade for the nursing attachment (p = 0.02) and had a higher mean grade for the practical clinical course in year 3 (p = .04). No differences in course grades were found. The results indicate that students perform best on the elements of the curriculum that are represented most strongly in the selection procedure they had participated in. We recommend the use of curriculum sample procedures, resembling the early medical school curriculum,-whether it has a more cognitive or a more non-cognitive focus-, to select the students who are likely to be successful in the subsequent curriculum.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d94c4114aadd3f12579c940ad5939c5a",
  "timestamp": "2025-05-15T01:23:58.091944"
}