{
  "id": 7069,
  "title": "Abuse and its associated factors among elderly population of Kamalamai Municipality of Sindhuli District, Nepal",
  "abstract": "Background The global rise in the elderly population brings attention to the pressing issue of elder abuse, categorized into physical, psychological, neglect, financial and sexual abuse. According to the World Health Organization (2022), one in six individuals aged 60 and older has experienced some form of abuse in community setting necessitating increase in awareness and support for older people. This study aimed to assess abuse and its associated factors among elderly population of Kamalamai Municipality of Sindhuli District, Nepal. Methodology We conducted a community-based cross-sectional study utilizing both qualitative and quantitative methods. We collected data from June 15 to September 15, 2023. The study involved 398 elderly participants (>= 60 years). Stratified sampling techniques was used to select participants. For the qualitative study we utilized purposive sampling technique which included two key informant interviews, one in-depth interview and two focus group discussions. We analyzed quantitative data using IBM SPSS version 20 applying bivariate and multivariable logistic regression analysis at a 95% confidence interval. For qualitative data, thematic analysis was done. Results The mean +/- SD age of the elderly participants was (70.8 +/- 8.08) years. Among the total of 398 study participants, (64.1%) participants reported experiencing different forms of abuse. The study found that neglect (46.0%), psychological abuse (42.5%), and financial abuse (24.4%) were the most common while physical abuse (4.8%) and sexual abuse (2.8%) were less common. Living in a nuclear family (AOR: 2.74, 95% CI: 1.67-4.51) and lower socioeconomic status (AOR: 5.42, 95% CI: 2.28-12.92) were significantly associated with increase risk of elder abuse. Qualitative findings revealed mistreatment, vulnerability, negligence, economic factors, family dynamics, loneliness, financial exploitation, food withholding, physical abuse, and emotional attachment as key aspects of elder abuse. Conclusion This study highlights neglect and psychological abuse were the most common forms of elder abuse. These findings emphasize the urgency of implementing programs at the municipal level such as financial support system for elderly individuals from lower socioeconomic backgrounds and education programs for both elderly individuals and their families and caregivers. These initiatives aim to control and reduce the incidence of elder abuse and ensure comprehensive well-being of elderly population.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9a793c46dfadf7480730415b87cc5b2",
  "timestamp": "2025-05-15T03:05:03.369605"
}