{
  "id": 7641,
  "title": "Association between chronic disease and catastrophic health expenditure in Korea",
  "abstract": "Background: The prevalence and economic burden of chronic diseases are increasing worldwide. Nevertheless, little information is available on catastrophic health expenditures (CHE) associated with chronic diseases in Korea. This study explored the burden of household out-of-pocket health expenditures among the Korean population for different chronic diseases. Methods: This study was conducted utilizing data collected from the 7,006 households that participated in the Korea Health Panel Survey (KHPS) in 2008. The effect of CHE in relation to type of chronic disease was assessed via multiple logistic regression analysis. Results: Roughly 3.5% of the participating households experienced CHE. As opposed to households headed by females and middle-aged individuals (40-59 years), those of low economic status, elderly households, and households with a member who suffered from a chronic disease were more likely to experience CHE. According to type of chronic condition, households with a member who suffered from cerebrovascular disease, diabetes, or chronic kidney disease were at a significantly higher risk of experiencing CHE. Conclusion: Although Korea has greatly expanded its health insurance coverage, financial protection against CHE remains a concern. Policy-makers need to focus on expanding benefits according to the economic burden of individual chronic conditions.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9b39ac5d7da0463537509659ad4fdb5",
  "timestamp": "2025-05-15T03:10:33.044393"
}