{
  "id": 5111,
  "title": "An artificial neural network augmented GARCH model for Islamic stock market volatility: Do asymmetry and long memory matter?",
  "abstract": "Purpose The purpose of this study is to investigate the volatility and forecast accuracy of the Islamic stock market for the period 1999-2017. This period is characterized by the occurrence of several economic and political events such as the September 11, 2001, terrorist attack and the 2007-2008 global financial crisis. Design/methodology/approach This study constructs a new hybrid generalized autoregressive conditional heteroskedasticity (GARCH)-type model based on an artificial neural network (ANN). This model is applied to the daily Dow Jones Islamic Market World Index during the period June 1999-January 2017. Findings The in-sample results show that the volatility of the Islamic stock market can be better described by the fractionally integrated asymmetric power ARCH (FIAPARCH) approach that takes into account asymmetry and long memory features. Considering the out-of-sample analysis, this paper has applied a hybrid forecasting model, which combines the FIAPARCH approach and the ANN. Empirical results reveal that the proposed hybrid model (FIAPARCH-ANN) outperforms all other single models such as GARCH, fractional integrated GARCH and FIAPARCH in terms of all performance criteria used in the study. Practical implications The results have some implications for Islamic investors, portfolio managers and policymakers. These implications are related to the optimal portfolio diversification decision, the hedging strategy choice and the risk management analysis. Originality/value The paper develops a new framework that combines an ANN and FIAPARCH model that introduces two important features of time series, namely, asymmetry and long memory.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9c00349cabafc20996c23666684f310",
  "timestamp": "2025-05-15T02:44:11.123330"
}