{
  "id": 474,
  "title": "The mystery of choice of equity incentive model: based on the game theory analysis between shareholders and top executives",
  "abstract": "PurposeBased on the background of the restricted stock has gradually replaced stock option and has become the mainstream equity incentive model in China, this paper aims to investigate the which factors affect the choice of equity incentive model, and the impacts of equity incentive model. Design/methodology/approachThe theoretical analysis is based on the game theory between shareholders and top executives. The empirical analysis is based on the detailed data of equity incentives in China's listed companies from 2006 to 2017; the logit method and least square method are implemented to estimate the regression coefficients and Black-Scholes options pricing model to estimate the value of restricted stock/option granted to the CEO. FindingsThis paper documents that enterprises with serious agency problems, high investment risks, high stock price synchronicity and great executive power are significantly and positively related to restricted stock. The main empirical findings still hold after several robust tests. In addition, restricted stock can significantly improve corporate performance when the performance evaluation index is strict and the validity period is long, while for the sample group with loose performance index and short validity period, restricted stock significantly reduces corporate performance. Originality/valueThis paper analyzes the black box of equity incentive model selection from the stakeholders' game perspective by constructing a game theory model to investigate the reasons for the choice of equity incentive model in various situations, which enriches the research in this field. Moreover, this paper finds that restricted stock has both incentive and welfare characteristics, and the rationality of performance appraisal goals is the key factor leading to the difference in incentive effects. Overall, the research indicates that only well-designed equity incentive plans can improve corporate performance, which contributes to regulators and practitioners to form a rational understanding of restricted stock model and provides a reference for their decision-making.",
  "year": 2023,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9ca1dd924fc1c34dbcb6ca385a0c14a",
  "timestamp": "2025-05-15T01:32:30.172069"
}