{
  "id": 7564,
  "title": "Staying the course: Factors influencing pre-registration nursing student progression into Year 2-A retrospective cohort study",
  "abstract": "Aims/background: The retention of student nurses continues to concern the education sector internationally. Evidence shows that individual factors are correlated with a high risk of attrition, including age, disability, entry qualifications, financial issues, and placement experience. This paper is a report of a study that aimed to examine factors connected to progression and attrition by mapping student characteristics against Year 1 progression data. Method: The study used a retrospective cohort design. Students within five cohorts in a single University in the north of England were invited to be included (n = 807). Quantitative data were collected from the University's information system (October 2009-January 2010). Of the total potential participants, 695 were included (13.8% excluded). Multinomial logistic regression was used to ascertain factors that predicted progression. Results: As age on entry increased, the likelihood of non-progression from year one became less: i.e. older students appeared to be more likely to progress than their younger counterparts (p < 0.001, likelihood ratio chi-square test). Students who lived away from the local area outside term-time were significantly less likely to progress than those whose term-time and holiday domicile were the same (p = 0.007, likelihood ratio chi-square test). Students with dependents or previous care experience seemed more likely to progress than those without, although this was not statistically significant in a multivariable regression model. Conclusion: With the changing demographic profile of students, the new 'all-graduate' programmes need to consider student characteristics that are correlated with likelihood of progression and not just focus on those that precipitate exit. (C) 2012 Elsevier Ltd. All rights reserved.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9cb4dd7dcf3707f48408ede62074b6b",
  "timestamp": "2025-05-15T03:10:05.510081"
}