{
  "id": 7395,
  "title": "Coronavirus awareness, confinement stress, and mental health: Evidence from Honduras, Chile, Costa Rica, Mexico and Spain",
  "abstract": "Rationale: The purpose of the current study was to analyze the influence of coronavirus awareness, psychological stress responses, and sociodemographic variables on mental health indicators (somatization, depression, and anxiety) in residents of Honduras, Chile, Costa Rica, Mexico, and Spain. Methods: The study used a quantitative, cross-sectional approach. Data was collected online using the Brief Symptom Inventory-18 (BSI-18); the Coronavirus Awareness Scale-6 (CAS-6) and a questionnaire that included psychological and sociodemographic questions. The total sample size consisted of 1559 respondents from Honduras (34%), Chile (29%), Costa Rica (17%), Mexico (11%), and Spain (9%). Results: The most common stress domains correspond to family (22.97%), financial (22.53%), academic (16.47%), leisure time constraints (14.23%), health (12.48%), peer group (7.63%), and religious concerns (3.69%). These domains are significantly associated with the respondent's country, sex, employment status, and being or not a health worker. Respondents who reported confinement stress also reported higher scores in anxiety, depression, and somatization. The Global Severity Index was significantly predicted by confinement stress, health, academic, and leisure time-related stress, sex, age, being a health worker, COVID-19 Personal Concern, and Perceived Seriousness. Non-significant predictors were employment status, the number of people at home, presence of older adults and children at home, financial, peer group, family, and religious concerns; the regression model had an R2 of 0.26. Similar analyses were conducted for somatization, depression, and anxiety subscales. Conclusions: The COVID-19 pandemic has adverse effects on the mental health of the general population, particularly regarding anxiety, depression, and somatization. Specific populations, such as women and healthcare workers, are at particular risk of suffering a deterioration in mental wellbeing. The implications of the study for public policy are discussed.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9cc7d558bd3f530ed1ceeb8bca468bd",
  "timestamp": "2025-05-15T03:08:00.846715"
}