{
  "id": 8618,
  "title": "Chemotherapy-induced peripheral neuropathy and its impact on health-related quality of life among ovarian cancer survivors: Results from the population-based PROFILES registry",
  "abstract": "Objective. This study assessed the prevalence and risk factors of chemotherapy-induced peripheral neuropathy, and its impact on health-related quality of life among ovarian cancer survivors, 2-12 years after diagnosis. Methods. Women (n = 348) diagnosed with ovarian cancer between 2000 and 2010, as registered by the Dutch population-based Eindhoven Cancer Registry, were eligible for participation. A questionnaire, including the EORTC QLQ-C30 and EORTC QLQ-OV28 measures, containing 3 items about neuropathy, was returned by 191 women (55%). Recurrence and chemotherapy data were obtained from medical records. Results. Of all 191 women,. the 129 women who received chemotherapy more often reported having tingling hands/feet and feeling numbness in fingers/toes, specifically 51% reported a little to very much of these symptoms vs. about 27% who did not receive chemotherapy. Women reporting more neuropathy symptoms reported lower levels of functioning and overall quality of life. They also reported more symptoms of fatigue, nausea/vomiting, pain, dyspnea, insomnia, appetite loss, and financial problems. Moreover, women reporting more neuropathy symptoms had experienced the disease and treatment more often as being a burden and were more worried about their health, had more gastrointestinal and hormonal symptoms, hair loss and more other chemotherapy side effects. Linear regression analyses showed that more cycles of chemotherapy, more recurrences and a shorter period since last treatment were associated with a higher neuropathy score. Conclusion. Neuropathy symptoms were experienced by 51% of women with ovarian cancer who received chemotherapy even up to 12 years after the end of treatment, and this seriously affected their HRQoL. (C) 2014 Elsevier Inc. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9dbf0657d2ef75bfb6091261f8b3c5f",
  "timestamp": "2025-05-15T03:20:55.841800"
}