{
  "id": 7036,
  "title": "Psychosocial stress and cervical neoplasia risk",
  "abstract": "We assessed the association between psychosocial stress and preinvasive cervical neoplasia development controlling for HR-HPV infection. Methods: This-case-control study enrolled low-income women receiving family planning services at health department clinics. There were 59 cases with biopsy confirmed HSIL and 163 with low-grade SIL and 160 controls with normal cervical cytology. A modified SLE scale was used to measure stressful events and the perceived impact of the event in the prior 5 years. Unconditional logistic regression was used to assess SIL risk and stressful events scores and by subscales. Results: After adjusting for age, HR-HPV infection, and lifetime number of sex partners, the SLE count score was associated with an increased risk of SIL among white women (aOR = 1.20; 95% CI = 1.04,1.38) yet not among African American women (aOR = 1.02; 95% CI = 0.87, 1.19). The relationship stress subscale (divorce, infidelity, an increase in the number of arguments, and psychological and physical partner violence) was the only one of four subscales (loss, violence, and financial stress) associated with SIL, again, only among white women (aOR = 1.54; 95% CI = 1.21, 1.96). Conclusions: These data suggest that psychosocial stress may play a role in SIL development. Future studies are needed to confirm these findings, to explore racial difference in reporting stress, and to explore the mechanism through which psychosocial stress may affect cervical neoplasia risk. Key words: cervical neoplasms, psychological stress, human papillomavirus, women, ethnicity, epidemiology.",
  "year": 2003,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9dd603a47618144bdc962afe6655847",
  "timestamp": "2025-05-15T03:04:23.017396"
}