{
  "id": 5886,
  "title": "Prevalence and patient characteristics associated with cardiovascular disease risk factor screening in UK primary care for people with severe mental illness: an electronic healthcare record study",
  "abstract": "Background People with severe mental illness (SMI) are at increased risk of cardiovascular disease (CVD), and initiatives for CVD risk factor screening in the UK have not reduced disparities. Objectives To describe the annual screening prevalence for CVD risk factors in people with SMI from April 2000 to March 2018, and to identify factors associated with receiving no screening and regular screening. Methods We identified adults with a diagnosis of SMI (schizophrenia, bipolar disorder or 'other psychosis') from UK primary care records in Clinical Practice Research Datalink. We calculated the annual prevalence of screening for blood pressure, cholesterol, glucose, body mass index, alcohol consumption and smoking status using multinomial logistic regression to identify factors associated with receiving no screening and complete screening. Results Of 216 136 patients with SMI, 55% received screening for all six CVD risk factors at least once during follow-up and 35% received all six within a 1-month period. Our findings suggest that patient characteristics and financial incentivisation influence screening prevalence of individual CVD risk factors, the likelihood of receiving screening for all six CVD risk factors annually and risk of receiving no screening. Conclusions The low proportion of people with SMI receiving regular comprehensive CVD risk factor screening is concerning. Screening needs to be embedded as part of broad physical health checks to ensure the health needs of people with SMI are being met. If we are to improve cardiovascular health, interventions are needed where risk of receiving no screening or not receiving regular screening is highest.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9efc8cf7e37187f4b694bf4b1d7066a",
  "timestamp": "2025-05-15T02:52:31.441832"
}