{
  "id": 6410,
  "title": "Notes Readability and Discretionary Accruals",
  "abstract": "Narrative disclosures should help external users to better understand managerial discretionary accruals. However, both narrative disclosures and accruals earnings are subject to managerial discretion. This study investigates the relationship expected between earnings management, as gauged by discretionary accruals (DA), and readability, as measured by the Fog Index (Li, 2008). Prior studies investigate the relationship in terms of the readability of the management discussion and analysis (MD&A) which is not directly related to the disclosure of accruals estimation and is also not an audited section of the companys annual report. This study makes a unique contribution to the extant literature by providing empirical evidence on the association between DA and the readability of the notes to the financial statements (hereafter, Notes). Based on 1,021 observations for UK data drawn from FTSE All Share non -financial firms over the period 2005 to 2011, an ordinary least squares (OLS) regression finds a positive relation between DA and the readability of the Notes. A positive association shows that managers of firms who manage DA tend to produce more readable Notes. This result is likely due to the absence of an incentive to manage DA along with managers awareness of the associated risk of producing less -readable Notes, which might result in deeper analysis by auditors and, consequently, a greater chance of them detecting DA. Thus, market participants should not always rely on the greater readability of the Notes as an indicator of higher -quality financial statement numbers, as the results suggest that greater readability is associated with higher DA. (c) 2024 ASEPUC. Published by EDITUM - Universidad de Murcia. This is an open access article under the CC BY -NC -ND license (http: //creativecommons.org /licenses /by-nc-nd /4.0 /).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9fc64dd3673b377e7e4df6f0d1a03db",
  "timestamp": "2025-05-15T02:57:38.869336"
}