{
  "id": 7544,
  "title": "Identifying risk factors for burnout-driven turnover in Canadian healthcare workers during the Covid-19 pandemic",
  "abstract": "Background/objectivesThe COVID-19 pandemic has tested health systems worldwide, exposing significant weaknesses and vulnerabilities, particularly its toll on healthcare workers (HCWs). This study aimed to identify risk factors leading Canadian HCWs to consider leaving their positions due to stress or burnout during the pandemic.MethodsData from the 2022 Survey on Healthcare Workers' Experiences During the Pandemic (SHCWEP) were analyzed using the Shanafelt and Noseworthy (2017) framework. We hypothesized that factors such as workload, work-life balance, resource availability, social and community support at work, and job environment-including organizational culture, values, and flexibility-could influence HCWs' intentions to leave due to stress or burnout. Multivariable logistic regression models were employed to identify significant risk factors for each HCW group.ResultsThe SHCWEP survey had a 54.9% response rate, with 12,139 HCWs participating. Of these, 3,034 HCWs (25%) expressed an intention to leave their current job, and within this group, 1,350 cited stress or burnout as their reason, representing 11% of the total participants and 44% of those intending to leave. Factors associated with HCWs considering leaving due to stress and burnout included being younger to middle-age, increased workload, longer working hours, financial difficulties, conflicts with colleagues or management, non-adherence to PPE/IPC protocols, and lack of professional emotional support.ConclusionThe findings underscore systemic issues exacerbated by the pandemic, highlighting the need for targeted interventions to address workload, organizational culture, and emotional support to mitigate stress and burnout and improve healthcare worker retention.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "d9fdb18cf69bfb9a1b242485fc44e07a",
  "timestamp": "2025-05-15T03:09:36.923642"
}