{
  "id": 8572,
  "title": "Prognosis of Outcome in Adult Survivors of Road Accidents in France: One-Year Follow-Up in the ESPARR Cohort",
  "abstract": "Objective: The consequences of road crashes are various, and few studies have dealt with the multidimensionality of outcomes. The aim of the present study was to assess the multidimensional nature of outcomes one year after a crash and to determine predictive factors that could help in adapting medical and social care to prevent such consequences to improve road crash victims' prognosis. Methods: The study population was the 886 respondents to the one-year follow-up from the ESPARR (Etude et Suivi d'une Population d'Accidentes de la Route du Rhone) cohort, aged 16years; the analysis was carried out only on the 616 subjects who fully completed a self-report questionnaire on health, social, emotional, and financial status one year after a crash. Multiple correspondence analysis and hierarchical clustering was implemented to produce homogeneous groups according to differences in outcome. Groups were compared using the World Health Organization Quality of Life Assessment (WHOQOL-BREF, a standard instrument of quality of life, assessing physical health, psychological health, social relationships, and environment) and the Injury Impairment Scale (IIS), a tool to predict road crash sequelae. Baseline predictive factors for group attribution were analyzed by weighted multinomial logistic regression models. Results: Three hundred seventeen of the 616 subjects (60.1%) were men. Mean age was 36.9years (SD = 16.5). Five victim groups were identified in terms of consequences at one year: one group (206 subjects, 33.4%) with few problems, one with essentially physical sequelae, one with problems that were essentially both physical and social, and 2 groups with a wider range of problems (one including psychological problems but fewer environmental problems; the last one reported negative physical, psychological, social, and environmental impact; notably, all had post-concussion syndrome [PCS]). There were significant differences between groups in terms of family status, injury severity, and certain types of injury (thorax, spine, lower limbs). Comparison on the WHOQOL-BREF confirmed that groups reporting more adverse outcomes had a lower quality of life. Description of the 5 groups by IIS indicators showed that IIS underestimated physical consequences one year after the crash. In addition to the known prognostic factors such as age, initial injury severity, and injury type, socioeconomic fragility and having a relative involved in the accident emerged as predictive of poor outcome at one year. Conclusions: One year after the crash, victims may still be experiencing multiple problems in terms of not only physical health but also of mental health, social life, and environment. Poor outcome may be predicted from both accident-related factors and socioeconomic fragility. Our results are useful in catching the attention of both clinicians and the public administration regarding victims at risk of suffering from important consequences after an accident. If those suffering head injuries are recognized, it would be very important to better consider and treat posttraumatic stress disorder (PTSD) or PCS. Furthermore, subjects from lower socioeconomic backgrounds, with or without lower limb injuries, have numerous difficulties after an accident, notably for returning to work. An objective would be to provide them with more specific support. Supplemental materials are available for this article. Go to the publisher's online edition of Traffic Injury Prevention to view the supplemental file.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da02ca1a4a55b49056ad108affa81f6c",
  "timestamp": "2025-05-15T03:20:22.167125"
}