{
  "id": 9452,
  "title": "Implementing Best Practices for the Provision of Long-acting Reversible Contraception: A Survey of Obstetrician-Gynecologists",
  "abstract": "The most effective long-acting reversible contraceptives (LARCs) are intrauterine devices (IUDs) and contraceptive implants. Although LARCs are safe for nulliparous women and adolescents in the immediate postpartum and postabortion periods, the proportion of reproductive-aged women using contraceptives is low. The results of a 2010 American College of Obstetricians and Gynecologists (ACOG) survey found that obstetrician-gynecologists (ob-gyns) underutilize LARCs. Between 2007 and 2012, LARC use increased from 3.7% to 11.6%. Despite this promising increase, overall use of LARCs remains low because of a number of financial, knowledge, and logistical barriers that prevent women interested in LARC methods from accessing them. A number of studies have demonstrated that the requirement to return for an additional visit for placement prevents women desiring LARC from accessing their preferred contraceptive method. This possibly increases risk of unintended pregnancy. Many medical organizations, including the ACOG, the World Health Organization, and the Centers for Disease Control and Prevention, have recommended same-day provision of LARCs, immediately postpartum, and to eligible adolescents and nulliparous women as best practices for LARC placement. This study had 3 aims: (1) to estimate the proportion of practicing ob-gyns who provide IUDs and contraceptive implants as same-day placement, immediately postpartum, and to women younger than 21 years; (2) to identify covariates associated with physician provision in these situations; and (3) to identify areas for continuing education of ob-gyns on contraceptives. ACOG sent 2500 of their members an electronic survey questionnaire regarding the provision of LARC methods. Nonresponders received paper surveys by mail. A proportionate sample of participants were chosen stratified by geographic location and practice setting. Participants were asked about use of LARC methods, how they manage patients with early pregnancy loss, unintended pregnancy, and those seeking contraception. An opt-out link was given for those who were retired or did not wish to participate. The authors categorized states into US regions (Northeast, Midwest, South, West) according to their Medicaid policy regarding covered immediate postpartum LARC placement using global fees for delivery or separate reimbursement for the device or the placement or both using data from the Kaiser Family Foundation. Multivariate analyses using binary logistic regression were used to identify factors affecting whether physicians offered same-day IUD placement to patients younger than 21 years and immediate postpartum LARC. The response rate among the 1253 eligible participants was 52%. Ninety-one percent of participants reported provision of IUDs, but only 29% (95% confidence interval [CI], 26%-32%) offered same-day placement. Ninety-two percent of the ob-gyns (95% CI, 90%-94%) offered IUDs to eligible patients younger than 21 years. With respect to immediate postpartum placement, only 19% of women were offered an IUD (95% CI, 16.1%-21.3%), and 21% offered an implant (95% CI, 18%-23%). Obstetrician-gynecologists who practiced in states that bundled Medicaid reimbursement for immediate postpartum LARCs within the global fee for delivery were less likely to offer them than ob-gyns in states providing separate reimbursement. In conclusion, although the proportion of ob-gyns implementing best practices for LARC placement has increased, especially for women younger than 21 years, many still do not offer same-day LARC placement or immediately postpartum. Only a minority of ob-gyns offer either IUDs or implants immediately postpartum; this may be due in large part to important disparities in geographic and ob-gyn practice settings affecting reimbursement. To increase access of LARC methods, a multi-pronged approach is most likely required; this includes continued education of ob-gyns on the benefits of same-day LARC placement as well as increased advocacy to improve insurance coverage and reimbursement. Further studies are needed to better understand these and other logistical barriers that could impact access to LARC methods.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da0f6e582c7c60df46a111e0a4a87a51",
  "timestamp": "2025-05-15T03:28:46.373067"
}