{
  "id": 7625,
  "title": "The Changing Financial Landscape of Renal Transplant Practice: A National Cohort Analysis",
  "abstract": "Kidney transplantation has become more resource intensive as recipient complexity has increased and average donor quality has diminished over time. A national retrospective cohort study was performed to assess the impact of kidney donor and recipient characteristics on transplant center cost (exclusive of organ acquisition) and Medicare reimbursement. Data from the national transplant registry, University HealthSystem Consortium hospital costs, and Medicare payments for deceased donor (N = 53 862) and living donor (N = 36 715) transplants from 2002 to 2013 were linked and analyzed using multivariate linear regression modeling. Deceased donor kidney transplant costs were correlated with recipient (Expected Post Transplant Survival Score, degree of allosensitization, obesity, cause of renal failure), donor (age, cause of death, donation after cardiac death, terminal creatinine), and transplant (histocompatibility matching) characteristics. Living donor costs rose sharply with higher degrees of allosensitization, and were also associated with obesity, cause of renal failure, recipient work status, and 0-ABDR mismatching. Analysis of Medicare payments for a subsample of 24 809 transplants demonstrated minimal correlation with patient and donor characteristics. In conclusion, the complexity in the landscape of kidney transplantation increases center costs, posing financial disincentives that may reduce organ utilization and limit access for higher-risk populations.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da17324d3e5630c2f0628f42c899092f",
  "timestamp": "2025-05-15T03:10:32.990719"
}