{
  "id": 8167,
  "title": "Stressful Life Events, Postpartum Depressive Symptoms, and Partner and Social Support Among Pregnant People with Disabilities",
  "abstract": "Introduction: As an increasing number of people with disabilities become pregnant and give birth, understanding their vulnerabilities for poor mental health and life stress can help to improve their health and well-being. We examined whether people with disabilities are more likely to experience stressful life events 12 months before childbirth, post-partum depressive symptoms (PDS), and lack of postpartum partner and social support, and compared these associa-tions by race/ethnicity. Methods: Using the Massachusetts Pregnancy Risk Assessment Monitoring System 2016-2020 data (n 1/4 6,483), we used univariate and multivariable logistic regression models to estimate the associations of disability with stressful life events, PDS, and postpartum partner and social support, and calculated risk ratio (RR), adjusted RR, and 95% confidence interval (CI). We also conducted stratified analyses by race/ethnicity. Results: The prevalence of disability was 10.7% overall, and 8.8% among White non-Hispanic people, 14.3% among Black non-Hispanic people, 15.5% among Hispanic people, and 8.3% among Asian non-Hispanic people. Compared with people without disabilities, those with disabilities were more likely to report emotional stress (RR, 1.54; 95% CI, 1.36-1.74), partner-related stress (RR, 2.55; 95% CI, 2.23-2.91), financial stress (RR, 1.55; 95% CI, 1.44-1.68), traumatic stress (RR, 2.27; 95% CI, 1.85-2.79), and PDS (RR, 3.77; 95% CI, 3.13-4.53). People with disabilities were also more likely to lack a partner's emotional support (RR, 2.57; 95% CI, 2.21-2.97), financial support from the newborn's father (RR, 2.89; 95% CI, 2.39-3.51), and social support while feeling tired or frustrated (RR, 2.05; 95% CI, 1.68-2.52). These associations remained statistically significant after adjustment for maternal factors and newborn's birth year. Strong associations of disability with stressful life events (including emotional stress and partner-related stress), PDS, lacking partner's emotional support, and social support existed across racial/ethnic groups. Conclusions: Pregnant people with disabilities may benefit from additional screening for stressful life events and depression during pregnancy and postpartum. Multidisciplinary efforts that combine mental health screening and treatment, peer support groups, increased health care provider training about caring for people with disabilities during pregnancy, and better access to care for pregnant people with disabilities are needed to improve their health and support their desire to become parents. (c) 2022 Jacobs Institute of Women's Health, George Washington University. Published by Elsevier Inc. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da21ee66b7671c493f1c2951ffcc2e89",
  "timestamp": "2025-05-15T03:16:17.296450"
}