{
  "id": 7900,
  "title": "Does the quality of voluntary disclosure constrain earnings management in emerging economies? Evidence from Middle Eastern and North African banks",
  "abstract": "Purpose This study aims to examine the influence of the quality of voluntary disclosure (QVD) on earnings management (EM) amongst a sample of commercial banks in the Middle East and North Africa (MENA) region. Design/methodology/approach Using a sample of 1,060 bank-year observations for the period 2006-2015, this paper developed a three-dimensional framework to measure the QVD, which considers the quantity, spread and usefulness of the information. Furthermore, this study examines the QVD-EM nexus using an ordinary least squares regression model. This technique is supplemented with conducting an instrumental variable regression model and a two-stage least squares model to overcome the potential occurrence of endogeneity problems. Findings The findings suggest that QVD is negatively attributed to EM in the context of MENA banks. The findings also confirm that the quality of financial reporting is enhanced by QVD dimensions that were considered in the framework, leading banks to less engagement in EM practices. In contrast, the influence of the quantity dimension (level) of the disclosed information has an insignificant impact on EM, while the spread and usefulness dimensions of VD are negatively and significantly associated with EM in the region. Research limitations/implications Although the results are robust to various measurements and to the possible occurrence of endogeneity problems, there are a few limitations should be acknowledged, which provides opportunities for future research. For example, the sample size is relatively small due to data accessibility issues. Likewise, the findings of the research might not be appropriate for non-financial sectors. These limitations provide a good opportunity for future studies to expand on the research by covering other developing economies and, thereby, enriching the understanding offered by this study. Practical implications This study offers several implications for bank managers, academics and policymakers. Firstly, it may help managers to appreciate the function and the importance of QVD in mitigating EM. Secondly, for academics, the study provides suggestive evidence on the impact of QVD on EM; however, future research may need to consider the role of morality and ethical behaviour across different environments in reducing excessive risk-taking and constraining earnings manipulation. Finally, it provides insights for policymakers and regulators to develop a framework or guidance that can help banks in providing high-QVD in the context of developing economies. Originality/value The study distinctively develops an innovative measurement for QVD using a new multi-dimensional model. This paper also bring new evidence on QVD complexity and its impact on EM practice from an under-researched developing context, namely, the MENA region.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da25f255baa801b122d899642c3f1b67",
  "timestamp": "2025-05-15T03:13:04.959245"
}