{
  "id": 8557,
  "title": "THEORETICAL ARGUMENTS FOR A PASSIVE INVESTMENT STRATEGY",
  "abstract": "One main classification of portfolio management strategies is the differentiation between active and passive approaches. Proponents of an active investment management strategy believe that capital markets are inefficient, and therefore it should be possible to achieve above-average risk-adjusted returns via stock selection and/or timing. On the other hand, passive investment managers do not believe in such opportunities. Next to diverse empirical quantitative studies, there are developed some theories that can support a passive investment strategy by a distinct sequence of logical arguments. Aim of the depiction is to elaborate these existing theories and create a better understanding of employing passive investment management strategies. The paper presents these theories and evaluates their utility for an application of a passive investment approach. Altogether, five specific qualitative arguments could be found which are eligible to be a theoretical proponent for passive portfolio management. The validity to the active versus passive debate is critical interpreted. The novelty is that the detected research models are able to find an adequate answer to the question which investment style is preferable under diverse presumptions by the methodology of a qualitative approach. Other studies often employ tests with success-measurement figures. The weakness of these single quantitative scientific models is their reference only to the past. With the help of an entire qualitative theory, the commitment to one of the above mentioned basic investment strategies can receive a more profound appreciation. The research is embedded in view of the fact that public pension schemes will not be able to guarantee an adequate living standard for the coming pensioners in Europe. The result is that some of the presented theories are indeed very suitable to gain a sophisticated decision for a special investment approach, although some assumptions are not fully congruent with the reality on worldwide financial markets.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da2e8b6ddb64472bd8876027d06287dc",
  "timestamp": "2025-05-15T03:19:52.226068"
}