{
  "id": 6064,
  "title": "The association between sociodemographic inequalities, COVID-related impacts and mental health",
  "abstract": "Purpose: There are concerns that the social, economic and health impacts of COVID-19 are unevenly distributed, exacerbating existing inequalities. Here we tested the hypotheses that: (H1) the magnitude of these impacts would be associated with symptoms of depression and anxiety early in the pandemic, and (H2) that these impacts would be associated with a range of sociodemographic risk factors. Methods: Cross-sectional self-report data were collected from a UK sample (N = 632) between the 16th of May and 21st of July 2020, coinciding with the early stages of the pandemic and first UK lockdown. Data were collected on COVID-19 related impacts including financial and social stressors, symptoms of anxiety and depression, and sociodemographic/economic risk factors operationalised at multiple levels including the indi-vidual, familial, household and neighbourhood.Results: Using regression analyses both financial and social impacts were independently associated with anxiety (R2 = 0.23) and depression scores (R2 = 0.24), as well as clinically significant generalised anxiety (R2 = 0.14) and depression (R2 = 0.11). In addition, many sociodemographic factors were associated with elevated levels of COVID-19 related impacts, including being younger, female, having lower educational attainment and lower income. Limitations: The main limitations of the study were its modest sample size, cross sectional design (which pre-cluded inferences about directions of causality), and the relatively high socioeconomic status of the sample (which limited generalisability).Conclusions: These findings are consistent with a growing body of evidence that suggests that the pandemic has exacerbated existing inequalities, and further, point to particular groups that should be supported by post-COVID-19 recovery policies and initiatives.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da304d30769f375c2dba2fc78b4550f6",
  "timestamp": "2025-05-15T02:54:38.726196"
}