{
  "id": 6109,
  "title": "Investigating the relationship between missed/rationed nursing care and organizational commitment in Iranian nurses",
  "abstract": "Background and objective The primary objective of the nursing profession is to provide comprehensive and appropriate nursing care that meets the individual needs of patients. However, instances of missed/rationed nursing care can jeopardize the delivery of complete and safe healthcare, potentially putting patients' lives at risk. The level of organizational commitment demonstrated by nurses is likely to impact various personnel and organizational factors. Therefore, this study aims to predict instances of missed/rationed nursing care by examining the influence of organizational commitment. Method This descriptive and cross-sectional study will be conducted in 2023. Three hundred nurses working in general and intensive critical care units at Tehran University of Medical Sciences hospitals were randomly selected. Data collection included Allen and Mayer's organizational commitment questionnaires, Kalish's missed care questionnaire, and demographic variables. A multiple linear regression model was used to analyze the prediction of missed care by commitment and other variables. The relationship between these variables was also explored using SPSS version 26 software. Findings Half of the nurses reported occasionally missing nursing care. Moreover, more than half of the nurses reported moderate organizational commitment in all dimensions. The most significant reasons identified by nurses for missed care were financial resources, human resources, and communication (p < 0.001). There was a significant relationship between missed/rationed nursing care and organizational commitment (p = 0.042). In the multiple regression equation, a significant portion of missed care due to commitment was predicted when considering demographic variables (p < 0.001). Conclusion By understanding the relationship between organizational commitment and missed care, and identifying the factors contributing to missed/rationed care, managers can improve the efficiency of human resources and allocate appropriate financial resources. Establishing effective communication with employees can also enhance their commitment to addressing neglected care, ultimately reducing instances of oversight.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da5d84e5b588c3c024aaefe9294074a3",
  "timestamp": "2025-05-15T02:54:39.154815"
}