{
  "id": 3773,
  "title": "THE IMPACT OF SOVEREIGN WEALTH FUND OWNERSHIP ON THE FINANCIAL PERFORMANCE OF FIRMS: THE EVIDENCE FROM EMERGING MARKETS",
  "abstract": "Sovereign Wealth Funds have been regarded as investment vehicles established in order to manage, in a rational and profit-oriented way, pools of national wealth for future generations. SWFs are among the most important financial institutions in global financial markets, and constitute a solid element in the architecture of the international financial safety net. Similarly to other institutional investors, Sovereign Wealth Funds possess huge amounts of capital. What distinguishes them the most from other financial institutions is the fact that they are owned, managed and controlled by sovereign states, have limited liquidity needs, a lower-than-market-average-level of redemption risk, a long-term, intergenerational investment horizon and relatively high risk tolerance. The question of whether investment from Sovereign Wealth Funds determines changes in corporate financial performance of a targeted firm is still unanswered question in the literature. This study tests empirically the impact of Sovereign Wealth Funds' ownership on the financial performance of targeted companies. Using the data of companies listed on the Warsaw Stock Exchange, we employ regression to analyze the relationship between the funds' investment and accounting, as well as the market outcomes of the firm. The empirical findings of this research suggest that Sovereign Wealth Funds' ownership has a positive influence on the price to book value of the firm. This article contributes to ongoing research in the field of studies related to financial aspects of SWF's investment behavior. The empirical findings of this research can also serve as a useful reference for companies and academics concerning themselves with investment decision making in emerging markets, as well as the role of institutional investors.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da694b8223bb2883ce638f29157ed292",
  "timestamp": "2025-05-15T02:29:59.129171"
}