{
  "id": 5534,
  "title": "Updated Benchmarks for Projecting Fixed and Variable Components of Hotel Financial Performance",
  "abstract": "An analysis of financial ratios for 601 hotels finds that room revenue, rather than occupancy, is the strongest driver of both departmental expenses and revenues for food, beverage, and other income. The study, which provides updated benchmarks for projecting fixed and variable components of hotel financial performance, finds that hotels generally became more efficient during the study period, 2001 to 2012, with the result that the fixed portion of many expenses declined. These lower fixed expenses appear to be reflected in lower capitalization rates for hotels because expenses are a factor in the risk level of an investment. While hoteliers may wish to use this regression methodology to develop their own analysis, the benchmarks presented are in many cases substantially different from past findings. As examples, the analysis found fixed departmental expense percentages as follows: rooms, 36 percent; food and beverage, 29 percent; and other income, 25 percent. Surprisingly, certain undistributed operating expenses that were considered to be largely fixed also have a substantial variable aspect. Thus, just 33 percent of administrative and general costs were fixed for this sample, as were 29 percent of marketing costs and 33 percent of utilities expenses.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da6cc9ac6057ce7917ded238409c6758",
  "timestamp": "2025-05-15T02:48:51.321152"
}