{
  "id": 5320,
  "title": "Case-control study of frequent visitors to an urban psychiatric emergency service",
  "abstract": "Objective: The purpose of this study was to identify risk factors for people who use psychiatric emergency services repeatedly and I to estimate their financial charges., Methods: The authors used interviews and chart reviews to compare 74 patients who had six or more visits to an urban psychiatric emergency service in the 12 months before an index visit with 74 patients who had five or fewer visits. Multivariate logistic regression was used to identify independent risk factors. Results: Independent risk factors for frequent visitors were self-reported hospitalization in the past 12 months, need for medications as the self-reported reason for seeking care, being homeless or living in an institution, and not giving the name of a friend or family member for interview. The level of burden for support of persons who were interviewed was low and did not differ between frequent and infrequent visitors. Compared with infrequent visitors, frequent visitors had greater utilization of inpatient and outpatient behavioral health services, general emergency services, and crisis residential services in the 12 months before the index visit and greater utilization of general emergency services and psychiatric emergency services in the three months after the index visit. Frequent visitors' median financial charge for those services was $16,200 greater (5.9 times greater) than that of infrequent visitors. Conclusions: Frequent visitors represent resource-poor mentally ill persons who have high levels of utilization of health care facilities besides psychiatric emergency services. Possible clinical interventions for these patients include focused medication reviews.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da76bb9936e92738085a11532c66e678",
  "timestamp": "2025-05-15T02:46:44.863299"
}