{
  "id": 3128,
  "title": "Pre-diagnosis employment status and financial circumstances predict cancer-related financial stress and strain among breast and prostate cancer survivors",
  "abstract": "Cancer may have a significant financial impact on patients, but the characteristics that predispose patients to cancer-related financial hardship are poorly understood. We investigated factors associated with cancer-related financial stress and strain in breast and prostate cancer survivors in Ireland, which has a complex mixed public-private healthcare system. Postal questionnaires were distributed to 1373 people diagnosed with cancer 3-24 months previously identified from the National Cancer Registry Ireland. Outcomes were cancer-related financial stress (impact of cancer diagnosis on household ability to make ends meet) and financial strain (concerns about household financial situation since cancer diagnosis). Modified Poisson regression was used to estimate relative risks (RR) for factors associated with cancer-related financial stress and strain. Seven hundred forty survivors participated (response rate = 54 %). Of the respondents, 48 % reported cancer-related financial stress and 32 % cancer-related financial strain. Compared to those employed at diagnosis, risk of cancer-related financial stress was significantly lower in those not working (RR = 0.71, 95 % CI 0.58-0.86) or retired (RR = 0.48, 95 % CI 0.34-0.68). It was significantly higher in those who had dependents; experienced financial stress pre-diagnosis; had a mortgage/personal loans; had higher direct medical out-of-pocket costs; and had increased household bills post-diagnosis. For cancer-related financial strain, significant associations were found with dependents, pre-diagnosis employment status and pre-diagnosis financial stress; risk was lower in those with higher direct medical out-of-pocket costs. Cancer-related financial stress and strain are common. Pre-diagnosis employment status and financial circumstances are important predictors of post-diagnosis financial wellbeing. These findings could inform development of tools to identify patients/survivors most in need of financial advice and support.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da7c346ecdd28624ec4ddced8946c588",
  "timestamp": "2025-05-15T02:22:56.691015"
}