{
  "id": 9016,
  "title": "Decomposing the inequalities in the catastrophic health expenditures on the hospitalization in India: empirical evidence from national sample survey data",
  "abstract": "Introduction Sustainable Development Goal (SDG) Target 3.8.2 entails financial protection against catastrophic health expenditure (CHE) by reducing out-of-pocket expenditure (OOPE) on healthcare. India is characterized by one of the highest OOPE on healthcare, in conjunction with the pervasive socio-economic disparities entrenched in the population. As a corollary, India has embarked on the trajectory of ensuring financial risk protection, particularly for the poor, with the launch of various flagship initiatives. Overall, the evidence on wealth-related inequities in the incidence of CHE in low- and middle-Income countries has been heterogenous. Thus, this study was conducted to estimate the income-related inequalities in the incidence of CHE on hospitalization and glean the individual contributions of wider socio-economic determinants in influencing these inequalities in India.Methods The study employed cross-sectional data from the nationally represented survey on morbidity and healthcare (75th round of National Sample Survey Organization) conducted during 2017-2018, which circumscribed a sample size of 1,13,823 households and 5,57,887 individuals. The inequalities and need-adjusted inequities in the incidence of CHE on hospitalization care were assessed via the Erreygers corrected concentration index. Need-standardized concentration indices were further used to unravel the inter- and intra-regional income-related inequities in the outcome of interest. The factors associated with the incidence of CHE were explored using multivariate logistic regression within the framework of Andersen's model of behavioral health. Additionally, regression-based decomposition was performed to delineate the individual contributions of legitimate and illegitimate factors in the measured inequalities of CHE.Results Our findings revealed pervasive wealth-related inequalities in the CHE for hospitalization care in India, with a profound gap between the poorest and richest income quintiles. The negative value of the concentration index (EI: -0.19) indicated that the inequalities were significantly concentrated among the poor. Furthermore, the need-adjusted inequalities also demonstrated the pro-poor concentration (EI: -0.26), denoting the unfair systemic inequalities in the CHE, which are disadvantageous to the poor. Multivariate logistic results indicated that households with older adult, smaller size, vulnerable caste affiliation, poorest income quintile, no insurance cover, hospitalization in a private facility, longer stay duration in the hospital, and residence in the region at a lower level of epidemiological transition level were associated with increased likelihood of incurring CHE on hospitalization. The decomposition analysis unraveled that the contribution of non-need/illegitimate factors (127.1%) in driving the inequality was positive and relatively high vis-a-vis negative low contribution of need/legitimate factors (35.3%). However, most of the unfair inequalities were accounted for by socio-structural factors such as the size of the household and enabling factors such as income group and utilization pattern.Conclusion The study underscored the skewed distribution of CHE as the poor were found to incur more CHE on hospitalization care despite the targeted programs by the government. Concomitantly, most of the inequality was driven by illegitimate factors amenable to policy change. Thus, policy interventions such as increasing the awareness, enrollment, and utilization of Publicly Financed Health Insurance schemes, strengthening the public hospitals to provide improved quality of specialized care and referral mechanisms, and increasing the overall budgetary share of healthcare to improve the institutional capacities are suggested.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da806e313c81ccc9ab7b9c05248d2ea6",
  "timestamp": "2025-05-15T03:24:54.867455"
}