{
  "id": 4344,
  "title": "Factors affecting profitability of pharmaceutical company: an Indonesian evidence",
  "abstract": "Purpose The purpose of this paper is to examine the factors affecting profitability of pharmaceutical company in Indonesia. While research and development has been the main discussed issues in pharmaceutical sector development, scant attention has been paid to profitability factors determined by financial ratio specifically. The industry itself faces significant disruption with the implementation of universal health coverage in Indonesia. This study investigates the factors affecting profitability in an Indonesian pharmaceutical company after the national health insurance policy implementation. Design/methodology/approach This research is based on five independent variables (IVs) with six measurements that were empirically examined for their relationship with profitability. These variables are firm size (as measured by total sales), company efficiency (assets turnover), liquidity (current ratio), market power (the Lerner index) and a firm's growth (as measured by sales growth and sustainable growth rate). Data of ten pharmaceutical companies listed on the Indonesia Stock Exchange covering the period of 2014-2018 were extracted from companies' annual reports. Pooled ordinary least squares regression and fixed effects were used to analyze the data. Findings The findings show strong and positive relationships between liquidity and sustainable growth rate with profitability as measured by return on equity (ROE), return on assets (ROA) and earning per share (EPS), except EPS for liquidity. Further, both firm size and market power show positive significant relationships with ROA but negative significant relationships with EPS. Sales growth and company efficiency (as measured by assets turnover ratio) have no significant relationship with profitability. Research limitations/implications Due to data availability, the data include only listed pharmaceutical companies in the Indonesia Stock Exchange. Practical implications These results benefit internal users (such as managers, shareholders and employees). They can realize the determinants of enhancing the profitability of their company after the implementation of universal health coverage from the Indonesian government (JKN - Jaminan Kesehatan Nasional) since 2014. On the other side, other external users (such as investors, creditors, newly established pharmaceutical companies and tax authorities) also may get advantages of these results. It is clear that a significant impact happened upon this new policy implementation, and how an Indonesian pharmaceutical company will be profitable in the future. The relevance of company's business strategy (product and customer portfolio, competitor intelligence, etc.) with the profitability factors from this study can be further scrutinized as further consideration for both internal and external users. Originality/value This study differs from previous studies in many ways; first, it focuses on pharmaceutical companies in Indonesia. Previous studies have concentrated on different countries and companies in other sectors, such as services, banking and financial institutions or on industrial organizations. Second, this study analyzes the data from pharmaceutical companies' annual reports since 2014. There was a significant event of universal health coverage (national health insurance) implementation from the Indonesian government. Third, the study used ROE, ROA and EPS as indicators of profitability. Last but not least, the results of the study provide empirical evidence that firms with significant market power, good liquidity and well-managed sustainable growth rate improve operating income and ultimately enhance profitability.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da89a7b40dba191b7859157ce0e17a31",
  "timestamp": "2025-05-15T01:26:26.181642"
}