{
  "id": 6953,
  "title": "Ten-Year Trends and Independent Risk Factors for Unplanned Readmission Following Elective Total Joint Arthroplasty at a Large Urban Academic Hospital",
  "abstract": "Background: Total joint arthroplasty procedures continue to provide consistent, long-term success and high patient satisfaction scores. However, early unplanned readmission to the hospital imparts significant financial risks to individual institutions as we shift away from the traditional fee-for-service payment model. Methods: Using a combination of our hospital's administrative database and retrospective chart reviews, we report the 30-day and 90-day readmission rates and all causes of readmission following all unilateral, primary elective total hip and knee arthroplasty procedures at a large, urban, academic hospital from 2004 to 2013. Results: In total, 1165 primary total hip (511) and knee (654) arthroplasty procedures were identified, and the 30-day and 90-day unplanned readmission rates were 4.6% and 7.3%, respectively. A multivariate regression model controlled for a variety of potential clinical and surgical confounders. Increasing body mass index levels, an American Society of Anesthesiologists score of >= 3, and discharge to an inpatient rehab facility each independently correlated with risk of both 30-day and 90-day unplanned readmission to our institution. Additionally, use of general anesthesia during the procedure independently correlated with risk of readmission at 30 days only, while congestive heart failure independently correlated with risk of 90-day unplanned readmission. Readmissions related directly to the surgical site accounted for 47% of the cases, and collectively totaled more than any single medical or clinical complication leading to unplanned readmission within the 90-day period. Conclusion: Increasing body mass index values, general anesthesia, an American Society of Anesthesiologists score of >= 3, and discharge to an inpatient rehab facility each were independent risk factors for early unplanned readmission. (C) 2017 Elsevier Inc. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da963552faa6d6a2e91ab8154e290eba",
  "timestamp": "2025-05-15T03:03:13.526694"
}