{
  "id": 580,
  "title": "Reprint of: Ex-ante expected changes in ESG and future stock returns based on machine learning",
  "abstract": "This study has two primary objectives. Firstly, it enhances the reliability and transparency of machine-learning-based models for predicting future changes in environmental, social and governance (ESG) performance. Secondly, it explores the relationship between ex-ante expected changes in ESG and future stock returns. This study collects 3258 STOXX Europe 600 firm-year observations. In the ESG prediction phase, two machine learning algorithms (logistic regression and random forest) are utilised to develop ESG forecasting models. Hyperparameter optimisation and walk-forward validation techniques are employed to address issues of underestimation and information leakage. The machine-learning-based ESG forecasting models are evaluated using three metrics: accuracy, area under the curve (AUC) and area under the precision-recall curve (AUPR). Subsequently, this study investigates the relationship between ex-ante expected ESG changes and future stock returns using the predicted ESG changes. A positive correlation is found between ex-ante expected ESG changes and future stock returns. The supplementary tests also reveal that this positive relationship is highly and statistically significant among large firms and after the COVID-19 pandemic. Moreover, this study introduces a robust and transparent approach for constructing effective machine-learning-based ESG forecasting models using hyperparameter optimisation and walk-forward validation. Additionally, traditional regression analyses are modernised by incorporating machine-learning-predicted independent variables. Furthermore, the findings provide empirical support for stakeholder, agency and resource-based theories. Finally, practical insights are provided to facilitate ESG-focused investment portfolio decision making.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da9b4811ee79ec4bc8decec3edce2d66",
  "timestamp": "2025-05-15T00:45:01.373577"
}