{
  "id": 4142,
  "title": "Intergenerational support, activities of daily living, and the interaction on psychological distress in older adults",
  "abstract": "Objectives: The purpose of this study is to examine the effects of intergenerational support and activities of daily living (ADL) on psychological distress in older adults, and to analyse the effects of the interaction between ADL and intergenerational support on psychological distress in older adults. Methods: A probability sample of 1,065 older adults aged 60 and above was conducted in Xuzhou, China, from 18 June to 26 August 2023. ADL was assessed using the ADL scale combined with the Barthel Index; Intergenerational support was measured using the Intergenerational Support Scale; and psychological distress was measured using the Kessler 10 scale. An ordered multichotomous logistic regression model was constructed to analyse the factors influencing psychological distress in the elderly. The interaction model was constructed by one-way analysis of variance to further analyse the effect of the interaction between financial support, instrumental support and emotional support and ADL on psychological distress in the elderly. Results: Elderly living in rural areas, with an annual household income of less than 30,000 yuan, who engaged in manual labor before retirement, who did not receive financial support and who received instrumental support were more likely to experience psychological distress, and the higher the degree of restriction in ADL, the higher the risk of psychological distress. A significant interaction was observed between ADL and financial support (F=221.570, p<0.05), as well as between ADL and emotional support (F=399.805, p<0.01). Additionally, a significant interaction was found among ADL, financial support, and instrumental support (F=227.187, p<0.05). Conclusion: (1) A significant association between place of residence, annual household income, occupation, financial support, instrumental support, ADL, and psychological distress in older adults; (2) When the level of ADL was moderate, the risk of psychological distress in older adults who received emotional support was significantly lower than that of older people who did not receive emotional intergenerational support; When the level of ADL was completely independent, financial support was beneficial in reducing psychological distress in the elderly; (3) the risk of psychological distress in the elderly who received instrumental support increased with the severity of ADL limitations, regardless of whether they received additional financial support.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "da9f4383634b3567ec593dfae8cac430",
  "timestamp": "2025-05-15T02:33:42.063135"
}