{
  "id": 8565,
  "title": "The impact of non-timely 10-Q filings and audit firm size on audit fees",
  "abstract": "Purpose Prior studies suggest that non-timely 10-Q filings indicate higher potential risks than non-timely 10-K filings. Furthermore, larger audit firms tend to be more risk-averse and conservative about reporting. Inspired by these research streams, this paper aims to investigate the influence of non-timely 10-Q filings on audit fees and the impact of audit firm size on this association. Design/methodology/approach The cross-sectional audit fee regression model used in this study is similar to that used in prior audit fee research (Simunic, 1980; Francis et al., 2005; Hay et al., 2006; Wang et al., 2013). The model includes the following five major characteristics that would influence auditors' fee decisions: auditee size (LNAT), complexity (REIVAT, FOREIGN, SEG), financial condition (LOSS, ROA, GROWTH, ZSCORE), special events (ICW, RESTATE, INITIAL, GC) and auditor type (BIG4). To examine the effect of non-timely 10-Q filings on audit fees, the variable NT10Q is included in the audit fee model. Findings The results indicate that when both non-timely 10-K and non-timely 10-Q filings are included in the regression model, only non-timely 10-Q filings are significantly associated with higher audit fees, suggesting that the presence of non-timely 10-Q filings signals more serious underlying problem than non-timely 10-K filings in the audit fees decision processes. In addition, we find that audit fees for firms audited by Big 4 auditors are 26.4 per cent higher when those firms file non-timely 10-Q reports, whereas there is no significant association between non-timely 10-Q filings and audit fees for firms audited by non-Big 4 auditors. Practical implications As no attention has been paid to the investigation of the impact of non-timely 10-Q filings on audit fees, with the aim of filling the gap of this specific research area, this study examines the association between non-timely 10-Q filings and audit fees and the influence of audit firm size on this association. Originality/value The contribution of this paper is threefold: first, it is the first study to examine the association between non-timely 10-Q filings and audit fees. The results show that non-timely 10-Q filings are a better and earlier indicator of audit risk than non-timely 10-K filings. Second, the results reveal that the relationship between non-timely 10-Q filings and audit fees is affected by audit firm size. Specifically, Big 4 auditors tend to charge higher audit fees in the presence of non-timely 10-Q filings, reflecting that they are more sensitive to audit risk than smaller audit firms are. Third, an examination of the quarterly effect of non-timely 10-Q filings on audit fees indicates a stronger effect from the first quarter's non-timely 10-Q filings, compared to the second or third quarter.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "daa8801a7995255451eb12dbdeab5560",
  "timestamp": "2025-05-15T03:20:22.142834"
}