{
  "id": 6685,
  "title": "Reproduction, Functional Autonomy and Changing Experiences of Intimate Partner Violence Within Marriage in Rural India",
  "abstract": "CONTEXT: The literature on intimate partner violence in resource-poor contexts relies primarily on cross-sectional studies. Because changes in women's status and empowerment are hypothesized to influence violence vulnerability, longitudinal studies are needed to determine the potential benefits and harms associated with such changes. METHODS: Data were collected prospectively from a representative cohort of 4,749 married women in rural areas of four socially and demographically diverse states in India in 1998-1999 and 2002-2003.A multinomial regression model including social and demographic characteristics and intersurvey changes and events related to functional autonomy and reproduction was fitted to a categorical outcome measuring the absence (reference), initiation, cessation and continuation of intimate partner violence. RESULTS: Continued freedom of movement, increased freedom of movement and continued financial autonomy between baseline and follow-up were associated with a lower risk of violence initiation rather than no violence (relative risk ratio, 0.7 for each). Having a first child was associated with lower risk of violence initiation and continuation rather than no violence (0.6 and 0.2, respectively). Women who reported that their relative economic contribution to the household decreased or increased and women who experienced an unwanted pregnancy had a higher risk of violence continuation rather than no violence (1.8,1.8 and 1.5, respectively). The death of a child was associated with higher risk of violence initiation rather than no violence (1.4). CONCLUSION: Future research to inform interventions to reduce intimate partner violence should consider how changes in women's reproductive experiences and functional autonomy may be linked to changes in intimate partner violence.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "daa85fa5055a300e3c91c49aef4ab604",
  "timestamp": "2025-05-15T03:00:35.427053"
}