{
  "id": 3699,
  "title": "Supply chains and supply networks: distinctions and overlaps",
  "abstract": "Purpose - Although supply chain management is now an established field, the distinction between supply chains and supply networks is relatively immature and requires further investigation. The purpose of this paper is to clarify the distinction between supply chains and supply networks. Design/methodology/approach - Based on a review of the literature and assisted by input from academic experts during a relevant supply chain management workshop, this paper critiques seminal and extant theoretical developments in the field of supply chain management. Findings - The main contribution of this paper is the development of an outline classification of relevant dimensions where the concepts of supply chain and supply network are compared and their distinctive features are highlighted. The paper identifies strategic opportunities emanating from considering both the supply chain and supply network, and the associated levels of engagement with active and inactive members in terms of, inter alia, complexity, members' interdependencies and risk resilience. Originality/value - The paper highlights many theoretical and practical implications following a detailed analysis of an engagement-based portfolio of relationships within complex supply systems. The systematic clarification of these two concepts and their boundaries result in the provision of original insights which will assist the future research agenda of the academic community.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dab9ea76245167203cd02925fd0d9b9b",
  "timestamp": "2025-05-15T01:20:03.384200"
}