{
  "id": 6928,
  "title": "Temporary Financial Assistance for Housing Expenditures and Mortality and Suicide Outcomes Among US Veterans",
  "abstract": "INTRODUCTION: It is unclear whether interventions designed to increase housing stability can also lead to improved health outcomes such as reduced risk of death and suicide morbidity. The objective of this study was to estimate the potential impact of temporary financial assistance (TFA) for housing-related expenses from the US Department of Veterans Affairs (VA) on health out- comes including all-cause mortality, suicide attempt, and suicidal ideation.METHODS: We conducted a retrospective national cohort study of Veterans who entered the VA Supportive Services for Veteran Families (SSVF) program between 10/2015 and 9/2018. We assessed the association between TFA and health outcomes using a multivariable Cox proportional hazards regression approach with inverse probability of treatment weighting. We conducted these analyses on our overall cohort as well as separately for those in the rapid re-housing (RRH) and homelessness prevention (HP) components of SSVF. Outcomes were all-cause mortality, suicide attempt, and suicidal ideation at 365 and 730 days following enrollment in SSVF.RESULTS: Our analysis cohort consisted of 41,969 unique Veterans with a mean (SD) duration of 87.6 (57.4) days in the SSVF program. At 365 days following SSVF enrollment, TFA was associated with a decrease in the risk of all-cause mortality (HR: 0.696, p < 0.001) and suicidal ideation (HR: 0.788, p < 0.001). We found similar results at 730 days (HR: 0.811, p = 0.007 for all cause mortality and HR: 0.881, p = 0.037 for suicidal ideation). These results were driven primarily by individuals enrolled in the RRH component of SSVF. We found no association between TFA and suicide attempts.CONCLUSION: We find that providing housing-related financial assistance to individuals facing housing instability is associated with improvements in important health outcomes such as all-cause mortality and suicidal ideation. If causal, these results suggest that programs to provide housing assistance have positive spillover effects into other important aspects of individuals' lives.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dabbbf6a7bab23ba3128c06178223cb3",
  "timestamp": "2025-05-15T03:03:13.437826"
}