{
  "id": 1633,
  "title": "Neural Network Modeling Based on the Bayesian Method for Evaluating Shipping Mitigation Measures",
  "abstract": "Climate change caused by greenhouse gas emissions is of critical concern to international shipping. A large portfolio of mitigation measures has been developed to mitigate ship gas emissions by reducing ship energy consumption but is constrained by practical considerations, especially cost. There are difficulties in ranking the priority of mitigation measures, due to the uncertainty of ship information and data gathered from onboard instruments and other sources. In response, a neural network model is proposed to evaluate the cost-effectiveness of mitigation measures based on decarbonization. The neural network is further enhanced with a Bayesian method to consider the uncertainties of model parameters. Three of the key advantages of the proposed approach are (i) its ability to simultaneously consider a wide range of sources of information and data that can help improve the robustness of the modeling results; (ii) the ability to take into account the input uncertainties in ranking and selection; (iii) the ability to include marginal costs in evaluating the cost-effectiveness of mitigation measures to facilitate decision making. In brief, a negative marginal cost-effectiveness would indicate a priority consideration for a given mitigation measure. In the case study, it was found that weather routing and draft optimization could have negative marginal cost-effectiveness, signaling the importance of prioritizing these measures.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dac155520bf1c520bbb259606d9f5542",
  "timestamp": "2025-05-15T00:57:46.924589"
}