{
  "id": 6244,
  "title": "Health insurance and financial hardship in cancer survivors during the COVID-19 pandemic",
  "abstract": "Uninsured or underinsured individuals with cancer are likely to experience financial hardship, including forgoing healthcare or non-healthcare needs such as food, housing, or utilities. This study evaluates the association between health insurance coverage and financial hardship among cancer survivors during the COVID-19 pandemic. This cross-sectional analysis used Patient Advocate Foundation (PAF) survey data from May to July 2020. Cancer survivors who previously received case management or financial aid from PAF self-reported challenges paying for healthcare and non-healthcare needs during the COVID-19 pandemic. Associations between insurance coverage and payment challenges were estimated using Poisson regression with robust standard errors, which allowed for estimation of adjusted relative risks (aRR). Of 1,437 respondents, 74% had annual household incomes <$48,000. Most respondents were enrolled in Medicare (48%), 22% in employer-sponsored insurance, 13% in Medicaid, 6% in an Affordable Care Act (ACA) plan, and 3% were uninsured. Approximately 31% of respondents reported trouble paying for healthcare during the COVID-19 pandemic. Respondents who were uninsured (aRR 2.58, 95% confidence interval [CI] 1.83-3.64), enrolled in an ACA plan (aRR 1.86, 95% CI 1.28-2.72), employer-sponsored insurance (aRR 1.70, 95% CI 1.23-2.34), or Medicare (aRR 1.49, 95% CI 1.09-2.03) had higher risk of trouble paying for healthcare compared to Medicaid enrollees. Challenges paying for non-healthcare needs were reported by 57% of respondents, with 40% reporting trouble paying for food, 31% housing, 28% transportation, and 20% internet. In adjusted models, Medicare and employer-sponsored insurance enrollees were less likely to have difficulties paying for non-healthcare needs compared to Medicaid beneficiaries. Despite 97% of our cancer survivor sample being insured, 31% and 57% reported trouble paying for healthcare and non-healthcare needs during the COVID-19 pandemic, respectively. Greater attention to both medical and non-medical financial burden is needed given the economic pressures of the COVID-19 pandemic.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dacd0cabb070749e11bfd6f27bd7956b",
  "timestamp": "2025-05-15T02:56:10.979932"
}