{
  "id": 5607,
  "title": "Spillover effect of regulatory accounting inspections on accounting quality of peer companies",
  "abstract": "Purpose The purpose of this paper is to examine whether a negative outcome (i.e. a sanction) of an inspection by Korea's Financial Supervisory Service for an industry-leading company affects the accounting quality of other companies in the same industry. The premise is that when peer companies observe the negative results of such an inspection on a leader in their industry, they will be more concerned about their own risk during a future inspection and more likely to increase their accounting quality. Design/methodology/approach The authors conduct a mutivariate Oridnary Least Squares (OLS) regression using 11,476 South Korean samples from 2002 to 2016. The study uses ordinary least square regressions to test the hypotheses using discretionary accruals as a proxy for accounting quality. Findings The authors find that peer companies reduced their discretionary accruals in the next period and that this reduction is amplified according to the severity of the disciplinary action on the industry leader and the materiality of errors in that leader's financial statements. Originality/value This finding contributes to the literature by providing the first evidence of a spillover effect of regulatory inspection on accounting quality that financial reporting sanctions not only affect the overall accounting quality of the sanctioned company but also that of its peers in the same industry. The authors expect this study to lead to future research on the effect of other regulations on industry-wide accounting quality.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dad154d38449b7dd257538918d21f61d",
  "timestamp": "2025-05-15T02:49:21.772022"
}