{
  "id": 9135,
  "title": "A national perspective on palliative interventions for malignant gastric outlet obstruction",
  "abstract": "Background: Of note, 15% to 20% of patients with duodenal or periampullary malignancies develop gastric outlet obstruction (GOO). Although small randomized trials have reported more rapid recovery and shorter hospital stay with endoscopic stenting (ES), limited studies have evaluated outcomes at a national level. The current study characterized short-term clinical and financial outcomes associated with gastrojejunostomy (GJ) vs ES in malignant GOO. Methods: Adults with malignant GOO treated with ES or GJ were identified in the 2016-2020 Nationwide Readmissions Database. Entropy balancing was used to balance covariates between groups, and multivariate regression was used to evaluate the association between GJ or ES and in-hospital mortality, total parenteral nutrition (TPN) use, complications, length of stay (LOS), costs, and 90-day readmission. Results: Of 8186 patients with GOO, 5603 (68.4%) underwent ES, and 2583 (31.6%) underwent GJ. The cohorts were similar in age, female/male sex, and comorbidities. However, patients who underwent GJ were more commonly frail. After risk adjustment, mortality, composite complications, and 90-day readmission were comparable between patients who underwent GJ and those who underwent ES. GJ was associated with greater odds of blood transfusion (adjusted odds ratio [AOR], 1.74; 95% CI, 1.37-2.21) and postoperative TPN use (AOR, 3.76; 95% CI, 2.64-5.35). Furthermore, patients who underwent GJ experienced a significant increment of > $15,800 in costs and > 6.9 days in LOS. In subgroup analysis of patients with metastatic disease, mortality, complications, and readmission remained comparable among palliation strategies. Conclusion: ES seems to yield comparable short-term morbidity and mortality relative to GJ with significant cost reduction. Increasing access to endoscopic technology and regionalizing care to high-volume centers may help improve outcomes for patients with malignant GOO. (c) 2024 The Author(s). Published by Elsevier Inc. on behalf of Society for Surgery of the Alimentary Tract. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dad3a9a7a7ab6d23a981626085e8024b",
  "timestamp": "2025-05-15T03:25:54.605539"
}