{
  "id": 530,
  "title": "Performance Evaluation in the University Context: an investigation of literature from the Constructivist perspective",
  "abstract": "The objective of the article is to know and investigate the characteristics of Performance Evaluation in the University Context, from a Constructivist perspective. The intervention instrument used was the ProKnow-C which originated a Bibliographic Portfolio (BP) composed of 67 articles. The analysis and discussion of results made use of these stages: Literature Map, Bibliometric Analysis and Systemic Analysis. The Literature Map shows the predominance of studies addressing measurement elements and Performance Evaluation ( PE) models. The Bibliometric Analysis showed that most of the articles did not make use of the theoretical contribution of Organizational Performance Evaluation (OPE) regarding metrics. Systemic Analysis points out the misalignment between the evaluation made in the BP studies and the defined OPE concept. The contributions of the study refer to the verification of the paths taken by the literature and the analysis of PE instruments/models, helping to understand the possibilities of future research that seek to improve models and the participation of managers in this process. The originality lies in the knowledge generated by the mapping of aspects involving the field, enabling the identification of research gaps that point to the desire for future research that deepens the themes Intellectual Capital, Knowledge Management, HRM Practices and Performance Evaluation System.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dae36d8c8e65c17106f5ff5359ef6c53",
  "timestamp": "2025-05-15T00:37:01.785568"
}