{
  "id": 3742,
  "title": "The oil price uncertainty effect on stock returns of the Indian renewable energy firms under different market conditions",
  "abstract": "This study investigates the oil price uncertainty effect on stock return of the Indian renewable energy firms under different market conditions. We use the Oil Volatility Index (OVX) as a proxy of oil price uncertainty. All renewable energy companies listed on the National Stock Exchange of India are considered. Monthly data are analysed from January 2009 to December 2019 using panel quantile regression. In the whole sample of the renewable energy firms, we find that the impact of oil price volatility on stock return is negative only in extreme market conditions. In subgroups of renewable energy firms, oil price volatility has negative coefficients in most quantiles. The oil price volatility change is decomposed into positive and negative changes to investigate the asymmetric effect. In subgroups of renewable energy firms' analysis, most of the asymmetric effects of oil price volatility are seen in the bearish market condition. The policymakers can use the findings to formulate policies as per the oil price volatility movement to ensure the growth of the renewable energy sector. Investors and portfolio managers can make appropriate strategies based on oil price volatility to maximise the investment return across market conditions.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dae4835ed9088476e098d417000219d1",
  "timestamp": "2025-05-15T01:20:35.936554"
}