{
  "id": 4184,
  "title": "Correlates of interorganizational relationship strategies among critical access hospitals",
  "abstract": "Background: Interorganizational relationships (IORs) between hospitals and other health care providers have many potential benefits for critical access hospitals (CAHs) that operate in resource-constrained environments. Given the potential benefits of IORs, especially for CAHs, it is important to identify the conditions that support or hinder IOR development. However, most research examining IORs isolates individual types of relationships while ignoring the practical reality that many hospitals participate in a portfolio of relationships simultaneously. Purpose: The aim of the study was to examine the IOR strategies of CAHs as a function of market and organizational characteristics. Methodology: The sample consisted of CAHs operating in the United States between the years 2002 and 2012. For each year, hospitals were assigned to one of four mutually exclusive IOR categories: (a) no IOR, (b) vertical IOR only, (c) horizontal IOR only, and (d) both vertical and horizontal IOR. Organizational characteristics were categorized as structural, operational, and financial. Environmental characteristics were categorized as sociodemographic, physical, and health delivery system-related. A multinomial logistic regression model was used to assess the relationship between IOR strategies and organizational and environmental characteristics, with results reported as average marginal effects. Results: Approximately 41% of the CAHs were pursuing a combined vertical and horizontal IOR strategy, 20% were pursuing a vertical IOR-only strategy, 18% were pursuing a horizontal IOR-only strategy, and 21% were not engaged in an IOR strategy. Among the organizational characteristics, the type of IOR strategy used by a hospital varied as a function of ownership, total margin, days cash on hand, number of community orientation activities, and census. In contrast, among the environmental characteristics, only the number of community health centers in the community was associated with the type of IOR strategy pursued. Conclusion: CAHs' construction of IOR portfolios may be more dependent on organizational attributes than by environmental conditions.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "daee81acf47919c19beb5861b97a4d8d",
  "timestamp": "2025-05-15T01:24:25.477299"
}