{
  "id": 2915,
  "title": "Exploring rationality of peer-to-peer lending investors: A conceptual approach and multicriteria-based methodology",
  "abstract": "Research background: The shift towards globalization, technological innovations, and digitalization has led to the emergence of various innovative financial products, such as peer-to-peer (P2P) lending. Characterised by digital solutions and easier access, P2P lending allows investors to make quick and more frequent investment decisions. However, this can increase investors' vulnerability to behavioural biases, and therefore leave them open to potential losses. There is a research gap in understanding P2P lending investors' rationality, including research methods tailored to the specifics of this innovative product. Purpose of the article: Objectives of our study is to propose a conceptual approach and multicriteria-based methodology to measure the degree and type of investor rationality; to apply it in Lithuanian P2P lending context, and to explore the differences in rationality based on the investors' sociodemographic characteristics. Methods: The data set represented answers to an online survey collected from 390 Lithuanian P2P lending investors. Three groups of criteria were employed to assess rationality degree and type: risk and return (reflecting utility maximization), use of available information, and be- havioural biases criteria. The rationality index was developed to measure the rationality de- gree of individual P2P lending investors; descriptive and cluster analysis were performed to assess the rationality type; t -test, ANOVA test and regression analysis were used to investi- gate its influencing factors. Findings & value added: The results indicated a moderate overall degree of P2P lending investors' rationality, with bounded rationality representing 96,67% of the sample. Further clustering analysis proved that bounded rationality behaviour is not homogenous; therefore, measures taken to increase individual's rationality should be tailored to their specific rational- ity type primarily focusing on low -scoring rationality criterion. Regarding sociodemographic factors, investors' financial literacy was identified as the only significant and positive deter- minant of P2P lending investors' rationality, reinforcing the importance of financial literacy in society.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "db1c80049966e27b405452117706103c",
  "timestamp": "2025-05-15T02:20:48.095066"
}