{
  "id": 7740,
  "title": "Unravelling the Belgian cascade of hypertension care and its determinants: insights from a cross-sectional analysis",
  "abstract": "Background Hypertension is a major risk factor for cardiovascular disease and all-cause mortality worldwide. Despite the widespread availability of effective antihypertensives, blood pressure (BP) control rates remain suboptimal, even in high-income countries such as Belgium. In this study, we used a cascade of care approach to identify where most patients are lost along the continuum of hypertension care in Belgium, and to assess the main risk factors for attrition at various stages of hypertension management.Methods Using cross-sectional data from the 2018 Belgian Health Interview Survey and the Belgian Health Examination Survey, we estimated hypertension prevalence among the Belgian population aged 40-79 years, and the proportion that was (1) screened, (2) diagnosed, (3) linked to care, (4) in treatment, (5) followed up and (6) well-controlled. Cox regression models were estimated to identify individual risk factors for being unlinked to hypertension care, untreated and not followed up appropriately.Results The prevalence of hypertension based on self-reported and measured high BP was 43.3%. While 98% of the hypertensive population had their BP measured in the past 5 years, only 56.7% were diagnosed. Furthermore, 53.4% were linked to care, 49.8% were in treatment and 43.4% received adequate follow-up. Less than a quarter (23.5%) achieved BP control. Among those diagnosed with hypertension, males, those of younger age, without comorbidities, and smokers, were more likely to be unlinked to care. Once in care, younger age, lower BMI, financial hardship, and psychological distress were associated with a higher risk of being untreated. Finally, among those treated for hypertension, females, those of younger age, and without comorbidities were more likely to receive no adequate follow-up.Conclusion Our results show that undiagnosed hypertension is the most significant barrier to BP control in Belgium. Health interventions are thus needed to improve the accurate and timely diagnosis of hypertension. Once diagnosed, the Belgian health system retains patients fairly well along the continuum of hypertension care, yet targeted health interventions to improve hypertension management for high-risk groups remain necessary, especially with regard to improving treatment rates.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "db1d65cd184b5f862953a19ef5773506",
  "timestamp": "2025-05-15T03:11:38.546655"
}