{
  "id": 2190,
  "title": "A computational approach to evaluating curricular alignment to the united nations sustainable development goals",
  "abstract": "The United Nations (UN) considers universities to be key actors in the pursuit of the Sustainable Development Goals (SDGs). Yet, efforts to evaluate the embeddedness of the SDGs in university curricula tend to rely on manual analyses of curriculum documents for keywords contained in sustainability lexica, with little consideration for the diverse contexts of such keywords. The efficacy of these efforts, relying on expert co-elicitation in both subject-matter contexts and sustainability, suffers from drawbacks associated with keyword searches, such as limited coverage of key concepts, difficulty in extracting intended meaning and potential for greenwashing through keyword stuffing. This paper presents a computational technique, derived from natural language processing (NLP), which develops a sustainability lexicon of root keywords (RKs) of relative importance by adapting the Term Frequency-Inverse Document Frequency (TF-IDF) method to a corpus of sustainability documents. Identifying these RKs in module/course descriptors offers a basis for evaluating the embeddedness of sustainability in 5,773 modules in a university's curricula using classification criteria provided by the Association for the Enhancement of Sustainability in Higher Education's (AASHE). Applying this technique, our analysis of these descriptors found 286 modules (5%) to be sustainability focused and a further 769 modules (13%) to be sustainability inclusive, which appear to address SDGs 1, 17, 3, 7, and 15. Whilst this technique does not exploit machine learning methods applied to large amounts of trained data, it is, nevertheless, systemic and evolutive. It, therefore, offers an appropriate trade-off, which faculty with limited analytics skills can apply. By supplementing existing approaches to evaluating sustainability in the curriculum, the developed technique offers a contribution to benchmarking curricular alignment to the SDGs, facilitating faculty to pursue meaningful curricular enhancement, whilst complying with sustainability reporting requirements. The technique is useful for first-pass analyses of any university curriculum portfolio. Further testing and validation offer an avenue for future design-science research.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "db52f4678709835a9955744409be45d1",
  "timestamp": "2025-05-15T01:04:27.352411"
}