{
  "id": 0,
  "title": "A Fast Discovery Model for Production Financial Risk Using Large Language Model and Knowledge Graph",
  "abstract": "This paper focuses on building an innovative industrial financial risk rapid discovery model based on large language model and knowledge graph inference. Firstly, this work deeply analyzes the diversity, concealment and rapid propagation of industrial financial risks. Secondly, it points out the limitations of traditional risk assessment methods when dealing with massive and heterogeneous financial data. Then, it designs an integrated strategy to integrate the powerful natural language processing and understanding ability of large language models. Combined with the advantages of knowledge graph in structured information representation, this model analyzes financial text data through a large language model. Hence, key information can be automatically extracted and a preliminary risk knowledge base can be built. Finally, an industrial financial network can be established to realize correlation mining and dynamic evolution analysis of risk factors. The experimental results show that the model can effectively capture risk signals in the industrial chain, and detect potential financial risks in advance. This study not only enriches the theoretical framework of industrial financial risk management, but also provides strong technical support for risk prevention and control in practice.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "LLMs",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "db7af131b558d384de6e77c9e5123959",
  "timestamp": "2025-05-15T01:45:16.267521"
}