{
  "id": 342,
  "title": "House Prices Prediction Using Machine Learning Techniques",
  "abstract": "In places like Bangalore, developing predictive models for home selling prices is still a difficult and time-consuming job. The price at which houses in major cities are being sold as in bangalore is reliant on a variety of interconnected variables. The area of the house where you live may have a significant impact on the pricing. Property, including the physical location as well as the features and services on the property. Due to the fact that there has been research done and an analysis done by taking into account the data set that is still available to the general public using a machine to depict the various housing options platform for hack athons there are nine different variables in this collection of information. According to the findings of this investigation, attempts have been made to develop a model that can predict assessing the pricing in light of the influencing variables. Some regression methods, such as are used in modeling experiments, such the least squares method of multivariate linear regression, the lasso, and the ridge models of regression, support vector regression, and methods for enhancing such as extreme gradient boost regression (xg) methods; boost). These models are used in the construction of prediction models and in the analysis of decide on the most effective design by doing a comparison an examination of the disparity in prediction error between the two models. It is hoped that by doing this, a predictive model may be built for assessing the pricing in light of the influencing variables.",
  "year": 2022,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "db7af63e9722c4df54902fb435478da4",
  "timestamp": "2025-05-15T01:30:46.435541"
}