{
  "id": 3916,
  "title": "Auditors' response to readability of financial statement notes",
  "abstract": "Purpose The main objective of the present study is to assess the potential impact of readability of financial statement notes on the auditor's report lag, audit fees and going concern opinion (GCO). Design/methodology/approach The statistical population of this study includes all listed firms on the Tehran Stock Exchange (TSE) for the period of 2012-2017. The systematic elimination method is used for sampling and multiple regression and EViews software are used for testing the hypothesis models. Findings The obtained results show that there is a significant and positive relationship between audit report lags and readability of financial statements. Moreover, it is also revealed that readability of financial statements is positively associated with audit fees. Furthermore, the findings suggest a negative correlation between readability indexes and issuing GCOs, denoting hard-to-read statements is considered as a risk factor by auditors. Finally, the observations of our robustness tests suggest that the association between audit report lag and readability of financial statements is robust. Originality/value This is the first conducted investigation concerning auditor's response to the readability of financial statement notes in TSE. The outcome of current paper may pave the way for revising and developing Iranian accounting standards in order to give a fairer and clearer picture of financial reports.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "db8103665e0165662bfe5ef9926c2b96",
  "timestamp": "2025-05-15T02:31:28.334823"
}