{
  "id": 6802,
  "title": "The capital structure decisions of Islamic banks in the GCC",
  "abstract": "Purpose This study aims to find the determinants of the capital structure of Islamic banks in the Gulf Cooperation Council countries (GCC). The uniqueness of the case of Islamic banks stems from the fact that they are not only subject to the supervision of financial regulatory bodies that organize the banking sector (e.g. central banks) but also subject to the guidelines of Shari'ah law governing their financial transactions, products and contracts. Such characteristics are expected to have an impact on the capital structure decisions of Islamic banks compared to their conventional counterparts. Design/methodology/approach To achieve the research purpose, an empirical model was constructed to describe the relationship between leverage and the independent variables. The empirical model was tested through multivariate regression analysis using a panel data approach of 12 Islamic banks in the GCC for the period 2005-2014. Three types of regression analysis were used as follows: ordinary least squares (OLS), fixed-effect and random-effect regressions on panel data. Findings The research findings show that the leverage of Islamic banks in the GCC is positively related to size of the firm (SIZE) and growth opportunity (GROWTH); and it is negatively related to profitability of the firm (ROA), tangibility of the firm's assets (TANG) and financial market development (MRKT). The results indicate that larger Islamic banks tend to be relatively more diversified with higher credit ratings, which lower their cost of funding and relatively increase its profitability and the bank's customer/depositor base. The results also show that higher profitability ratios indicate relatively more internal funds to cover future investments, which leads to less reliance on external funds in the form of debt and/or equity. However, the higher the growth opportunities of Islamic banks, the faster the depletion rate of internal funding, and the more external debt financing is acquired to cover the expansion plans. In addition, the results show that in developed financial markets, savers tend to purchase less traditional depository products, and they prefer to invest directly in the financial markets to avoid higher commissions. The results are in line with the pecking order theory, which states that Islamic banks in the GCC tend to prefer sources of funds that have the least transaction cost and reveal minimal information to competitors. Hence, bank management resort to internally generated funds by its operations rather than acquiring external funds. Furthermore, the results are weakly explained by the agency theory, which states that as the firm assets become more tangible, the required monitoring cost is reduced; and hence, shareholders will have less tendency to raise more debt for the purpose of sharing the monitoring cost with debt holders. Research limitations/implications - This research study contributes to the theory of capital structure in re-validating the findings of a previous theoretical and empirical study on capital structure in the GCC and abroad. It helps understand the capital structure of Islamic banks in comparison with financial and nonfinancial firms. Future research is recommended in several areas. In terms of the methodology, it is recommended to conduct the research topic surveying management and financial executives of Islamic banks in the GCC; this will validate the results using a triangular approach supported by the findings of this paper. It is also recommended to apply the research methodology in other parts of the world where Islamic banking exists. Finally, as studies on the capital structure of financial institutions and other regulated sectors are rare, it is recommended to intensify research effort in these sectors to strengthen our knowledge of capital structure. Practical implications - From a practical perspective, this research bridges the gap between theory and practice in many aspects. The findings can serve Islamic bank executives as guidelines to understand the market and competitive reaction in response to capital structure decisions. On the other hand, research analysts and equity holders can use the findings in their debt and equity research valuations, assessment of the size of dividends and profit distributions, and to make more informed decisions to buy/sell financial securities. Furthermore, the findings help regulatory bodies to issue informed regulations in relation to capital adequacy ratios, reserve requirements, provisions and payout decisions to achieve policy intended purpose. In addition, organizations that are responsible for setting accounting and audit standards for Islamic banks will learn more about the industry practice; and hence, be able to pass practical standards. Moreover, the findings realize the recommendations of international financial regulatory bodies, such as the International Monetary Fund (IMF), the World Bank (WB) and other concerned organizations that emphasize the importance of further understanding of financial institution practices, to enable more effective formulation of risk management techniques, which may prevent future financial crisis. Originality/value This paper was amongst the few research studies conducted on determinants of capital structure in the GCC and specifically on the Islamic banking sector.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "db8571e945acbecfcbea6575974faea7",
  "timestamp": "2025-05-15T03:01:31.475755"
}