{
  "id": 5090,
  "title": "Psychosocial Factors Associated with Memory Complaints during the First Wave of the COVID-19 Pandemic: A Multi-Country Survey",
  "abstract": "This study assessed the associations between psychosocial factors (social isolation, social support, financial support and emotional distress) and memory complaints during the COVID-19 pandemic. This was a secondary analysis of data extracted from the dataset of participants recruited from 151 countries for a COVID-19 related mental health and wellness study between June and December 2020. The dependent variable was memory complaint, measured using the Memory Complaint Questionnaire. The independent variables were perception of social isolation, social support, financial support, emotional distress and history of SARS-CoV-19 infection. Confounding variables were age, sex at birth, level of education, employment status, HIV status and country-income level. Multivariable logistic regression was used to determine the associations between the dependent and independent variables after adjusting for the confounders. Of the 14825 participants whose data was extracted, 2460 (16.6%) had memory complaints. Participants who felt socially isolated (AOR: 1.422; 95% CI: 1.286-1.571), emotionally distressed (AOR: 2.042; 95% CI: 1.850-2.253) and with history of SARS-CoV-19 infection (AOR: 1.369; 95% CI: 1.139-1.646) had significantly higher odds of memory complaints. Participants who perceived they had social and financial support had significantly lower odds of memory complaints (AOR: 0.655; 95% CI: 0.571-0.751). Future management of pandemics like the COVID-19 should promote access to social and financial support and reduce the risk of social isolation and emotional distress.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dba08e9c79104f8ec7e3bcf4cd71458f",
  "timestamp": "2025-05-15T02:44:11.031514"
}