{
  "id": 5322,
  "title": "Does Firm Life Cycle Impact Corporate Investment Efficiency?",
  "abstract": "Corporate investment efficiency (CIE) is an imperative factor influencing the smooth functioning and financial sustainability of an enterprise. The role of a firm life cycle on risk and performance fundamentals has been extensively explored in the literature. However, it remains unclear as to whether the life cycle stages of a firm have any impact on corporate investment efficiency. This paper investigates the role of firm life cycle stages (FLCS) in determining the investment efficiency of 351 Pakistani non-financial listed firms over the course of 12 years (2005-2016). It used panel data fixed effects and ordinary least squares (OLS) techniques to empirically examine the proposed relationship. By employing Dickinson's FLCS measure, we found that CIE was lower during the introduction and decline stages and higher at the growth and maturity stages of a firm's life cycle. Moreover, the results of regression analysis revealed that mature firms enjoyed the highest level of investment efficiency followed by the growth firms. Overall, CIE exhibited an inverted U-shaped trend across FLCS. In addition, the findings corroborated the idea that the sample firms could not sustain their investment efficiency when they moved along different stages of the life cycle. Thus, policymakers are suggested to customize their investment policies for each stage of FLC to attain sustainable financial performance throughout the life of a firm.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbaf0b81f7a16f70d8c3eb16ff1f6880",
  "timestamp": "2025-05-15T02:46:44.868307"
}