{
  "id": 6727,
  "title": "Abuse and Subclinical Cardiovascular Disease Among Midlife Women The Study of Women's Health Across the Nation",
  "abstract": "Background and Purpose-Some evidence suggests that abuse may be related to cardiovascular disease (CVD) risk among women. However, this relation has largely been addressed using self-reported measures of CVD. We tested whether a history of abuse was related to subclinical CVD among midlife women without clinical CVD. Methods-The Study of Women's Health Across the Nation (SWAN) is a longitudinal cohort study of women transitioning through the menopause. One thousand four hundred two white, black, Hispanic, and Chinese SWAN participants completed measures of childhood and adult physical and sexual abuse, underwent a blood draw, completed physical measures, and underwent a carotid artery ultrasound at SWAN study visit 12. Associations between abuse and intima media thickness and plaque were tested in linear and multinomial logistic regression models controlling for age, site, race/ethnicity, financial strain, education, body mass index, lipids, blood pressure, measures of insulin resistance, smoking, alcohol use, physical activity, and medication use. Results-Findings indicated that a history of childhood sexual abuse was associated with higher intima media thickness controlling for standard CVD risk factors and other confounders (beta=0.022; SE=0.010; P<0.05; adjusted mean childhood sexual abuse: 0.800 mm versus no childhood sexual abuse: 0.782 mm). Conclusions-Childhood sexual abuse was associated with higher intima media thickness controlling for CVD risk factors and other confounders. These findings indicate the importance of considering the potential impact of early-life stressors on women's later cardiovascular health.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbc2d9402b3b5e61ef0a42d53bb70f1b",
  "timestamp": "2025-05-15T03:01:03.547786"
}