{
  "id": 4283,
  "title": "Modeling Competitive Adsorption between Methane and Water on Coals",
  "abstract": "Natural gas produced from coals, or coalbed methane (CBM), is a significant component of the energy portfolio for many countries. One challenge associated with CBM production is associated water. Specifically, coalbeds in situ contain significant amounts of water, and ideally this water is removed by pumping prior to the primary recovery of CBM to lower pressure and stimulate methane desorption. Such a prior water production can be challenging because desorption depends on the occurrence state of methane and water in situ, e.g., how much of each fluid is adsorbed or otherwise. Accordingly, primary objectives of this analysis include quantifying both the occurrence state of methane and water of different coals for a range of coalbed properties and conditions, and specifically quantifying the impact of coal moisture on methane desorption. Ultimate and proximate analysis and methane adsorption tests were first conducted on several coal samples from different basins. Simplified local density (SLD) theory was then tailored and applied to describe the adsorption characteristics of specific methane/water mixtures for each coal. Then, a fluid mixing rule was introduced to characterize competitive adsorption processes and a minimum potential energy method was applied to distinguish primary and secondary water adsorptions. Analysis of all resulting data included a regression analysis to obtain best fit parameters. Finally, an analytical reserve estimation method for methane and water was developed to quantify the extent of potential original reserves, and results of the method were compared to forecasts by conventional simulators. Combined results of all analyses suggest that both methane and water adsorptions decrease with temperature. While water adsorption decreases monotonically with pressure, methane adsorption first increases then decreases with pressure. Maximum methane adsorption occurs at approximately 10 MPa pressure. Water will compete with methane for adsorption sites, thus degrading the effective methane adsorption capacity of coal. Both methane and water adsorptions by coal can be effectively described by a competitive adsorption model, but the impact of moisture on methane desorption varies with temperature and pressure. With water divided into adsorbed and free states and with methane occurring in adsorbed, free, and dissolved forms, the proposed reserve estimation method predicted approximately the same original reserves as existing simulators predict, and also quantified how reserves change during CBM recovery.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbc7f67dad9ba58e4e729701ceb651b1",
  "timestamp": "2025-05-15T01:25:23.372346"
}