{
  "id": 6836,
  "title": "TyG index is positively associated with HOMA-IR in cholelithiasis patients with insulin resistance: Based on a retrospective observational study",
  "abstract": "Background/objective: Cholelithiasis is a common disease but pose significant global health and financial burdens. Mechanisms of the disease are associated with insulin resistance (IR), obesity, metabolic syndrome, and type 2 diabetes. Insulin resistance is commonly observed in cholelithiasis patients. More recently, the triglyceride-glucose (TyG) index has been proposed as an alternative marker of insulin resistance. In our study we aimed to understand whether the TyG index is correlated with HOMA-IR in cholelithiasis patients. And also we aimed the predict a cutoff value for determining insulin resistance in cholelithiasis patients. Methods: A total of 184 cholelithiasis patients were matched in terms of age, gender, and BMI. They were divided into two groups based on their Homa IR levels (IR and Non-IR group). This study was a retrospective, observational study and clinical data was obtained from electronic medical records. Cutoff value for Tyg index was established through ROC Analysis. Binary Logistic Regression was used to identify factors affecting insulin resistance. Results: A significant cutoff value was found for the TyG index in determining the presence of insulin resistance. Having a TyG index of >= 8.71 indicates the presence of insulin resistance. The sensitivity was 68.48%, the specificity was 58.70%. Binary Logistic Regression analyses showed that an increase in Tyg Index, waist circumference and waist-to-height ratio values increases the risk of insulin resistance by 2.705 (p = 0.001), 1.032 (p = 0.029), and 334.057 (p = 0.012) times respectively. Conclusion: Our study indicated that TyG index is positively correlated with HOMA-IR. TyG index was found as a risk factor for insulin resistance. (c) 2024 Asian Surgical Association and Taiwan Society of Coloproctology. Publishing services by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/ by-nc-nd/4.0/).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbc8535699daf07de22bfc3bf0eb6be6",
  "timestamp": "2025-05-15T03:02:07.482968"
}