{
  "id": 5732,
  "title": "The association between stressful life events and breast cancer risk: A meta-analysis",
  "abstract": "Breast cancer is the most prevalent cancer in women in Western societies. Studies examining the relationship between stressful life events and breast cancer risk have produced conflicting results. The purpose of this meta-analysis was to identify studies on this relationship, between 1966 and December 2002, to summarize and quantify the association and to explain the inconsistency in previous results. Summary odds ratios and standard errors were calculated, using random effect meta-regression analyses, for the following categories: stressful life events, death of spouse, death of relative or friend, personal health difficulties, nonpersonal health difficulties, change in marital status, change in financial status and change in environmental status. The presence of publication bias has been explored, and sensitivity analyses were performed to identify heterogeneity, using calculation of the percentage of variability due to heterogeneity, meta-regression analyses and stratification. Only the categories stressful life events (OR = 1.77, 95% CI 1.31-2.40), death of spouse(OR= 1.37, 95% CI 1.10-1.71) and death of relative or friend (OR = 1.35, 95% CI 1.09-1.68) showed a statistically significant effect. Publication bias was identified in both stressful life events (p = 0.00) and death of relative or friend (p = 0.02). Sensitivity analyses resulted in the identification of heterogeneity in all categories, except death of spouse. The results of this meta-analysis do not support an overall association between stressful life events and breast cancer risk. Only a modest association could be identified between death of spouse and breast cancer risk. (C) 2003 Wiley-Liss. Inc.",
  "year": 2003,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbd3c38830fb9317e5555567dc494c57",
  "timestamp": "2025-05-15T02:50:53.896094"
}