{
  "id": 899,
  "title": "Spatial Analysis and Risk Evaluation for Port Crisis Management Using Integrated Soft Computing and GIS-Based Models: A Case Study of Jazan Port, Saudi Arabia",
  "abstract": "A hazard zoning map is the most essential tool during the crisis management cycle's prevention and risk reduction phase. In this study, a geographic information system (GIS) is applied to the crisis management of ports through the preparation of a risk zoning map in Jazan Port, Saudi Arabia, using a novel integrated model of the fuzzy hierarchical analysis process and emotional artificial neural network (FAHP-EANN). The objective is to more accurately identify the highly potential risk zones in the port through hybrid techniques, which mitigates the associated life and financial damages through proper management during a probable hazard. Prior to creating the risk zoning map, every potential port accident is identified, categorized into six criteria, and assigned a weight through the utilization of a machine learning algorithm. The findings indicate that the three most effective criteria for the risks of Jazan Port are land fires, pollution and dangerous substances, and human behavior, respectively. A zoning map of all risks in Jazan Port was generated by using the weights obtained for each of the major accidents. This map may be utilized in the development of crisis prevention measures for the port and in the formation of crisis management units.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbd76df4c63661a394c219e5cdabe51b",
  "timestamp": "2025-05-15T01:56:17.600123"
}