{
  "id": 5313,
  "title": "Using digital financial inclusion and graph neural networks to prevent poverty recurrence in the revitalization of multiple villages in Henan Province",
  "abstract": "This study examines the impact of digital financial inclusion (DFI) and graph neural networks (GNNs) on preventing poverty recurrence and promoting sustainable rural revitalization in Henan Province. Significant differences in poverty alleviation policies across counties and cities in Henan affect the demand for and effectiveness of digital financial services, thus influencing the efficiency of policy implementation. Using the feasible generalized least squares method, the study measures multidimensional poverty vulnerability and explores the roles of DFI and GNNs in mitigating poverty risks. The study integrates data from the CFPS (China Family Panel Studies), Peking University Digital Financial Inclusion Index, and Henan Statistical Yearbook, employing graph convolutional networks and SHAP (Shapley Additive Explanation) to analyze the causes of poverty and identify high-risk households. Fixed effects and instrumental variable methods address endogeneity, with robustness verified through Probit and Logit regression models. Empirical results show that DFI and GNNs significantly reduce farmers' poverty vulnerability, with coefficients of -0.641 and -0.236, respectively, indicating a strong negative correlation with poverty vulnerability at the 1% significance level. In central and southern Henan, DFI alleviates poverty vulnerability, particularly in the economically weaker areas, but the digitalization index is positively correlated with poverty vulnerability, highlighting regional economic disparities. The findings suggest that DFI and GNNs are essential for poverty alleviation in Henan, particularly in underdeveloped areas, and should be tailored to local conditions for effective poverty reduction.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbe03d36714558220f8259eadd0774c6",
  "timestamp": "2025-05-15T02:46:44.842927"
}