{
  "id": 8856,
  "title": "Textbook outcome for the Norwood operation-an informative quality metric in congenital heart surgery",
  "abstract": "Objectives: To develop a more holistic measure of center performance than operative mortality, we created a composite textbook outcome for the Norwood operation using several postoperative end points. We hypothesized that achieving the textbook outcome would have a positive prognostic and financial impact. Methods: This was a single-center retrospective study of primary Norwood operations from 2005 to 2021. Through interdisciplinary clinician consensus, textbook outcome was defined as freedom from operative mortality, open or catheterbased reintervention, 30-day readmission, extracorporeal membrane oxygenation, cardiac arrest, reintubation, length of stay >75%ile from Society of Thoracic Surgeons data report (66 days), and mechanical ventilation duration >75%ile (10 days). Multivariable logistic regression and Cox proportional hazards modeling were used to determine predictive factors for textbook outcome achievement and association of the outcome with long-term survival, respectively. Results: Overall, 30% (58/196) of patients met the textbook outcome. Common reasons for failure to attain textbook outcome were prolonged ventilation (68/ 138, 49%) and reintubation (63/138, 46%). In multivariable analysis, greater weight (odds ratio [OR], 2.11; 95% confidence interval [CI], 1.17-3.95; P = .02) was associated with achieving the textbook outcome whereas preoperative shock (OR, 0.36; 95% CI, 0.13-0.87; P = .03) and longer bypass time (OR, 0.99; 95% CI, 0.98-1.00; P = .002) were negatively associated. Patients who met the outcome incurred fewer hospital costs ($152,430 [141,798-177,983] vs $269,070 [212,451-372,693], P < .001), and after adjusting for patient factors, achieving textbook outcome was independently associated with decreased risk of all-cause mortality (hazard Conclusions: Outcomes continue to improve within congenital heart surgery, making operative mortality a less-sensitive metric. The Norwood textbook outcome may represent a balanced measure of a successful episode of care.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbe3cb8b07862b4a3bc32f82f1e8f31b",
  "timestamp": "2025-05-15T03:22:57.952464"
}