{
  "id": 2860,
  "title": "Leveraging corporate governance characteristics for stock crash risk assessment",
  "abstract": "Causing considerable losses for individual investors, stock crashes are also potential triggers for wider financial crises. In contrast to existing research that primarily focuses on specific corporate governance characteristics in relation to stock crash risk, in this study, we construct a set of corporate governance attributes and employ machine learning techniques for a comprehensive assessment of stock crash risk. Through empirical analysis in the Chinese stock market, we find that our corporate governance attributes are effective indicators of stock crash risk, yielding statistically significant and economically meaningful crash risk assessment. Additionally, our heterogeneity tests suggest that firms with less concentrated shareholding result in superior assessment accuracy. This observation is consistent with prior findings that increased retail investor participation enhances corporate governance transparency, thereby contributing to better assessment performance. Industry-wise, the performance of crash risk assessment for real estate companies is higher than that for cultural, sports, and entertainment sectors. We speculate that these variations stem from industry-specific factors, such as business logic, operational models, and profit mechanisms. Our results also suggest that characteristics related to shareholder meetings are pivotal in assessing crash risks for manufacturing companies, while board-related features are essential for real estate firms. Overall, this study contributes to current literature by validating the feasibility of employing corporate governance characteristics to assess crash risk and by exploring the economic value of crash risk assessment. Furthermore, we discuss several valuable insights into the Chinese stock market through heterogeneity analysis.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbe95106dfba3f8844e9eded453a892f",
  "timestamp": "2025-05-15T02:19:46.762853"
}