{
  "id": 9462,
  "title": "Comparative Interrupted Time Series Analysis of Long-term Direct Medical Costs in Patients With Hip Fractures and a Matched Cohort: A Large-database Study",
  "abstract": "Background Previous studies on medical costs in patients with hip fractures have focused on medical costs incurred for a short period after the injury. However, patients often had comorbidities before their hip fractures that would have affected medical costs even had they not sustained a fracture. Consequently, these studies may have overestimated the costs associated with hip fractures and did not characterize the duration of increased medical costs adequately. Without knowing this crucial information, it is difficult to craft thoughtful health policy to support these patients' needs. Questions/purposes (1) To compare the direct medical costs for 5 years before fracture and up to 5 years after injury in a group of patients who underwent hip fracture surgery with a matched group of patients who did not experience a hip fracture, (2) to analyze the duration over which the increased direct medical costs associated with a hip fracture continues, and (3) to analyze whether there is a difference in direct medical costs according to age group using a nationwide claims database in South Korea. Methods The National Health Insurance Service Sample cohort in South Korea consisted of 1 million patients who were selected using a systematic, stratified, random sampling method from 48,222,537 individuals on December 31, 2006. Under a compulsory social insurance system established by the National Health Insurance Act, all patients were followed until 2015. Patients with hip fractures and matched controls were selected from the National Health Insurance Service sample of South Korea. Patients with hip fractures were defined as those who were hospitalized with a diagnosis of femoral neck fracture or intertrochanteric fracture and who underwent surgical treatment. We excluded patients with hip fractures before January 1, 2007 to ensure a minimum 5-year period that was free of hip fractures. Patients with hip fractures were matched with patients of the same age and gender at the date of admission to an acute care hospital for surgery (time zero). If patients with hip fractures died during the follow-up period, we performed matching among patients whose difference from the time of death was within 1 month. This method of risk-set matching was repeated sequentially for the next patient until the last patient with a hip fracture was matched. We then sequentially performed 1:5 random sampling for each risk set. A total of 3583 patients in the hip fracture cohort (patients with hip fractures) and 17,915 patients in the matched cohort (those without hip fractures) were included in this study. The mean age was 76 +/- 9 years, and 70% were women in both groups. Based on the Charlson comorbidity index score, medication, and medical history, the patients with hip fractures had more comorbidities. Person-level direct medical costs per quarter were calculated for 5 years before time zero and up to 5 years after time zero. Direct medical costs were defined as the sum of that insurer's payments (that is, the National Health Insurance Service's payments), and that patient's copayments, excluding uncovered payments. We compared direct medical costs between patients with hip fractures and the patients in the matched cohort using a comparative interrupted time series analysis. The difference-in-difference estimate is the ratio of the differences in direct medical costs before and after time zero in the hip fracture cohort to the difference in direct medical costs before and after time zero in the matched cohort; the difference in difference estimates were calculated each year after injury. To identify changes in direct medical cost trends in patients with hip fractures and all subgroups, joinpoint regression was estimated using statistical software. Results The direct medical costs for the patients with hip fractures were higher than those for patients in the matched cohort at every year during the observation period. The difference in direct medical costs between the groups before time zero has increased every year. The direct medical costs in patients with hip fractures was the highest in the first quarter after time zero. Considering the differential changes in direct medical costs before and after time zero, hip fractures incurred additional direct medical costs of USD 2514 (95% CI 2423 to 2606; p < 0.01) per patient and USD 264 (95% CI 166 to 361; p < 0.01) per patient in the first and second years, respectively. The increase in direct medical costs attributable to hip fracture was observed for 1.5 to 2 years (difference-in-difference estimate at 1 year 3.0 [95% CI 2.8 to 3.2]; p < 0.01) (difference-in-difference estimate at 2 years 1.2 [95% CI 1.1 to 1.3]; p < 0.01; joinpoint 1.5 year). In the subgroups of patients younger than 65, patients between 65 and 85, and patients older than 85 years of age, the increase in direct medical costs attributable to hip fracture continued up to 1 year (difference-in-difference estimate ratio at 1 year 2.7 [95% CI 2.1 to 3.4]; p < 0.01; joinpoint 1 year), 1.5 to 2 years (difference-in-difference estimate ratio at 1 year 2.8 [95% CI 2.6 to 3.1]; p < 0.01; difference-in-difference estimate ratio at 2 years 1.2 [95% CI 1.1 to 1.3]; p < 0.01; joinpoint 1.5 years), and 39 months to 5 years (difference-in-difference estimate ratio at 1 year 5.2 [95% CI 4.4 to 6.2]; p < 0.01; difference-in-difference estimate ratio at 5 years 2.1 [95% CI 1.4 to 3.1]; p < 0.01; joinpoint 39 months) from time zero, respectively. Conclusion The direct medical costs in patients with hip fractures were higher than those in the matched cohort every year during the 5 years before and after hip fracture. The increase in direct medical costs because of hip fractures was maintained for 1.5 to 2 years and was greater in older patients. Based on this, we suggest that health policies should focus on patients' financial and social needs, with particular emphasis on the first 2 years after hip fracture with stratification based on patients' ages.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbe9b792f55fbb7e337e7e66d0431e6c",
  "timestamp": "2025-05-15T03:28:46.444715"
}