{
  "id": 2472,
  "title": "Palenque and Afro-Latino in Los Angeles: Social and Environmental Justice through Mixed Methods",
  "abstract": "Afro-Latinos, African descendants with Latino ethnicity, have been documented since the 1700s. No geographic studies, however, address the spatial relationships between socioeconomic conditions and environmental risk of Afro-Latinos in Los Angeles, where assumptions of underserved conditions drawn from other minority groups are applied. Palenques, settlements of runaway enslaved Africans in Colombia, became outcast and marginalized through history. In this research we introduce the historical concept of Palenques and propose it as a new sense of place for Afro-Latinos. The methods include descriptive analysis, regression models, spatial autocorrelation models, and factor analysis. They produced a cumulative impact model to estimate life quality. The results show that Los Angeles Palenques have a lower financial status, a higher isolation rate, and higher levels of environmental pollution than the average neighborhoods. The regression models suggest that Latinos of any race have the strongest positive correlation to disadvantaged life quality, whereas the Black population has an extremely weak correlation to vulnerability. Furthermore, the spatial autocorrelation models reveal a strong spatial clustering of highly disadvantaged communities near downtown Los Angeles, where most Latinos of any race live. The main finding of this project challenges previous assumptions about social inequality and environmental injustice toward the multiracial Afro-Latino population.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbf9a5e11d7298d882831b0cab67f0c0",
  "timestamp": "2025-05-15T02:15:59.777062"
}