{
  "id": 9182,
  "title": "The epidemiological follow-up process for suspected and confirmed cases of COVID-19 in migrant shelters on the northern border of Mexico from July to December 2020: Between contagion underestimation and containment",
  "abstract": "Background: Elements associated with an increased risk factor for the contagion of COVID-19 in shelters include the turnover and overcrowding of people, time spent in communal areas, daily supply needs, water availability, and sanitation levels. The Report on the Effects of the COVID-19 Pandemic on Migrants and Refugees, shows that factors such as the shortage of food, supplies, water, sanitizing materials, spaces for healthy distancing, financial resources for rent and essential services, and the lack of medical or psychological care complicated providing care for migrants and applicants seeking international protection. Objective: We describe shelter operations regarding the detection and follow-up of suspected and confirmed COVID-19 cases showing mild symptoms among the migrant population housed in the border cities under study. Methods: We conducted semi-structured, in-depth interviews with study subjects (people in charge, managers, coordinators, shelter directors) from 22 migrant shelters, and 30 with key informants. We studied the cities of Tijuana (Baja California), Nogales (Sonora), Ciudad Juarez (Chihuahua), Piedras Negras (Coahuila), and Heroica Matamoros (Tamaulipas). The research was based on a qualitative methodological design with an ethnographic approach. The information collected was transcribed and systematized into two tables or analytical templates, one for interviews with study subjects, and another for interviews with key actors. Findings: Overall, seventy-eight registered shelters provided accommodation services for migrants in the five cities the study focused on: thirty-seven in Tijuana, five in Nogales, twenty-two in Ciudad Juarez, eight in Piedras Negras, and five plus a camp (six in total) in Matamoros. The major concentration of shelters was in Tijuana (47.4%) and Ciudad Juarez (28.2%). At the beginning of the pandemic, only a few shelter facilities met quarantine and isolation guidelines, such as having separate bathrooms and sufficient space to isolate the asymptomatic and confirmed from close contacts. The lack of isolation space and the inability to support the monitoring of patients with COVID-19 posed a challenge for those housed in shelters, forcing many shelters to close or continue operating behind closed doors to avoid becoming a source of infection during the pandemic. Discussion and outlook: Contrary to speculation, during the onset of the pandemic northern border migrant shelters did not become sources of COVID-19 infection. According to the data analyzed from 78 shelters only seven had confirmed cases, and the classification of outbreak was applied only in two facilities. Contagion control or containment was successful as the result of following a preventive containment logic, including the isolation of all suspected but unconfirmed cases, without a clear understanding of the human and financial resources required to maintain isolation areas. However, shelters in the study implemented protocols for epidemiological surveillance, control, and prevention with elements that interfered with monitoring spaces, and processes that caused oversights that resulted in underestimating the number of cases. Limitations: Due to travel restrictions imposed to prevent and contain coronavirus infections it was impossible to stay on-site in the cities studied, except for Tijuana, or carry-out recordings of migrants' views in shelters.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dbff117572ad05b85e3a615aa3951013",
  "timestamp": "2025-05-15T03:26:25.969759"
}