{
  "id": 8364,
  "title": "Longitudinal changes of frailty in 8 years: comparisons between physical frailty and frailty index",
  "abstract": "Background Few studies have made longitudinal comparisons between frailty phenotype (FP) and frailty index (FI) changes. We aimed to investigate frailty status changes defined by FP and FI concurrently, and to compare the associated factors and incident disability among different combination of FI and FP trajectory groups. Methods Data on respondents aged over 50 who completed the 1999, 2003 and 2007 Taiwan Longitudinal Study on Aging (TLSA) surveys (n = 2807) were excerpted. Changes of FI, FP and major time-dependent variables were constructed by group-based trajectory modeling. Logistic regression was used to investigate the associated factors and relationships with incident disability among different frailty trajectories. Results We identified four FP trajectories - stably robust, worsened frailty, improved frailty, and stably frail and three FI trajectories - stable FI, moderate increase FI and rapid increase FI. Lower self-rated health, mobility impairment, and depressed mood were associated with unfavorable FP and FI changes (all p < 0.001). Regardless of FP trajectory groups, the moderate and rapid increase FI group had significantly more comorbidities than the stable FI group, and more visual, hearing, oral intake impairment, more difficulty in meeting living expenses, and poorer cognitive function in >= 65-year-olds (all p < 0.05). In addition, the worsened frailty, improved frailty, and stably frail groups had ORs for incident disability of 10.5, 3.0, and 13.4, respectively, compared with the stably robust group (all p < 0.01); the moderate and rapid increase FI groups had 8.4-fold and 77.5-fold higher risk than the stable FI group (both p < 0.001). When combining FI and FP trajectories, risk increased with FI trajectory steepness, independent of FP change (all p < 0.01 in rapid increase FI vs stable FI). Conclusions Four FP trajectories (stably robust, worsened frailty, improved frailty, and stably frail) and three FI trajectories (stable FI, moderate increase FI and rapid increase FI) were identified. Lower self-rated health, mobility impairment, and depressed mood were associated with both unfavorable FP and FI trajectories. Nevertheless, even for individuals in stably robust or improved frailty FP groups, moderate or rapid increase in FI, either due to comorbidities, sensory impairment, cognitive deficits, or financial challenges, may still increase the risk of incident disability.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc0b2ba0539b9bbd411d0c8d23b9a2f8",
  "timestamp": "2025-05-15T03:18:19.485132"
}