{
  "id": 1110,
  "title": "Hybrid ML models for volatility prediction in financial risk management",
  "abstract": "Predicting volatility in financial markets is an important task with practical uses in decision- making, regulation, and academic research. This study focuses on forecasting realized volatility in stock indices using advanced machine learning techniques. We examine three key indices: the Shanghai Stock Exchange Composite (SSE), Infosys (INFY), and the National Stock Exchange Index (NIFTY). To achieve this, we propose a hybrid model that combines optimized Variational Mode Decomposition (VMD) with deep learning methods like Artificial Neural Networks (ANN), Long Short-Term Memory (LSTM), and Gated Recurrent Units (GRU). Using data from 2015 to 2022, we analyse how well these models predict volatility. Our findings reveal distinct patterns: the SSE shows high unpredictability, INFY is prone to extreme positive volatility, and NIFTY is relatively moderate. Among the models tested, the Q-VMD-ANN-LSTM-GRU hybrid model consistently performs best, providing highly accurate predictions for all three indices. This model has practical benefits for financial institutions. It improves risk management, supports investment decisions, and provides real-time insights for traders and risk managers. Additionally, it can enhance stress testing and inspire innovative trading strategies. Overall, our study highlights the potential of advanced machine learning, especially hybrid models, to address financial market complexities and improve risk management practices.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc14bf0e3851d30bc8d0be067c086ccd",
  "timestamp": "2025-05-15T01:58:43.531102"
}