{
  "id": 3028,
  "title": "Lower partial moments as measures of perceived risk: An experimental study",
  "abstract": "The paper reports the results of an experiment on individual investors' risk perception in a financial decision making context under two different modes of information presentation (framings). One way to reduce the complexity of a risky decision situation is to focus on risk measures, e.g. the statistical moments of a risky alternative's distribution. There is a huge number of propositions about which risk measure is to be used from a theoretical point of view. Many of these models are based on the variance as risk measure. But since the symmetrical nature of variance does not capture the common notion of risk as something undesired there has been much discontent with this approach. More recently, lower partial moments (LPMs) have been rediscovered as a more suitable risk measure. They reflect the popular negative meaning of risk since they only take negative deviations from a reference point to measure risk. The purpose of this paper is to examine experimentally people's risk perception in a financial context. The focus is on the correspondence of risk perceptions with specific LPMs. The main findings can be summarized as follows. First, symmetrical risk measures like variance can be dearly dismissed in favor of shortfall measures like LPMs. Second, the reference point (target) of individuals for defining losses is not a distribution's mean but the initial price LPM0. i.e. the probability of loss. Fourth, the framing of price distributions (histograms versus charts) exerts a significance influence on average risk ratings, the latter being higher for the histogram framing. Fifth, positive deviations from an individual reference point tend to decrease perceived risk. (C) 2000 Elsevier Science B.V. All rights reserved. PsycINFO classification: 3920 JEL classification: C91; D81; G19.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc1afbf57f5b3c2e4ac70a7b6d180bb5",
  "timestamp": "2025-05-15T02:21:52.178954"
}