{
  "id": 8930,
  "title": "Linking chronic stress to insomnia symptoms in older adults: The role of stress co-occurrence during the pandemic",
  "abstract": "Studies examining the associations of chronic stressors with sleep health in older adults have shown conflicting results. While the COVID-19 pandemic increased perceived stress at the population level, less is known about chronic stressors experienced by older adults in the context of the COVID-19 pandemic and its impact on sleep health in an aging population. This study aims to examine the association of older adults' chronic stress with insomnia symptoms during the first year of the COVID-19 pandemic. A cross-sectional analysis was performed using early-release COVID-19 data from the Health and Retirement Study. Data on chronic stressors and insomnia symptoms in older adults (N = 2021; mean age = 68.8) were examined. Co-occurrence network analysis, latent class analysis, Rao-Scott chi(2) tests, and multivariable logistic regression were used to characterize the co-occurrence of chronic stressors and associations with insomnia symptoms. The most common co-occurring chronic stressors during the first year of the COVID-19 pandemic were self-health issues, family-health issues, and financial stress. Older adults experiencing frequent stress co-occurrence had 91% higher odds of difficulty initiating sleep (p < 0.001), 40% higher odds of frequent nocturnal awakening (p = 0.028), and 83% higher odds of nonrestorative sleep (p < 0.001). However, adjustment for health risk factors and COVID-19 concerns attenuated the effects, leaving strongest association for difficulty initiating sleep (odds ratio = 1.51, p = 0.010). Frequent stress co-occurrence plays an important role linking chronic stress to insomnia symptoms in an aging population. Ongoing research is needed to examine the lingering effects of frequent stress co-occurrence on older adults' sleep health in the post COVID-19 era.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc287cc36ef80b703f419f0b52b8daa5",
  "timestamp": "2025-05-15T03:23:56.059813"
}