{
  "id": 8018,
  "title": "Sleep disturbance and anxiety symptom among public during the second wave of COVID-19 in Beijing: A web-based cross-sectional survey",
  "abstract": "Purpose: The global coronavirus disease 2019 (COVID-19) epidemic has significantly impacted people's lives. This study aimed to examine the influence of the unexpected second wave of COVID-19 on sleep quality and anxiety of Chinese residents in Beijing in June 2020, compared with the initial outbreak at the beginning of 2020, and to investigate the associated factors. Methods: Using a web-based cross-sectional survey, we collected data from 1,511 participants. assessed with demographic information, sleep quality and anxiety symptoms. The participants were asked to compare their recent sleep and sleep during the first outbreak. The Zung's Self-rating Anxiety Scale (SAS) was used to assess their current insomnia severity. Multivariable logistic regression models were used to analyze the association between COVID-19 epidemic and risk of sleep disturbance and anxiety symptom. Results: The overall prevalence of sleep disturbance and anxiety symptoms were 50.8% and 15.3% respectively. People had significantly shorter sleep duration during the second wave of COVID-19(7.3 +/- 1.3) h than the first outbreak (7.5 +/- 1.4)h (p < 0.001). During the second outbreak, people were less concerned about infection and more concerned about financial stress and occupational inferference. Beijing residents did not have significant differences in sleep disturbance and anxiety compared with other regions, nor were occupations and nucleic acid testing associated risk factors. Home quarantine, health administrators, history of insomnia and anxiety-depression were significantly associated with sleep disturbance. Female gender, home quarantine, history of insomnia and anxiety-depression were significantly associated with anxiety. Conclusion: High prevalence of sleep disturbance and depression symptom was common during the second wave of COVID-19 crisis in Beijing. Home quarantine and previous history of insomnia and anxiety-depressive risk factors were associated with sleep disturbance and anxiety. Female gender was impacting predictor of anxiety. We need continuous assessment of the sleep quality and anxiety symptoms of this epidemic.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc432f59b1b755997fd3904f301944b0",
  "timestamp": "2025-05-15T03:14:37.264219"
}