{
  "id": 2973,
  "title": "Optimizing climate risk management practices: a hierarchical classification of TCFD risks in Taiwan's electronics industry",
  "abstract": "In the wake of the Intergovernmental Panel on Climate Change (IPCC) AR6 report, there is escalating certainty regarding anthropogenic climate change and its concomitant uncertainties impacting corporate risk profiles and global financial stability. The lack of comprehensive climate risk identification contributes to this uncertainty. Despite its significance as a major global exporter, the Taiwanese electronics industry faces a significant empirical research gap regarding the corporate-level impacts of climate risks, resulting in an ambiguous risk landscape. Literature indicates that research related to the Task Force on Climate-related Financial Disclosures (TCFD) is still in its nascent stage, particularly in corporations' strategic implementation of climate risk management. More climate risk identification is needed within this strategic domain to improve climate risk management. Based on the TCFD's risk classification framework, we employed thematic analysis to identify 49 risk events within Taiwan's electronics industry, thereby expanding the TCFD's original list of risks and introducing a new category - climate risk events. Following this categorization, we applied the Analytic Hierarchy Process (AHP) to prioritize the materiality of these climate risk events. Subsequently, we incorporated vulnerability analysis to underscore its criticality in corporate climate risk management. This study highlights that acute physical risks, particularly power outages and water scarcity, dominate climate risk concerns within Taiwan's electronics industry, whereas transition risks remain largely underestimated in corporate risk assessments. Furthermore, the findings reveal that vulnerability, measured through disclosure gaps, has a limited yet notable impact on risk prioritization, underscoring the need for more transparent and standardized climate risk reporting. By integrating hierarchical classification, materiality assessment, and vulnerability analysis, this study provides empirical evidence to support Taiwanese policymakers and industry practitioners in refining climate risk disclosure frameworks and strengthening corporate resilience strategies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc69c3c2b0e138c2418111aaa210fb7c",
  "timestamp": "2025-05-15T02:21:19.210070"
}