{
  "id": 4103,
  "title": "The Role of Financial Security on Physical and Mental Health in Young-Midlife Couples Surviving Cancer",
  "abstract": "Background A cancer diagnosis carries a significant economic burden. Yet little is known about perceived financial security on the health of couples with a partner diagnosed with cancer. Objective The current study explored perceived financial security in young-midlife couples. Methods The study included 49 couples (aged 27-58 years) 1 to 3 years after diagnosis. Multilevel modeling was used to examine the association of perceived financial security on physical and mental health of couples controlling for interdependent data; hierarchical linear regression was used to examine perceived financial security on survivor symptoms and partner care strain. Results Mean age of survivors was 43.5 (+/- 9.0) years. Most survivors were female (69%) and 2.2 (+/- 0.6) years after diagnosis. Lower levels of perceived financial security were significantly associated with poorer physical (P < .001) and mental (P < .05) health status for survivors, controlling for age, sex, education, and years since diagnosis; there were no significant associations with partner health status. Lower levels of perceived financial security were significantly associated with higher survivor pain severity (P < .001), pain interference (P < .001), and fatigue (P < .01); there was no significant association with partner care strain. Conclusions Financial security plays a role on the physical and mental health of couples after diagnosis. Implications for Practice Screening for financial hardship at diagnosis and posttreatment can identify couples at high risk and in need of additional resources and counseling. Greater assessment and reporting of financial security in studies of families surviving cancer are needed to understand the impact on health outcomes.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc6ca38b05dc5301b034ebd43ac7500f",
  "timestamp": "2025-05-15T02:33:03.543891"
}