{
  "id": 6356,
  "title": "Risk Factors for and Cost Implications of Free Flap Take-backs: A Single Institution Review",
  "abstract": "Objective/Hypothesis: For patients undergoing microvascular free tissue transfer (MFTT), we evaluated risk factors and financial implications of operating room (OR) take-back procedures. Study Design: Retrospective review at a tertiary care center. Methods: Patients who underwent MFTT for head and neck reconstruction from 2011 to 2018 were identified. We compared hospital length of stay and overall costs associated with OR take-back procedures. Multivariable regression analysis evaluated factors associated with OR take-backs during the same hospitalization. Results: A total of 727 free flaps were reviewed, and 70 OR take-backs (9.6%) were identified. Mean total length of stay (LOS) in the ICU was 3.4 days versus 6.7 days for non-take-back and take-back flaps, respectively (P < .001). Mean total LOS on the regular floor was 6.3 days versus 13.1 days, respectively (P < .001). This resulted in a cost differential of $33,507 (94.3% increase relative to non-take-back flaps). The total cost associated with an OR take-back was $39,786. Hematomas were the most common cause of take-backs and wound dehiscence was associated with the highest costs. On multivariable analysis, higher ASA class (OR, 2.06; 95% CI, 1.11-3.99; P = .026) and shorter ischemia times (OR, 0.52; 95% CI, 0.29-0.95; P = .030) were independently associated with increased risk of take-backs. Conclusions: OR take-backs infrequently occur but are associated with a significant increase in financial burden when compared to free flap cases not requiring OR take-back. The large majority of the cost differential lies in a substantial increase of ICU and floor LOS for take-back flaps when compared to non-take-back flaps.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc7805f376bcd5d09a6b5cb3187d194b",
  "timestamp": "2025-05-15T02:57:07.779739"
}