{
  "id": 8663,
  "title": "Factors associated with health insurance enrolment among ghanaian children under the five years. Analysis of secondary data from a national survey",
  "abstract": "Background Health insurance enrolment provides financial access to health care and reduces the risk of catastrophic healthcare expenditure. Therefore, the objective of this study was to assess the prevalence and correlates of health insurance enrolment among Ghanaian children under five years. Methods We analysed secondary data from the 2017/18 Ghana Multiple Indicator Cluster Survey. The survey was a nationally representative weighted sample comprising 8,874 children under five years and employed Computer Assisted Personal Interviewing to collect data from the participants. In addition, Chi-square and Logistic Regression analyses were conducted to determine factors associated with health insurance enrolment. Results The results showed that a majority (58.4%) of the participants were insured. Health insurance enrollment was associated with child age, maternal educational status, wealth index, place of residence and geographical region (p < 0.05). Children born to mothers with higher educational status (AOR = 2.14; 95% CI: 1.39-3.30) and mothers in the richest wealth quintile (AOR = 2.82; 95% CI: 2.00-3.98) had a higher likelihood of being insured compared with their counterparts. Also, children residing in rural areas (AOR = 0.75; 95% CI: 0.61-0.91) were less likely to be insured than children in urban areas. Conclusion This study revealed that more than half of the participants were insured. Health insurance enrolment was influenced by the child's age, mother's educational status, wealth index, residence, ethnicity and geographical region. Therefore, interventions aimed at increasing health insurance coverage among children should focus on children from low socio-economic backgrounds. Stakeholders can leverage these findings to help improve health insurance coverage among Ghanaian children under five years.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc7f694fe55f51661b7f4e3ef6bde215",
  "timestamp": "2025-05-15T03:21:24.590141"
}