{
  "id": 5800,
  "title": "Can a country's environmental sustainability exert influence on its economic and financial situation? The relationship between environmental performance indicators and country risk",
  "abstract": "Due to international events such as the declaration of Sustainable Development Goals, countries have started to develop their national strategies for effective implementation of the 2030 Agenda based on those targets. This study aimed to analyse the existing relationship between the environmental proactiveness and sustainability of countries and their associated Country Risk Scores. For this purpose, two main indicators were considered: (a) the Environmental Performance Index, as a measure of a country's environmental sustainability pro-activeness, and (b) the Country Risk Score, which represents a country's economic, political, and financial situation. Data for 163 countries were used to test whether the Environmental Performance Index is related to the Country Risk Score while controlling for country groupings (memberships and/or alliances). This analysis was complemented by a regression approach using fuzzy-set qualitative comparative analysis to identify the combination of con-ditions leading to a high or low Country Risk Score. The results showed that the Environmental Performance Index is a good predictor of the Country Risk Score. In particular, the Environmental Health component of the Environmental Performance Index emerged as a better fit. However, the complementary analysis uncovered the important role of Ecosystem Vitality. Furthermore, the analysis confirmed the moderating effect of the country groupings. Overall, the Environmental Performance Index scores correlate with Country Risk Scores. The Environmental Performance Index reflects good governance practices, which are related to those evaluated by the Country Risk Score.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc80b4b0981fa16d1d745ed5b25fd651",
  "timestamp": "2025-05-15T02:51:30.097390"
}