{
  "id": 8310,
  "title": "Exacerbation of household food insecurity among low-income families in Hong Kong during the COVID-19 pandemic",
  "abstract": "Aim The economic depression and reduced physical mobility associated with COVID-19 potentially affected the food security status of the poor. This study aimed to assess the possible worsening of perceived food insecurity among low-income families in Hong Kong. Methods Families either receiving government subsidies or living in a subdivided flat referred by local non-governmental organisations were invited to participate in a telephone survey. Food security status before (by recalling) and during the pandemic were assessed using Household Food Insecurity Access Scale. Chi-square analysis and ANOVA were used to test the difference between the percentage of participants who responded affirmatively to survey questions and various categories of food insecurity. Paired t-test was used to examine the reported change in food insecurity score before and during the COVID-19 pandemic. Association between socio-demographic factors and change in food insecurity score was then assessed by multiple linear regression using backward stepwise elimination. Results Findings from the 212 households revealed that, for all nine questions concerning food insecurity, there was a significantly higher percentage of affirmative responses during versus before the pandemic. The proportion of food-secure households dropped from 16.5% to 7.1% amidst the pandemic. By contrast, households with severe food insecurity increased from 19.3% to 33.5%. Regression analysis showed that those households who were living in subdivided flats and with high monthly housing expenses, were likely to experience an exacerbation of food insecurity. Meanwhile, households with divorced parents (probably due to consistent social subsidy) and high household incomes, showed resilience toward food insecurity. Concurrently, about one fifth of children in these households had an experience of starvation for a whole day due to financial constraints. Conclusion The exacerbation of food insecurity among low-income families during the COVID-19 pandemic necessitates timely assessments and the implementation of appropriate measures to prevent them from experiencing physiological harm. These initiatives can be guided by the identified at-risk socio-economic characteristics in the present study.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc903dd15f6b78b3030724f1fdd3c37e",
  "timestamp": "2025-05-15T03:17:21.605595"
}