{
  "id": 3353,
  "title": "A Short Form of the Financial Exploitation Vulnerability Scale",
  "abstract": "Objectives The purpose of the present study was to develop a short form of the Financial Exploitation Vulnerability Scale (FEVS) with good psychometric properties to detect contextual risk exploitation. Methods The sample included community volunteers who were 60 years and older, as well as elders who were referred to the SAFE program after being the victim of a financial scam or identity theft. All participants completed the FEVS as part of a larger test battery. Factors analysis was used to explore the underlying structure of the FEVS and eliminate items. ROC analysis and logistic regression were used to evaluate the clinical utility of the Financial Exploitation Vulnerability Scale - Short Form (FEVS-SF) to detect exploitation. Results The resulting FEVS-SF was unidimensional, contained nine items, and had comparable internal consistency to the full FEVS. Sensitivity and specificity were good at a cut score of five or greater. FEVS-SF was a better predictor of exploitation than demographic factors and several measures of cognitive functioning. Conclusions The FEVS-SF can detect the experience of financial exploitation among older adults better than other known risk factors, and equally as well as a measure of executive functioning. Clinical Implications This tool serves a need in many professional settings (e.g., doctor's offices and Adult Protective Services) for a brief, standardized assessment measure of financial exploitation risk. This measure also provides actionable information for professionals to follow up with the standard of care for their clients.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc94a923740392c24b2defdd8c8a50fc",
  "timestamp": "2025-05-15T02:25:13.771010"
}