{
  "id": 3587,
  "title": "A solar and wind clustering framework with downscaling and bias correction of reanalysis data using singular value decomposition",
  "abstract": "Solar and wind energy have emerged as pivotal elements driving the transition towards sustainable power generation sources. To sustain this momentum, reanalysis data provide a critical foundation for spatial planning of renewable sources. However, effectively structuring large-scale, multi-decade reanalysis data into welldelineated clusters for resource planning remains a challenge. Additionally, the relatively coarse resolution of reanalysis data can limit the spatial precision needed for detailed resource planning. These challenges can be addressed by employing dimensionality reduction and clustering techniques alongside high-resolution datasets, thereby enhancing the characterization of renewable resources. This paper introduces a novel framework that applies singular value decomposition to reduce the dimensionality of multi-decade hourly datasets from ERA5, preserving 99 % of the original variance. By identifying spatial clusters from these reduced-dimension datasets and subsequently applying statistical downscaling and bias-correction methods, high-resolution time series can be derived to perform simulations using a mesh of subgrids suitable for renewable generation. A case study using a three-decade dataset from Brazil indicates that 15 solar and 16 wind clusters capture fundamental hourly generation patterns, enabling the estimation of energy outputs for each cluster and the crafting of renewable portfolios that leverage hourly complementarities. This research fills a critical gap by linking long-term hourly patterns to spatial clusters with global applicability. It advances the methodological toolkit for handling reanalysis datasets and enables the use of more detailed spatial information in energy models, including capacity expansion and portfolio selection models.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc9521b8ae142f7c3aac96a21d7b7924",
  "timestamp": "2025-05-15T01:18:20.644816"
}