{
  "id": 9320,
  "title": "Traditional Chinese Medicine Injections Combined With Oseltamivir for Influenza: Systematic Review and Network Meta-Analysis",
  "abstract": "Background: As a cause of respiratory tract infections in humans, influenza remains with high morbidity and mortality, with associated significant healthcare burden and increased financial burden. Traditional Chinese medicine injections (TCMIs) combined with oseltamivir (TCMIs + oseltamivir) are the representative therapeutic strategies for influenza, which is a compliant with clinical applications in China. The aim of this study was to describe the comparative efficacy and safety of TCMIs + oseltamivir in patients with influenza, based on the current evidence. Methods: PubMed, Embase, Cochrane Library, Web of Science, China National Knowledge Infrastructure, Wanfang Data Knowledge Service Platform, VIP information resource integration service platform databases, and the Chinese biomedical literature service system were searched to find randomized controlled trials where TCMIs + oseltamivir are the representative therapeutic strategies for influenza, from inception until October 2021, without language restriction. Two investigators independently screened eligibility criteria, extracted data, and appraised the risk of bias with the same criteria. We conducted a network meta-analysis using the Bayesian random method for each outcome and performed the sensitivity analysis, meta-regression, and Egger's and Begg's tests for the reliability and robustness of our results. Results: Thirty-one trials including 2,893 participants proved eligible and reported on four TCMIs + oseltamivir versus oseltamivir. Network meta-analysis showed Yanhuning (YHN) +oseltamivir (MD = -1.7, 95% CrI: -2.5 to -0.88; SUCRA = 0.89; low certainty of evidence) in fever disappearance time, Tanreqing (TRQ) +oseltamivir (MD = -1.9, 95% CrI: -2.8 to -1; SUCRA = 0.97; low certainty of evidence) in cough disappearance time, and Xiyanping (XYP) +oseltamivir (OR = 5.9, 95% CrI: 3.1 to 11; SUCRA = 0.82; very low certainty of evidence) in the response rate to be more efficacious than oseltamivir alone with the best SUCRA. Based on the combined SUCRA value for primary outcomes, TRQ +oseltamivir is probably better in cough disappearance time, and XYP +oseltamivir and YHN + oseltamivir may be better in fever disappearance time than others. No significant difference in safety between the treatments. Conclusion: In patients with influenza, TCMIs +oseltamivir only partially improve flu symptoms. Overall therapeutic efficacy and safety are inconclusive, based on low to very low certainty of evidence. However, the safety remains uncertain, and TCMI treatments for influenza should be considered with caution. More high-quality studies examining the efficacy and safety of TCMIs are needed.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dc9b4affef424c39e53e830f49f105da",
  "timestamp": "2025-05-15T03:27:53.307180"
}