{
  "id": 8529,
  "title": "Factors influencing the use of multiple HIV prevention services among transport workers in a city in southwestern Uganda",
  "abstract": "The use of multiple HIV prevention services has been found to decrease the risk of acquiring HIV when tailored to individuals at risk of HIV exposure, including transport workers. Therefore, we assessed the uptake of multiple HIV prevention services (>= 2) and associated factors among transport workers in a city in Southwestern Uganda. This cross-sectional study comprised motorcycle taxi riders, motor vehicle and truck drivers, aged 18 to 55 years who were selected and responded to an interviewer-administered questionnaire, between November 2021 and February 2022. Data was analyzed using descriptive statistical and modified Poisson regression analyses. Out of 420 participants, 97.6% were male, with a median age of 28 years and the majority were aged <34 years (84.6%). Overall, less than half (45.3%) of the participants had used multiple (>= 2) HIV prevention services within a one-year period. Many participants had used condoms (32.2%) followed by voluntary HIV counseling and testing (27.1%), and safe male circumcision (17.3%). Most participants who tested for HIV had ever used condoms (16.2%), followed by those who received safe male circumcision and had ever used condoms (15%), and those who tested for HIV and had started on antiretroviral therapy (ART) (9.1%). In the adjusted model, factors that were significantly associated with the use of multiple HIV prevention services included religion (aPR = 1.25, 95% CI = 1.05-1.49), the number of concurrent sex partners (aPR = 1.33, 95% CI = 1.10-1.61), prior HIV testing and awareness of HIV serostatus (aPR = 0.55, 95% CI = 0.43-0.70), awareness of HIV prevention services (aPR = 2.49, 95% CI = 1.16-5.38), and financial payment to access HIV services (aPR = 2.27, 95% CI = 1.47-3.49). In conclusion, the uptake of multiple HIV prevention services among transport workers remains suboptimal. Additionally, individual behavioral factors influence the use of multiple HIV services compared with other factors. Therefore, differentiated strategies are needed to increase the utilization of HIV prevention services among transport workers.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dca49e4ebd6c08a266e0a4f178ca417e",
  "timestamp": "2025-05-15T03:19:52.071101"
}