{
  "id": 1580,
  "title": "Adaptive Kriging-based method with learning function allocation scheme and hybrid convergence criterion for efficient structural reliability analysis",
  "abstract": "Structural reliability analysis poses significant challenges in engineering practices, leading to the development of various state-of-the-art approximation methods. Active learning methods, known for their superior performance, have been extensively investigated to estimate the failure probability. This paper aims to develop an efficient and accurate adaptive Kriging-based method for structural reliability analysis by proposing a novel learning function allocation scheme and a hybrid convergence criterion. Specifically, the novel learning function allocation scheme is introduced to address the challenge of no single learning function universally outperforms others across various engineering contexts. Six learning functions, including EFF, H, REIF, LIF, FNEIF, and KO, constitute a portfolio of alternatives in the learning function allocation scheme. The hybrid convergence criterion, combining the error-based stopping criterion with a stabilization convergence criterion, is proposed to terminate the active learning process at an appropriate stage. Moreover, an importance sampling algorithm is leveraged to enable the proposed method with the capability to deal with rare failure events. The efficiency and accuracy of the proposed method are demonstrated through four numerical examples and one engineering case.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dca69b140d24e3f14d33f47d47ac38a5",
  "timestamp": "2025-05-15T00:57:12.708372"
}