{
  "id": 5305,
  "title": "An algorithm for the implementation of safety improvement programs",
  "abstract": "In production system workplace environments, the achievement of safety objectives depends essentially on the risk assessment process and on the adequacy of measures to eliminate or reduce risk. The main goal of the planning phase is to define in advance the effective management of resources (financial, human and technical) involved in the completion of the overall safety improvement program. Indeed, whereas the results of the risk assessment process depend only on the correct evaluation of the work system with respect to human safety, the planning phase of safety improvement program is subject to economic, technical and organisational constraints and has to be integrated with other company objectives. Within this context, the plan definition should include additional objectives other than risk reduction, such as the clustering of measures with homogenous or compatible characteristics and the minimisation of production system disturbance (inefficiency) over the program time span. However, no safety improvement program can really be implemented if operational constraints (i.e. finite availability of resources, incompatibility in the execution of measures and limited acceptance of inefficiency) are overlooked. The present paper proposes a quantitative view of these objectives and constraints in order to develop an algorithm for the scheduling of measures within a safety improvement program. By means of the evaluation of a priority index, this algorithm provides a plan with the higher rate of risk reduction possible that maximises the objectives in function of their relative importance, obeying the imposed constraints. The definition of the safety improvement program for a textile factory shows how the algorithm can produce a plan with higher rate of risk reduction in comparison with plans based only on risk priority. (C) 2001 Elsevier Science Ltd. All rights reserved.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dcae34a4f8ca01fe5deb5145dca53a6d",
  "timestamp": "2025-05-15T02:46:16.283144"
}