{
  "id": 3582,
  "title": "Indications for fertility preservation not included in the 2017 Japan Society of Clinical Oncology Guideline for Fertility Preservation in Pediatric, Adolescent, and Young Adult Patients treated with gonadal toxicity, including benign diseases",
  "abstract": "In recent years, local governments in Japan have established a public financial support system for fertility preservation in pediatric, adolescent, and young adult cancer patients. Fertility preservation has become popular for patients with cancers included in the gonadal toxicity risk classification of the 2017 edition of the Guideline for Fertility Preservation in Children, Adolescents and Young Adult Cancer Patients from the Japan Society of Clinical Oncology. However, patients with cancer and non-cancer diseases that are not included in the Guideline's gonadal toxicity risk classification also often receive treatment that may affect fertility, but they are often denied the opportunity of fertility preservation because no public financial support is available for diseases not listed in the Guideline. The national research project proposes including these diseases in the indications and treatment for fertility preservation. Therefore, we cooperated with the Japan Society for Fertility Preservation and the Ministry of Health, Labour and Welfare research group to solicit opinions from experts in each therapeutic area and reviewed the literature and overseas guidelines. This paper summarizes the findings of the project. We believe that it will be an important source of information for clinicians treating patients who need fertility preservation but note that the appropriateness of fertility preservation for the disorders listed in this report needs to be continuously reviewed as medical care advances.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dccd7d2edb0e119553195fdb92cbe5b9",
  "timestamp": "2025-05-15T02:27:54.038522"
}