{
  "id": 8825,
  "title": "Caesarean sections in Mexico:: are there too many?",
  "abstract": "This paper seeks to quantify the magnitude of caesarean sections in Mexican public health-care institutions in recent years, to characterize the evolution of caesarean section rates (CSR) during the last decade, and to estimate the possible economic cost caused by the excess of caesareans performed in these institutions. The study is based on data obtained from the health sector, both for Mexico in the 5-year period 1993-97 and for the Mexican State of Jalisco between 1983 and 1998. Linear regression analysis was used to evaluate time series, and 'excess of caesareans' was considered the number of caesarean deliveries performed above the admissible 15% CSR. The results reflect that on the national level, more than one-quarter of the deliveries handled by public institutions ended in caesarean section for each analyzed year, and if the deliveries performed in private institutions are included, the national rate is around 30%. A marked increase in CSR can be observed in Jalisco between 1983 and 1998 (almost 50%); and the cost for the nation of this CSR excess in financial terms is highly significant: several millions of dollars - obtained from public funds - are spent annually and unnecessarily by health services. The findings suggest that the increase in CSR is a public health problem that has not been satisfactorily faced by the health sector authorities. Many unnecessary caesareans would undoubtedly be avoided if the policies of these public health-care institutions were to consider, as a priority, both the known higher risk implicit in a caesarean for the health of the mother and child, and the economic impact on the country and its health institutions of the excessive number of caesareans performed yearly.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dccef92479d7ee114b3ef5521298c3c4",
  "timestamp": "2025-05-15T03:22:57.882376"
}