{
  "id": 5096,
  "title": "Integrating real options into project management process of power plant construction",
  "abstract": "With the rapid development of technology such as computes and tele-communication technologies, product life cycle is becoming shorter and shorter. Project managers nowadays are required to adapt to changes in technology and market continuously. Now it is believed that only short term appropriate decisions that can lead to long term successful strategies. Borrowed from financial as a series of options that are exercised option theory, real option theory treats investment strategy continually to achieve both short and long term returns on investment. Management flexibility represented as option value is incorporated into traditional Discounted Cash Flow (DCF) approach to reflect more dynamic decision making process. This paper points out problems in traditional DCF approach, critically reviews real option theory, its comparison with financial options and its classification. Different from previous researches mainly concentrating on hi-h risk industries such as Information Technology (IT) industry, this paper analyzes the integration of real option method into power plant construction project. This paper discusses problems found in current power plant construction project due to lack of managerial flexibility integration so far. Then this paper proposes different real option applications in the project management process of Power Plant Construction.",
  "year": 2003,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dcdb0b821d7c8ff9ca993f5a2138a98f",
  "timestamp": "2025-05-15T02:44:11.047637"
}