{
  "id": 3299,
  "title": "COVID-19 LED TO PRICE SLUMPS IN THE GERMAN STOCK MARKET. IS SENTIMENT APPLICABLE AS AN EXPLANATORY FACTOR?",
  "abstract": "Explaining and forecasting returns and other statistical moments of returns in the stock market have always been critical challenges. Recent studies postulate a relation between investor sentiment and future stock market returns. Supported by evidence from other countries, this study explores the statistical moments of stock returns in Germany and analyses to what extent an explanation can be found through investor sentiment. The recent COVID-19 induced market distortions provide an opportunity to investigate the suitability of predictive sentiment-based analyses. These are presented in this study and appear to be meaningful. The main concept behind the sentiment-based return explanation is built on the assumption that stock returns are linked to investor psychology. This theory often serves as an explanation for market movements that cannot be explained by fundamental data which are directly linked to stocks. However, the extraction of various sentiment proxies for further analysis in statistical models remains challenging. Problems occur because sentiment proxies do not have a constant influence and depend greatly on what currently drives the market. Furthermore, the correlation between sentiment indicators varies over time, especially in times of market distress. In this study, 73 sentiment indicators were examined in the aggregate with regard to the explainability of future stock market return distribution moments such as mean, variance, skewness, and kurtosis. This study examines 169 one-month periods from 2006 to 2020 and shows a potential solution to these challenges by applying a neural network based on long short-term memory (LSTM) neurons. The authors were able to identify a good model fit and reasonable forecasting power, which seem to work particularly well in trend forecasting. The results can be valuable in the area of portfolio risk management.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dcdcee6af92e0d3f6a9e8d1e4d2472bb",
  "timestamp": "2025-05-15T01:15:54.703844"
}