{
  "id": 7519,
  "title": "Does it really matter where you live? A multilevel analysis of factors associated with missed opportunities for vaccination in sub-Saharan Africa",
  "abstract": "There is an urgent need to examine the magnitude and factors responsible for missed opportunities for vaccination, to rapidly achieve national immunization targets. The objective of the study was to examine the influence of individual, neighbourhood and country level socioeconomic position on missed opportunities for vaccination (MOV) in Sub-Saharan Africa. We used multilevel logistic regression analysis on Demographic and Health Survey data collected between 2007 and 2016 in sub-Saharan Africa. We analysed data on 43,637 children aged 12 to 23months (Level 1) nested within 15,122 neighbourhoods (Level 2) from 35 countries (Level 3). After adjustment for individual-, neighbourhood- and country-level factors, the following appeared as significant risk factors for increased odds of MOV: high birth order, high number of under-five children in the house, poorest household, lack of maternal education, lack of media access, and living in poorer neighbourhood. According to the intra-country and intra-neighbourhood correlation coefficient, 18.4% and 37.4% of the variance in odds of MOV could be attributed to the country and neighbourhood level factors, respectively; and if a child moved to another country or neighbourhood with a higher probability of MOV, the median increase in their odds of MOV would be 2.47 and 2.56 fold respectively. This study has revealed that the risk of missed opportunities for vaccination in sub-Saharan Africa is influenced by not only individual factors but also by compositional factors such as family's financial capacity, place of birth and upbringing.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dce3ad080c479176d8c56de121619dc1",
  "timestamp": "2025-05-15T03:09:36.820848"
}