{
  "id": 2894,
  "title": "Re-evaluating natural resource investments under uncertainty: An alternative to limited traditional approaches",
  "abstract": "The need to evaluate natural resource investments under uncertainty has given rise to the development of real options valuation; however, the analysis of such investments has been restricted by the capabilities of existing valuation approaches. We re-visit the well-known example of a copper mine project under a one-factor and two multi-factor models using the influence diagram simulation-and-regression (IDSR) approach. The one-factor setting was originally proposed by Brennan and Schwartz (J Bus 58(2):135-157, 1985), who used partial differential equations (PDEs) and finite differences to approximately solve the valuation problem; extensions to two and three factors were later analysed by Tsekrekos et al. (Eur Financ Manag 18(4):543-575, 2012) using the least-squares Monte Carlo method. We apply the IDSR approach to perform a detailed portfolio analysis of the one-factor benchmark investment and find issues in both the definitions and values of the fixed-output-rate mine and closure option at the portfolio decomposition stage in Brennan and Schwartz (1985). We then apply the IDSR approach to re-evaluate two multi-factor extensions of Tsekrekos et al. (2012) and detect issues in their sensitivity analyses that impact on the reliability of some of their findings. To confirm this and validate the values we obtained, we integrate PDE-based analytical expressions that describe the volatilities implied by the multi-factor models into our IDSR-based analysis. Using the investment-uncertainty relationship, we are able to correctly analyse the impact of the complex multi-factor model parameters on investment value. We conclude that the limitations of PDE-based finite difference approaches may invalidate their use in portfolio situations, but analytical expressions obtained from PDE-based modelling may be profitably integrated into a simulation-based, numerical analysis to validate results and gain new insights.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dce50c8ff3c626edc6cce73d3e4843ea",
  "timestamp": "2025-05-15T01:11:48.301810"
}