{
  "id": 8165,
  "title": "Early-Onset Ocular Motor Cranial Neuropathy Is a Strong Predictor of Dementia",
  "abstract": "Purpose: To assess the risk of dementia in individuals with newly diagnosed ocular motor cranial neuropathy (OMCN). Design: A nationwide, population-based cohort study using authenticated data from the Korean National Health Insurance Service (KNHIS). Participants: This study included 60 781 patients with OMCN who received a diagnosis between 2010 and 2017 and were followed up through 2018, with an average follow-up of 3.37 +/- 2.21 years with a 1-year lag. After excluding patients with disease related to oculomotor dysfunction preceding the OMCN diagnosis, a total of 52 076 patients with OMCN were established. Of these, 23 642 patients who had participated in the National Health Screening Program (NHSP) within 2 years before the OMCN diagnosis were included. After applying the exclusion criteria, the final cohort comprised 19 243 patients and 96 215 age and sex-matched control participants without OMCN. Methods: We identified patients with newly diagnosed OMCN in the KNHIS database and collected participant characteristics from the health checkup records of the NHSP. The study end point was determined by the first claim with a dementia diagnostic code and antidementia medications. The association of OMCN with dementia risk was examined using Cox proportional hazards regression analysis, adjusting for potential confounding factors. Main Outcome Measures: The main outcome measures were hazard ratios (HRs) and 95% confidence intervals (CIs) for all-cause dementia (ACD), Alzheimer's disease (AD), and vascular dementia (VaD) development in patients with OMCN relative to those without OMCN. Results: Patients with newly diagnosed OMCN demonstrated higher metabolic comorbidities than those without OMCN. New OMCN was associated with an elevated risk of ACD (HR, 1.203; 95% CI, 1.113-1.300), AD (HR, 1.137; 95% CI, 1.041-1.243), and VaD (HR, 1.583; 95% CI, 1.286-1.948), independent of potential confounding factors. The younger age groups exhibited a stronger association between OMCN and ACD (HR, 8.690 [< 50 years] vs. 1.192 [>= 50 years]; P = 0.0004; HR, 2.517 [< 65 years] vs. 1.099 [>= 65 years]; P < 0.0001). Conclusions: This nationwide population-based study assessed the association between OMCN and dementia risk. Our results demonstrated a robust relationship between OMCN and the risk of dementia, particularly in the younger population. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2024;131:288-301 (c) 2023 by the American Academy of Ophthalmology",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd12acf64d9172593cb464e96e64af84",
  "timestamp": "2025-05-15T03:16:17.266933"
}