{
  "id": 5708,
  "title": "Contributing Risk Factors for Orthopedic Device-Related Infections, Tehran, Iran",
  "abstract": "Background: In spite of decreasing incidence of orthopedic device-related infections to 1%, nowadays, devicerelated infection still remains a diagnostic, therapeutic and cost-related problem. The objective of this study is to evaluate the contributing risk factors for orthopedic device-related infections in Sina Hospital, Tehran, Iran. Methods: Three hundred and thirty patients who underwent orthopedic device implantation from 2002-2006 were enrolled; among them, 110 patients were complicated with infection. Descriptive and logistic regression analyses were performed to determine the risk factors for device related infections. Results: Patients with infection were older compared to those without infection. The Staphylococcus aureus was the commonest organism. A correlation was observed between wound infection and external fixation, an underlying health condition, and addiction which were independent risk factors for a device related infection. Conclusion: Orthopedic device-related infection puts a great financial burden on patients and hospital resources and could lead to morbidity and mortality in patients. So, appropriate pre and postoperative wound care for dirty wounds, especially when external fixators are used, and in patients with poor conditions or addiction should be done with more caution.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd1b8178fb4174a70ccdb6c37e730186",
  "timestamp": "2025-05-15T02:50:21.379226"
}