{
  "id": 6079,
  "title": "Hip hemiarthroplasty for the treatment of femoral neck fractures in dialysis patients",
  "abstract": "Objectives: This study sought to delineate the postoperative outcomes in dialysis patients undergoing hip hemiarthroplasty (HHA) for the treatment of femoral neck fractures (FNF) in order to better optimise pre- and postoperative management and minimise short-term morbidity and mortality rates. Methods: 16,955 patients who had undergone HHA for femoral neck fractures from 2005 to 2018 were isolated from a multi-institutional surgical registry, of which 343 (2.0%) were on dialysis and 16,612 (98.0%) were not. The cohorts were identified/analysed for differences in their comorbidities, demographic factors, and 30-day postoperative complications using Fischer's exact tests and Mann-Whitney U-tests. Coarsened exact matching (CEM) was implemented in order to control for baseline difference in demographics and comorbidities. Multivariate logistic regression analyses were used to assess the impact of dialysis as an independent risk factor for various complications, including reoperations, readmissions, and mortality. Results: Upon CEM-matching (L1-statistic <0.001), weighted multivariate logistic regression analyses demonstrated dialysis to be an independent risk factor for minor complications (OR 3.051, p < 0.001), pneumonia (OR 3.943, p < 0.001), urinary tract infections (UTIs) (OR 2.684, p < 0.001), major complications (OR 1.892, p < 0.001), unplanned intubation (OR 2.555, p = 0.047), cardiac arrest (OR 11.897, p < 0.001), deep vein thrombosis (DVT), (OR 2.610, p = 0.049), and mortality (OR 2.960, p < 0.001). Conclusions: Dialysis independently increased the risk for unplanned intubation, cardiac arrest, blood transfusions, pneumonia, DVT, and mortality. In communicating postoperative expectations, surgeons should aim to clarify the patients' preferences and potential resuscitation designations prior to surgical intervention due to the increased risk of serious complications. A lower threshold of suspicion for DVT in this population is reasonable. Identifying high-risk patient populations that may experience increased rates of complications, with the ensuing financial expenditures, due to medical complexity rather than subpar management may help providers avoid penalties in caring for these patients.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd2f77d11572a4750411e6e4a811d864",
  "timestamp": "2025-05-15T02:54:38.767950"
}