{
  "id": 464,
  "title": "Analysis of Risk Factors and Diagnosis for Anxiety Disorder in Older People with the Aid of Artificial Intelligence: Observational Study",
  "abstract": "Anxiety disorders are the most common mental health problems particularly in older people who suffer from loneliness and social isolation, chronic health conditions, financial insecurity and other factors that can lead to anxiety disorders. The high prevalence and health risks of anxiety disorders, and the requirement for effective mental care, coupled with recent advances in artificial intelligence, has resulted in an increase exploration of how machine learning can aid the diagnosis and prediction of mental health problems. Data from the Trinity-Ulster-Department of Agriculture (TUDA) study will be utilized to identify risk factors for anxiety in community dwelling older adults using machine learning techniques. The TUDA study includes detailed information on biochemical, clinical, nutritional, lifestyle, and sociodemographic factors in 5186 older people recruited from the Republic of Ireland and Northern Ireland. These characteristics could foster the prediction of anxiety disorders using supervised machine learning methods. Biomarker risk factor analysis was conducted to facilitate feature engineering. In this observational study, several classical machine learning models have been trained to predict anxiety disorders. Comparing the accuracy results and determining the impact of features on the predictions of each method. The models' performance was assessed on a held-out test set and achieved an accuracy of 85.4% (sensitivity: 67.0%, specificity: 90.3%) and 83.4% (sensitivity: 81.5%, specificity: 83.9%) for two best performing methods i.e., random forest and support vector machine respectively, using the standard Synthetic Minority Oversampling Technique. Risk factors such as female sex, loneliness, separated/divorced conditions, lifestyle-related, socio-economic low status, chronic diseases, and family related diseases were identified. These results will aid in the early detection of anxiety disorder in future studies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd3f31c0b7d4dd09364a9532fafda420",
  "timestamp": "2025-05-15T01:51:31.182757"
}