{
  "id": 6930,
  "title": "Government Bonds of the CIS Countries: Integration Dynamics of Debt Markets in the Context of External Instability",
  "abstract": "The paper examines development specifics of government bond markets in the CIS countries. The sample includes Russia, Kazakhstan, Uzbekistan and Azerbaijan, since only these countries, among the CIS members, possess enough government bonds included in the global debt market. The relevance of the study is due to the increasing financial uncertainty, which attracts attention to relatively reliable means of public debt; the need to understand the functioning of debt markets against the background of anti -Russian sanctions and the increasing influence of the State. The aim of the work is to empirically verify the connectivity, integration and predictability of the government bond markets of Russia, Kazakhstan, Uzbekistan and Azerbaijan. Empirical data include daily refinancing rates of national central banks, indices of total government bond yields, G -spreads of international bonds of the countries in relation to the conditionally risk -free US bond yield curve for 2019-2023. The effects of market development features are divided into local, regional and global, such as the reaction to COVID-19 and anti -Russian sanctions after 2022. We use the following methods: dynamics analysis, correlation, factor and regression analysis. The novelty of the research lies in introducing new empirical data into scientific discourse, testing a methodology that allows us to assess the interaction of monetary policies and the functioning of government bond markets, common features and differences in the behavior of these markets before and after the imposition of sanctions against the Russian financial system. We conclude that the integration of the considered markets within the CIS is violated, which poses risks to the effective economic development of the region. We consider the relatively developed and integrated, but poorly predictable markets of Russia and Kazakhstan. Unlike Russia, Kazakhstan has more connectivity regarding its monetary policy, government bond yields and risks. The yield of Azerbaijan's government bonds is influenced by a more developed market of Kazakhstan, especially in terms of risk assessment, but the market itself is developed poorly. Uzbekistan's market is even less integrated and developed.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd70cf00fbfcfde1da009f699f6b78b0",
  "timestamp": "2025-05-15T03:03:13.440328"
}