{
  "id": 7209,
  "title": "Understanding the effect of universal credit on housing insecurity in England: a difference-in-differences approach",
  "abstract": "Existing research indicates an association between the introduction of Universal Credit in the UK and increased financial hardship among claimants. This policy change embodies key changes in welfare policy and ideology taking place across Europe and worldwide. This study investigates the association between housing insecurity and claiming Universal Credit in comparison to Housing Benefit and Jobseeker's Allowance. To examine changes in housing insecurity trajectories before and after the introduction of Universal Credit, we apply a difference-in-differences fixed effects logistic regression research design to Understanding Society data (2009-2020) on benefit claimants in England. We compare how Universal Credit claimants' likelihood of housing insecurity changes over time compared to other benefit claimants. We find that claiming Universal Credit does indeed have a significant effect on increasing housing insecurity in comparison to claiming Housing Benefit or Jobseeker's Allowance. This effect varied across different scenarios, including a larger effect for people with disabilities and claimants moving from Housing Benefit to Universal Credit. These findings demonstrate that the Universal Credit system negatively impacts particular population groups more than others, placing these claimants at disproportionate risk of experiencing housing insecurity.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd7138aa46a19cf611278d0b968fe20a",
  "timestamp": "2025-05-15T03:06:01.325157"
}