{
  "id": 3911,
  "title": "The Effect of Environmental, Social, and Governance (ESG) Disclosure on the Profitability of Saudi-Listed Firms: Insights from Saudi Vision 2030",
  "abstract": "This study investigates the influence of Environmental, Social, and Governance (ESG) disclosure on the profitability of Saudi-listed non-financial firms in the context of Saudi Vision 2030. The study uses a sample of 100 non-financial organizations from 2019 to 2023 (500 firm-year observations). This study uses panel data analysis and a random-effects regression model to examine the relationship between ESG disclosure and firm profitability as assessed by return on assets (ROA). To assess ESG disclosure, this study developed a comprehensive ESG disclosure index based on worldwide ESG guidelines and Saudi-related regulations. The regression results show a significantly positive relationship between ESG disclosure and firm profitability, emphasizing the financial benefits of corporate transparency and sustainability. This finding is consistent with the stakeholder theory, implying that firms with strong ESG commitments boost investor trust, improve risk management, and increase operational efficiency. Thus, this study adds to the ESG literature by presenting empirical evidence from Saudi Arabia, a growing country that is undergoing regulatory transition. Additionally, this study's notable contribution is the development of a comprehensive ESG disclosure index tailored for the Saudi corporate landscape, integrating global reporting standards with local regulatory requirements. This index enhances the assessment of ESG transparency and offers a thorough tool for examining business sustainability strategies. The results offer substantial insights for policymakers, investors, and corporate leaders, emphasizing the significance of ESG in sustainable financial performance.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd72d3b90a2cfe2ec665e8c3ec629d06",
  "timestamp": "2025-05-15T02:30:58.398322"
}