{
  "id": 6422,
  "title": "Is gender dysphoria associated with increased hospital cost per stay among patients hospitalized for depression? Focus on the racial and regional variance in US hospitals",
  "abstract": "Introduction Individuals with gender dysphoria do not identify with their sex assigned at birth and face societal and cultural challenges, leading to increased risk for depression, anxiety, and suicide. Gender dysphoria is a DSM-5 diagnosis but is not necessary for transition therapy. Additionally, individuals with gender dysphoria or who identify as gender diverse/nonconforming may experience minority stress from increased discrimination, leading to a greater risk for mental health problems. This study aimed to identify possible health disparities in patients hospitalized for depression with gender dysphoria across the United States. Depression was selected because patients with gender dysphoria are at an increased risk for it. Various patient and hospital-related factors are explored for their association with changes in healthcare utilization for patients hospitalized with depression.Methods The National Inpatient Sample was used to identify nationwide patients with depression (n = 378,552, weighted n = 1,892,760) from 2016 to 2019. We then examined the characteristics of the study sample and investigated how individuals' gender dysphoria was associated with healthcare utilization measured by hospital cost per stay. Multivariate survey regression models were used to identify predictors.Results Among the 1,892,760 total depression inpatient samples, 14,145 (0.7%) patients had gender dysphoria (per ICD-10 codes). Over the study periods, depression inpatients with gender dysphoria increased, but total depression inpatient rates remained stable. Survey regression results suggested that gender dysphoria, minority ethnicity or race, female sex assigned at birth, older ages, and specific hospital regions were associated with higher hospital cost per stay than their reference groups. Sub-group analysis showed that the trend was similar in most racial and regional groups.Conclusion Differences in hospital cost per stay for depression inpatients with gender dysphoria exemplify how this community has been disproportionally affected by racial and regional biases, insurance denials, and economic disadvantages. Financial concerns can stop individuals from accessing gender-affirming care and risk more significant mental health problems. Increased complexity and comorbidity are associated with hospital cost per stay and add to the cycle.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd7f565d4c1b54118eb984bed0dbab3f",
  "timestamp": "2025-05-15T02:58:05.588168"
}