{
  "id": 2019,
  "title": "RETRACTED: Internet financial risk assessment based on web embedded system and data mining algorithm (Retracted Article)",
  "abstract": "The Financial requirements of the investigation and the specific design techniques for Web applications in the financial services industry Web Embedded Systems (WES) of. In discussing some of the financial services industry has decision-making technology, using data mining motives are related to the basic challenge of some typical applications using embedded design, after the realization of prompt analysis and user behavior online risks Accounting Oversight Internet control, early warning accounting software module risk In the monitoring system and embedded, the construction of interest rate risk, currency risk, accounting for risk prediction of the network, warning the Multiple of supervision of discriminant analysis model, accounting for boot loader in accordance with the classification Improve internet controls and requirements, real-time early tracking alert payment network and information on the efficiency of various fees and interest, corporate accounting fees business operations and regular financial reporting system. Internet financial analysis and risk measurement receivers. As a result, to achieve real-time risk-aware network can use the Internet shows that the supervision of accounting, risk management capabilities and improve prevention.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd84f4ef9e979eaa04715576d0c280f1",
  "timestamp": "2025-05-15T02:10:25.658310"
}