{
  "id": 407,
  "title": "Monitoring corporate credit risk with multiple data sources",
  "abstract": "PurposeMonitoring corporate credit risk (CCR) has traditionally relied on such indicators as income, debt and inventory at a company level. These data are usually released on a quarterly or annual basis by the target company and include, exclusively, the financial data of the target company. As a result of this exclusiveness, the models for monitoring credit risk usually fail to account for some significant information from different sources or channels, like the data of its supply chain partner companies and other closely relevant data yet available from public networks, and it is these seldom used data that can help unveil the immediate CCR changes and how the risk is being propagated along the supply chain. This study aims to discuss the a forementioned issues.Design/methodology/approachGoing beyond the existing CCR prediction data, this study intends to address the impact of supply chain data and network activity data on CCR prediction, by integrating machine learning technology into the prediction to verify whether adding new data can improve the predictability.FindingsThe results show that the predictive errors of the datasets after adding supply chain data and network activity data to them are made the ever least. Moreover, intelligent algorithms like support vector machine (SVM), compared to traditionally used methods, are better at processing nonlinear datasets and mining complex relationships between multi-variable indicators for CCR evaluation.Originality/valueThis study indicates that bringing in more information of multiple data sources combined with intelligent algorithms can help companies prevent risk spillovers in the supply chain from causing harm to the company, and, as well, help customers evaluate the creditworthiness of the entity to lessen the risk of their investment.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd84728c4e8bc14dcb7f4362d33b962f",
  "timestamp": "2025-05-15T01:50:14.146794"
}