{
  "id": 6288,
  "title": "Does sustainability performance reflect the quality of internal controls?",
  "abstract": "PurposeThis paper aims to examine whether firms' environmental, social and governance (ESG) performance indicates higher quality internal controls. The authors argue that commitment to high ESG performance is indicative of a commitment to quality corporate governance and impactful ESG practices are presumed to be achieved when pursued within a system of strong internal controls.Design/methodology/approachThe authors obtain financial and ESG-related information for firms on the Financial Times Stock Exchange (FTSE)-350 for the years 2010-2018. Following prior literature, the authors use audit report lag as a measure of auditor effort. Controlling for various factors that proxy for audit clients' inherent risk, the authors hypothesize that the remaining variance in audit report lag is related to audit clients' control risk, and test whether ESG performance explains some of that remaining variance. To measure ESG performance, the authors use two variables to proxy firm's ESG performance, an ESG disclosure score and being listed on the FTSE4GOOD index. Thomson Reuters provides a weighted average and industry adjusted ESG disclosure score. The FTSE4Good listing status was manually collected. Random-effect GLS panel regression model is used to estimate relationships. The authors reran their regressions using the generalized linear model and the two-stage least square model and the authors used an industry adjusted audit report lag and the lagged value of ESG and FTSE4GOOD to ensure the robustness of the results.FindingsRegressing audit report lag on different measures of ESG performance, the authors find that better ESG performance is associated with lower audit report lag. The results remain consistent when replacing ESG with FTSE4Good and applying alternative econometrical techniques. The authors also find that female board representation facilitates lower audit report lag.Originality/valueThis study provides an alternative methodological approach to indicate firms' internal control quality. In addition, auditors can benefit from firms' ESG performance/disclosure to assess their client's governance, internal control quality and project that on the audit risk and the level of effort required.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dd9eb398b37ff496eac6f94d4e101604",
  "timestamp": "2025-05-15T02:56:37.486864"
}