{
  "id": 4005,
  "title": "Greenwashing practices and ESG reporting: an international review",
  "abstract": "Purpose - This study provides an overview of the numerous theoretical facets of greenwashing (GW) and their relationship with sustainability, social responsibility and sustainable development. This study highlights the actions of governments and international organizations in GW. It delves into the sins of GW and the various metrics used in the literature to measure them. It seeks to distinguish between sustainability reporting and GW practices by offering a critical perspective on GW. Design/methodology/approach - This study measures GW practices at the international level and compares them with the ESG disclosure score. The main determinants of GW are assessed by examining the impact of a set of variables on GW. The influence of various sources used to gather the data were assessed using multiple regression analysis. Findings - Factors such as protocols and conventions, media role and the strength of environmental policies have a considerable and positive impact on the occurrence of GW. Research limitations/implications - Owing to the research method chosen for measuring variables such as GW scores, procedures for measuring GW in companies should be developed. Multicriteria modeling could be a suitable approach to address the sorting or portfolio approach. Originality/value - This study provides a theoretical basis for examining GW from a business-economic standpoint. It presents various perspectives on GW, analyzes relevant theories and explores potential GW strategies. This study highlights the connection between GW and various factors, including the influence of conventions, role of the media and strength of environmental policies.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ddaa4038c13e1eb7322ac5b8cfe4d78d",
  "timestamp": "2025-05-15T01:23:07.293042"
}