{
  "id": 3841,
  "title": "You sneeze, and the markets are paranoid: the fear, uncertainty and distress sentiments impact of the COVID-19 pandemic on the stock-bond correlation",
  "abstract": "Purpose This paper investigates the influence of three different sentiment indicators on the time-varying stock-bond correlation of 15 countries during the global crisis period of the coronavirus disease 2019 (COVID-19) pandemic. Design/methodology/approach The author uses the time-varying correlation estimated using the autoregressive moving average -dynamic conditional correlation - generalised autoregressive conditional heteroskedasticity (ARMA-DCC-GARCH) model to achieve this aim. The impact of investor sentiment on the stock-bond correlation was analysed using the Markov regime-switching regression. Findings The study results show that the sentiment indicators of fear, uncertainty and distress have a pronounced negative impact on the stock-bond correlation. They further provide evidence of a strong regime effect on the stock-bond correlation with sentiment indicators. Practical implications The paper has a relevant impact on policymakers and fund managers. First, the policymakers now have more insightful evidence of how the stock and bond markets react during crises. Second, the fund managers need to focus on behavioural variables as they may be driving factors in crisis periods that may impair portfolio management. Originality/value To the best of my knowledge, the paper is the first to throw light on the behaviour of the stock-bond correlation for 15 countries during the COVID-19 period.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ddbe9aba907df3f723c4ce8ba7000e01",
  "timestamp": "2025-05-15T01:21:41.228035"
}