{
  "id": 2635,
  "title": "Assessing banking sectors' efficiency of financially troubled Eurozone countries",
  "abstract": "The aim of this paper is to assess the relative banking efficiency of the Eurozone's soft underbelly (i.e., the so called PIIGS countries: Portugal, Ireland, Italy, Greece and Spain) in the period after the outburst of the financial crisis. It is one of the few that attempts to measure banking efficiency in the periphery of Eurozone in the outburst of the financial crisis using a battery of efficiency evaluation techniques for robustness reasons. This study relies on a modeling framework consisting of data envelopment analysis (DEA), bootstrapping, Malmquist Productivity Index and truncated regression which is applied on accounting and macroeconomic data spanning from 2009 to 2015. Findings show statistical evidence of a high degree of inefficiency in most of the examined banks. The application of the truncated regression indicate several financial variables as driving forces, offering thus important warning signs for banking performance. Indicators such as Tier 1 Capital to Risk Weighted Assets, Tangible Common Equity to Risk-Weighted Assets, Risk-Weighted Assets to Total Assets, Non-Performing Assets to Total Assets and Net Income Margin contribute in banks' efficiency score. The above financial variables need to be closely monitored by the bank's decision makers. Moreover, inflation and high levels of General Government Debt to GDP ratio also affect the efficiency of banks.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ddde45e7e2a08e00f79c65ee0d0cc3f7",
  "timestamp": "2025-05-15T02:17:32.161848"
}