{
  "id": 6308,
  "title": "CEO Skills in Preventing Tax Avoidance Activities and Reducing the Risk of Stock Price Crashes in Indonesia",
  "abstract": "The market bubble phenomenon has hit the capital markets, including in Indonesia. This occurs when a company's cash flow is lower than investors' expectations. Even the literature on stock price crash risk, which considers managers' motives to disguise negative information, identifies that tax avoidance has been used as a mask by managers to cover up poor performance. This study aims to determine the effect of high CEO capability on the relationship between tax avoidance and stock price crash risk in Indonesia. This research method uses a quantitative approach with 436 observations of companies on the Indonesia Stock Exchange during the period 2015-2019. Data was obtained through the official website of the Indonesia Stock Exchange indexed by Kompas 100. The data was tested using ordinary least squares regression model. The results of this study found that, first, tax evasion has a positive effect on the risk of decreasing the share price of companies incorporated in the Kompas 100 index on the Indonesia Stock Exchange. Second, that a highly skilled CEO can weaken the relationship between tax evasion and the risk of falling stock prices. This finding supports the agency theory perspective, where tax evasion is used by opportunistic managers to disguise financial information, thereby increasing the risk of future stock price crash. This study enriches the literature by demonstrating the role of highly skilled CEOs in influencing the intensity of the relationship between tax avoidance and stock price crash risk. Second, this study demonstrates the uniqueness of incorporating the human aspect, in the form of CEO characteristics, into the model linking tax avoidance with stock price crash risk.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ddebdceb16f7ccefb692ae00377cb667",
  "timestamp": "2025-05-15T02:56:37.525706"
}