{
  "id": 7381,
  "title": "Assertive community treatment for people with severe mental illness: The effect on hospital use and costs",
  "abstract": "Objective. To determine the effect of the Program for Assertive Community Treatment (PACT) model on psychiatric inpatient service use in a population of non-emergency psychiatric patients with severe chronic mental illness, and to test for variations in this effect with program staffing levels and patient characteristics such as race and age. Data Sources/Study Setting. Data are taken from a randomized trial of PACT in Charleston, South Carolina for 144 patients recruited from August 1989 through July 1991. Study Design. Subjects were randomly assigned either to one of two PACT programs or to usual care at a local mental health center. Effects on hospital use were measured over an 18-month follow-up period via multiple regression analysis. Data Collection Methods. Data were obtained from Medicaid claims, chart reviews, subject, case manager, and family interviews; searches of the computerized patient and financial databases of the South Carolina Department of Mental Health and relevant hospitals; and searches of the hard copy and computerized financial databases of the two major local hospitals providing inpatient psychiatric care. Principal Findings. PACT participants were about 40 percent less likely to be hospitalized during the follow-up period. The effect was stronger for older patients. Lower PACT client/staff ratios also reduced the risk of hospitalization. No evidence of differential race effects was found. Given some hospital use, PACT did not influence the number of days of use. Conclusions. Controlling for other covariates, PACT significantly reduces hospitalizations but the size of this effect varies with patient and program characteristics. This study shows that previous results on PACT can be applied to non-emergency patients even when the control condition is an up-to-date CMHC office-based case management program.",
  "year": 1999,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ddff3daa95bd4d15cecb7bc4a39221c0",
  "timestamp": "2025-05-15T03:08:00.781110"
}