{
  "id": 3147,
  "title": "Varieties of Financial Stressors and Midlife Health Problems, 1996-2016",
  "abstract": "Objectives: Financial stressors such as wealth loss, indebtedness, and bankruptcy have gained the attention of public health scholars since the Great Recession. In this study, we extend this area of research by comparing the mental and physical impact of multiple financial stressors during midlife, a pivotal period in the life course for wealth accumulation and disease onset. Methods: With data from the National Longitudinal Survey of Youth 1979 (www.nlsinfo.org), an ongoing survey of adult men and women in the United States, we used logistic regression to estimate the associations between financial stressors and the risk of a psychiatric disorder or high blood pressure diagnosis from ages 31-39 in 1996 to ages 50-59 in 2016 (N = 7,143). Financial stressors include multiple types of wealth loss, debt, and bankruptcy. Results: Even after adjusting for a comprehensive set of confounders, many of the financial stressors we considered had similar positive associations with the risk of a psychiatric disorder, whereas only debt and bankruptcy were associated with the risk of high blood pressure. The best-fitting models for both health outcomes included a simple indicator of indebtedness. Stock losses were not significantly associated with either health outcome. Discussion: Given the recent volatility in the U.S. economy, our results highlight the potential loss of health that may occur if nothing is done to prevent economically vulnerable populations from sliding into financial crisis. Our results also emphasize the need for additional research to develop individual-level interventions to improve health among those already experiencing financial difficulties.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de021f15d509d5410d5a2e0375537aaa",
  "timestamp": "2025-05-15T02:22:56.783648"
}