{
  "id": 9327,
  "title": "Violence against women from partners and other household members during COVID-19 in Burkina Faso and Kenya",
  "abstract": "Background Global evidence indicates increases in gender-based violence (GBV) during the COVID-19 pandemic following mitigation measures, such as stay at home orders. Indirect effects of the pandemic, including income loss, strained social support, and closed or inaccessible violence response services, may further exacerbate GBV and undermine help-seeking. In Kenya and Burkina Faso, as in many settings, GBV was prevalent prior to the COVID-19 pandemic. Studies specific to COVID-impact on GBV in Kenya indicate mixed results and there remains a lack of evidence from Burkina Faso. Our study takes a comprehensive lens by addressing both intimate partner violence (IPV) and non-partner household abuse through the COVID-19 pandemic in two priority settings. Methods Annual, national cross-sections of women ages 15-49 completed survey data collection in November-December 2020 and December 2020-March 2021; the GBV module was limited to one woman per household [Kenya n = 6715; Burkina n = 4065]. Descriptive statistics, Venn diagrams, and logistic and multinomial regression characterized prevalence of IPV and other household abuse, frequency relative to the COVID-19 pandemic, help-seeking behaviors, and predictors of IPV and household abuse across the socioecological framework. Results In both settings, past-year IPV prevalence exceeded non-partner household abuse (Kenya: 23.5%(IPV,) 11.0%(household); Burkina Faso: 25.7%(IPV,) 16.2%(household)). Over half of those affected in each setting did not seek help; those that did turned first to family. Among those with past-year experiences, increased frequency since COVID-19 was noted for IPV (16.0%(Burkina Faso); 33.6%(Kenya)) and household violence (14.3%(Burkina Faso); 26.2%(Kenya)). Both context-specific (i.e., financial autonomy in Burkina Faso) and universal (i.e., COVID-related income loss) risk factors emerged. Conclusion Past-year IPV and household violence against women in Kenya and Burkina Faso were prevalent, and in some cases, intensified during the COVID-19 pandemic. Across settings, help-seeking from formal services was notably low, likely reflecting shame, blame, and stigmatization identified as barriers in pre-COVID literature. Both primary prevention and survivor-centered support services, including those related to economic empowerment, should be integrated within COVID-recovery efforts, and extended into the post-pandemic period to fully meet women's safety needs.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de0a212a78f18ce66e7fd21198e15200",
  "timestamp": "2025-05-15T03:27:53.325206"
}