{
  "id": 7970,
  "title": "Do corporate governance implementation and bank characteristics improve the performance of Indonesian Islamic banking? Before-COVID-19 pandemic analysis",
  "abstract": "Islamic banking has existed in Indonesia since 1992. The performance of Islamic banking is interesting for further analysis. This study aims to analyze the impact of good corporate governance (GCG) implementation and bank characteristics on the performance of Islamic banking in Indonesia before the COVID-19 pandemic. Profitability is a measure of banking performance and is proxied by return on assets (ROA) and return on equity (ROE). The research sample consists of Islamic commercial banks that published financial and annual reports between 2011 and 2019. The data collection method used is documentation. Multiple regression analysis was used for data analysis. The results indicate that the implementation of GCG has no significant impact on performance (probability values of 0.425 and 0.420 on ROA and ROE with coefficients of 0.016 and 0.019). The P-value of the non-performing loans (NPF) variable is < 0.001 on ROA and ROE, which means that NPF has a significant negative impact on ROA and ROE. Third-party funds only have a significant impact on ROE with a p-value of 0.046. Meanwhile, the size of a bank has not been shown to have a significant impact on the performance of Islamic banking in Indonesia. Efforts to maintain NPF are critical for banks to achieve good performance (profitability). NPF demonstrates the risk of nonpayment of Islamic bank financing.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de166203273addd05b06fadab13b4242",
  "timestamp": "2025-05-15T03:14:07.159244"
}