{
  "id": 3902,
  "title": "Green loans: Navigating the path to sustainable profitability in banking",
  "abstract": "This research investigates the impact of green loans distribution on the sustainable profitability performance of banks, as evaluated by measures such as Return on Assets (ROA), Return on Equity (ROE), and Net Interest Margin (NIM). The analysis examined reports and websites of Indonesian banks, specifically targeting 89 conventional banks unaffected by any governance changes, such as mergers, acquisitions, or conversion to Sharia Banks, over the duration of the study. The research used panel regression analysis and included bank-specific features as control variables. The results demonstrate that the presence of green loans in a bank's loan portfolio negatively impacts its profitability. Several variables affect the strength of the correlation between green loans and bank profits. Banks' green loans sustainable profitability performance and the economic advantages that follow should be investigated concerning several elements, not just the degree of green development. This paper's research contribution will help commercial banks to improve their financial performance by implementing green loans policies. The government can then further improve these policies to motivate banks to implement green loans and achieve sustainable development. The government should strengthen green loans incentive policies and commercial banks should aggressively expand their green loans operations to encourage the coordinated growth of green finance and an environmentally friendly economy.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de18607263e629d3742a2d27b7bf3b95",
  "timestamp": "2025-05-15T01:22:11.810920"
}