{
  "id": 2374,
  "title": "USE AND RESEARCH OF ERP IN FINANCIAL MANAGEMENT OF LARGE ENTERPRISES USING NONLINEAR SYSTEM",
  "abstract": "The purpose of this paper is to improve the financial management efficiency of large enterprises and enhance the overall operation vitality of enterprises. First, the connotation and characteristics of enterprise resource planning (ERP) are analyzed, and the financial ERP system is established. Then, the relevant dynamic models of nonlinear systems are classified and their characteristics are analyzed. Moreover, the system model of enterprise financial risk management is constructed based on the key success factors of project implementation risk and control flow chart of project life cycle. Finally, based on MATLAB software, Z large enterprise is taken as an example to evaluate the implementation effect of analytical hierarchy process (AHP) algorithm and back propagation neural network (BPNN) algorithm in ERP system. The results reveal that compared with 2019, the capital concentration in 2020 increases by 8%, the operating cost decreases by 23.6%, and the expense reimbursement process time decreases from 60-80 days to about 6 days. The expected output and assessment result of AHP are 6.912 and 6.823, respectively, and the error between them is 0.0196. The expected output and assessment result of BPNN are 6.798 and 6.675, respectively, and the error between them is 0.0121. The error value of BPNN in ERP implementation effect assessment is less than that of AHP, which indicates that the assessment effect of BPNN is better than that of AHP.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de414b9b9a19adacd46eaaa2d255ff83",
  "timestamp": "2025-05-15T02:14:50.281198"
}