{
  "id": 7230,
  "title": "Demand trade-off between PLSs and markups in the presence of a conventional banking relationship: The case of Moroccan companies",
  "abstract": "Theoretical explanations based on information asymmetry constitute the dominant paradigm of the near disappearance of PLSs (profit and loss sharing). This assumption implicitly implies a hypothesis on the power of contractual choice exclusively monopolized by Islamic banks. The theoretical positioning in this study to explain the arbitrage between PLSs and markups is based on a lack of demand. In this sense, this paper attempts to verify the demand trade-off of Moroccan companies between PLSs and markups. A logistic regression was used to establish several findings. The evidence suggests that past banking relationships with conventional banks and debt maturity both favor the commercialization of markups. On the other hand, financial quality of firms has no direct impact on the choice between PLSs and markups. This assertion implies that it is incorrect to assume that sole entrepreneurs undertaking high-risk projects choose to be funded by PLSs. Combining that with the fact that companies that agree to be funded by PLSs agree to share profits, private information and decision-making power, it can be said that PLSs can have a good chance of thriving in Morocco if Islamic banks provide a favorable climate for their marketing.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de4326561254e4f8da7d6a5babd8a561",
  "timestamp": "2025-05-15T03:06:35.362327"
}