{
  "id": 8098,
  "title": "The role of dyad-level factors in shaping sexual and drug-related HIV/STI risks among sex workers with intimate partners",
  "abstract": "Background: Despite high HIV burden among sex workers (SWs) globally, and relatively high prevalence of client condom use, research on potential HIV/STI risk pathways of intimate partnerships is limited. This study investigated partner/dyad-level factors associated with inconsistent condom use among SWs with intimate partners in Vancouver, Canada. Methods: Baseline data (2010-2013) were drawn from a community-based prospective cohort of women SWs. Multivariable generalized estimating equations logistic regression examined dyad-level factors associated with inconsistent condom use (<100% in last six months) with up to three male intimate partners per SW. Adjusted odds ratios and 95% confidence intervals were reported (AOR[95%CI]). Results: Overall, 369 SWs reported having at least one intimate partner, with 70.1% reporting inconsistent condom use. Median length of partnerships was 1.8 years, with longer duration linked to inconsistent condom use. In multivariable analysis, dyad factors significantly associated with increased odds of inconsistent condom use included: having a cohabiting (5.43[2.53-11.66]) or non-cohabiting intimate partner (2.15[1.11-4.19]) (versus casual partner), providing drugs (3.04[1.47-6.301) or financial support to an intimate partner (2.46[1.05-5.74]), physical intimate partner violence (2.20[1.17-4.12]), and an intimate partner providing physical safety (2.08[1.11-3.91]); non-injection drug use was associated with a 68% reduced odds (0.32[0.17-0.60]). Conclusions: Our study highlights the complex role of dyad-level factors in shaping sexual and drug-related HIV/STI risk pathways for SWs from intimate partners. Couple and gender-focused interventions efforts are needed to reduce HIV/STI risks to SWs through intimate partnerships. This research supports further calls for integrated violence and HIV prevention within broader sexual/reproductive health efforts for SWs. (C) 2015 Elsevier Ireland Ltd. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de4a70305f3b42d5ca7508fbb9d0f2a2",
  "timestamp": "2025-05-15T03:15:09.410801"
}