{
  "id": 9268,
  "title": "Identifying high-need patients with multimorbidity from their illness perceptions and personal resources to manage their health and care: a longitudinal study",
  "abstract": "BackgroundA proactive person-centred care process is advocated for people with multimorbidity. To that aim, general practitioners may benefit from support in the identification of high-need patients, i.e. patients who are high or suboptimal users of health services and/or have a poor quality of life. To develop such support, we examined whether knowledge about patients' illness perceptions and personal resources to manage their health and care is useful to identify high-need patients among multimorbid general practice populations.MethodsSurvey data, collected in 2016 and 2017, of 601 patients with two or more chronic diseases (e.g. COPD, diabetes, Parkinson's disease) registered with 40 general practices in the Netherlands were analysed by logistic regression analysis to predict frequent contact with the general practice, contact with general practice out-of-office services, unplanned hospitalisations and poor health related quality of life. Patients' illness perceptions and personal resources (education, health literacy, mastery, mental health status, financial resources, social support) were included as predictors.ResultsThe four outcomes were only weakly associated among themselves (Phi .07-.19). Patients' illness perceptions and personal resources were of limited value to predict potentially suboptimal health service use, but they were important predictors of health related quality of life. Patients with a poor health related quality of life could be identified by their previously reported illness perceptions (attributing many symptoms to their chronic conditions (B=1.479, P <.001), a high level of concern (B=0.844, P =.002) and little perceived control over their illness (B=-0.728, P =.006)) combined with an experienced lack of social support (B=-0.527, P =.042) and a poor mental health status (B=-0.966, P =.001) (sensitivity 80.7%; specificity 68.1%).ConclusionsMultimorbid patients who frequently contact the general practice, use general practice out-of-office services, have unplanned hospitalisations or a poor health related quality of life are largely distinct high-need subgroups. Multimorbid patients at risk of developing a poor quality of life can be identified from specific illness beliefs, a poor mental health status and unmet social needs.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de4ece6c24c7fca8b90785c8fdd8999c",
  "timestamp": "2025-05-15T03:27:24.924517"
}