{
  "id": 261,
  "title": "Efficient Variance Reduction for American Call Options Using Symmetry Arguments",
  "abstract": "Recently it was shown that the estimated American call prices obtained with regression and simulation based methods can be significantly improved on by using put-call symmetry. This paper extends these results and demonstrates that it is also possible to significantly reduce the variance of the estimated call price by applying variance reduction techniques to corresponding symmetric put options. First, by comparing performance for pairs of call and (symmetric) put options for which the solution coincides, our results show that efficiency gains from variance reduction methods are different for calls and symmetric puts. Second, control variates should always be used and is the most efficient method. Furthermore, since control variates is more effective for puts than calls, and since symmetric pricing already offers some variance reduction, we demonstrate that drastic reductions in the standard deviation of the estimated call price is obtained by combining all three variance reduction techniques in a symmetric pricing approach. This reduces the standard deviation by a factor of over 20 for long maturity call options on highly volatile assets. Finally, we show that our findings are not particular to using in-sample pricing but also hold when using an out-of-sample pricing approach.",
  "year": 2021,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de553fa6706734c5daeb8461ab43eb87",
  "timestamp": "2025-05-15T01:30:19.034784"
}