{
  "id": 5894,
  "title": "The influence of female leadership on the cash holdings of listed companies in Vietnam",
  "abstract": "This study examines the relationship between female leadership factors and the cash holdings of Vietnamese companies. The random effects regression model (REM) is used with panel data from the financial statements of 174 companies listed on the Ho Chi Minh Stock Exchange in the period 2013-2020. Besides control variables, factors related to female leadership including the female CEO, the percentage of women on the board of executives, the female chairman, the percentage of women on the board of directors, and duality are included in the research model with the expectation of having a positive effect on cash holdings. The estimation results show that companies with female executives hold more cash and maintain lower levels of financial leverage than companies with male executives. Female executives will increase profitability and reduce the risk to the company. The influence level of the female on the Board of Directors on the company's cash holdings depends on the characteristics of each company. Besides, the results also show that net working capital, cash flow, ROA, and dividend payment have a positive correlation with the cash holdings of the company. Listed companies should pay attention to two factors: the proportion of women on the Board of Directors and female executives in order to diversify gender in the leadership and improve the ability to decide on financial strategies. (c) 2022 The Authors. Published by IASE. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de58225af631cafb3634d30cabe467ab",
  "timestamp": "2025-05-15T02:52:31.475908"
}