{
  "id": 3538,
  "title": "Using Asymmetric Cost Matrices to Optimize Care Management Interventions",
  "abstract": "The majority of health care expenditures are incurred by a small portion of the population. Care management or intervention programs may help reduce medical costs, especially those of extremely high-cost members. For these programs to be effective, however, the insurer must identify and select potential high-cost members to be assigned to an intervention before they incur those costs. Because high medical costs are often connected to an accident or traumatic event that cannot be anticipated, it can be difficult to predict who will be high-cost in the future. In this article, we explore the use of machine learning in predicting high-cost members. Specifically, we use the extreme gradient boosting algorithm to develop risk scores for members based on demographic, medical, and financial histories. To select members for intervention, we develop asymmetric cost matrices that account for potentially unequal savings or losses for assigning interventions to members. We show how these matrices can be reduced to a function of the expected savings per dollar of intervention, which is easily used to optimize the risk score threshold at which members are assigned an intervention. These techniques, which can be tailored to the specific needs of an insurer, may help insurers select the optimal members for intervention programs, reduce overall costs, and improve member health outcomes.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de62713ddc5f347d5c94023967b179c3",
  "timestamp": "2025-05-15T02:27:19.104488"
}