{
  "id": 6936,
  "title": "Exploring Socioeconomic Disparities in Mandibular Trauma: A Retrospective Cohort Analysis of Patient Profiles and Treatment Outcomes",
  "abstract": "Study Design: Retrospective Chart Review. Objective: Mandible fracture is a life-altering event, and its complications can have devastating consequences for patients. Patients are therefore well-served if providers can identify their risk factors and engage strategies to reduce complication risk. The present study examines mandible trauma in an urban tertiary hospital serving an economically disadvantaged population. Methods: This review identified all patients undergoing operative repair of traumatic mandible fractures from January 2015 to December 2020. Patient risk factors, operative technique, and surgical complications (including infection, hardware failure, malunion, and mandible nonunion) were analyzed. Results: Two hundred and seventy-two patients were identified with mandible fractures; 78.3% of these injuries were related to interpersonal violence; 83.4% of patients were male, and 55.5% were African American. Based on multivariable logistic regression models, increased rates of postoperative complications were observed in patients with increasing Area Deprivation Index (Odds Ratio 1.02), mandible body fracture (OR 3.11), tobacco use disorder (OR 3.75), history of hepatitis C infection (OR 7.35), and discharge to drug and alcohol rehabilitation (OR 23.42). Conclusions: For providers treating patients with mandible fractures, the effects of comorbid substance use-including tobacco use-and inadequate discharge disposition (a reflection of financial means and insurance status) should be identified early, and steps to mitigate their consequences should be taken. Providers must recognize that patients with these comorbidities require more patience, support, and attention than patients without these risk factors. Increased engagement with multidisciplinary services such as psychiatry, addiction medicine, primary care, and social work may improve outcomes for these vulnerable patients.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de65d1c74746aee294f790e9f0e76ce8",
  "timestamp": "2025-05-15T03:03:13.466528"
}