{
  "id": 6049,
  "title": "The corporate credit rating changes and firm returns in a transitional economy: The case of South Africa",
  "abstract": "Background: Investors depend on rating agencies to provide an independent assessment of the ability of companies operating in the transition economy to meet their debt obligations. Any change in a firm's credit rating conveys informed signals about the financial health of the firm and that information should offer markets better knowledge about the future prospects of the firm's ability to pay creditors and equity holders. What we do not know is the magnitude of the impact of credit rating change on the stock yields of companies operating in a transitional and risky economy like South Africa. The literature indicates that the amount of influence that a rating agency has on equity returns is ambiguous. Objectives: The purpose of this study is to determine whether companies' share prices react to a change in credit rating. The study also investigates the financial risk factors that differentiate between credit rating downgrades and upgrades. Methods: The event study methodology was utilised to measure the abnormal returns of companies listed on the Johannesburg Stock Exchange (JSE) that had a credit rating change between 2005 and 2015. Logistic regression was used to establish the financial factors influencing the direction of credit rating change. Results: We found that there was no significant impact evident on equity prices when companies' credit rating upgrades were announced by the credit rating agencies, indicating that the upgrades are largely anticipated by the market at the time they are announced. However, the market reacts significantly negatively when companies' credit rating downgrades are announced, suggesting that only credit rating downgrades contain relevant pricing information. The finding implies that the credit rating downgrades may lead to disinvestment from the economy, leading to deterioration in macroeconomic indicators in the country within which the firm operates. Furthermore, factors, including interest cover and firm earnings, are significant in differentiating between credit rating upgrades and downgrades, implying that debt issuers in South Africa can manage their credit rating by managing specific financial risk factors. Conclusion: In an emerging and transitional economy like South Africa, the market reacts significantly negatively to credit rating downgrades, just as they do in developed countries like the USA. Stock prices react negatively to credit rating downgrades because credit rating agencies convey adverse private information about a company through these downgrades.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de6b59d062dfe37a6f5780d76ca1dd7f",
  "timestamp": "2025-05-15T02:54:03.489668"
}