{
  "id": 4294,
  "title": "Experiences of Self-Sampling and Future Screening Preferences in Non-Attenders Who Returned an HPV Vaginal Self-Sample in the YouScreen Study: Findings From a Cross-Sectional Questionnaire",
  "abstract": "BackgroundWe assessed experiences of human papillomavirus (HPV) vaginal self-sampling and future screening preferences in an ethnically and socio-economically diverse group of women overdue for cervical screening.Setting and ParticipantsA postal questionnaire was embedded in the YouScreen self-sampling trial in England: 32.5% (2712/8338) of kit completers returned the survey. Kit non-completers were encouraged to return a questionnaire, but no responses were received. Participants were ethnically diverse (40.3% came from ethnic minority backgrounds), and 59.1% came from the two most deprived quintiles. Differences in confidence in kit completion, trust in the test results and intention to attend a follow-up test if HPV-positive were evaluated using Pearson's chi 2 analyses. Binary logistic regression models explored predictors of a future screening choice and preferences for urine versus vaginal self-sampling.ResultsMost kit-completers reported high confidence in self-sampling (82.6%) and high trust in the results (79.9%), but experiences varied by ethnicity and screening status. Most free-text comments were positive but some reported difficulties using the device, pain or discomfort. Most women would opt for self-sampling in the future (71.3% vs. 10.4% for a clinician-taken test) and it was more often preferred by ethnic minority groups, overdue screeners and never attenders. Urine self-tests were preferred to vaginal tests (41.9% vs. 15.4%), especially among women from Asian, Black or Other Ethnic backgrounds.ConclusionsKit-completers were confident, found the test easy to complete, and trusted the self-sample results. However, experiences varied by ethnic group and some women highlighted difficulties with the kit. Most women would prefer self-sampling in the future, but it was not a universal preference, so offering a choice will be important.Patient or Public ContributionWe did not have direct patient and public involvement and engagement (PPIE) in the questionnaire design. However, patients and public representatives did input into the design of the YouScreen trial and reviewed the wider study materials (e.g. participant information sheet).Trial RegistrationThis questionnaire study was embedded in the YouScreen trial. The protocol for the YouScreen trial is available at . The National Institute for Health Research 43 Clinical Research Network (NIHR CRN) Central Portfolio Management System (CPMS) ID is 4441934.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de7dc9b34bbc654ca1272e86a9aa59d4",
  "timestamp": "2025-05-15T01:25:50.474036"
}