{
  "id": 2800,
  "title": "A RELEVANCE VECTOR MACHINE WITH ROUGH SET THEORY MODEL IN ANALYZING THE LIFE CYCLE OF NEW ECONOMIC FIRMS",
  "abstract": "The subprime mortgage crisis and subsequent financial tsunami have raised considerable concerns about financial risk management and evaluation. This is nowhere more apparent than in new economic firms (NEFs) with large economic targets and heavy R&D expenses, such as firms in the electronics industries. With its potential for extreme growth and superior profitability, the electronic industries in Taiwan have been in the financial stock market spotlight. Recently, the relevance vector machine (RVM) was reported to have considerably less computation complexity than support vector machines (SVM) models, since it uses fewer kernel functions. Another emerging technique is rough set theory (RST), which derives rules from data. Based on the corporation life cycle theory (CLC), this study developed a relevance vector machine with rough set theory (RVMRS) to predict the status of a corporation in the decline stage. To demonstrate the performance of the designed RVMRS model, the study used electronic industries data from the Taiwan Economic Journal data bank, Taiwan Security Exchange, and Securities and Futures Institute in Taiwan. Experimental results revealed that the presented RVMRS model can predict the decline stage in a firm's life cycle with satisfactory accuracy, and generate rules for investors, managers, bankers and regulators that enable them to make suitable judgments. In addition, this study proved that the transparency and information disclosure index (TDI) is crucial to predicting the financial decline of corporations.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de81154fab1706bb40c1d67d7c2a3bcc",
  "timestamp": "2025-05-15T02:19:08.482220"
}