{
  "id": 4907,
  "title": "Predictors of unplanned readmission in patients undergoing lumbar decompression: multi-institutional analysis of 7016 patients",
  "abstract": "Object. Unplanned hospital readmission represents a large financial burden on the Centers for Medicare and Medicaid Services, commercial insurance payers, hospitals, and individual patients, and is a principal target for cost reduction. A large-scale, multi-institutional study that evaluates risk factors for readmission has not been previously performed in patients undergoing lumbar decompression procedures. The goal of this multicenter retrospective study was to find preoperative, intraoperative, and postoperative predictive factors that result in unplanned readmission (UR) after lumbar decompression surgery. Methods. The National Surgical Quality Improvement Program (NSQIP) database was retrospectively reviewed to identify all patients who received lumbar decompression procedures in 2011. Risk-adjusted multivariate logistic regression analysis was performed to estimate independent predictors of UR. Results. The overall rate of UR among patients undergoing lumbar decompression was 4.4%. After multivariate logistic regression analysis, anemia (odds ratio [OR] 1.48), dependent functional status (OR 3.03), total operative duration (OR 1.003), and American Society of Anesthesiologists Physical Status Class 4 (OR 3.61) remained as independent predictors of UR. Postoperative complications that were significantly associated with UR included overall complications (OR 5.18), pulmonary embolism (OR 3.72), and unplanned reoperation (OR 56.91). Conclusions. There were several risk factors for HR after lumbar spine decompression surgery. Identification of high-risk patients and appropriate allocation of resources to reduce postoperative incidence may reduce the readmission rate.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "de9d1fd323718bcce65b966bc40a1617",
  "timestamp": "2025-05-15T02:42:04.944091"
}