{
  "id": 5551,
  "title": "What Incentives Are Created by Medicare Payments for Total Hip Arthroplasty?",
  "abstract": "Background: Differences in profitability and contribution margin (CM) between various patient populations may make certain patients particularly attractive (or unattractive) to providers. This study seeks to identify patient characteristics associated with increased profit and CM among Medicare patients undergoing total hip arthroplasty (THA). Methods: The expected Medicare reimbursement for consecutive patients of Medicare-eligible age (65+ years) undergoing primary unilateral elective THA (n = 498) was calculated in accordance with Center for Medicare and Medicaid Services policy. Costs were derived from the hospital's cost accounting system. Profit and CM were calculated for each patient as reimbursement less total and variable costs, respectively. Patients were compared based on clinical and demographic factors by univariate and multivariate analyses. Results: Medicare patients undergoing THA generated negative average profits but substantial positive CMs. Lower profit and CM were associated with higher American Society of Anesthesiologists Physical Status Classification (P < .01, P = .03), older age (P < .01), and longer length of stay (P < .01, P = .03). No association was found with gender, body mass index, or race. Conclusion: If our results are generalizable, Medicare patients requiring THA are currently financially attractive, but institutions have a long-term incentive to shift resources to more profitable patients and service lines, which may eventually restrict access to care for this population. THA providers have a financial incentive to favor Medicare patients with younger age, lower American Society of Anesthesiologists Physical Status Classification, and those who can be expected to require relatively short admissions. The Center for Medicare and Medicaid Services must strive to accurately match reimbursement rates to provider costs to avoid inequitable payments to providers and financial incentives discouraging treatment of high-risk patients or other patient subpopulations. (C) 2016 Elsevier Inc. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "deaec622b6112de243a9d25bf982fcde",
  "timestamp": "2025-05-15T02:48:51.376097"
}