{
  "id": 4175,
  "title": "The Impact of Perceived Risk on the Capital Market's Reaction on Outsourcing Announcements",
  "abstract": "Outsourcing has become a widely accepted option in strategic management which, as every business venture, bears chances and risky. Supplementing the popular area of research on the merits of outsourcing, this paper examines how stockholders rate the corporate sourcing decision with regard to the perceived risk they associate with this transaction. Using event study methodology and multivariate cross-sectional OLS-regression, we analyze a sample of 182 outsourcing transactions of the global financial services industry between 1998 and 2004 in order to investigate the risk-specific drivers of excess returns to shareholders. The analysis studies the impact of risk-specific independent variables which include the transaction size, length, outsourced business functionality, and experience with outsourcing. Our findings indicate that risk mitigating strategies have significant explanatory power, indicating that capital markets reaction to an outsourcing announcement might at least partly be forecasted. Results show a positive correlation of market reaction and business process outsourcing of financial services companies. We also find strong evidence indicating that capital markets react positively towards relative large transactions compared to the market capitalization of the outsourcing firm. For service providers our results show that traditional IT-related sourcing projects or insourcing of administrative processes has a significant positive correlation with market reaction.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dec2219258106311ec72ca1e4537c3a9",
  "timestamp": "2025-05-15T02:34:13.362983"
}