{
  "id": 4292,
  "title": "National institutes of health: Analysis of gender differences in anesthesiology research funding",
  "abstract": "Although studies have shown an increase in the representation of women in academic anesthesiology, it remains one of the medical specialties most dominated by men. While gender disparities have been identified in academic anesthesiology, literature on discrepancies in funding allocated by the National Institutes of Health (NIH) is scarce. The objective of the present study was to explore these discrepancies from 2017 to 2020 and assess potential changes in funding trends over time. Publicly available funding data was retrospectively obtained from the NIH Research Portfolio Online Reporting Tools Expenditure and Results (RePORTER) database for fiscal years 2017 to 2020. Information regarding each principal investigator (PI) was obtained from the Scopus database and institutional websites. For statistical comparison of continuous variables, Mann-Whitney U tests were performed. Simple linear regression analyses assessed the relationship between fiscal year and number of NIH grants awarded to PIs. Median NIH amount per grant [interquartile range (IQR)] was determined to be $359,038 ($233,947-$476,933) for PIs that were men, greater than that of $330,865 ($164,268-$458,785) for PIs that were women (p < .05). Similarly, men received a greater median NIH grant amount per PI, with a value of $348,751 ($222,043-$442,075), compared to women who received $268,634 ($161,159-$414,384) (p < .05). When stratified by terminal degree, significantly higher median grant amounts (p < .05) were awarded to MD and PhD holders who were men versus their women counterparts. Lastly, an increasing trend in obtaining NIH grants between 2017 and 2020 was observed for PIs that were men overall, including PIs holding MD/PhD degrees (p < .05). No such trend was observed for PIs who were women. This study demonstrates a significantly greater number of NIH grants and higher award values allocated to researchers who were men than researchers who were women in academic anesthesiology over the past four years. Moreover, an increase in the number of grants secured by PIs who were women from 2017-2020 was not observed. In the future, longitudinal trends in NIH funding for principal investigators (PIs) of both genders in anesthesiology should be investigated.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dec76c99f8d314f97c7c5623e1d06319",
  "timestamp": "2025-05-15T01:25:50.472380"
}