{
  "id": 5469,
  "title": "Socioeconomic and Behavioral Determinants of Cardiovascular Risk in Russia: A Structural Equation Modeling Approach",
  "abstract": "Purpose: Despite much attention within the literature, the multiple risk factors associated with CVD mortality in Russia are still not fully understood. Drawing on the Health Belief Model as a theoretical framework, we aim to elicit socioeconomic and behavioral determinants of cardiovascular risks in Russian men and women. Methods: Using the Know Your Heart project data, we utilize regression analysis and then structural equation modeling (latent class analysis and mediation analysis) to study the determinants of CVD risks.Results: OLS and ordered logit regressions show that the key factors defining cardiovascular health behaviors in Russia are health -related actions to reduce the perceived threat of diseases (physical activity and GP visits), perceived barriers to behavioral change (financial constraints), and cues to action (awareness of the federal health check-up program). The latent class analysis further identifies three distinct groups of the population with different CVD risk levels. Over one-third of respondents belong to the high CVD risk class characterized by the highest share of smokers and alcohol abusers who evade contact with primary care and face financial constraints. In the mediation analysis, we find that employment mediates the relationship between physical activity and CVD risks: physically active individuals have a greater chance of employment, and employment further mitigates CVD risks. We also find an indication of the selection of the healthy into employment in the causal relationship between GP visits, having a job, and CVD risks.Conclusion: A corresponding set of policy actions stem from these findings. These include reinforcing the change of perceptions of CVD risks and lowering barriers to health care; raising awareness of the free preventive check-up program in the high CVD risk group; making sports and exercise accessible to the elderly; and using off-putting labels on alcohol products as behavioral nudges among physically active but drinking males.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dec8222407fc726ad2f7d706aeb00468",
  "timestamp": "2025-05-15T02:48:23.566776"
}