{
  "id": 5892,
  "title": "Prevalence of stressful life events during pregnancy and its association with postpartum depressive symptoms",
  "abstract": "Experiencing stressful life events (SLEs) has negative consequences for both mother and infant. This study examined the predictive contributions of (1) experiences of each SLE separately and its association with postpartum depressive symptoms (PDS), (2) experiences of cumulative number of SLEs and PDS, and (3) the cumulative experiences of SLEs across three domains (relational, financial, physical health). Georgia's Pregnancy Risk Assessment Monitoring System data were obtained from 2004 to 2011. Chi-square tests and a combination of weighted logistic regression models were conducted to predict self-reported PDS. Odds ratios (OR) and 95 % confidence intervals (CI) were reported. A total of 10,231 women were included in the analysis; 15 % of the mothers reported PDS. Arguments with partner, trouble paying bills, and separation/divorce significantly predicted increased odds of PDS. Increased odds of PDS were observed with increasing numbers of cumulative SLEs. Experiencing high stress in any domain significantly predicted PDS with the highest predictor being high stress across all domains, followed by experiencing a combination of high relational and financial stress. SLEs were associated with reporting PDS among new mothers in Georgia. It is important to assess for SLEs during prenatal care and provide resources aimed at reducing the impact of SLEs.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dec8198eddab67f0b0006cabc278243d",
  "timestamp": "2025-05-15T02:52:31.459445"
}