{
  "id": 469,
  "title": "Integrated Patent Landscape Analysis Based on Semiconductor Infringement Landmark Cases",
  "abstract": "This research conducts integrated patent landscape analyses based on the landmark cases of patent infringement disputes between VLSI Technology and Intel. Complex multidisciplinary semiconductor knowledge ontology and taxonomy are derived from the landmark cases. Since Intellectual property (IP) and patent legal right protections defensively and offensively are critically important to high-tech companies for remaining globally competitive, the analysis of the patent portfolio consisting of the multiple technology innovations is the major challenge of this research. First, the patent search based on keywords of the patents under dispute. Afterward, the patenting trends of top assignees in the semiconductor industry, ranked in top International Patent Classification (IPC) codes, are analyzed. Further, this research performs topic clustering, a form of non-supervised learning, to divide all domain patents into unique topic groups. The ontology schema, based on the topic clustering results, builds the critical domain knowledge map, which can be used to highlight transdisciplinary technologies and their IPs. The research ensures newly granted patents, which focus on the disputed technical topics with literally or equally similar claims, must be cautious about the rist of potential infringement disputes. In the future, this transdisciplinary approach can be applied to various industries for IP protection",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "decd7a6450c498acab4db9e33c3c34cf",
  "timestamp": "2025-05-15T00:43:47.381205"
}