{
  "id": 31,
  "title": "Study on Early Warning on the Financial Risk of Project Venture Capital through a Neural Network Model",
  "abstract": "paper aims to effectively reduce the financial loss of enterprises by accurately and reasonably making early warning of investment project risks. This paper briefly introduced the index system used for investment project risk early warning. It constructed a project investment risk earlywarning model with a back-propagation neural network (BPNN) algorithm, and improved it with a genetic algorithm (GA) to solve the defect that the traditional BPNN is easy to fall into, over-fitting when reversely adjust parameters. An analysis was conducted on an electric power company in Hunan Province. Orthogonal experiments are performed to determine the population size and the number of hidden layers in the improved BPNN algorithm. The results showed that the improved BPNN algorithm had the best performance when the population size was set as 25 and the number of hidden layers was four; compared with support vector machine (SVM) and traditional BPNN algorithms, the GA-improved BPNN algorithm had better performance for early risk warning of investment projects. In conclusion, adjusting the parameters of a BPNN with a GA in the training stage can effectively avoid falling into over-fitting, thus improving the early warning performance of the algorithm; in addition, the improved BPNN has better early warning performance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ded5c2ea2fb7083eb6c941d048b6d1cc",
  "timestamp": "2025-05-15T01:46:03.817427"
}