{
  "id": 2187,
  "title": "Resolution of Corporate Financial Distress: An Empirical Analysis of Processes and Outcomes",
  "abstract": "In this article, Jacobs, Karagozoglu, and Naples Layish focus on determining which types of firms are able to successfully remain independent entities through the resolution of their financial distress. The authors empirically investigate the determinants of the process utilized to resolve financial distress (private work-out versus public bankruptcy filing) and also the outcome (liquidation versus reorganization). After developing various qualitative-dependent variable models, they estimate and compare several accounting and economic variables measured at the time of default that they expect can influence the resolution process and outcome. Results reveal the ordered logistic regression specification achieves the best balance between in-sample fit, consistency with financial theory, and out-of-sample classification accuracy, as compared to more elaborate techniques, such as local regression or neural networks. The authors find the public resolution process to be associated with larger firms that have less tangibility, a greater proportion of secured debt in their capital structures, or higher risk measures. The private resolution process is likelier for firms that have more total leverage, greater measures of liquidity a higher proportion of subordinated debt in their capital structures, or reside in a debtor-friendly bankruptcy court district. Regarding the resolution outcome, the authors find that firms that are more likely to be liquidated than reorganized have greater liquidity, more secured debt, lower cumulative abnormal returns on equity, higher loss given default, a less favorable auditor's opinion, or they will default in a better part of the credit cycle. Finally, firms more likely to be reorganized have greater leverage, more intangible assets, or a prepackaged bankruptcy. They conclude that their model is useful for risk managers and investors who are in the market for distressed or defaulted debt.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dee338385e6a3d17c332f726cf282af4",
  "timestamp": "2025-05-15T02:12:17.415876"
}