{
  "id": 7661,
  "title": "The secrets to successful entrepreneurship: how occupational experience shapes the creation and performance of start-ups",
  "abstract": "PurposePrevious experience is a critical factor affecting entrepreneurial activities; however, it has not been fully studied in the existing literature. This study attempts to comprehensively reveal the routes and mechanisms of occupational experience that affect entrepreneurial activities and assess the entrepreneurial potential of different occupational practitioners.Design/methodology/approachBy matching occupational characteristics with entrepreneurs' competence, this study proposes ten hypotheses about how occupational experience affects entrepreneurial entry and performance. This empirical study is based on the Occupational Information Network database and Chinese survey data. Factor and regression analyses were used in the empirical research.FindingsThis study verifies that different occupational practitioners have varied entrepreneurial potential. Occupational experience, including occupational uncertainty, market contact and social capital, gained from previous experience significantly affects entrepreneurial entry. Meanwhile, occupational characteristics, including management experience, marketing experience, social capital, financial capital, risk-taking ability and creativity, accumulated from previous experience, have a significant impact on entrepreneurial performance.Originality/valueThis study is a pioneering attempt to reveal the relationship between occupational experience and entrepreneurial activities. The transmission mechanism of previous experiences affecting entrepreneurial activities is comprehensively revealed by relaxing the assumption of a representative occupation. These findings provide a theoretical foundation for empirical evidence and have important practical value.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df0d6f57503ba54555a1ea921b28ee23",
  "timestamp": "2025-05-15T03:10:33.144034"
}