{
  "id": 1033,
  "title": "Diagnosis Osteoporosis Risk: Using Machine Learning Algorithms Among Fasa Adults Cohort Study (FACS)",
  "abstract": "IntroductionIn Iran, the assessment of osteoporosis through tools like dual-energy X-ray absorptiometry poses significant challenges due to their high costs and limited availability, particularly in small cities and rural areas. Our objective was to employ a variety of machine learning (ML) techniques to evaluate the accuracy and precision of each method, with the aim of identifying the most accurate pattern for diagnosing the osteoporosis risks.MethodsWe analysed the data related to osteoporosis risk factors obtained from the Fasa Adults Cohort Study in eight ML methods, including logistic regression (LR), baseline LR, decision tree classifiers (DT), support vector classifiers (SVC), random forest classifiers (RF), linear discriminant analysis (LDA), K nearest neighbour classifiers (KNN) and extreme gradient boosting (XGB). For each algorithm, we calculated accuracy, precision, sensitivity, specificity, F1 score and area under the curve (AUC) and compared them.ResultsThe XGB model with an AUC of 0.78 (95% confidence interval [CI]: 0.74-0.82) and an accuracy of 0.79 (0.75-0.83) demonstrated the best performance, while AUC and accuracy values of RF were achieved (0.78 and 0.77), LR (0.78 and 0.77), LDA (0.78 and 0.76), DT (0.76 and 0.79), SVC (0.71 and 0.64), KNN (0.63 and 0.59) and baseline LR (0.72 and 0.82), respectively.ConclusionThe XGB model had the best performance in assessing the risk of osteoporosis in the Iranian population. Given the disadvantages and challenges associated with traditional osteoporosis diagnostic tools, the implementation of ML algorithms for the early identification of individuals with osteoporosis can lead to a significant reduction in morbidity and mortality related to this condition. This advancement not only alleviates the substantial financial burden placed on the healthcare systems of various countries due to the treatment of complications arising from osteoporosis but also encourages health policies to shift toward more preventive approaches for managing this disease.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df1b9f488faffbacdd1ecfa43bf013e1",
  "timestamp": "2025-05-15T01:58:08.491399"
}