{
  "id": 535,
  "title": "Developing the value of legal judgments of supply chain finance for credit risk prediction through novel ACWGAN-GPSA approach",
  "abstract": "Predicting the credit risk for enterprises in Supply Chain Finance (SCF) often presents substantial challenges in supply chain management community. Considering the huge information asymmetry, we introduce the Bidirectional Encoder Representations from Transformers (BERT) technology in the fields of Deep Learning and Natural Language Processing (NLP) to extract textual insights from legal judgments related to enterprises in SCF business. By integrating legal judgments-extracted information with the financial and corporate attributes of these enterprises, we aim to enhance the prediction accuracy of credit risk. Our empirical results show that the amalgamation of multi-source information significantly reinforces the predictive accuracy of credit risk. Furthermore, we effectively identify critical predictive factors for credit risk, demonstrating the important role of legal judgment content in default prediction situations. Additionally, considering the issue of imbalanced data categories, we propose a novel imbalanced data processing technique called ACWGAN-GPSA to address the generation of unrealistic samples, thereby significantly improving the performance of credit risk prediction models for enterprises in SCF. The strategic insights obtained from our findings offer valuable guidance for both lenders and financial institutions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df2928a17236691187b435e257d16f77",
  "timestamp": "2025-05-15T01:39:38.240728"
}