{
  "id": 4236,
  "title": "Financial markets' reactions to the 2023 Israel war: an empirical perspective from stock markets",
  "abstract": "PurposeThis study aims to underline the unique reactions of stock markets to the event of war. The paper undertakes a comparative assessment of the impact of the ongoing Israel war on selected indexes of leading stock markets.Design/methodology/approachThe research design of this study is based on the autoregressive conditional heteroscedasticity models (Bollerslev, 1986; Nelson, 1991) to examine returns and volatilities, the event study methodology (Fama et al., 1969) to assess abnormal returns surrounding event days and the quantile regression approach (Koenker and Bassett, 1978) to further appraise the robustness of the results. The dataset includes principal stock exchanges collected from international markets and from the region of the war.FindingsThe results indicated a significant effect of the war on the volatility and returns of the selected markets. The cumulative abnormal returns revealed several distinctive findings. Among them, two seminal indications can be pointed out. First, the considerable declines to the war were identified at the event window [2, 11] for the entire sample of capital markets. Second, a salient number of stock exchanges established positive reactions during the post-event period of the war. This outcome suggests that abnormal profits are possible instantaneously after the war. Further, the results of the quantile regression analysis demonstrated that international stock markets are not showing substantial responses to the war, and regional stock markets disclosed significant positive effects. In a nutshell, the results are in line with the efficient market hypothesis. They documented the significance of wars to abnormal returns of stock markets.Research limitations/implicationsThe findings of the paper are notable for investment decisions and portfolio management. Evidence proposed that the performance of advanced markets is favorable during the war. Investors and market participants can adopt this output to enhance investment strategies to achieve sustainable returns. Further, this paper highlighted a necessity to design policies to support financial activities in stock markets that displayed damages due to the war. Such policies call for close collaborations between policymakers and business leaders. Besides, the limitation of the research is possibly the exclusion of control variables due to a lack of data.Originality/valueThis study is considered the first to originate a comparative analysis of the effect of the current Israel war on selected stock exchanges. Further, it challenges findings that wars have a durable negative effect on overall stock markets. Therefore, the core results contribute prominent evidence to the steadily growing literature on the performance of stock markets during wartime.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df3e4f937dc1f75605318875b16e6338",
  "timestamp": "2025-05-15T01:24:51.543692"
}