{
  "id": 7982,
  "title": "Management accountants' susceptibility to overconfidence: the overplacement perspective",
  "abstract": "Purpose Overconfidence bias is considered to be a very influential decision-making bias in the business environment. This paper aims to identify the susceptibility of management accountants to overconfidence-related overplacement bias and to determine its pervasiveness among these professionals. Design/methodology/approach Two international samples of management accountants were surveyed using overplacement bias elicitation questions. The hypothesis that bias susceptibility varies between management accountants in different hierarchical employment positions was tested employing binary logistic regression. Findings Management accountants are found to be susceptible to overplacement bias, yet its pervasiveness among the samples is similar to other sample populations in comparable studies. Management accountants in the position of Chief Financial Officer (CFO) were found to be more susceptible to overplacement bias than their colleagues in other management accountant and business management positions. Research limitations/implications The use of convenience sampling represents a limitation of the research. Practical implications The findings confirm that there is a need for syllabi and continual professional development projects to educate management accountants on this bias. CFOs are especially at risk of being overconfident, which may not be in the best interest of the business. Originality/value This is the first paper to assess overplacement bias in management accountants as a group of decision-makers, especially within the context of their increasing involvement in business decision-making.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df47c49e18fa55c797c45488619b35b3",
  "timestamp": "2025-05-15T03:14:07.201426"
}