{
  "id": 9385,
  "title": "Periodontitis and Outer Retinal Thickness: a Cross-Sectional Analysis of the United Kingdom Biobank Cohort",
  "abstract": "Purpose: Periodontitis, a ubiquitous severe gum disease affecting the teeth and surrounding alveolar bone, can heighten systemic inflammation. We investigated the association between very severe periodontitis and early biomarkers of age -related macular degeneration (AMD), in individuals with no eye disease. Design: Cross-sectional analysis of the prospective community -based cohort United Kingdom (UK) Biobank. Participants: Sixty-seven thousand three hundred eleven UK residents aged 40 to 70 years recruited between 2006 and 2010 underwent retinal imaging. Methods: Macular -centered OCT images acquired at the baseline visit were segmented for retinal sublayer thicknesses. Very severe periodontitis was ascertained through a touchscreen questionnaire. Linear mixed effects regression modeled the association between very severe periodontitis and retinal sublayer thicknesses, adjusting for age, sex, ethnicity, socioeconomic status, alcohol consumption, smoking status, diabetes mellitus, hypertension, refractive error, and previous cataract surgery. Main Outcome Measures: Photoreceptor layer (PRL) and retinal pigment epithelium-Bruch's membrane (RPE-BM) thicknesses. Results: Among 36 897 participants included in the analysis, 1571 (4.3%) reported very severe periodontitis. Affected individuals were older, lived in areas of greater socioeconomic deprivation, and were more likely to be hypertensive, diabetic, and current smokers (all P < 0.001). On average, those with very severe periodontitis were hyperopic (0.05 +/- 2.27 diopters) while those unaffected were myopic (-0.29 +/- 2.40 diopters, P < 0.001). Following adjusted analysis, very severe periodontitis was associated with thinner PRL (-0.55 mm, 95% confidence interval [CI], -0.97 to -0.12; P = 0.022) but there was no difference in RPE-BM thickness (0.00 mm, 95% CI, -0.12 to 0.13; P = 0.97). The association between PRL thickness and very severe periodontitis was modified by age ( P < 0.001). Stratifying individuals by age, thinner PRL was seen among those aged 60 to 69 years with disease (-1.19 mm, 95% CI, -1.85 to -0.53; P < 0.001) but not among those aged < 60 years. Conclusions: Among those with no known eye disease, very severe periodontitis is statistically associated with a thinner PRL, consistent with incipient AMD. Optimizing oral hygiene may hold additional relevance for people at risk of degenerative retinal disease. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Science 2024;4:100472 (c) 2024 by the American Academy of Ophthalmology. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/ 4.0/).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df49d6ed031295279b5c451c9eee304b",
  "timestamp": "2025-05-15T03:28:17.583070"
}