{
  "id": 5864,
  "title": "Chronic Health Cost Burden in Older Caregivers and NonCaregivers in the United States",
  "abstract": "Background and Objectives Chronic health conditions affect the physical and financial well-being of millions of older adults, including those who themselves provide care to relatives and friends. As well, certain conditions cost more than others to manage, and older caregivers may be especially at risk of experiencing financial burden from an illness. This study investigated the association between caregiving and longitudinal change in health cost burden by measuring condition-specific expenses in a nationally representative sample of older caregivers and noncaregivers.Research Design and Methods Three waves of the Health and Retirement Study (HRS) were used in the analysis. Caregiver sociodemographic and financial status was matched with updated treatment and lost-wage costs for chronic conditions developed by the Milken Institute. Profiles of health cost burden were created for community-dwelling adults 60 years and older who completed the HRS core survey for all 3 wave years from 2016 to 2020 (N = 10,540). Bivariate and regression analyses were used to examine differences in health cost burden between caregivers and noncaregivers over time.Results Compared with noncaregivers, caregivers were healthier and less burdened at baseline. Yet, holding other variables constant, caregivers showed steeper increases in chronic condition prevalence and costs over a four-year period after initiating caregiving activities.Discussion and Implications Findings suggest that whereas older caregivers may appear to select into the caregiving role while healthier, they are more likely to experience increased economic and health burdens over time-both from medical treatment and lost wages-related to chronic conditions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df508b412c1e03dd2da5bc696ccd0d9e",
  "timestamp": "2025-05-15T02:52:31.356196"
}