{
  "id": 6227,
  "title": "Diversification of revenues in credit unions in Brazil and their influence on financial performance",
  "abstract": "Purpose: To analyze the effect of revenue diversification on the financial performance of Credit Union in Brazil, from 2014 to 2018. Methodology: The panel data regression model was used and 263 credit unions were evaluated, making a total of 2,630 observations. The data were obtained from the Central Bank of Brazil. The variables were defined according to the study by Mathuva (2016), in which the dependent variables were ROA, ROE and their volatility measures. Results: The results indicated that the diversification of activities in the cooperatives positively influenced the financial performance, and the signs found indicated that the more balanced this process is, the better the result and the lower the risk, given by the volatility of returns. When specifically evaluating service revenues, that is, the direct effect of this revenue source, an inverse relationship with performance was found and that returns become more volatile as cooperatives increase service revenues. These results may be due both to the maturity stage of the cooperatives in these business lines whose participation in the formation of revenues is still low, as well as suggest that the performance of the cooperatives tends to be expanded by expanding the provision of services and at the same time strengthening existing business lines, in which the institution has comparative advantages. The combined effect of these different sources of funds is that, during the analyzed period, it had an influence on the performance of Brazilian credit unions. Contributions of the Study: Assessing the factors that influence the performance of credit unions contributes to the definition of growth promotion strategies for these institutions that play an important economic and social role in the provision of financial services. For the literature, this study contributes to understanding the behavior of credit cooperatives' performance in a context of expansion of service revenues by financial institutions, whose research is still incipient and not conclusive.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df5139aae6e625db68bead259b398555",
  "timestamp": "2025-05-15T02:56:10.864047"
}