{
  "id": 7464,
  "title": "Intimate Partner Violence Victimization, Social Support, and Resilience: Effects on the Anxiety Levels of Young Mothers",
  "abstract": "Young mothers face considerable challenges that can affect their mental health, with anxiety being one of the most common mental health problems observed in this population. Furthermore, pregnancy is one of the risk factors for intimate partner violence (IPV). There is thus an urgent need to explore the IPV risk faced by young mothers and its association with their mental health, anxiety in particular. The study aimed to investigate the correlation between IPV victimization and anxiety in young mothers, as well as the protective effects of social support and resilience. A total of 79 young Chinese mothers aged 16 to 25 were recruited from a special service project for young parents in Hong Kong. Just more than half (50.6%) were found to have experienced psychological aggression by their current partner, with 26.6% and 13.9%, respectively, having experienced physical assault and sexual abuse. Roughly a quarter (25.3%) perceived themselves to suffer from moderate or severe generalized anxiety disorder. Logistic regression further showed the young mothers who had experienced physical assault and/or sexual abuse by their current partners to be at least six times likelier to have moderate or severe anxiety disorder (adjusted odds ratio [aOR] = 4.51, p < .05) than those who had experienced no such violence. Young mothers with less perceived social support (aOR = 0.77, p < .01), a lower secondary level of education or below (aOR = 12.99, p < .05), and in receipt of social security assistance (aOR = 5.69, p < .05) were also likelier to have moderate or severe anxiety disorder. The results indicate the importance of social support during the critical period of young motherhood. Health care professionals need to remain alert to the impacts of IPV victimization and the risk of anxiety in young mothers with a low level of education and/or receiving financial support.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df6d3eb1cc16883198c2883b0106f27b",
  "timestamp": "2025-05-15T03:09:07.200663"
}