{
  "id": 1562,
  "title": "A hybrid fuzzy rule-based multi-criteria framework for sustainable project portfolio selection",
  "abstract": "Project selection is a complex decision making process that is influenced by multiple and often conflicting objectives. The complexity of the project selection problem is due to the high number of projects from which a subset (portfolio) has to be chosen. We present a hybrid fuzzy rule-based multi-objective framework for sustainable project portfolio selection. The multiple and conflicting objectives are considered as the input variables in a Fuzzy Rule-Based (FRB) system developed to estimate the overall fitness (suitability) of the potential project portfolios. A hybrid multi-objective framework integrates and synthesizes the results from a data mining model with the results from a Data Envelope Analysis (DEA) model and an Evolutionary Algorithm (EA) to design the structure of the proposed FRB system. The proposed framework simultaneously considers the accuracy maximization and the complexity minimization objectives. A Genetic Based Machine Learning (GBML) method is utilized to design an alternative FRB system for comparison purposes. The proposed framework and the GBML method are used to assess the alternative project portfolios in a real-world financial services institution. The statistical analysis shows the performance dominance of the proposed hybrid framework over the GBML method based on selected accuracy and interoperability measures. (C) 2012 Elsevier Inc. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df6ee173e527ee2e64b2bf55276c7af3",
  "timestamp": "2025-05-15T00:57:12.645023"
}