{
  "id": 8482,
  "title": "Protecting patients with cardiovascular diseases from catastrophic health expenditure and impoverishment by health finance reform",
  "abstract": "ObjectivesTo compare the incidences of catastrophic health expenditure (CHE) and impoverishment, the risk protection offered by two health financial reforms and to explore factors associated with CHE and impoverishment among patients with cardiovascular diseases (CVDs) in rural Inner Mongolia, China. MethodsCross-sectional study conducted in 2014 in rural Inner Mongolia, China. Patients with CVDs aged over 18 years residing in the sample areas for at least one year were eligible. The definitions of CHE and impoverishment recommended by WHO were adopted. The protection of CHE and impoverishment was compared between the New Cooperative Medical Scheme (NCMS) alone and NCMS plus National Essential Medicines Scheme (NEMS) using the percentage change of incidences for CHE and impoverishment. Logistic regression was used to explore factors associated with CHE and impoverishment. ResultsThe incidences of CHE and impoverishment under NCMS plus NEMS were 11.26% and 3.30%, respectively, which were lower than those under NCMS alone. The rates of protection were higher among households with patients with CVDs covered by NCMS plus NEMS (25.68% and 34.65%, respectively). NCMS plus NEMS could protect the poor households more from CHE but not impoverishment. NCMS plus NEMS protected more than one-fourth of households from CHE and more than one-third from impoverishment. ConclusionNCMS plus NEMS was more effective at protecting households with patients with CVDs from CHE and impoverishment than NCMS alone. An integration of NCMS with NEMS should be expanded. However, further strategies to minimise catastrophic health expenditure after this health finance reform are still needed.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df797ed56dc07ffd7b63719e02b7da4f",
  "timestamp": "2025-05-15T03:19:21.317632"
}