{
  "id": 8585,
  "title": "Attributes of corporate boards and assurance of corporate social responsibility reporting: evidence from the UK",
  "abstract": "Purpose This study aims to investigate the relationship between the attributes of corporate boards in UK companies and their tendency to assure their corporate social responsibility (CSR) reports. Design/methodology/approach From the agency theory perspective, the authors examine the impact of board attributes on the assurance of CSR reports for the Financial Times Stock Exchange (FTSE) 350 during 2016-2019. The authors used annual integrated reports, companies' websites and Thomson Reuters Eikon database for data collection and the logistic regression for data analysis. Findings The results confirm that some board attributes significantly influence a company's decision to assure its CSR reports. While board size, board tenure, the presence of female board members and female executive directors and Chief Executive Officers (CEOs)' global working experience positively contribute to CSR assurance (CSRA) decisions, the chairman's independence negatively contributes to it. However, board independence, board meetings and board financial expertise demonstrate no effect on the CSRA decision. Research limitations/implications The authors focus on some attributes of board members, but the authors did not consider board diversity in its broader meaning. Moreover, the effect of board committees and their attributes on CSRA was not addressed. The authors also did not consider the impact of scope, the quality level of assurance service and the differences between assurance providers on companies' decisions to neither undertake CSRA nor choose between assurance providers. Practical implications The study provides insights into the increasing demand on voluntary assurance to boost the credibility of CSR reports and the role of the board of directors (BOD) in taking this initiative. The findings highlight the importance of board diversity (e.g. gender) in improving transparency and sustainability reporting, which can help policymakers and regulators in shaping future governance policies. Additionally, the findings refer to a drawback in the UK Corporate Governance Code regarding the chairman's independence, which requires corrective actions from the Financial Reporting Council. The findings raise concern over the small share of audit firms in the assurance service market, despite the growing demand for these services in the UK, which may require more attention to these services from the audit firms. Social implications Companies are increasingly pressurized, especially after the COVID-19 pandemic, to discharge their accountability to stakeholders and to act in a socially responsible manner in their business activities. CSR reporting is one of the main tools that companies use to communicate their social activities. Understanding the determinants of voluntary CSRA helps to increase the credibility of CSR reports and the favorable response to social pressure. Originality/value The authors add empirical evidence to the limited literature on CSRA about the role of the BOD in undertaking companies' social responsibility, improving CSR reporting and reducing information asymmetry. It also highlights the significance of maintaining a balanced BOD in terms of gender, experience and tenure, in minimizing the risk of perpetuating non-transparent integrated reporting.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df856ca5e338109704a74453c56c15ef",
  "timestamp": "2025-05-15T03:20:22.232443"
}