{
  "id": 7208,
  "title": "Age and Gender Variations in Age-related Macular Degeneration Prevalence in Populations of European Ancestry: A Meta-analysis",
  "abstract": "Objective: To obtain prevalence estimates of age-related macular degeneration (AMD; late, geographic atrophy, neovascular) by age and gender amongst populations of European ancestry taking into account study design and time trends. Design: Systematic review of population-based studies published by September 2010 with quantitative estimates of geographic atrophy (GA), neovascular (NV), and late AMD prevalence. Studies were identified by a literature search of MEDLINE (from 1950), EMBASE (from 1980), and Web of Science (from 1980) databases. Participants: Data from 25 published studies (57 173 subjects: 455 with GA, 464 with NVAMD, and 1571 with late AMD). Methods: Bayesian meta-regression of the log odds of AMD with age, gender, and year of study allowing for differences in study design characteristics, to estimate prevalences of AMD (late, GA, NVAMD) along with 95% credible intervals (CrI). Main Outcome Measures: Log odds and prevalence of AMD. Results: There was considerable heterogeneity in prevalence rates between studies; for late AMD, 20% of the variability in prevalence rates was explained by differences in age and 50% by study characteristics. The prevalence of AMD increased exponentially with age (odds ratio [OR], 4.2 per decade; 95% CrI, 3.8-4.6), which did not differ by gender. There was some evidence to suggest higher risk of NVAMD in women compared with men (OR, 1.2; 95% CrI, 1.0-1.5). Compared with studies using fundus imaging and international classification systems, studies using fundus imaging with alternative classifications were more likely (OR, 2.7; 95% CrI, 1.1-2.8), and studies using alternative classifications without fundus imaging most likely to diagnose late AMD (OR, 2.9; 95% CrI, 1.3-7.8). There was no good evidence of trends in AMD prevalence over time. Estimated prevalence of late AMD is 1.4% (95% CrI, 1.0%-2.0%) at 70 years of age, rising to 5.6% (95% CrI, 3.9%-7.7%) at age 80 and 20% (95% CrI, 14%-27%) at age 90. Conclusions: Studies using recognized classifications systems with fundus photography reported the lowest prevalences of AMD taking account of age and gender, and were stable over time, with a potentially higher risk of NVAMD for women. These prevalence estimates can be used to guide health service provision in populations of European ancestry. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2012;119:571-580 (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df9ceeda53e75b0f0b23539625393101",
  "timestamp": "2025-05-15T03:06:01.320673"
}