{
  "id": 3313,
  "title": "Cumulative prospect theory and mean-variance analysis: a rigorous comparison",
  "abstract": "We propose a numerical optimization approach that can be used to solve portfolio selection problems including several assets and involving objective functions from cumulative prospect theory (CPT). Implementing the suggested algorithm, we compare asset allocations that are derived for CPT based on two different methods: maximizing CPT along the mean-variance efficient frontier so that simple mean-variance algorithms can be used, and maximizing CPT without this restriction. According to the theoretical literature, with normally distributed returns and unlimited short sales, these two approaches lead to the same optimal solutions. We find that for empirical finite discrete distributions obtained via sampling and subsequent clustering from a normal distribution, the difference between the two approaches remains negligible even if short sales are restricted. However, if standard asset allocation data for pension funds is considered, the difference is considerable. Moreover, for certain types of derivatives, such as call options, the restriction of asset allocations to the mean-variance efficient frontier produces sizable losses in various respects, including decreases in expected returns and expected utility. We are able to explain these differences by CPT's preference for positive skewness, which is not accounted for by optimizing CPT along the mean-variance efficient frontier.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "df9d53589fb90278aa15f69a9ddcab14",
  "timestamp": "2025-05-15T01:15:54.739527"
}