{
  "id": 2818,
  "title": "Prospective scenarios applied in course portfolio management: An approach in light of the Momentum and ELECTRE-MOr methods",
  "abstract": "The Training & Development (T&D) sector is gaining increasing importance on organizations' day, acting as a tool for improving organizational performance. The objective of this paper is, through the application of the Momentum method, to analyze the demand of customers for a company in the field of corporate training in Brazil, considering different contexts and, from this, to propose a decision-making process to the increase efficiency and effectiveness of its procedures, prioritizing T&D courses that present more return and relevance to the organization. For this purpose, we use the Momentum method to prospect scenarios, establishing a relationship between the variables that make up each scenario and the portfolio of courses offered by the company. Besides, we applied the ELECTRE-MOr Multicriteria Decision Support (MDS) method to propose a line of action taken by the company, taking into account the trend scenario. The results obtained were satisfactory, providing support to strategic decision making in the composition of the courses portfolio offered, resulting in a classification of them, presenting those who should be prioritized, maintained or discarded by the company's management. It is emphasized that the methodology presented in this work can be applied in other sectors - tactical, operational or strategic - presenting relevance to academia and society. (C) 2021 The Authors. Published by Elsevier B.V.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dfab1de8e678058a6d0c6b689941d4fb",
  "timestamp": "2025-05-15T01:10:49.519046"
}