{
  "id": 42,
  "title": "Enhancing Financial Risk Prediction Using TG-LSTM Model: An Innovative Approach with Applications to Public Health Emergencies",
  "abstract": "Amidst the backdrop of economic globalization and occasional public health crises, the comprehension and mitigation of financial risks confronting enterprises have emerged as imperative pursuits. This research paper delves into the intricate nexus between these global phenomena and the realm of financial risk management. Conventional approaches to financial risk prediction often falter in grappling with the intricacies of contemporary financial markets. To address this challenge, our study introduces a pioneering methodology termed the TG-LSTM (Time Series Ratio Analysis combined with Long Short-Term Memory) model, aimed at furnishing early financial warnings to enterprises. The TG-LSTM model harnesses the power of ratio analysis to discern representative financial data reflective of crucial facets such as debt-paying ability, operational efficiency, growth prospects, and profitability. Leveraging the TSVD (Truncated Singular Value Decomposition) technique bolsters prediction accuracy, while the XGboost feature screening method aids in curtailing data dimensionality. Our analysis integrates real-world data from the CSI 300 and SSE 50 datasets, with results showcasing the efficacy of the TG-LSTM model. With the lowest Root Mean Square Error (RMSE), Mean Absolute Error (MAE), and Mean Absolute Percentage Error (MAPE) values, our model attains an impressive accuracy rate of 96.1%. This research represents a significant stride in advancing financial risk prediction, shedding light on the confluence of financial stability, global events, and innovative data analytics. It underscores the pivotal role of technology, knowledge management, and innovation in navigating the complexities of today's rapidly evolving knowledge economy and enhancing the anticipation and mitigation of financial risks in contemporary society.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dfb814358f8a297d6a4dd02d9f779936",
  "timestamp": "2025-05-15T01:33:11.331491"
}