{
  "id": 7567,
  "title": "Quantitative and Qualitative Factors Associated with Social Isolation Among Graduate and Professional Health Science Students",
  "abstract": "Objective. To determine the prevalence of social isolation and associated factors in graduate and professional health science students. Methods. Quantitative and qualitative data were gathered via an online survey from graduate and professional students in the colleges of dentistry, medicine, nursing, pharmacy, and public health at a Midwestern university. Questions assessed students' demographics, weekly activity hours, support systems, and financial concerns, and included the 20-item UCLA Loneliness Scale. Logistic regression was performed using the binary outcome of feeling socially isolated (yes/no) and examined program-related respondent comments using thematic analysis. Results. There were 427 survey respondents with 398 completing the full survey. Students answering the social isolation question (n=386) were included in the regression analysis. Nearly one-fifth (19.4%) of respondents indicated social isolation, with the highest percentage among nursing respondents (40.7%). Lacking a strong support, being a non-native English speaker, having caregiving responsibilities, and experiencing lonely items described in the UCLA Loneliness Scale were positively associated with social isolation. The ability to discuss feelings with friends in their professional program and experiencing non-lonely items were negatively associated with social isolation. Ninety-six comments revealed nine risk factor themes in four categories: individual (feeling different from peers, personality, employment), interpersonal (competition/exclusionary atmosphere, faculty relationship), organization (too busy with coursework, isolating program) and community (relocation reduces social support). Student-involvement in organizations (activities encouraging socialization) and community (support from outside the group) were protective factors. Conclusion. Understanding associated factors and designing strategies to reduce student social isolation may enhance the quality and well-being of future health professionals and scientists.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dfc8608c15b11a2a4dda5c5b90b5a060",
  "timestamp": "2025-05-15T03:10:05.515478"
}