{
  "id": 778,
  "title": "Internet Financial Risk Monitoring and Evaluation Based on GABP Algorithm",
  "abstract": "Due to the generality and particularity of Internet financial risks, it is imperative for the institutions involved to establish a sound risk prevention, control, monitoring, and management system and timely identify and alert potential risks. Firstly, the importance of Internet financial risk monitoring and evaluation is expounded. Secondly, the basic principles of backpropagation (BP) neural network, genetic algorithm (GA), and GABP algorithms are discussed. Thirdly, the weight and threshold of the BP algorithm are optimized by using the GA, and the GABP model is established. The financial risks are monitored and evaluated by the Internet financial system as the research object. Finally, GABP is further optimized by the simulated annealing (SA) algorithm. The results show that, compared with the calculation results of the BP model, the GABP algorithm can reduce the number of BP training, has high prediction accuracy, and realizes the complementary advantages of GA and BP neural network. The GABP network optimized by simulated annealing method has better global convergence, higher learning efficiency, and prediction accuracy than the traditional BP and GABP neural network, achieves better prediction effect, effectively solves the problem that the enterprise financial risk cannot be quantitatively evaluated, more accurately assesses the size of Internet financial risk, and has certain popularization value in the application of Internet financial risk prediction.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dfd8d24753d827535a97d992ab3dc139",
  "timestamp": "2025-05-15T01:55:07.997959"
}