{
  "id": 8391,
  "title": "Forgoing healthcare during the COVID-19 pandemic in Geneva, Switzerland - A cross-sectional population-based study",
  "abstract": "Background: Health systems around the world continue to navigate through operational challenges surfaced by the coronavirus disease 2019 (COVID-19) pandemic; these have implications for access to healthcare. In this study, we estimate the prevalence and reasons for forgoing healthcare during the pandemic in Geneva, Switzerland; a country with a universal and mandatory private health insurance coverage. Methods: Participants from a randomly selected population-based sample of the adult population living in the Canton of Geneva completed an online socio-demographic and lifestyle questionnaire between November 2020 and January 2021. The prevalence and reasons for forgoing healthcare since the beginning of the COVID-19 pandemic were examined descriptively, and logistic regression models were used to assess determinants for forgoing healthcare. Results: The study included 5397 participants, among which 8.0% reported having forgone healthcare since the beginning of the COVID-19 pandemic; participants with a disadvantaged financial situation (OR = 2.04; 95% CI: 1.56-2.65), and those reporting an average (OR = 2.54; 95% CI: 1.94-3.31) or poor health (OR = 4.40; 95% CI: 2.39-7.67) were more likely to forgo healthcare. The most common reasons to forgo healthcare were appointment cancellations by healthcare providers (53.9%), fear of infection (35.3%), and personal organizational issues (11.1%). Conclusion: Our paper highlights the effects of the COVID-19 pandemic on access to healthcare and identifies population sub-groups at-risk for forgoing healthcare. These results necessitate public health efforts to ensure equitable and accessible healthcare as the COVID-19 pandemic continues.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dfdc3b3a4f6afe9e74c2c872e54f855a",
  "timestamp": "2025-05-15T03:18:19.596847"
}