{
  "id": 3034,
  "title": "Financial risk, plan types, and authorizations for managed alcohol treatment services",
  "abstract": "Objective: To estimate the effects of a managed behavioral healthcare organization's (MBHO's) products/plans and financial risk on levels and amount of care authorized for patients with alcohol-related problems. Study Design: Secondary analysis of 1995-1998 MBHO authorization files. Patients: Individuals diagnosed as having an alcohol-related problem without comorbidities. Methods: Episodes (n = 10,872) were constructed with 60-day clear zones. Multinomial regression equations were used to analyze the proportional distribution of care authorized within episodes at 5 levels: inpatient, residential, partial hospitalization, intensive outpatient, and traditional outpatient. Care equivalency hours were calculated to combine data across outpatient sessions and inpatient days. A linear regression equation analyzed quantity of care within episodes. Product/plan types, financial risk, state of residence, and participation in the MBHO's network were explanatory variables, Age, sex, diagnosis, and episode number were control variables. Results: Most utilization management care hours authorized are inpatient and residential. Relative to other products/plans for managing care, utilization management leads to 50% more authorized hours. More financial risk does not predict fewer care units authorized but shifts hospitalizations toward residential treatment. Increasing age and higher-severity diagnoses predict more overnight care authorizations. Pennsylvania, which mandates minimum levels of care and follows American Society of Addiction Medicine criteria, has significantly more care authorized compared with 8 other states with data. Conclusions: Other than in utilization management, MBHO financial risk does not predict less care authorization. The MBHO authorizes higher-level care for older adults, for those with more severe diagnoses, and for those with episodes of care beyond the second. Authorization data do not necessarily reflect utilization but can provide a useful, partial view of management strategies.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dfdfd43df315ecdfc7eebd0fdec94a19",
  "timestamp": "2025-05-15T02:21:52.206482"
}