{
  "id": 5011,
  "title": "Family structure and children's risk of child protective services re-reports",
  "abstract": "Background: Single parent families are at higher risk of re-report to Child Protective Services (CPS) than two-parent families. Yet, how single-family homes differ in risk from two-parent families remains under researched. Objective: To identify heterogenous patterns of child and caregiver factors among CPS-involved families and the subsequent risk for CPS re-report based on child and family characteristics (i. e., sociodemographic information, family structure, and risk indicators). Participants and setting: Data were from the 2017 National Child Abuse and Neglect Data System Child File (N = 249,026). Methods: We conducted latent class analysis (LCA) to identify discrete patterns (i.e., classes) based on child and caregiver risk indicators (e.g., substance use, behavioral health). We then used logistic regression to examine family structure and other family characteristics and CPS indicators predicted CPS re-report for each class. Results: Results yielded five distinct classes: 1) Financial Stressors (25 % of the sample); 2) Caregiver Substance Use (16 %); 3) Complex Household Stressors (3 %); 4) Child Disabilities (4 %); and 5) Minimal Household Stressors (53 %). Family structure was significantly associated with CPS rereports for Classes 1, 2, and 5. For Class 1, single father families had increased odds of CPS rereport compared to other family structures. For Classes 2 and 5, single father families' odds of CPS re-reports were greater than those of married families, but lower than single mother families. Conclusions: Children growing up in single father families have different likelihoods of repeat CPS involvement compared to those in single mother and married families. Financial stressors and parental substance use within single father families should be addressed.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dfe6c67ce3ccd4abdd01348991c424d8",
  "timestamp": "2025-05-15T02:43:06.895578"
}