{
  "id": 6361,
  "title": "What factors are associated with functional impairment among the oldest old?",
  "abstract": "PurposeMost of the existing studies did not explicitly focus on the oldest old who are at high risk of functional impairment. Moreover, some potential risk factors (such as financial poverty) of functional impairment have been neglected so far. Thus, our aim was to clarify the determinants (with a particular emphasis on financial poverty) of functional impairment exclusively among the oldest old. MethodsData were taken from the Survey on quality of life and subjective well-being of the very old in North Rhine-Westphalia (NRW80+) - a representative sample of individuals >= 80 years (community-dwelling and in institutionalized settings) in North Rhine-Westphalia (n = 1,863, average age was 86.5 years, ranging from 80 to 102 years). Common tools were used to quantify functional impairment. In regression analysis, these determinants were included: sex, age, marital status, educational level, income poverty, asset poverty, depressive symptoms, cognitive impairment, and the number of chronic conditions. ResultsMultiple linear regressions showed that higher functional impairment was associated with being female (ADL, beta = 0.06, p < 0.01; IADL, beta = 0.09, p < 0.01), higher age (ADL, beta = 0.02, p < 0.001; IADL, beta = 0.04, p < 0.001), low education (compared to high education: IADL, beta = -0.10, p < 0.05), the presence of income poverty (ADL, beta = 0.09, p < 0.05; IADL, beta = 0.16, p < 0.01), more depressive symptoms (ADL, beta = 0.12, p < 0.001; IADL, beta = 0.14, p < 0.001), higher cognitive impairment (ADL, beta = -0.03, p < 0.001; IADL, beta = -0.06, p < 0.001), and a higher number of chronic conditions (ADL, beta = 0.03, p < 0.001; IADL, beta = 0.05, p < 0.001). ConclusionSeveral determinants of functional impairment among the oldest old have been identified (i.e., being female, higher age, low education, presence of income poverty, more depressive symptoms, higher cognitive impairment, and more chronic conditions). Such knowledge (e.g., regarding the association between income poverty and functional impairment) may assist in characterizing individuals aged 80 years and over at high risk for functional impairment. Ultimately, such knowledge may help to design specific interventions for high risk groups. Moreover, such knowledge may enrich the research areas addressing inequalities.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "dff4c5c5867da7995e4d7e8bfe229315",
  "timestamp": "2025-05-15T02:57:07.809087"
}