{
  "id": 8272,
  "title": "Understanding the complexity, patterns, and correlates of alcohol and other substance use among young people seeking help for mental ill-health",
  "abstract": "PurposeUse of alcohol and other substances is a multifaceted issue impacting young people across multiple life domains. This paper aims to elucidate patterns of substance use and associated demographic and clinical factors among young people seeking treatment for their mental health.MethodsYoung people (12-25 years old) were recruited from five youth-specific primary mental health (headspace) services in Australia. Self-reported substance use and harms in the past 3 months were measured using WHO-ASSIST. Network analyses were conducted to evaluate interrelationships between use and harms associated with different substances. Subgroups were then identified based on whether participants reported using high centrality substances, and associated demographic and clinical factors were assessed with multinomial logistic regression.Results1107 youth participated. 70% reported use of at least one substance in the past 3 months, with around 30% of those reporting related health, social, legal or financial problems. Network analysis highlighted substantial interconnections between use and harm indicators for all substances, with amphetamine-type stimulants (ATS) and cannabis being high central substances. Higher levels of substance use and harms were reported in subgroups with ATS or cannabis use and different risk factors were associated with these subgroups.ConclusionsFindings highlight the importance of screening for substance use in youth primary mental healthcare settings, offering a key opportunity for early intervention. Clinicians should be aware of the inner connections of use and harms of different drugs and the role of cannabis and amphetamine use as a marker for more substance use profiles.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0019ca698d38e60a7f508091c88e3da",
  "timestamp": "2025-05-15T03:17:21.453938"
}