{
  "id": 7575,
  "title": "Average height of surrounding buildings and district age are the main predictors of tree failure on the streets of Sa tilde o Paulo/Brazil",
  "abstract": "Tree failure is an increasingly frequent issue in cities worldwide leading to the risk of property damage, financial loss, citizen injury, and death. Assessing tree failure is a challenging task since early signs are often not visible and require a detailed evaluation of each tree, which is limiting considering the management of trees across the whole city. We used Regression Trees and Bagging to assess tree failure on the streets of Sa & SIM;o Paulo / Brazil using parameters from the gray and green infrastructure that could be easily estimated in the field to support the proper preventive maintenance of street trees. We characterized the districts' age, average building height, tree height, canopy cover, sidewalk width, sidewalk slope, and terrain slope of 26,616 fallen trees. The Regression Tree shows 82% accuracy and reveals that building height is the main predictor of tree failure, followed by district age, sidewalk width, and tree height. The proportion of tree failure in the most verticalized areas, with on average five stories buildings or taller, is twice that observed in the entire city. Tree failure also increases in districts older than 42 years. The proportion of tree failure is 37% lower than the city's average in relatively newer districts with low building height, where trees taller than 9.58 m are more prone to failure. These results point to possible roles of wind tunneling, shading, pollution, canopy conflicts with service cables in the urban canyons, and the natural senescence of trees in the oldest districts. The present study establishes comprehensive guidelines for effective preventive maintenance of the street trees in Sa & SIM;o Paulo.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0039bc0a888b3adbb38f856dbfb70bf",
  "timestamp": "2025-05-15T03:10:05.529069"
}