{
  "id": 6556,
  "title": "Examining Dropout Among Graduate and Undergraduate Public Affairs and Political Science Students",
  "abstract": "Within the domain of public affairs and political science (PAPS), student dropout emerges as a critical concern. This study delves into the factors influencing the decisions of undergraduate and graduate PAPS students to discontinue their programs. Employing a comprehensive mixed-methods approach, we surveyed 384 at-risk undergraduates and conducted in-depth interviews with 18 former graduate students. Thematic analysis of these interviews revealed six pivotal factors influencing graduate student dropout: the financial burden of study (including tuition and limited financial aid), program curricular challenges (such as demanding thesis requirements and inadequate practical components), the delicate balance of multiple responsibilities (work, study, and family), health-related issues (including anxiety and stress), poor academic performance, and personal difficulties (such as lack of family support). At the undergraduate level, descriptive analyses indicated that 38% of PAPS students contemplated dropping out, with 30% considering changing their major. Exploratory Factor Analysis and Multiple Regression highlighted the significance of factors such as family and societal influences, economic considerations, program and curriculum structure, institutional dynamics, academic performance, personal attitudes, and student health in shaping these contemplations. This research not only expands the application of integration and engagement theory and the pull, push, and failing out theory but also validates their effectiveness in predicting dropout within PAPS programs. The study offers valuable insights for both researchers and policymakers, underscoring the imperative for more supportive, flexible, and financially viable educational structures to enhance student retention in the realm of public affairs and political science.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e02204a03988d4271092a4c24392363f",
  "timestamp": "2025-05-15T02:59:07.601001"
}