{
  "id": 7620,
  "title": "Moving Branded Statins to Lowest Copay Tier Improves Patient Adherence",
  "abstract": "BACKGROUND: Stet Ins are efficacious In reducing the risk of major cardiovascular events for both primary and secondary prevention, yet long-term adherence is poor. Their effectiveness could be compromised in actual practice when patients are not adherent to the treatments. Higher copayments have been shown to be associated with lower adherence to statins. OBJECTIVE: To assess the effect on patient adherence of moving branded atorvastatin and rosuvastatin from the second to the first tier by a Medicare Part D plan sponsor. METHODS: Pharmacy claims and eligibility records between July 1, 2009, and July 31, 2011, of Medicare Part D members not receiving the low-income subsidy were analyzed. New atorvastatin and rosuvastatin users in January 2010 (2010 cohort) were compared with those In January 2011 (2011 cohort) after this formulary tier change (tier-reduction group). Adherence was defined by the proportion of days covered (PDC) over 6 months. The impact of tier reduction on adherence was evaluated via logistic regression for binary outcome (PDC >= 0.8) and generalized linear regression for continuous PDC by comparing the 2011 cohort with the 2010 cohort, adjusting for demographic and clinical characteristics. Other statin users (97% on generic statins) were also analyzed, serving as a nontier-reduction comparator group. RESULTS: We identified 12,437 members in the tier-reduction group. Between the 2010 and 2011 cohorts, mean PDC increased from 0.77 to 0.83, and the proportion of members with high adherence increased from 62.0% to 72.9% (both P < 0.001). After regression adjustment, members in the 2011 cohort were more likely to be adherent (OR=1.68; 95% CI=1.55-1.82) and had a 5.9% increase in PDC (P < 0.05). There was no significant increase In adherence observed in the comparator nontier-reduction group. CONCLUSION: Findings from this study suggest that financial incentives may improve medication adherence. Future studies should evaluate whether such formulary strategies improve long-term adherence and patient outcomes. Copyright (C) 2014, Academy of Managed Care Pharmacy. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0221043ad6945c29da7131fa36764e9",
  "timestamp": "2025-05-15T03:10:32.982240"
}