{
  "id": 253,
  "title": "An integrated machine learning approach for evaluating critical success factors influencing project portfolio management adoption in the construction industry",
  "abstract": "PurposeIn today's intricate and dynamic construction sector, traditional project management techniques, which view projects in isolation, are no longer sufficient. Project Portfolio Management (PPM) has proven to be an efficient alternative solution for handling multiple construction projects. As such, based on a Machine Learning (ML) approach, this study aims to explore the Critical Success Factors (CSFs) influencing the adoption of PPM, aiming to enhance PPM implementation in construction projects.Design/methodology/approachA questionnaire based on CSFs gathered from prior studies was developed and validated by experts. Afterward, exploratory data analysis is conducted to understand CSF-PPM relationships. Preprocessing techniques ensure uniformity in variable magnitudes. Lastly, ML techniques, namely Linear Discriminant Analysis (LDA), Logistic Regression (LR) and Extra Trees Classifier (ETC) are developed to model and investigate CSFs' impact on PPM adoption.FindingsThe findings pointed out that the ETC model marginally outperforms other ML models with a classification accuracy of 93%. Also, the project size, utilized PPM tool and resource allocation-related factors are the most significant CSFs that influenced the PPM performance by about 48.5%.Originality/valueThis study contributes to the existing body of knowledge by raising awareness among construction companies and other project stakeholders about the pivotal CSFs that must be considered when prioritizing projects and designing an optimal PPM approach.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e02eb906bb66a8066aa7f2f095b0bc1c",
  "timestamp": "2025-05-15T00:41:04.741896"
}