{
  "id": 6342,
  "title": "Blockchain markets, green finance investments, and environmental impacts",
  "abstract": "In our study, we delve deep into the dynamics of blockchain markets and their ecological ramifications while also shedding light on the invaluable insights gleaned from a risk spillover analysis involving green finance investments, thereby broadening the spectrum of opportunities for portfolio diversification. Employing a robust framework grounded in copulas theory, we meticulously scrutinize the intricate interplay of risk transmission and the dependence structure of green financial products in relation to the blockchain market index. Our investigation, guided by the application of VaR and CoVaR measures, has unearthed compelling findings. We have discerned that the price fluctuations in the clean energy sector have wielded a substantial influence on the blockchain industry, particularly in the wake of the COVID-19 pandemic. Remarkably, our analysis reveals an absence of spillover effects between the blockchain and green bond markets, underscoring the tangible diversification advantages that investors can harness. This becomes pivotal in safeguarding their assets from the inherent risks associated with blockchain investments. Furthermore, we have conducted a rigorous regression analysis to uncover the nuanced relationship between the blockchain's extreme downside risk factor and climate change risk. Notably, the robust coefficient associated with the climate change index serves as a clarion call to investors, environmental organizations, and policymakers alike. It beckons them to accord greater attention to environmental considerations when venturing into the blockchain markets, emphasizing the pressing need for environmentally responsible investments and policy decisions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0307b582d0257dded735d4d89d5af79",
  "timestamp": "2025-05-15T02:57:07.708348"
}