{
  "id": 6190,
  "title": "Research on Systematic Risk Assessment and Early Warning of China's Insurance Industry",
  "abstract": "The unique correlation and infectious nature of financial systemic risks determine that once they occur, they will cause serious harm. Although China's insurance industry has not yet experienced a systemic risk outbreak, in recent years the cross-shareholdings between the insurance industry and other areas of finance have increased, business complexity has increased, and the importance of the system has deepened. Therefore, the current work focuses on early risk identification and early warning. In this paper, the systematic risk of insurance industry is taken as the research object. Firstly, this paper analyzes the transmission path of the systematic risk of insurance industry based on the actual situation of the development of insurance industry in China, and draws lessons from the thinking of the association between corporate governance and systematic risk put forward by the former CIRC, and theoretically analyzes the influence of corporate governance on the systematic risk of insurance industry. Secondly, this paper selects listed China Ping An, China Life Insurance, China Pacific Insurance and Xinhua Insurance as research objects, and uses CoVaR method and quantile regression to measure the systematic risks of the insurance industry and explore the influencing factors of the occurrence of systematic risks. Thirdly, this paper selects the indicators that are significant in the above influencing factors and precede the occurrence of systemic risks as early warning tips to provide ideas for the early warning of systemic risks in the insurance industry. Finally, based on the above qualitative and quantitative analysis, this paper puts forward suggestions for macro-prudential supervision of the insurance industry.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e053fd5cf266128b6257a9e231084558",
  "timestamp": "2025-05-15T02:55:44.562505"
}