{
  "id": 5814,
  "title": "Paper The associations between resilience and socio-demographic factors in parents who care for their children with congenital heart disease",
  "abstract": "Objective: To examine the resilience of parents of children with congenital heart disease and to investigate socio-demographic factors that may influence parents' resilience. Methods: This is a web-based survey study using a cross-sectional design. A purposive sampling method was utilized to recruit 515 parents who care for children with congenital heart disease. Resilience was assessed using the Dispositional Resilience Scale-II. Based on expert-interviews, a questionnaire was designed to collect socio-demographic data. Descriptive statistics, factor analysis, and linear regressions were used to analyze data. Results: A total of 413 parents completed the survey study. The mean resilience score was 3.75 (SD = 0.61; range = 1.89-4.89) with higher scores indicating higher resilience. The linear regression models demonstrated that parents who had lower education levels and lower gross household income had lower resilience (P < 0.05). Conclusions: Parents reported resilience that reflected their ability to cope with stressful events and mitigate stressors associated with having and caring for children with congenital heart disease. Lower education levels and lower gross household income are associated with lower resilience. To increase parents' resilience, nursing practice and nurse-led interventions should target screening and providing support for parents at-risk for lower resilience. As lower education level and financial hardship are factors that are difficult to modify through personal efforts, charitable foundations, federal and state governments should consider programs that would provide financial and health literacy support for parents at-risk for lower resilience. (C) 2022 The authors. Published by Elsevier B.V. on behalf of the Chinese Nursing Association.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e05dabb7c8933f4d0f3f84b84a14a01e",
  "timestamp": "2025-05-15T02:51:58.509286"
}