{
  "id": 920,
  "title": "Statistical and economic performance of combination methods for forecasting crude oil price volatility",
  "abstract": "This article aims to investigate whether a wide variety of combination methods, ranging from simple averaging approaches to time-varying techniques based on the past performance of the single models and regression tools, improve forecasting accuracy, risk management and economic gains across different forecasting horizons in a crude oil future framework. For this purpose, we implement various combination methods in fourteen HAR-RV models including different characteristics and uncertainty factors and evaluate their performance through statistical, risk management and economic loss functions. The empirical analysis yields some important conclusions: (i) sophisticated combinations improve the forecasting accuracy in all forecasting horizons, (ii) from a risk management perspective, regression-based combinations predict better potential loss of an investment on crude oil futures compared to individual models, (iii) machine learning and non-parametric combinations lead to higher economic gains across all forecasting horizons in a portfolio exercise and (iv) combinations are considered as a better alternative to single models using various robustness checks although the best performer among the combination methods is not stable across applications.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e06b65ff22f23743dffa11ad5fc76283",
  "timestamp": "2025-05-15T00:49:36.355414"
}