{
  "id": 8896,
  "title": "Cross-sectional study of depression and help-seeking in Uttarakhand, North India",
  "abstract": "Objectives: This study sought to use a population-based cross-sectional survey to describe depression prevalence, healthcare seeking and associations with socioeconomic determinants in a district in North India. Setting: This study was conducted in Sahaspur and Raipur, administrative blocks of Dehradun district, Uttarakhand, in July 2014. Participants: A population-based sample of 960 people over the age of 18 years was selected in 30 randomised clusters after being stratified by rural: urban census ratios. Primary outcome measures: The survey used a validated screening tool, Patient Health Questionnaire, to identify people with depression, and collected information regarding socioeconomic variables and help-seeking behaviours. Depression prevalence and health seeking behaviours were calculated, and multivariable logistic regression was used to assess associations between risk factors and depression. Results: Prevalence of depression was 6% (58/960), with a further 3.9% (37/960) describing a depressive episode of over 2 weeks in the past 12 months. Statistically significant adjusted OR for depression of more than 2 were found for people who were illiterate, classified as Scheduled Caste/Tribe or Other Backward Castes, living in temporary material housing and who had recently taken a loan. While over three quarters of people with depression (79%) had attended a private or government general medical practitioner in the past 3 months, none had received talking therapy (100% treatment gap) and two people (3.3%) had been prescribed antidepressants. Conclusions: There are clear associations between social, educational and economic disadvantage and depression in this population. Strategies that address the social determinants of depression, such as education, social exclusion, financial protection and affordable housing for all are indicated. To address the large treatment gap in Uttarakhand, we must ensure access to primary and secondary mental health providers who can recognise and appropriately manage depression.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e079a4bd4cdd34896f0841b47e18103d",
  "timestamp": "2025-05-15T03:23:27.859087"
}