{
  "id": 2560,
  "title": "Factors Related to Regional Variation in the High-risk Drinking Rate in Korea: Using Quantile Regression",
  "abstract": "Objectives: This study aimed to identify regional differences in the high-risk drinking rate among yearly alcohol users in Korea and to identify relevant regional factors for each quintile using quantile regression.Methods: Data from 227 counties surveyed by the 2017 Korean Community Health Survey (KCHS) were analyzed. The analysis dataset included secondary data extracted from the Korean Statistical Information Service and data from the KCHS. To identify regional factors related to the high-risk drinking rate among yearly alcohol users, quantile regression was conducted by dividing the data into 10%, 30%, 50%, 70%, and 90% quantiles, and multiple linear regression was also performed.Results: The current smoking rate, perceived stress rate, crude divorce rate, and financial independence rate, as well as one's social network, were related to the high-risk drinking rate among yearly alcohol users. The quantile regression revealed that the perceived stress rate was related to all quantiles except for the 90% quantile, and the financial independence rate was related to the 50% to 90% quantiles. The crude divorce rate was related to the high-risk drinking rate among yearly alcohol users in all quantiles.Conclusions: The findings of this study suggest that local health programs for high-risk drinking are needed in areas with high local stress and high crude divorce rates.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e07a0750f0c7adbd94b226f4be1c8334",
  "timestamp": "2025-05-15T02:16:32.730315"
}