{
  "id": 2158,
  "title": "Impact of emerging technologies in banking and finance in Europe: A volatility spillover and contagion approach",
  "abstract": "The empirical evidence suggests that stock returns in the emerging technology environment exhibit high stock return volatility. The fundamental aim of the article is to investigate the dynamic, time series properties of the correlations between daily log returns and magnitude of the volatility transmissions from the emerging technologies environment to the Spanish banking sector, the Spanish market portfolio and the finance industry in the EU area. Using daily log returns for the performance variables and an equally weighted index was constructed as proxy to represent the emerging technology phenomena covering a period from the 7 th of July of 2015 to the 20 th of September of 2019. The study applies generalized autoregressive conditional heteroskedasticity GARCH followed by the diagonal BEKK approach. One key finding is that the emerging technology environment is important in capturing volatility of Spanish banking sector, the Spanish market portfolio and the finance industry in the EU area through significant volatility clustering, volatility spillover and volatility persistence. Results exhibit very large GARCH and relatively low ARCH effects indicating a long persistence of resulting shocks over volatility. Broadly, the Spanish banking sector seems to be the most exposed to volatility spillover. Nevertheless, it is the finance industry across the EU which is more affected by the volatility persistence from emerging technology shocks in terms of volatility and cross - volatility point of view. Additionally, high volatility periods provide insights about an increased integration and volatility spillover. From an investor perspective, one important implication is that adding stocks from different emerging technologies to a portfolio does not necessarily lead to risk reduction.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e084cea7ed03e799448d566c670f7607",
  "timestamp": "2025-05-15T01:03:36.665256"
}