{
  "id": 9280,
  "title": "Real world drug treatment models for pregnancy complicated with urinary tract infection in China from 2018 to 2022: a cross-section analysis",
  "abstract": "Objective: Urinary tract infection (UTI) is common in pregnant women. The selection of anti-infection plans during pregnancy must take into account the dual factors of patient pregnancy status and urinary tract infection anti-infection treatment, as well as the efficacy, cost, risk, and potential adverse reactions associated with each method applied to individual patients. Consequently, there are numerous drugs from which to choose; presently, there is no unified conclusion regarding the choice of drug therapy, and there is a lack of long-term drug treatment for UTI during pregnancy. Our objective is to investigate the actual drug treatment patterns of UTI patients during pregnancy in China over the past 5 years, with a particular emphasis on the trend and rationality of antibiotic use in these patients over the past 5 years.Method: We conducted a cross-sectional analysis of data from a China Medical Association-supervised hospital prescription analysis cooperation initiative. From January 2018 to December 2022, the information is extracted from prescriptions/medical orders of patients with UTI during pregnancy. Using a primary anatomical therapeutic chemistry (ATC) classification code and the US Food and Drug Administration (FDA) classification, we quantified the frequency of drug use and drug types. We also calculated the prevalence of the most frequently prescribed antibacterial medications and assessed the efficacy of anti-infection plans based on drug labels and guidelines.Results: Among the 563 patients included in this research, Chengdu (36.59%), Guangzhou (27.72%), and Shanghai (8.70%) were the top three cities. Over the course of 5 years, the average age was 29.60% +/- 6.59 years, with approximately 60.21% of women between the ages of 25 and 34. Each patient's primary anti-infection medications were statistically analyzed. Cephalosporins (403, 71.58%), enzyme inhibitors (66, 11.72%), and penicillins (34, 6.04%) were the first few categories, followed by the most commonly used cephalosporins. Cefuroxime, ceftriaxone, and cefdinib, rounded out the top five. Cefoxitin and cefaclor. According to the 5-year change in dosage, cephalosporins have always ranked first. Three of the top five most expensive drugs are cephalosporins, carbapenems, and enzyme inhibitors. Teicoplanin, tigecycline, nifurtel, linezolid, and quinolones ranked among the top five in terms of per-patient drug costs for patients receiving comprehensive treatment drugs.Conclusion: In the 5 years of research, the average age of patients who visit a doctor has not increased substantially, but the opportunity cost of female fertility has increased, which has severely impeded the fulfillment of fertility desires. The selection of medications is generally reasonable, and the dosage of the first-line cephalosporins recommended by the guidelines is relatively high in this study. The dosage of furantoin and fosfomycin, which are more prevalent in urinary tract infections, is however relatively low. In addition, some expensive pharmaceuticals may increase patients' financial burden. On the premise of meeting clinical needs, future research will focus on how to further improve the level of rational drug use in outpatient clinics, attain economical, safe, and effective drug use, and thus reduce the economic burden on patients.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e08a5aea81a95709e8c1908a22195c6b",
  "timestamp": "2025-05-15T03:27:24.967617"
}