{
  "id": 8298,
  "title": "Trace of delirium after robotic lower abdominal tumor resection at different end-tidal carbon dioxide: a RCT trial",
  "abstract": "BackgroundPostoperative delirium (POD) often occurs in oncology patients, further increasing the medical and financial burden. Robotic technology in lower abdominal tumors resection reduces surgical trauma but increases risks such as carbon dioxide (CO2) absorption. This study aimed to investigate the differences in their occurrence of POD at different end-tidal CO2 levels.MethodThis study was approved by the Ethics Committee of Affiliated Hospital of He Bei University (HDFY-LL-2022-169). The study was registered with the Chinese Clinical Trials Registry on URL: http://www.chictr.org.cn, Registry Number: ChiCTR2200056019 (Registry Date: 27/08/2022). In patients scheduled robotic lower abdominal tumor resection from September 1, 2022 to December 31, 2022, a comprehensive delirium assessment was performed three days postoperatively using the CAM scale with clinical review records. Intraoperative administration of different etCO2 was performed depending on the randomized grouping after intubation. Group L received lower level etCO2 management (31-40mmHg), and Group H maintained the higher level(41-50mmHg) during pneumoperitoneum. Data were analyzed using Pearson Chi-Square or Wilcoxon Rank Sum tests and multiple logistic regression. Preoperative mental status score, alcohol impairment score, nicotine dependence score, history of hypertension and diabetes, duration of surgery and worst pain score were included in the regression model along with basic patient information for covariate correction analysis.ResultsAmong the 103 enrolled patients, 19 (18.4%) developed postoperative delirium. The incidence of delirium in different etCO2 groups was 21.6% in Group L and 15.4% in Group H, respectively, with no statistical differences. In adjusted multivariate analysis, age and during of surgery were statistically significant predictors of postoperative delirium. The breath-hold test was significantly lower postoperatively, but no statistical differences were found between two groups.ConclusionWith robotic assistant, the incidence of postoperative delirium in patients undergoing lower abdominal tumor resection was not modified by different end-tidal carbon dioxide management, however, age and duration of surgery were positively associated risk factors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e08c9b8d8a2ab92561a140c62389eefd",
  "timestamp": "2025-05-15T03:17:21.574066"
}