{
  "id": 1927,
  "title": "Decomposition based neural dynamics for portfolio management with tradeoffs of risks and profits under transaction costs",
  "abstract": "Real-time online optimisation plays a crucial role in high-frequency trading (HFT) strategies. The Markowitz model, as a Nobel Prize-winning framework, is widely used for portfolio management optimisation by framing the problem as a constrained quadratic programming task. While conventional analytical methods are typically effective for solving quadratic programming problems with linear constraints, the introduction of both linear equality and inequality constraints in the Markowitz model necessitates the use of numerical methods. The complexity of these numerical solutions presents technical challenges for real-time online optimisation, especially in HFT environments where computational speed and efficiency are critical. To address this challenge, we propose a simplified model that decomposes the problem into analytically solvable and unsolvable components, alongside an innovative dynamic neural network designed to quickly solve the unsolvable components. Overall, this method helps reduce computational load and is well-suited for realtime online computations in HFT settings. Furthermore, we conducted a theoretical analysis and proof of the optimality and global convergence of the solutions obtained using this method. Finally, based on a large set of real stock data, we performed three numerical experiments to validate its effectiveness. Notably, in an experiment using Dow Jones Industrial Average (DJIA) stock data, our approach reduced total costs by 5.54% compared to the commonly used MATLAB quadprog() solver, demonstrating the potential of this method as an efficient tool for portfolio management in HFT scenarios.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0907fa844812a1fa283e83110487da3",
  "timestamp": "2025-05-15T01:01:06.191885"
}