{
  "id": 1537,
  "title": "Hybrid artificial intelligence and robust optimization for a multi-objective product portfolio problem Case study: The dairy products industry",
  "abstract": "The optimization of the product portfolio problem under return uncertainty is addressed here. The contribution of this study is based on the application of a hybrid improved artificial intelligence and robust optimization and presenting a new method for calculating the risk of a product portfolio. By applying an improved neural network with runner root algorithm (RRA), the future demand of each product is predicted and the risk index of each product is calculated based on its predicted future demand. A two-objective (minimizing risk and maximizing return) mathematical model is proposed where, the effect of investments, reliability and allowable lost sales on the designed product portfolio are of concern. Due to the return uncertainty, two robust counterpart models based on the Bertsimas and Sim and Ben-Tal and Nemirovski approaches are developed. Then, an exact solution method is proposed to reduce the solving time of robust model. The results of the implementation in the dairy industry of Iran indicate that an increase in the confidence level, increase the investment risk and decrease the total return. The obtained results by the statistical tests indicate that the two newly proposed robust models are of similar performance in the finding the maximum return solutions, while, here the least risky solutions, the Bertsimas model outperforms its counterparts. Moreover, the results of the proposed exact solution method indicate that this method reduces the execution time by an average of 3%, indicative of proposed method effectiveness.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e09d01e6e261feec65dd245ccd654557",
  "timestamp": "2025-05-15T00:56:39.165422"
}