{
  "id": 173,
  "title": "Volatility forecasting with Hybrid-long short-term memory models: Evidence from the COVID-19 period",
  "abstract": "Volatility forecasting, a central issue in financial risk modelling and management, has attracted increasing attention after several major financial market crises. In this article, we draw upon the literature on volatility forecasting and hybrid models to construct the Hybrid-long short-term memory (LSTM) models to forecast the intraday realized volatility in three major US stock indexes. We construct the hybrid models by combining one or multiple traditional time series models with the LSTM model, and incorporating either the estimated parameters, or the predicted volatility, or both from the statistical models as additional input values into the LSTM model. We perform the out-of-sample test of our Hybrid-LSTM models in volatility forecasting during the coronavirus disease 2019 (COVID-19) period. Empirical results show that the Hybrid-LSTM models can still significantly improve the volatility forecasting performance of the LSTM model during the COVID-19 period. By analysing how the construction methods may influence the forecasting performance of the Hybrid-LSTM models, we provide some suggestions on their design. Finally, we identify the optimal Hybrid-LSTM model for each stock index and compare its performance with the LSTM model on each day during our sample period. We find that the Hybrid-LSTM models' great capability of capturing market dynamics explains their good performance in forecasting.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0a42a0730ebd8afbcefa289ed057638",
  "timestamp": "2025-05-15T01:35:04.367060"
}