{
  "id": 5228,
  "title": "The role of investor protection in stock price crash risk: a comparison of developing and developed Asian economies",
  "abstract": "Purpose - This study examines the influence of investor protection on stock price crash risk (SPCR) in Asian economies. Design/methodology/approach - This study used yearly data from 432 nonfinancial companies publicly listed firms in six countries (i.e., China, India, Pakistan, Hong Kong, Japan and Singapore) from 2007 to 2020 to investigate the relationship between investor protection and the risk of stock price crashes. The hypothesis was tested using a generalized least square panel regression. Findings - The results suggest that investor protection significantly affects SPCR in Asian economies. Furthermore, the findings show that the stocks of firms whose investors received the best protection were less prone to crash in developed Asian economies. However, in developing Asian economies, the stocks of firms whose investors received the best protection were more prone to crashes. Practical implications - It provides awareness and understanding of how the level of investor protection affects SPCR, which could be useful for decision-makers and professionals across a spectrum of financial and non-financial institutions, such as portfolio managers and traders in commercial banks, investment banks and mutual funds. This knowledge enables informed decision-making and the formulation of effective policies to manage stock market volatility. Originality/value - This study appears to be the first of its kind to focus on the link between investor protection and SPCR within the specific context of developed and developing Asian economies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0b086d36b9b0cd4dbf7d9e7686699fd",
  "timestamp": "2025-05-15T02:45:47.374720"
}