{
  "id": 3031,
  "title": "A comparison of landscape metrics for conservation planning",
  "abstract": "This study examined the extent to which commonly used and easily obtained landscape metrics contribute to a conservation planning process that must be completed rapidly and economically. Specifically, we aimed to determine if landscape metrics could be used to guide the prioritization process when the importance of sites to conservation portfolios is measured in terms of irreplaceability, as measured by the probability that a particular site will be required in conservation reserve network. This question was examined in the context of a flexible planning process where the size of a conservation portfolio may vary over time. We used avian survey data from 35 riparian forest sites in central Ohio to calculate irreplaceability scores for each site. Landscape composition within a 1-km radius of each site was measured as the number of buildings and the percent forest, agriculture, roads, pavement and mowed surfaces. Multinomial logistic regression models were created and compared using Akaike Information Criterion. Results suggest that when predicting the irreplaceability value of a site, a simple yet effective method involves the use of forest coverage at the landscape-level plus one metric measuring human disturbance. This result appears to hold across a range of portfolio sizes and is therefore useful even in the context of a planning process that varies in scope over time. (c) 2008 Elsevier B.V. All rights reserved.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0b46fa8a33d6c929897ee545520e8b9",
  "timestamp": "2025-05-15T01:12:43.132918"
}