{
  "id": 2705,
  "title": "Determinants of Foreign Investors' Home Bias in the Vietnamese Stock Market",
  "abstract": "This paper studies the determinants of foreign investors' home bias in the Vietnamese stock market. The research used a database on foreign ownership and the characteristics of 4698 enterprises listed on the Ho Chi Minh Stock Exchange (HOSE) and Hanoi Stock Exchange (HNX) over a 10-year period. A multivariate regression model was constructed using two methods: (i) cross-sectional regressions by year, and (ii) panel data regressions to evaluate the relationship between firm characteristics representing barriers to foreign portfolio investment (FPI) and foreign investors' home bias in the Vietnamese stock market. The results revealed the impact of firm characteristics representing FPI barriers on the home bias of foreign investors in the Vietnamese stock market - i.e., which business characteristics are preferred by foreign investors when choosing investment portfolios - as well as the impact of FPI barriers on the portfolio selection of foreign investors on the Vietnamese stock market. The research results can be used to identify why foreign investors prefer certain firms in their investment portfolios in order to enhance the attraction of FPI capital, for which the most radical solution is to solve the problem of the investment barriers hidden behind firm characteristics.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0b6f64246ed8115d9ea218107658631",
  "timestamp": "2025-05-15T01:09:43.327021"
}