{
  "id": 4022,
  "title": "Green start-up finance - where do particular challenges lie?",
  "abstract": "Purpose The purpose of this paper is to shed some new light on the entrepreneurial finance of green start-ups, for which there has been little quantitative empirical evidence thus far. It explores what challenges green start-ups might experience when it comes to financial access. Design/methodology/approach The paper includes a survey of start-ups in Finland, Germany and Sweden and the separate evaluation of the greenness of participating companies' product/service portfolios based on Eurostat's Environmental Goods and Service Sector classification. A logistic regression is carried out for different company phases for two measures of challenges (difficulty accessing finance and rejection by investor/funder). Findings Green start-ups as an overall group cannot be said to have more challenges in access to finance. Particularly, a lack in business education and a high level of innovativeness, however, seem to be lead to more challenges for green start-ups in accessing finance compared to other start-ups. Research limitations/implications Further research might seek to identify which exact characteristics of innovative green start-ups lead to challenges in financial access, i.e. is it individual factors such as high risk levels, high investment sums, long development periods or a low return prospect - or is it rather a combination? It might, furthermore, be rewarding to investigate whether interventions of business-related training might reduce challenges. Social implications Suggestions are made for improved policy support to sustainable entrepreneurship in the case of green start-ups. Originality/value This research paper provides quantitative empirical analysis in a new research area, which has previously been predominantly theory based with some anecdotal observations as well as some early qualitative research.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0bc0ccf24302b946baee6e890ded6fd",
  "timestamp": "2025-05-15T02:32:27.450247"
}