{
  "id": 9112,
  "title": "Mortality and resource utilization in surgical versus transcatheter repeat mitral valve replacement: A national analysis",
  "abstract": "Background Transcatheter mitral valve replacement (TMVR) has garnered interest as a viable alternative to the traditional surgical mitral valve replacement (SMVR) for high-risk patients requiring redo operations. This study aims to evaluate the association of TMVR with selected clinical and financial outcomes. Methods Adults undergoing isolated redo mitral valve replacement were identified in the 2016-2020 Nationwide Readmissions Database and categorized into TMVR or SMVR cohorts. Various regression models were developed to assess the association between TMVR and in-hospital mortality, as well as additional secondary outcomes. Transseptal and transapical catheter-based approaches were also compared in relation to study endpoints. Results Of an estimated 7,725 patients, 2,941 (38.1%) underwent TMVR. During the study period, the proportion of TMVR for redo operations increased from 17.8% to 46.7% (nptrend<0.001). Following adjustment, TMVR was associated with similar odds of in-hospital mortality (AOR 0.82, p = 0.48), but lower odds of stroke (AOR 0.44, p = 0.001), prolonged ventilation (AOR 0.43, p<0.001), acute kidney injury (AOR 0.61, p<0.001), and reoperation (AOR 0.29, p = 0.02). TMVR was additionally correlated with shorter postoperative length of stay (pLOS; beta -0.98, p<0.001) and reduced costs (beta -$10,100, p = 0.002). Additional analysis demonstrated that the transseptal approach had lower adjusted mortality (AOR 0.44, p = 0.02), shorter adjusted pLOS (beta -0.43, p<0.001), but higher overall costs (beta $5,200, p = 0.04), compared to transapical. Conclusions In this retrospective cohort study, we noted TMVR to yield similar odds of in-hospital mortality as SMVR, but fewer complications and reduced healthcare expenditures. Moreover, transseptal approaches were associated with lower adjusted mortality, shorter pLOS, but higher cost, relative to the transapical. Our findings suggest that TMVR represent a cost-effective and safe treatment modality for patients requiring redo mitral valve procedures. Nevertheless, future studies examining long-term outcomes associated with SMVR and TMVR in redo mitral valve operations, are needed.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0c4d557c2ef7853ee088ea3652120e0",
  "timestamp": "2025-05-15T03:25:27.815691"
}