{
  "id": 9208,
  "title": "High non-compliance rate among presumptive tuberculosis cases referred from peripheral health facilities in silti district of Southern Ethiopia: a mixed methods study",
  "abstract": "BackgroundFor presumptive Tuberculosis (TB) case referral to be effective, most of the referred cases need to present themselves to health facilities for assessment and testing. Otherwise, cases of TB could be missed, and these cases are at an increased risk of delayed diagnosis, complications and death. Further, their care incurs significantly higher costs. This study assessed referral compliance as well as factors attributable to compliance/non-compliance to referral of presumptive TB cases in Silti district, Southern Ethiopia.MethodWe applied a mixed design involving both quantitative and qualitative methods. A randomly selected sample of 384 presumptive TB cases referred between January, 2014 and July 2021 were included in this study from the records of 12 health posts. Purposefully selected presumptive TB cases and Health Extension Workers were also interviewed to get in-depth information on the reasons for compliance and non-compliance to referral. STATA version 14 was employed to model the data using logistic regression. Qualitative data were analyzed using thematic content analysis.ResultsOf the 384 referred presumptive TB cases, close to 49% did not present themselves to the referral facilities. About 66% (n = 249) of the referred cases were women, and 62% (n = 119) of those who complied to referral were women. In multivariate analysis, cough [AOR = 3.4, 95%CI: 1.54-7.32], and chest pain [AOR = 2.7, 95%CI: 1.45-5.05] were independent predictors of compliance to referral. Nearly 5.5% (n = 21) of TB cases of all types were identified. The qualitative data analysis revealed that severe disease symptoms, HEW's recommendations, and social issues as reasons improving compliance while personal and social factors, financial problems, lack of awareness about TB and transportation were reasons impeding compliance to referral.ConclusionOur study showed a high level of non-compliance to referral among referred presumptive TB cases. We also found that more women were referred and also complied with the referral. Strengthening community awareness about the disease symptoms and the existence of free treatment, addressing misconceptions about TB, supporting the elderly and disabled, and checkup house visits after referral could improve compliance to referral.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0cc5cd60dcfc6ba5c773fa3a4f805f4",
  "timestamp": "2025-05-15T03:26:26.061198"
}