{
  "id": 730,
  "title": "Modeling food-related business closure in select New York City communities using multi-scale and spatial features",
  "abstract": "This paper introduces an extensible framework to predict small-business closures to inform urban planners, lenders, and business owners as to factors to improve business resilience. This paper couples machine learning with two point of interest (POI) datasets and infrastructure data and uses New York State's COVID-19 PAUSE as a stressor for investigating small-business resiliency. The study included 2537 food-related, non-chain, retail businesses across select New York City zip codes, of which 17.7% closed permanently. Macro-, meso-, and micro-levels of features included the neighborhood profile, street dynamics, and venue-specific, location-related characteristics. A Gaussian Mixture Neural Network model achieved 74.1% precision, 92.5% recall, and an 82.3% F1-score without use of financial data. High-end restaurants located further than average from public transit were most at risk for closure, while non-restaurant, food businesses in commercially diverse areas having higher-than-average social media ratings were least at risk. This paper introduces a model for timely prediction of pandemic-induced, food-related, small-business closures without reliance on private or protected financial data, and provides insights into urban design to promote small, food business survivability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0cc0a7290256da12eb1e3f8986a7f60",
  "timestamp": "2025-05-15T01:54:34.021709"
}