{
  "id": 9414,
  "title": "Monetary policy and stabilization of the US economy",
  "abstract": "The boom of the USA economy in the nineties outmatched all the booths in the past fifty years as well as the expectations of many economists. Important indicators such as unemployment rate. inflation rate. capitalisation of financial markets and fiscal management helped to prolong the expansion of the economic cycle. GDP growth rate tend productivity growth rate eras on average higher than any other comparable economic system. At the same time the whole decade was dominated by the efficient functioning of the monetary policy of the central bank Fed. Conditions in the nineties differed substantially from those in the seventies and eighties. In the nineties one managed in the US to change the tendency in the economic cycle and market subjects became more confident that any increase of inflation and interest rates is only a temporary one and that the long-terns trend in monetary policy follows price stability. First-rate target of the Fed's monetary strategy was to maximise long-term economic growth along with the preservation of the stable purchasing power of the currency.(25), Along with Fiscal consolidation, which already inspired confidence, monetary policy was able to act more efficiently in favour of sustainable growth and prolonged expansion. Balancing and stabilising of the development of currency's purchasing power and inflation started to be successful since the times when its currency policy monetary approach prevailed and when one ascribed to the currency the irreplaceable role in its function in individual pleases of economic cycles. Later successes achieved in the field of local currency's strong exchange rate and long-term economy growth had big support in the change of Fed's policy of the year 1979 and its further gradual enforcement(26) into the mode of economic cycle function. When in the second half of the year 2000 the output began gradually to slow down its growth rate, Fed let the official interest rate unchanged (6.5 per cent) and thus signalled its potential decrease. Fed was led towards the consecutive relaxation of conditions in the market by the fears of the deterioration the expansion results (relaxation of the investment and consumption demand) and possible recession deepening. Central bank thus opened the struggle for the confidence in its abilities. The character of economic slow-down and recession depend also oil how intensive the unbalances generated in economy manifest themselves during boom expansion. The causes responsible for the recession situation of economic growth slow-down are numerous and cannot be all included here. Ever-new impulses affecting the behaviour of enterprises, households and the government subscribe; themselves oil the unbalances already generated, and it is questionable to what extent the economy will be able to develop itself further alongside with this negative impact. In the USA the following three sorts of unbalances most markedly occur: a) net savings of private sector are negative: b) households and firms generate big debts: c) current account payment balance deficit grows enormously. High financial deficit of the private sector arose as a result of the investment increase and dramatically decreased growth rate in personal savings. Should the net savings return to their historic average,(27) the result would be a relatively big decrease of aggregate demand after the decrease of consumer expenses and investments of firms. This case can be provoked by medium-term expectations of negative development of the product, employment and decreasing incomes that will reflect in share rates. The growth of capital markets played an important role in consumer demand. We demonstrated by means of regression analysis that for higher real expenses of the households lower disposable income was enough, in other words, in the years 1984 - 1990 the elasticity of real personal expenses towards the changes in disposable income was stronger, whereas in the years 1991 - 1997 this elasticity was weakened by the possibility of higher indebtedness. Disposable income no longer played in consumer decision of the households such nil important role as in the past and the demand could increase at the expense of the higher drawing of the financial market tools. The development of financial markets accompanied by the enforcement of monetary rules in economic policy was indirectly related with the growth of deficit in the current account payments. The trade deficit is in its essence the flow and will last as long as one could finance it either by the sale of foreign assets owned by the Americans or by the sales of domestic American assets to foreigners or by loans from abroad. Trade deficit thus brings about financial risk in the form of high uncertainty rate generated by exogenous influences (for instance uncertain foreign demand). Mentioned unbalances. which were generated during the boom of the nineties. are connected with the development of capital markets and with the high growth of American economy, The indebtedness of the private sector and the current account payment. balance deficit result from the favourable development of the boom, which however. they inevitably subvert in the long-term horizon. Negative net savings are important mainly from the short-terns point of view. Negative net savings arc important also from the point of view of the boom slow-down's impact oil the consumption of the private sector. The important part in the process of increasing unbalances is played by the macro-economic strategy, particularly the functioning of monetary and fiscal policy trying to moderate the influence of the slower growth of economy and weaker aggregate demand. American economy is since the second half of the year 2000 in the phase where the supply and demand try to Find anew balance after the end of the period of long-term not sustainable fast growth. Although in this phase the economy demonstrated signs typical for the recession of economy - excessive capacities, decreasing investments, worker discharging, decreasing profits - this slow-down lacks dynamics, gravity of consequences and duration of the real recession, Monetary policy responded to this development relatively quickly and markedly decreased interest rates, thus confirming the fears of economy's recession. These fears prevail and the expectations to continue a relaxed monetary policy of the central bank are confirmed. The prospects for further monetary reaction are based oil weak inflation pressures. However, some signs of their possible increase exist. At stake are above all relatively saturated labour market and the risk of weakening of the USD exchange rate. Economic cycle is ill the advanced phase and favourable inflation conditions that allowed the Fed to decrease interest rates may not prevail ill the future. Thus it will depend oil how one succeeds to maintain investment activity, where the fluctuation in later phases directly influences the consumption sector. We cannot expect that consumers will maintain their expenses oil such a high level (concerning their indebtedness), as has been the situation up till now. We can say that if before September 2001 one sensed a certain unwillingness to engage fiscal programmes into the support of aggregate demand, one now considers such a tool of economic policy as indispensable. This will thus mean even stronger short-term support for (lie weakened growth. It is also unquestionable that ill macro-economic policy, the economic and policy mix will be changed when the hither-to preferred monetary policy would be accompanied to a greater extent also by the support for fiscal budget. Current expenses of the government for the first quarter of 2002 total 28.8 tier cent or GDP and one should my that higher government expenditure is implemented at the expense of private investments. Question remains, how will greater public expenses influence logs-term interest rates. Long-term balance of the American economy will be influenced, however, by the decline of fiscal balance, where the deficit for the first quarter of 2002 totals 64.4 billion USD, The combination or slower growing economy. higher expenses and tax decreases changes the estimates or projected fiscal excesses. Higher government expenses will strengthen the role of the government in the economy and thus a new power distribution between private and public sectors will take place.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0d2c378b8c3f66ccd51f67655c2f1be",
  "timestamp": "2025-05-15T03:28:46.187852"
}