{
  "id": 7697,
  "title": "Global, regional and country-specific burden of patella, tibia or fibula, or ankle fractures and its prediction to 2035: findings from global burden of disease study 2019",
  "abstract": "BackgroundBone fractures are a global public health issue and a major source of significant illness and financial hardship. However, to date, there is limited research on patella, tibia or fibula, or ankle fractures (FPTFA) disease burden.MethodsUsing the framework of the Global Burden of Diseases, Injuries, and Risk Factors Study (GBD) 2019, we conducted temporal trends of disease burden, effects of sex and socio-demographic index (SDI) on age standardized prevalence rate (ASPR) and age-period-cohort model. Machine learning models were built to predict the ASPR of FPTFA in 2035.ResultsIn 1990 and 2019, the top three of all fractures with the highest ASPR was FPTFA. Globally, in 2019, there were 13529.45 million (95%UI: 11811.02, 15642.25), 9198.67 million (95%UI: 8518.9, 10009.91) and 77.54 million (95%UI: 34.09, 149.9) prevalent cases of fracture attributable to fall, transport injury and mechanical external force, respectively. The number of fracture prevalence and years lived with disability (YLDs), and ASPR were higher in males than in females. From 1990 to 2019, most of GBD regions showed a downward trend in average annual percent change (AAPC) of ASPR attributable to transport injuries, High-income Asia Pacific had the highest decline (AAPC= -1.81%, 95%CI: -1.89% to -1.74%). However, an upward trend in East Asia was observed (AAPC = 1.60%, 95%CI: 1.48-1.73%). With increasing SDI, the ASPR for FPTFA attributed to the fall and mechanical external force slowly increased and then turned downward, especially in high-income and high-SDI countries. The longitudinal age curve suggested that the attributed rate was increased for the three sites of lower limb fractures. The best predictive models for FPTFA caused by falls, transport injuries and mechanical external force were autoregressive integrated moving average model (ARIMA) (0,2,1), ARIMA (2,0,1) and ARIMA (0,2,2), with R2 of 0.96, 0.78 and 0.94, respectively. By 2035, ASPR for the fall-related FPTFA will continue to rise rapidly, whereas the ASPR of the transport injury-related FPTFA will gradually decrease.ConclusionFPTFA attributed to the falls is the dominant type and the burden and trends of the fall-related FPTFA are substantial. Fall prevention and access to treatment are crucial for reducing FPTFA burden.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0e62aa038f89f1e13f1c062e5d9a4d5",
  "timestamp": "2025-05-15T03:11:04.607968"
}