{
  "id": 7729,
  "title": "Non-use of health care service among empty-nest elderly in Shandong, China: a cross-sectional study",
  "abstract": "Background: Empty-nest elderly refers to those elderly with no children or whose children have already left home. Few studies have focused on healthcare service use among empty-nest seniors, and no studies have identified the prevalence and profiles of non-use of healthcare services among empty-nest elderly. The purpose of this study is to compare the prevalence of non-use of healthcare services between empty-nest and non-empty-nest elderly and identify risk factors for the non-use of healthcare services among empty-nest seniors. Methods: Four thousand four hundred sixty nine seniors (60 years and above) were draw from a cross-sectional study conducted in three urban districts and three rural counties of Shandong Province in China. Non-visiting within the past 2 weeks and non-hospitalization in previous year are used to measure non-use of healthcare services. Chi-square test is used to compare the prevalence of non-use between empty-nesters and non-empty-nesters. Multivariate logistic regression analysis is employed to identify the risk factors of non-use among empty-nest seniors. Results: Of 4469 respondents, 2667(59.7 %) are empty-nesters. Overall, 35.5 % of the participants had non-visiting and 34.5 % had non-hospitalization. Non-visiting rate among empty-nest elderly (37.7 %) is significantly higher than that among non-empty-nest ones (32.7 %) (P = 0.008). Non-hospitalization rate among empty-nesters (36.1 %) is slightly higher than that among non-empty-nesters (31.6 %) (P = 0.166). Financial difficulty is the leading cause for both non-visiting and non-hospitalization of the participants, and it exerts a larger negative effect on access to healthcare for empty-nest elderly than non-empty-nest ones. Both non-visiting and non-hospitalization among empty-nest seniors are independently associated with low-income households, health insurance status and non-communicable chronic diseases. The non-visiting rate is also found to be higher among the empty-nesters with lower education and those from rural areas. Conclusions: Our findings indicate that empty-nest seniors have higher non-use rate of healthcare services than non-empty-nest ones. Financial difficulty is the leading cause of non-use of health services. Healthcare policies should be developed or modified to make them more pro-poor and also pro-empty-nested.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e0eb366df124cb36fe37855a1f66a9f2",
  "timestamp": "2025-05-15T03:11:38.474905"
}