{
  "id": 7965,
  "title": "Price response of top-five renewable energy firms to Russia-Ukraine conflict: An advanced quantile analysis to achieve net-zero in United States of America",
  "abstract": "Achieving net zero largely depends on the stability of the domestic renewable energy generation firms. Steady investment attracted by these firms can ensure their sustenance. Price fluctuations of these firms can affect their risk profiles, and subsequently, the investments coming toward those firms. The fluctuating stance of the United States of America (USA) in tacking climatic shift has made the policy environment inconducive of the domestic renewable energy generation firms. The disruptions in the financial market caused by the Russia-Ukraine Conflict have worsened the situation. Moreover, the trade restrictions on critical minerals and restrictive trade flows in the post-conflict period are expected to hamper the operational efficiency of these firms. Given this background, the present study attempts to develop a policy framework for the USA to internalize the impacts of conflict and stabilize the price returns of the renewable energy generation firms in the USA. The study is done from January 5, 2021, to March 31, 2023, and by comparing the pre- and post-conflict scenarios after dividing the sample. This study has used the multivariate quantile-on-quantile regression (m-QQR) framework. Results of the study have provided with significant insights into the price response of the renewable energy generation firms in the USA to the Russia-Ukraine Conflict. These insights are utilized to develop a policy framework to achieve net zero in the USA.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e10a7532f3285c9ab3af9d795ae68f03",
  "timestamp": "2025-05-15T03:14:07.138884"
}