{
  "id": 5203,
  "title": "Depressive symptoms after breast cancer surgery: Relationships with global, cancer-related, and life event stress.",
  "abstract": "For women with breast cancer, rates of depression are the third highest of any cancer diagnostic group. Stress, defined as life events or perceptions of stress, is associated with depressive symptoms. However, little is known about the relationships between different types of stress and these symptoms in women with breast cancer. This relationship was tested in 210 women assessed after initial surgical treatment for regional breast cancer. Using Hierarchical Multiple Regression, three types of stress were examined: the occurrence of five stressful life events in the year prior to cancer diagnosis, perceptions of global stress, and perceptions of cancer-related traumatic stress. Other potentially relevant correlates of depressive symptoms were also examined, including the personality trait neuroticism, sociodemographics, and disease/treatment characteristics. Fifty-three percent of the variance in depressive symptoms was accounted for by three stress variables (perceptions of global and cancer-related traumatic stress and the life event-major financial difficulty) and two control variables (neuroticism and racial group). Specifically, global stress perceptions coupled with cancer-related intrusive thoughts and financial concerns along with the tendency towards negativity (neuroticism) may conspire to heighten a women's risk for depressive symptoms. Assessing multiple sources of stress would improve our ability to identify women 'at risk' for depressive symptoms and provide appropriate intervention. Copyright (C) 2003 John Wiley Sons, Ltd.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e11e0912f6e331f9fd48b13650a9a0ec",
  "timestamp": "2025-05-15T02:45:17.129681"
}