{
  "id": 4057,
  "title": "Examining the impact of market uncertainty on earnings forecasts: an empirical study from Egypt",
  "abstract": "PurposeThis paper aims to conduct a comparative analysis of the impact of market uncertainty on the degree of accuracy and bias of analysts' earnings forecasts versus four model-based earnings forecasts.Design/methodology/approachThe study employs panel regression analysis on a sample of Egyptian listed companies from 2005 to 2022 to examine the impact of market uncertainty on the accuracy and bias of each type of earnings forecast.FindingsThe empirical analysis reveals that market uncertainty significantly affects analysts' earnings forecast accuracy and bias, while model-based earnings forecasts are less affected. Furthermore, the Earnings Persistence and Residual Income model-based earnings were found to be superior in terms of exhibiting the least susceptibility to the impact of market uncertainty on their forecast accuracy and biasness levels, respectively.Practical implicationsThe findings have important implications for stakeholders within the financial realm, including investors, financial analysts, corporate executives and portfolio managers. They emphasize the importance of considering market uncertainty when formulating earnings forecasts, while concurrently highlighting the potential benefits of using alternative forecasting methods.Originality/valueTo our knowledge, the influence of market uncertainty on analysts' earnings forecast accuracy and bias in the MENA region, particularly in the Egyptian market, remains unexplored in existing research. Additionally, this paper contributes to the existing literature by pinpointing the forecasting method, specifically distinguishing between analysts-based and model-based approaches, whose predictive quality is less adversely impacted by market uncertainty in an emerging market.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e11e2f4b2fe5be2c1701fccde69de35e",
  "timestamp": "2025-05-15T01:23:27.319920"
}