{
  "id": 4082,
  "title": "Occupational burnout and public stigma associated with employee mental well-being: A multi-industry, cross-sectional study during COVID-19",
  "abstract": "BACKGROUND: While mental illness (e.g., depression, anxiety) has been examined frequently in the workplace, the COVID-19 pandemic has only increased the attention towards mental illness. Mental well-being views mental health as a continuum from ill health to thriving. Few studies have examined factors associated with mental well-being in the workplace. Public stigma for mental illness, the general population's negative attitude towards mental illness, and occupational burnout are examined. OBJECTIVE: The purpose of this study was to examine the relationship between burnout and public stigma on mental well-being in a sample of employees across industries in the United States. METHODS: Employees surveyed from 16 companies from various industries were assessed. Room Here, a non-profit organization whose goal is to improve employee mental fitness, gathered data from these companies located in the western mountain region of the U.S. Data were collected during the pandemic. Across this portfolio of companies, 259 employees were included in the sample. Survey assesses respondents' mental well-being, stigma towards mental illness, and occupational burnout. Ordinary least squares (OLS) regression was used in this cross-sectional study on secondary data. RESULTS: Results suggested occupational burnout was associated with a decrease in mental well-being, while public stigma was associated with an improvement in mental well-being. CONCLUSION: This study sought to examine the relationship between mental well-being, burnout, and public stigma. Employee burnout and public stigma were related to mental well-being. Implications for burnout and stigma reduction programs are discussed as well as future research.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e1315ef0e9b2f818ff465652d10447ef",
  "timestamp": "2025-05-15T01:23:27.432270"
}