{
  "id": 5390,
  "title": "Preventing Pressure Ulcers by Image based Posture Detection",
  "abstract": "Pressure ulcers, also known as pressure sores or bedsores, are a disease affecting the skin and underlying tissue that mostly occurs over bony parts of the body because of long-term exposure to pressure. Pressure ulcers most commonly develop in patients who are often bed- or chair-bound for long periods of time. When an ulcer occurs, its treatment is often complex and expensive. Relieving the pressure imposed on the patient skin is the most effective approach for preventing bedsores. Common practice in hospitals and nursing homes is to periodically repositioning the patient. Manually relieving patient skin pressure places a financial and physical burden on caregivers. In this paper, we are proposing a detection approach that optimally detects patient posture and spots at-risk locations on the body by using data from a pressure sensor array in a bed. Our novel ulcer detection solution is based on posture detection using an SVM-based classifier, whose performance was considerably boosted by the pre-processing pipeline we designed. The approach periodically generates outputs that can be used to trigger actuators in air-enabled mattresses to inflate and deflate the air in the target locations. This technique can also be used in robot-equipped beds to turn patients if needed to prevent bedsores. The generated outputs can also be used in reporting the patient's condition.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e1332642bb51104938030d2b1a8d6381",
  "timestamp": "2025-05-15T02:47:13.995335"
}