{
  "id": 3969,
  "title": "The role of the internal audit in the Armed Forces and its influence on organisational sustainability: a case study",
  "abstract": "Purpose - This paper develops a case study focusing on the Portuguese Air Forces, first to identify the roles of the internal audit (IA) and then to analyse its influence on organisation sustainability, while also exploring the moderating effect of human resource management practices (HRMPs). Theoretical framework - This research draws on empirical work on the roles and activities performed by IA in the private sector and human capital theory to assess the effect of HRMPs on performance. Design/methodology/approach - The study uses the survey method and data were collected through a questionnaire made available on an online platform. The study applies an ordinary least squares regression model. Findings - This study shows that IA provides assurance and advisory services and that IA is positively related to sustainability orientation, particularly in the governance and social dimensions. The moderating effect of HRMPs is felt only in the environmental dimension. Practical & social implications of research - This study reinforces the literature on the relationship between IA effectiveness and sustainability, provides insights into the effectiveness of IA as reported by auditors themselves, identifies the portfolio of functions performed by IA, and points to improvements to be made in IA management. Originality/value - The topics studied are explored for the first time in the context of the Armed Forces, and the analysis of the moderating effect of HMRPs on the relationship between IA and sustainability is pioneering.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e1376a4541923766c8875d522b863ed0",
  "timestamp": "2025-05-15T01:22:39.405888"
}