{
  "id": 1421,
  "title": "A credit scoring ensemble model incorporating fuzzy clustering particle swarm optimization algorithm",
  "abstract": "The emergence of credit has generated a wealth of data on consumer lending behavior. In recent years, financial institutions have also started to use such data to make informed lending decisions based on fine-grained customer data, but conventional risk assessment models are inadequate in meeting the risk control requirements of the financial industry. Therefore, this paper proposes a credit scoring ensemble model incorporating fuzzy clustering particle swarm optimization (PSO) algorithm to obtain better credit risk prediction capability. First, a weighted outlier detection method based on the Induced Ordered Weighted Average Operator is proposed to preprocess the data to reduce noisy data's misleading effect on model training. Then, an undersampling method combined with fuzzy clustering PSO is proposed to overcome the negative effect of category imbalance on model training by resampling the data. In addition, a hyperparameter optimization framework is introduced to adaptively adjust important parameters in the ensemble model considering the impact of parameter settings on the training performance of the model. Based on the evaluation metrics of F-score, AUC, and Kappa coefficient, an empirical analysis was conducted on five credit risk datasets. The results show that the proposed method outperforms the comparative model with an improvement of 10% to 50% in terms of F-score and AUC. The highest achieved F-score is 0.9488, and the maximum AUC is 0.9807, demonstrating the effectiveness of the proposed method. The kappa coefficient results indicate a high level of consistency in the predicted classification results of the model.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e14198347656618a4b79655d9760b37e",
  "timestamp": "2025-05-15T02:03:00.618098"
}