{
  "id": 9248,
  "title": "Psychosocial impact of the summer 2007 floods in England",
  "abstract": "Background: The summer of 2007 was the wettest in the UK since records began in 1914 and resulted in severe flooding in several regions. We carried out a health impact assessment using population-based surveys to assess the prevalence of and risk factors for the psychosocial consequences of this flooding in the United Kingdom. Methods: Surveys were conducted in two regions using postal, online, telephone questionnaires and face-to-face interviews. Exposure variables included the presence of flood water in the home, evacuation and disruption to essential services (incident management variables), perceived impact of the floods on finances, house values and perceived health concerns. Validated tools were used to assess psychosocial outcome (mental health symptoms): psychological distress (GHQ-12), anxiety (GAD-7), depression (PHQ-9) and probable post-traumatic stress disorder (PTSD checklist-shortform). Multivariable logistic regression was used to describe the association between water level in the home, psychological exposure variables and incident management variables, and each mental health symptom, adjusted for age, sex, presence of an existing medical condition, employment status, area and data collection method. Results: The prevalence of all mental health symptoms was two to five-fold higher among individuals affected by flood water in the home. People who perceived negative impact on finances were more likely to report psychological distress (OR 2.5, 1.8-3.4), probable anxiety (OR 1.8, 1.3-2.7) probable depression (OR 2.0, 1.3-2.9) and probable PTSD (OR 3.2, 2.0-5.2). Disruption to essential services increased adverse psychological outcomes by two to three-fold. Evacuation was associated with some increase in psychological distress but not significantly for the other three measures. Conclusion: The psychosocial and mental health impact of flooding is a growing public health concern and improved strategies for minimising disruption to essential services and financial worries need to be built in to emergency preparedness and response systems. Public Health Agencies should address the underlying predictors of adverse psychosocial and mental health when providing information and advice to people who are or are likely to be affected by flooding.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e14b46a77f940c02e929dfeb6c97881f",
  "timestamp": "2025-05-15T03:26:54.598582"
}