{
  "id": 2786,
  "title": "Unveiling the curvilinear dynamics: financial inclusion and bank performance in India",
  "abstract": "PurposeThis study aims to explore the intricate and dynamic relationship between financial inclusion and the financial performance of banking institutions, revealing a novel U-shaped pattern. By employing a comprehensive financial inclusion index, it highlights how financial inclusion initially hampers performance due to elevated costs and risk exposure, but beyond a critical threshold, it becomes a driver of financial success.Design/methodology/approachUsing a robust regression framework, this study analyzes financial inclusion metrics and banking performance indicators from 2014 to 2023. The analysis, conducted with Stata 17, offered a comprehensive understanding of the interplay between financial inclusion and bank performance.FindingsThe results uncover a significant U-shaped relationship, marking a groundbreaking contribution to the Indian banking sector. Early-stage financial inclusion efforts strain profitability due to operational inefficiencies and risk factors, but as inclusion scales beyond a critical point, its benefits outweigh costs, enhancing financial performance. This too little of a good thing effect underscores the need for strategic, well-calibrated financial inclusion initiatives that balance growth with sustainability.Originality/valueUnlike prior studies that assume a linear relationship, this research is the first to empirically establish a U-shaped link between financial inclusion and bank performance to identify the optimal level of financial inclusion to enhance the financial performance of banks in the Indian context. The findings provide actionable insights for policymakers and financial institutions, advocating for a nuanced, stage-wise approach to financial inclusion that maximizes financial viability.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e151cedaaceadc684372d299c921cd46",
  "timestamp": "2025-05-15T02:19:08.457721"
}