{
  "id": 2629,
  "title": "ENVIRONMENTAL PERFORMANCE, SOCIAL RESPONSIBILITY AND CORPORATE GOVERNANCE (ESG) RATINGS AND FINANCIAL RISK",
  "abstract": "The promotion of environmental performance, social responsibility, and corporate governance (ESG) ratings are increasingly becoming the consensus of multinational green financial institutions, investors, and governments, as evidenced by the increasing number of ESG scoring systems and databases developed in recent years. After the full implementation of the Green Credit Guidelines (GCG) policy by the Chinese government in 2014, all environment-related firms, especially listed firms, had to be concerned about their ESG information disclosure. Based on the difference-in-difference (DID) approach, this study empirically examined the impact of the green finance policy on ESG scores and financial risk within the green economy. We applied a fixed effect (FE) model to analyze static panel data to test the impact of financial risk on ESG indices, with a general method of moments (GMM) two-step system in the dynamic panel to perform the benchmark regression. We also further evaluated the moderating effect of patent lifespan and internal controls. Our empirical results indicate that; 1) GCG policy significantly improved the ESG scores and reduced the financial risk of green enterprises; 2) financial risk negatively affected ESG ratings in Chinese listed companies; 3) the maintenance period of patents and internal controls could significantly moderate financial risk, with a negative interaction, and help enterprises with profitable operations to improve their ESG ratings.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e1661382660399f31af1b48b187ee7cf",
  "timestamp": "2025-05-15T02:17:32.141424"
}