{
  "id": 8976,
  "title": "Out-of-pocket expenditures and financial risks associated with treatment of vaccine-preventable diseases in Ethiopia: A cross-sectional costing analysis",
  "abstract": "BackgroundVaccine-preventable diseases (VPDs) remain major causes of morbidity and mortality in low- and middle-income countries (LMICs). Universal access to vaccination, besides improved health outcomes, would substantially reduce VPD-related out-of-pocket (OOP) expenditures and associated financial risks. This paper aims to estimate the extent of OOP expenditures and the magnitude of the associated catastrophic health expenditures (CHEs) for selected VPDs in Ethiopia. Methods and findingsWe conducted a cross-sectional costing analysis, from the household (patient) perspective, of care-seeking for VPDs in children aged under 5 years for pneumonia, diarrhea, measles, and pertussis, and in children aged under 15 years for meningitis. Data on OOP direct medical and nonmedical expenditures (2021 USD) and household consumption expenditures were collected from 995 households (1 child per household) in 54 health facilities nationwide between May 1 and July 31, 2021. We used descriptive statistics to measure the main outcomes: magnitude of OOP expenditures, along with the associated CHE within households. Drivers of CHE were assessed using a logistic regression model. The mean OOP expenditures per disease episode for outpatient care for diarrhea, pneumonia, pertussis, and measles were $5 center dot 6 (95% confidence interval (CI): $4 center dot 3, 6 center dot 8), $7 center dot 8 ($5 center dot 3, 10 center dot 3), $9 center dot 0 ($6 center dot 4, 11 center dot 6), and $7 center dot 4 ($3 center dot 0, 11 center dot 9), respectively. The mean OOP expenditures were higher for inpatient care, ranging from $40 center dot 6 (95% CI: $12 center dot 9, 68 center dot 3) for severe measles to $101 center dot 7 ($88 center dot 5, 114 center dot 8) for meningitis. Direct medical expenditures, particularly drug and supply expenses, were the major cost drivers. Among those who sought inpatient care (345 households), about 13 center dot 3% suffered CHE, at a 10% threshold of annual consumption expenditures. The type of facility visited, receiving inpatient care, and wealth were significant predictors of CHE (p-value < 0 center dot 001) while adjusting for area of residence (urban/rural), diagnosis, age of respondent, and household family size. Limitations include inadequate number of measles and pertussis cases. ConclusionsThe OOP expenditures induced by VPDs are substantial in Ethiopia and disproportionately impact those with low income and those requiring inpatient care. Expanding equitable access to vaccines cannot be overemphasized, for both health and economic reasons. Such realization requires the government's commitment toward increasing and sustaining vaccine financing in Ethiopia. Author summary Why was this study done? Despite a rapid expansion in access to vaccines in the past 2 decades, vaccine-preventable diseases (VPDs) remain major causes of morbidity and mortality in low- and middle-income countries.Out-of-pocket (OOP) medical expenditures can lead to catastrophic health expenditures and impoverishment.Studies on household healthcare expenditures and associated financial risks for VPDs among children in sub-Saharan African countries are scarce. What did the researchers do and find? We collected OOP expenditures data from 995 households to estimate medical impoverishment associated with the following vaccine-preventable childhood diseases: measles, pertussis, pneumonia, diarrhea, and meningitis.Households incur substantial OOP expenditures for the treatment of VPDs in Ethiopia.Poor families and those with sick children requiring inpatient care are likely to be impoverished. What do these findings mean? Expanding access to vaccination has the potential to protect families from OOP expenditures related to the treatment of VPDs and its associated catastrophic and impoverishing financial consequences. The financial risk benefits primarily accrue among the poorest.Universal access to vaccines requires the government's commitment toward increasing and sustaining vaccine financing.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e16bbb2fe96b30ed19b1efc2f1f42177",
  "timestamp": "2025-05-15T03:24:26.272540"
}