{
  "id": 3929,
  "title": "Standardization of the life cycle environmental performance in the energy sector: ASTM draft standard: E067110 quantifying and reporting the environmental performance of electric power generation facilities and infrastructure; Implications to the electronics sector",
  "abstract": "Among the key suppliers to the electronics sector, the power generation sector has been standardizing its approach to reporting environmental performance across the broad portfolio. The draft ASTM Standard, E06710, on the quantification and reporting of environmental performance of the electric power generation facilities contains a technology-neutral, performance based approach to environmental performance reporting. With its emphasis on life cycle impact assessment methodology and comparisons to grid power, the standard provides a mechanism to address system wide improvement and to encourage improvement and efficiencies among all power generation technologies and end users. In addition, by conforming to Clause 9 of ISO 14042 LCIA standard for comparative assertions, the ASTM standard specifies an LCIA framework that requires impact classification/characterization on a spatial, temporal, and effect-intensity basis. This level of LCIA allows for an environmental accounting system with sufficient accuracy to create a quantitative environmental performance rating program. This paper illustrates comparison among various renewable and non-renewable power generation options. This EP-rating system will be useful tool for power customers and planners and will serve as the basis for transparent, accurate reporting of advantages/disadvantages of various generation options/portfolios. The results of these analyses will be useful to energy customers, policy makers, and emergent technology/distributed power generators. This approach can also be used to address engineering approaches to conformance to the Restriction on Hazardous Substances as currently being standardized as part of ASTM F40.4.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e1727711c4d45bfc193f17ea6deaebe0",
  "timestamp": "2025-05-15T01:22:11.944214"
}