{
  "id": 3729,
  "title": "Electricity consumption and economic growth nexus in Zimbabwe revisited: fresh evidence from Maki cointegration",
  "abstract": "This study explores the relationship between electricity consumption, real gross domestic product per capita and carbon dioxide emissions in Zimbabwe. To achieve this, the study set off by examining the stationarity properties of the variables under review with the Zivot-Andrews (1992) unit root test that accounts for a single structural break. Subsequently, Maki (2012) cointegration test, which accounts for multiple structural breaks, is applied for equilibrium relationship between the variables under review while the long run regression of dynamic ordinary least square (DOLS) is employed for long-run coefficients as estimation procedures. In order to account for the direction of causality flow, the Toda-Yamamoto (1995) causality test is used for annual frequency data set spanning from 1971-2014. Empirical evidence from the Maki cointegration test shows that there exists a long-run equilibrium relationship between electricity consumption, carbon dioxide emissions and real gross domestic product per capita over the sampled period. The long-run regression suggests that there exist a positive statistically significant relationship between real income and electricity consumption. Thus, corroborating the electricity-led growth hypothesis. This result is supported by the causality test, as one-way causality is observed running from electricity consumption to real gross domestic product. Thus, this is suggestive to government administrators and policymakers that the Zimbabwean economy is electricity dependent. However, there is a tradeoff for environmental quality. As the increase in electricity consumption increases carbon dioxide emissions. The need for diversification of Zimbabwe energy portfolio to cleaner and environmentally friendly energy sources is recommended, given the world global consciousness for cleaner energy consumption.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e19209f9575bacc39371ad10b98f889d",
  "timestamp": "2025-05-15T01:20:03.612383"
}