{
  "id": 7595,
  "title": "Investigating the beneficial impact of segmentation-based modelling for credit scoring",
  "abstract": "Due to its vital role in financial risk management, credit scoring has been investigated extensively in extant information systems studies. However, most credit scoring studies rely on one-size-fits-all classifiers with logistic regression (LR) as a popular benchmark. Moreover, extant literature largely focuses on predictive performance as an evaluation criterion. To find a better balance between predictive performance and interpretability though, the current study investigates the beneficial impact of segmentation-based modelling by benchmarking the logit leaf model (LLM) which is based on LR and decision trees. By a large experimental setup using a real-life credit scoring data set containing 65,536 active customers, we find that LLM is a viable classifier over its constituent parts, i.e., LR and decision trees, and is very competitive to state-of-the-art credit decision making techniques (neural networks, support vector machines, bagging, boosting and random forests) on three evaluation metrics (AUC, top-decile lift and profit). Furthermore, we show its extraordinary interpretability capacities by proposing a new visualization based on the LLM output. In sum, the excellence of the LLM as a classifier for credit decision making problems stems from its ability to combine strong predictive performance with interpretable insights that in turn can inform managerial decisions.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e194085f693bc7d14c9c29b9a971f6d1",
  "timestamp": "2025-05-15T03:10:05.622203"
}