{
  "id": 4042,
  "title": "Health burden and funding at the Centers for Disease Control and Prevention",
  "abstract": "Background: The relationship between domestic funding for selected conditions to the Centers for Disease Control and Prevention (CDC) and the burden of disease and disability in the United States was assessed systematically. Methods: Using mortality, years of potential life lost (YPLLs), disability-adjusted life years (DALYs), hospital days, hospital discharges, and direct medical costs of conditions, 34 high-burden conditions addressed by CDC programs were identified, and information was collected about the funds spent on each by CDC during fiscal year (FY) 2003. The 34 conditions were grouped into 15 categorical areas, and the relationship between budget and burden was anahzed using correlation and regression methods for each of the categorical areas and for each measure of burden. Results: Of CDC's total FY 2003 budget of $6.9 billion, 62% ($4.3 billion) of funding was allocated to one of the 34 conditions studied. A positive relationship between budget and burden was identified for all measures of burden, although the correlations varied for the different conditions. Conclusions: Although examination of the relationship of CDC's budget to burden measures provides insight into the agency's portfolio of investments, this exercise also highlights a number of limitations with this approach and the currently available burden measures. Assessment of key public health functions such as emergency preparedness and the collection of vital statistics require development of metrics different from the burden measures used in this analysis. Investment in the development of such metrics warrants consideration.",
  "year": 2006,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e1a217a74b8cb0d92e1e8eaa65a3a702",
  "timestamp": "2025-05-15T01:23:27.265082"
}