{
  "id": 195,
  "title": "Text Mining of the Securities and Exchange Commission Financial Filings of Publicly Traded Construction Firms Using Deep Learning to Identify and Assess Risk",
  "abstract": "Risk factor identification is a critical topic in the construction industry. It is vital for the various construction firms and industry stakeholders to understand the different types of risks that affect their businesses and financial bottom lines. This research created a systematic methodology implementing a new set of text mining methods to identify and classify risk types affecting the publicly traded construction companies, by leveraging their 10-K reports filed with the Securities and Exchange Commission (SEC). A structured procedure was developed to apply advancements from text mining and natural language processing (NLP) to extract information from textual disclosures. A state-of-the-art deep learning algorithm named FastText was implemented to identify risk patterns and classify the text into appropriate risk types. Key findings showed that operational and financial risks associated with doing business most commonly are disclosed in the risk disclosures filed by the publicly traded construction firms. A steady monotonic increase was found in the average number of total risk disclosures from 2006 to 2018. Over the same period, growth occurred in the proportion of technology risks, reputation/intangible assets risks, financial markets risk, and third-party risks. The primary contributions of this research are (1) the development of a new methodology which serves as a risk thermometer for identification and quantification of risk at an individual company level, subindustry level, and the overall industry level; and (2) minimization of any existing information asymmetry in risk studies by utilization of a source of data that previously has not been used by construction researchers. It is anticipated that the developed methodology and its results can be used by (1) publicly traded construction companies to understand risks affecting themselves and their peers; and (2) surety bond companies and insurance providers to supplement their risk pricing models; and (3) equity investors and capital financial institutions to make more-informed risk-based decisions for their investments in the construction business. (C) 2020 American Society of Civil Engineers.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e1a385986758544f66c7e1f1f1305da0",
  "timestamp": "2025-05-15T01:35:04.466841"
}