{
  "id": 6407,
  "title": "Detecting changes in financial protection: creating evidence for policy in Estonia",
  "abstract": "Ninety-four per cent of the Estonian population is covered by public health insurance, but private expenditure has been increasing quickly both in real terms and as a percentage of total health expenditure. To date, little attention has been given to the impact this could have on the population's financial protection. Out-of-pocket payments, which account for the bulk of the private expenditure in many low- and middle-income countries, can push people into poverty and more generally represent too high a burden for some households. It is therefore very important that governments monitor the impact of out-of-pocket payments on health. Using an example from Estonia, this paper aims to illustrate that, if household budget survey data are available, monitoring a population's financial protection is not a complex undertaking. Further, by combining simple statistical analyses of these data with a good knowledge of a country's health system, it is possible to give a fairly detailed diagnostic of the nature of the population's coverage limitation. This allows for the presentation of easily interpretable results that can raise awareness among policy-makers and help to target adequate policy responses. Using Estonian household budget surveys from 1995, 2001 and 2002, we show that the proportion of households who spend more than 20% of their capacity to pay on health increased from 3.4% in 1995 to 7.4% in 2002 and that in 2002, 1.3% of the population fell into poverty because of health payments. Logistic regression helps in identifying the population most at risk: elderly patients who belong to poor households and spend high amounts on medicines. This study, which can be replicated, did raise awareness among policy-makers about the changes in financial protection over the years in Estonia.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e1cc06358ed711d5bf9ff7f3412b65d7",
  "timestamp": "2025-05-15T02:57:38.857558"
}