{
  "id": 4164,
  "title": "Government size and economic growth in African emerging economies: does the BARS curve exist?",
  "abstract": "Purpose This study is aimed at testing the validity of the BARS theory and determining the threshold level at which excessive government expenditure hampers growth. The data from 10 African emerging economies from 1988 to 2019 were used. Design/methodology/approach The methodology comprises several different stages. In the first stage, an Lagrange Multiplier (LM) type test was employed to find the appropriate transition variable among all the candidate variables to assess the linearity between government expenditure and economic growth and to find the sequence for selecting the order m of the transition function. The linearity test helped to identify the nature of the relationships between government expenditure and economic growth. In the second stage, the model evaluation was tested using the wild cluster bootstrap-Lagrange Multiplier (WCL-LM) test to assess appropriateness of the model. Thirdly, the Panel smooth transition regression (PSTR) model with one regime was estimated to test the validity of the BARS curve. Findings The results revealed evidence of nonlinear effects between government expenditure and economic growth, where the size of the government spending was found to be a 27.84% share of GDP, above which government expenditure caused growth to decline in African emerging economies. The findings combined into an inverted U-shape relationship, in line with the BARS theory. Originality/value This study proposes that policy-makers ought to formulate prudent fiscal policies that encourage expenditure, which would improve growth for selected countries as their current level of spending is below the threshold. This might be done through: (1) a suitable investment portfolio and (2) spending more on infrastructure.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e1e505f8704df265ddb9ffab0c618537",
  "timestamp": "2025-05-15T01:24:25.373415"
}