{
  "id": 589,
  "title": "Organizational Performance Management and the 'Sustainability' of the Performance Evaluation System: A View Guided by the Integrative Review Perspective",
  "abstract": "Objective: This paper aims to explore the scientific literature in order to show how the process of institutionalizing (incorporating) the 'sustainability' of the performance evaluation system (PES) contributes to organizational performance management (OPM). Methodology: An integrative review was carried out with the support of the ProKnow-C intervention instrument to select 39 articles that formed part of the bibliographic portfolio (BP). The PB analysis was conducted through the evolution of the performance evaluation (PE) area; the elaboration of the concept of OPM, which guided this research; and the development of a 'lens' using the concept of the 'sustainability' of the PES, from which it was possible to identify its essential aspects and use them as a basis for exploration. With this, it was feasible to demonstrate the relationship of the 'lens' with the guiding concept that allowed the elaboration of a taxonomy. Findings: In terms of the results, the evolution of a mature theme in the literature (PE) from a new perspective and with an emphasis on the integration of elements related to management is presented, allowing for the identification that the management elements are incipient and little developed in the literature. The elaboration of a taxonomy made it possible to verify that 'learning' is the aspect of sustainability that most contributes to OPM, that the 'holistic/integrated vision' element encompasses all aspects that determine the sustainability of the PES, and that the 'use of information' is the common component and link between the sustainability of PES and OPM in promoting organizational learning, supporting communication and providing it with a foundation for decision-making. Originality: Gaps were identified in the literature that led to the elaboration of a future research agenda for questions related to the importance of culture in encouraging the continuous process of performance management, the relationship of organizational learning with the context and strategic alignment, and the contribution of the human factor and culture to the continuous improvement of organizational performance. Thus, this research offers a new guiding perspective for OPM.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e1f215eb9148493893b69e078fa51c34",
  "timestamp": "2025-05-15T00:37:38.208070"
}