{
  "id": 4655,
  "title": "Evaluation and Classification of Mobile Financial Services Sustainability Using Structural Equation Modeling and Multiple Criteria Decision-Making Methods",
  "abstract": "Despite the fast emergent of smartphones in day-to-day activity, the sustainable development of mobile financial services (MFS) remains low partially due to online consumer's trust and perceived risk. This research broadens the trust and the perceived risk at the multi-dimensional for understanding and prioritizing alternatives of MFS decision. Acombined methodology; structural equation modeling (SEM) with two multiple criteria decision-making (MCDM) methods such as a technique for order of preference by similarity to ideal solution (TOPSIS) and analytic hierarchy process (AHP) were applied for data analysis. The two steps SEM-TOPSIS techniques were adopted through a two-types survey on datasets consisting of 538 MFS users, and 74 both experienced MFS users and experts in Togo. The SEM is used for causal relationships and assigning weights for the TOPSIS input. TOPSIS was applied for providing MFS alternative classification, in which the results were compared with prior research using the SEM-AHP technique on the given population. The results via SEM revealed particularly strong support for the dispositional trust and perceived privacy risk. Trust has a negative relationship with perceived risk. Except for perceived time risk, all the antecedents of perceived risk and trust validated the proposed relationship. The findings of TOPSIS uncovered that mobile money transfer (MMT) remains the core application used, followed by mobile payment (MP) and mobile banking (MB) and, therefore, consistent with AHP. However, the TOPSIS technique is better suited to the problem of MFS selection for this study field. This research offers a novel and practical modeling and classification concept for researchers, companies' managers, and experts in the areas of information technology. The implications, limitations, and future research are provided.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e205913a632fca4fb168eed598f06721",
  "timestamp": "2025-05-15T02:39:27.035953"
}