{
  "id": 3664,
  "title": "Predicting Insolvency of the Construction Companies in the Creditworthiness Assessment Process-Empirical Evidence from Poland",
  "abstract": "Prediction insolvency is one of the most important issues during creditworthiness assessment, especially in the turmoil environment. That is why the problem of insolvency and bankruptcy prediction has been the subject of numerous studies focused on its causes, consequences, and prediction. The main goal of the study was to develop a prediction model that can be effectively used in practice to analyze and signal the risk of insolvency and bankruptcy of a construction firms. Also, the research must identify the key factors that would allow for early identification of the symptoms of the upcoming financial failure of companies from a construction sector. To reach the goal of the study discriminant analysis, logistic regression and classification trees were used. The final estimated models included nine variables related to the profitability; revenues; liquidity; asset's structure; and dynamics of own and foreign capitals, some of which referred to the industry and market situation in a construct sector, which is a novelty compared to previous research. What is more, results show that the method chosen to estimate the insolvency prediction model could have an impact on both partial and general effectiveness in the process of creditworthiness assessment.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e206c1a37f605899054bec247ecfcc51",
  "timestamp": "2025-05-15T02:29:00.008737"
}