{
  "id": 7521,
  "title": "Correlates of Elevated C-Reactive Protein Among Black Older Adults: Evidence From the Health and Retirement Study",
  "abstract": "Objectives Substantial evidence documents gender and racial disparities in C-reactive protein (CRP), a measure of systemic inflammation, among older adults. Yet, the comparative approaches of these studies may obscure distinct risk and protective factors associated with elevated CRP among older Black Americans. To pinpoint opportunities for intervention, this study utilizes a within-group approach to identify the sociodemographic, psychosocial, behavioral, and health-related correlates of elevated CRP among older Black women and men. Method The sample consisted of 2,420 Black respondents aged 51 and older in the Health and Retirement Study (2006-2016). Gender-stratified, random effects logistic regression models were used to examine correlates of elevated CRP (>3.0 mg/L). Results More than 50% of Black women had elevated CRP, and younger age, Medicaid, lower mastery, religiosity, overweight/obesity, physical inactivity, and activities of daily living (ADLs) contributed to elevated CRP among this group. In contrast, elevated CRP was reported among only 37.25% of Black men, for whom financial distress was associated with lower odds of elevated CRP; religiosity, less neighborhood cohesion, current smoking, overweight/obesity, ADLs, and more chronic conditions were associated with greater odds of elevated CRP among this group. Discussion Sociodemographic factors had a limited association with elevated CRP among older Black Americans. Rather, a range of psychosocial, behavioral, and health-related factors were more influential determinants of elevated CRP among older Black Americans. Most notably, findings demonstrate distinct correlates of CRP among Black women and men, underscoring the critical need to further evaluate the risk and protective mechanisms undergirding disparities among this aging population.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e21bdb3e8687e8798a9956a0d4c4d0ea",
  "timestamp": "2025-05-15T03:09:36.841476"
}