{
  "id": 782,
  "title": "Optimization algorithms and investment portfolio analytics with machine learning techniques under time-varying liquidity constraints",
  "abstract": "Purpose This paper aims to examine from commodity portfolio managers' perspective the performance of liquidity adjusted risk modeling in assessing the market risk parameters of a large commodity portfolio and in obtaining efficient and coherent portfolios under different market circumstances. Design/methodology/approach The implemented market risk modeling algorithm and investment portfolio analytics using reinforcement machine learning techniques can simultaneously handle risk-return characteristics of commodity investments under regular and crisis market settings besides considering the particular effects of the time-varying liquidity constraints of the multiple-asset commodity portfolios. Findings In particular, the paper implements a robust machine learning method to commodity optimal portfolio selection and within a liquidity-adjusted value-at-risk (LVaR) framework. In addition, the paper explains how the adapted LVaR modeling algorithms can be used by a commodity trading unit in a dynamic asset allocation framework for estimating risk exposure, assessing risk reduction alternates and creating efficient and coherent market portfolios. Originality/value The optimization parameters subject to meaningful operational and financial constraints, investment portfolio analytics and empirical results can have important practical uses and applications for commodity portfolio managers particularly in the wake of the 2007-2009 global financial crisis. In addition, the recommended reinforcement machine learning optimization algorithms can aid in solving some real-world dilemmas under stressed and adverse market conditions (e.g. illiquidity, switching in correlations factors signs, nonlinear and non-normal distribution of assets' returns) and can have key applications in machine learning, expert systems, smart financial functions, internet of things (IoT) and financial technology (FinTech) in big data ecosystems.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2272e95cdb034e423154512b07badeb",
  "timestamp": "2025-05-15T01:55:08.011321"
}