{
  "id": 362,
  "title": "Deep reinforcement learning imbalanced credit risk of SMEs in supply chain finance",
  "abstract": "It is crucial to predict the credit risk of small and medium-sized enterprises (SMEs) accurately for the success of supply chain finance (SCF). However, most of the existing research ignore the fact that the data distribution is usually imbalanced, that is, the proportion of default SMEs is much smaller than that of non-default SMEs. To fill this research gap, we propose a novel approach called DRL-Risk to deal with the imbalanced credit risk prediction (ICRP) of SMEs in SCF with deep reinforcement learning (DRL). Specifically, we formulate the ICRP problem as a Markov decision process and suggest an instance-based reward function to incorporate financial loss into the reward function with consideration of the actual loss caused by misclassification in the ICRP of SMEs. Then, we recommend a deep dueling neural network for decision policy to predict the credit risk of SMEs. With deep reinforcement learning, the DRL-Risk approach can prioritize the learning on the SMEs that would lead to great financial losses. Experimental results demonstrate that the DRL-Risk approach can significantly improve the performance of credit risk prediction of SMEs in SCF compared with the baseline methods in recall, G-mean, and financial loss. We have also identified management implications for the decision-makers participating in SCF.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e24148d5241cf79f2c302fd044bf3afb",
  "timestamp": "2025-05-15T01:49:41.120573"
}