{
  "id": 7462,
  "title": "Suicidal ideation and behaviour in the aftermath of marital separation: Gender differences",
  "abstract": "Background: The limited studies on the consequences of the separation process on suicidal behaviour seem to indicate that separated people are at increased risk of suicide. Aims: The current study aims to compare suicidality immediately after the separation among males and females, and to analyse possible differences in predictors of serious suicidal ideation. Method: Separated males and females who had contacted relationship counselling services, help-line services, and a variety of support and self-help groups were asked to participate in the study. Participants were required to be 18 years old or older, and have separated from their married/de facto partner within the previous 18 months but not yet divorced. For categorial variables odds ratios with 95% Cl and for continuing variables t-tests were calculated. Multinomial logistic regression was applied to estimate the independent contribution of significant predictors. Results: Separated males (n = 228) were at an increased risk of developing suicidality during the separation process compared to separated females (n = 142), even after adjusting for age, education, employment and children with the separated partner. The psycho-social risk factors identified in the development of serious suicidal ideation were mental health problems (during the previous year), history of suicide attempts and internalised shame. For separated males, significant predictors also included lower education, separation-related shame and stress from legal negotiations, especially about property/financial issues. Conclusions: The findings provide a better understanding of suicidal behaviours in the aftermath of marital or de facto separation. This knowledge could be used in the implementation of future suicide prevention strategies in people who are going through the process of a marital/de facto separation. (C) 2009 Elsevier B.V. All rights reserved.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e258f78ad049d095928a2e73b441286a",
  "timestamp": "2025-05-15T03:08:38.000028"
}