{
  "id": 9154,
  "title": "Psychosocial distress and stressful life antecedents associated with smoking -: A survey of subjects consulting a preventive health center",
  "abstract": "Background The relationship between smoking and various sociodemographic or socio-economic factors, as well as the interactions between depressive mood and smoking are already known. However, the respective contribution of psychological factors and stressful life antecedents during childhood and adolescence warrants further specification. Methods 2315 consecutive subjects, aged 16 to 59, consulting for a free work-up in a preventive health Centre, supported by the National French Health insurance system, were invited to fill out a series of questionnaires: the GHQ-28 and the LOT, respectively measuring psychosocial distress and dispositional optimism, as well as a questionnaire on socio-demographic, socio-economic and biographical data. Results 78.1% complete records could be analysed: the smokers group (n = 870, 48.1%) declared a current tobacco consumption of at least one cigarette/day. This group was characterized by a predominance of male subjects, older age, modest educational level, low income level and responded to socio-economic criteria of precariousness more frequently (p < 0.001, except for age: p = 0.006). Smoking was also associated with higher levels of psychosocial distress, as assessed by GHQ-28, especially for the depressive mood and anxiety items of the questionnaire (p < 0.001), and with lower levels of dispositional optimism (p < 0.01). As regards biographical data, smokers were characterized by a way of life marked by financial problems, reduced social contacts, and a higher frequency, before the age of 18, of divorce or separation of the parents (p = 0.002), frequent parental quarrels (p < 0.001) or separation from the parents (p < 0.001). The presence of a depressive mood at GHQ-28 as well as frequent parental quarrels remained independent risk factors for smoking in multiple logistic regression (odds ratio respectively equal to 1.61 and 1.34), after adjustment on gender, educational level and the notion of socioeconomic precariousness. Conclusion These results highlight the complementary role of socio-economic, psychological factors and certain stressful life antecedents among the determinants of smoking and should be taken into account for tailoring smoking cessation programs.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e25aeccb04b2026f20c57c7c415af03a",
  "timestamp": "2025-05-15T03:25:54.675455"
}