{
  "id": 8734,
  "title": "Community-Based Health Insurance Increased Health Care Utilization and Reduced Mortality in Children Under-5, Around Bwindi Community Hospital, Uganda Between 2015 and 2017",
  "abstract": "Introduction: Out-of-pocket fees to pay for health care prevent poor people from accessing health care and drives millions into poverty every year. This obstructs progress toward the World Health Organization goal of universal health care. Community-based health insurance (CBHI) improves access to health care primarily by reducing the financial risk. The association of CBHI with reduced under-5 mortality was apparent in some voluntary schemes. This study evaluated the impact of eQuality Health Bwindi CBHI scheme on health care utilization and under-5 mortality in rural south-western Uganda. Methods: This was a retrospective cross-sectional study using routine electronic data on health insurance status, health care utilization, place of birth, and deaths for children aged under-5 in the catchment area of Bwindi Community Hospital, Uganda between January 2015 and June 2017. Data was extracted from four electronic databases and cross matched. To assess the association with health insurance, we measured the difference between those with and without insurance; in terms of being born in a health facility, outpatient attendance, inpatient admissions, length of stay and mortality. Associations were assessed by Chi-Square tests with p-values < 0.05 and 95% confidence intervals. For variables found to be significant at this level, multivariable logistic regression was done to control for possible confounders. Results: Of the 16,464 children aged under-5 evaluated between January 2015 and June 2017, 10% were insured all of the time 19% were insured for part of the period, and 71% were never insured. Ever having had health insurance reduced the risk of death by 36% [aOR; 0.64, p = 0.009]. While children were insured, they visited outpatients ten times more, and were four times more likely to be admitted. If admitted, they had a significantly shorter length of stay. If mother was uninsured, children were less likely to be born in a health facility [adjusted odds ratio (aOR) 2.82, p < 0.001]. Conclusion: This study demonstrated that voluntary CBHI increased health care utilization and reduced mortality for children under-5. But the scheme required appreciable outside subsidy, which limits its wider application and replicability. While CBHIs can contribute to progress toward Universal Health Care they cannot always be afforded.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e265842f1fc6e73fd0b73281b851d7f9",
  "timestamp": "2025-05-15T03:21:56.616017"
}