{
  "id": 3454,
  "title": "Nexus among disclosure quality, discretionary accruals and real earnings management practices: An empirical analysis of Malaysian public firms",
  "abstract": "Following the financial crisis, business practice and regulatory have become much more interested in corporate disclosure on risk and risk management. The crises necessitate enhancing corporate governance (CG) processes, risk disclosure, reporting, and accounting. This paper aims to empirically analyze specific components of disclosure quality that could be associated with the likelihood of mitigating earnings management (EM) practices. The Bursa Malaysia website, Bloomberg, and the annual reports of the listed firms were utilized as the sources for the data. Descriptive statistics and GLS methods of panel regression were the analytical techniques used in the current investigation. Corporate data of the listed firms on Bursa Malaysia covering financial periods of 2011-2022 were used to examine the research hypotheses. The findings from the panel regression suggested that internal control system disclosure (ICSD) and intellectual capital disclosure (ICD) both have negative and significant associations to the likelihood of EM practices. However, the findings also established negative but insignificant relationships between corporate risk disclosure (CRD), corporate voluntary disclosure (CVD), and the likelihood of EM practices across the sample. This study has implications to companies striving to satisfy shareholders and attract potential investors. The authors add to the growing body of literature on quality disclosure to the larger body of CG literature. Additionally, the study is original as it is the first to consider four qualities (internal control system disclosure, corporate risk disclosure and corporate voluntary disclosure, and voluntary ICD in the Malaysian context of EM practices.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e269453f849eeeb79e0d73a85fbd3183",
  "timestamp": "2025-05-15T02:26:09.242554"
}