{
  "id": 3000,
  "title": "Conceptual and Empirical Approaches to Financial Decision-making by Older Adults: Results from a Financial Decision-making Rating Scale",
  "abstract": "Objectives: The objectives of this study were threefold: (1) to empirically test the conceptual model proposed by the Lichtenberg Financial Decision-making Rating Scale (LFDRS); (2) to examine the psychometric properties of the LFDRS contextual factors in financial decision-making by investigating both the reliability and convergent validity of the subscales and total scale, and (3) extending previous work on the scale through the collection of normative data on financial decision-making.Methods: A convenience sample of 200 independent function and community dwelling older adults underwent cognitive and financial management testing and were interviewed using the LFDRS. Confirmatory factor analysis, internal consistency measures, and hierarchical regression were used in a sample of 200 community-dwelling older adults, all of whom were making or had recently made a significant financial decision.Results: Results confirmed the scale's reliability and supported the conceptual model. Convergent validity analyses indicate that as hypothesized, cognition is a significant predictor of risk scores. Financial management scores, however, were not predictive of decision-making risk scores.Conclusions: The psychometric properties of the LFDRS support the scale's use as it was proposed.Clinical Implications: The LFDRS instructions and scale are provided for clinicians to use in financial capacity assessments.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e26caf91cf899c57d1538c385d3d9d8c",
  "timestamp": "2025-05-15T02:21:19.288762"
}