{
  "id": 7455,
  "title": "Examining the Relationship Between Consumption of a Protein-Based Diet and Hypertension Among Urban Households: A Cross-Sectional Study",
  "abstract": "Background and Aims Hypertension continues to be a significant health challenge, contributing to numerous deaths. Dietary factors are key risk factors for hypertension. Evidence indicates that consuming at least four different types of protein each week may help reduce the risk of developing high blood pressure. This study aims to analyze the impact of protein intake on the health status of household members living with hypertension in Gauteng province, South Africa. Methods This study applied a cross-section design and stepwise binary logit regression to analyze the protein diet intake of 3278 households with members experiencing hypertension in eight Gauteng municipalities in South Africa. The study utilized nonmedical secondary data from the Gauteng City-Region Observatory Quality of Life survey for 2021/2022, which included 13,168 randomly sampled households. Results The findings showed that consuming beans (B = 0.120; p = 0.066), chicken (B = 0.349; p < 0.001), tin fish (B = 0.244; p < 0.001), meat (B = 0.235; p < 0.001), offal (B = 0.128; p = 0.050), and dairy (B = 0.294; p < 0.001) was positively associated with a reduced risk of hypertension. Animal protein was preferred over plant protein. Hypertension was more common in low-income households. Households with food expenditures of R0-R500, R501-R1000, and R1001-R2000 had probabilities of not suffering from hypertension that increased by at least 0.643, 0.799, and 0.826, respectively. Conclusions The study showed that consuming various proteins, particularly from beans, chicken, tin fish, meat, offal, and dairy, reduces hypertension health risks. It also shows that households with higher food expenditures experience lower hypertension prevalence, emphasizing the importance of dietary variety and financial resources in maintaining a healthy diet and reducing hypertension.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2756ccd1d5e25b3cd9cac1a6729ddd7",
  "timestamp": "2025-05-15T03:08:37.977470"
}