{
  "id": 5609,
  "title": "Financial reporting for employee stock options: liabilities or equity?",
  "abstract": "This study seeks to determine whether employee stock options share key characteristics of liabilities or equity. Consistent with warrant pricing theory, we find that common equity risk and expected return are negatively associated with the extent to which a firm has outstanding employee stock options, which is opposite to the association for liabilities. We also find the following. (1) The association is positive for firms that reprice options and less negative for firms that have options with longer remaining terms to maturity, which indicates that some employee stock options have characteristics that make them more similar to liabilities. (2) Leverage measured based on treating options as equity has a stronger positive relation with common equity risk than leverage measured based on treating options as liabilities. (3) The sensitivity of employee stock option value to changes in asset value mirrors that of common equity value and is opposite to that of liability value. Also, we find that, unlike liabilities, employee stock options have substantially higher risk and expected return than common equity. Our findings are not consistent with classifying employee stock options as liabilities for financial reporting if classification were based on the directional association of a claim with common equity risk and expected return. Rather, our findings suggest the options act more like another type of equity.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e27c8eac0995849e2d455c8f1ed7d1c9",
  "timestamp": "2025-05-15T02:49:21.778112"
}