{
  "id": 3676,
  "title": "Behavioral biases and the rational decision-making process of financial professionals: significant factors that determine the future of the financial market",
  "abstract": "Purpose - This paper describes how financial professionals' behavioral biases influence their financial forecast and decision-making process. Most of the earlier studies are focused on well-developed financial markets, and little is researched about financial professionals, such as institutional investors, portfolio managers, investment advisors, financial analysts, etc., in emerging markets. Design/methodology/approach - An expert-validated questionnaire measure four prominent behavioral biases and Indian financial professionals' rational decision-making process. The final sample consists of 274 valid responses using the purposive sampling technique. IBM SPSS and AMOS structural equation modeling (SEM) software are used to build measurement and structural models, multivariate analysis including regression, factor analysis, etc. Findings - The results provide empirical insights into the relationship between behavioral biases and the decision-making process. The results suggest that the structural path model closely fits the sample data. The presence of behavioral biases indicates that financial professionals' forecasting and decision-making is not always rational but bounded rational or irrational due to these factors. Furthermore, these biases (except overconfidence bias) have a markedly significant and positive relationship with irrational decision-making. Research limitations/implications - It is critical to eradicate these psychological errors, but awareness and attentiveness toward behavioral biases may help financial professionals to make informed decisions. Investors can improve their portfolio decisions and investments by recognizing their judgment errors and focusing on specific investment strategies to mitigate the impact of these biases. It is necessary to incorporate behavioral insights while developing training techniques for financial professionals. Rules of thumb, visual tools, financial coaching and implementing social-cultural elements in training programs enable financial professionals to develop simple, engaging, appealing and customized approaches for their clients. Originality/value - This novel study is the first of this kind of research that examines the relationship between financial professionals' behavioral biases and rational decision-making process. This study significantly and remarkably provides insights into irrationality in financial professionals' decision-making.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e29fd40063538409ef3e840f5b53e26e",
  "timestamp": "2025-05-15T01:19:26.253010"
}