{
  "id": 2468,
  "title": "Generalized Exponentiated Gradient Algorithms and Their Application to On-Line Portfolio Selection",
  "abstract": "Stochastic gradient descent (SGD) and exponentiated gradient (EG) update methods are widely used in signal processing and machine learning. This study introduces a novel family of generalized Exponentiated Gradient updates (EGAB) derived from the alpha-beta (AB) divergence regularization. The EGAB framework provides enhanced flexibility for processing data with varying distributions, thanks to the tunable hyperparameters of the AB divergence. We explore the applicability of these updates in online portfolio selection (OLPS) for financial markets with the goal of developing algorithms that achieve high risk-adjusted returns, even under relatively high transaction costs. The proposed EGAB algorithms are developed using constrained gradient optimization with regularization terms, demonstrating their versatility in OLPS by unifying the directional search of various algorithms and enabling interpolation between them. Our analysis and extensive computer simulations reveal that EGAB updates outperform existing OLPS algorithms, delivering good results on several performance metrics, such as cumulative return, average excess return, Sharpe ratio, and Calmar ratio, especially when transaction costs are significant. In conclusion, this study introduces a new family of exponentiated gradient updates and demonstrates their flexibility and effectiveness through extensive simulations across a wide range of real-world financial datasets.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2afa55809eb6fa3ab5d82c4485c7829",
  "timestamp": "2025-05-15T02:15:59.762835"
}