{
  "id": 4250,
  "title": "Are financially illiterate individuals all the same? A study on incorrect and do not know answers to financial knowledge questions",
  "abstract": "PurposeAre financially illiterate individuals all the same? This study aims to answer this question. Specifically, the authors investigate whether people answering incorrectly and do not know to the big five questions about financial knowledge (FK), all identified by previous literature as financially illiterate, are two sides of the same coin, or rather individuals with different socio-economic and demographic characteristics, and whether this leads to different levels of risk of falling victim to financial fraud.Design/methodology/approachUsing a large and representative sample of Italian adults, the authors run both ordered probit and probit regressions to test the determinants of financially illiterate individuals, distinguishing between those answering FK questions incorrectly and those answering do not know. The authors also measure the probability of falling victim to financial fraud for the two groups. To check the robustness of our results, the authors run a multinomial regression, a structural equation model and an instrumental variable regression model.FindingsThe authors demonstrate that the socio-demographic and socio-economic characteristics of individuals selecting incorrect responses to FK questions are different from those of individuals selecting the do not know option. Moreover, the results show that the former are more likely to be victims of financial frauds.Practical implicationsThe one-size-fits-all approach is not suitable for financial education. It is important to consider socio-demographic and socio-economic characteristics of individuals in order to identify specific targets of education programmes aiming to reduce insecurity and excessive self-confidence as well as to increase objective FK. The study's findings also identify vulnerable groups to which financial fraud prevention schemes should be targeted.Originality/valueTo date, financial illiteracy has been measured as the sum of incorrect and do not know responses given to FK questions. This approach does not allow to observe the socio-demographic and socio-economic differences between people choosing the do not know option and those answering incorrectly. The paper aims to overcome this limit by investigating the socio-demographic and socio-economic characteristics of individuals selecting do not know and incorrect responses, respectively. The authors also investigate whether the two groups have different probabilities of being victims of financial fraud.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2b76a773eae6d5638ef1d9f5a380f0f",
  "timestamp": "2025-05-15T02:34:48.942756"
}