{
  "id": 6728,
  "title": "A Review on Decentralized Finance Ecosystems",
  "abstract": "The future of the internet is moving toward decentralization, with decentralized networks and blockchain technology playing essential roles in different sectors. Decentralized networks offer equality, accessibility, and security at a societal level, while blockchain technology guarantees security, authentication, and openness. Integrating blockchain technology with decentralized characteristics has become increasingly significant in finance; we call this decentralized finance (DeFi). As of January 2023, the DeFi crypto market capitalized USD 46.21 billion and served over 6.6 million users. As DeFi continues to outperform traditional finance (TradFi), it provides reduced fees, increased inclusivity, faster transactions, enhanced security, and improved accessibility, transparency, and programmability; it also eliminates intermediaries. For end users, DeFi presents asset custody options, peer-to-peer transactions, programmable control features, and innovative financial solutions. Despite its rapid growth in recent years, there is limited comprehensive research on mapping DeFi's benefits and risks alongside its role as an enabling technology within the financial services sector. This research addresses these gaps by developing a DeFi classification system, organizing information, and clarifying connections among its various aspects. The research goal is to improve the understanding of DeFi in both academic and industrial circles to promote comprehension of DeFi taxonomy. This well-organized DeFi taxonomy aids experts, regulators, and decision-makers in making informed and strategic decisions, thereby fostering responsible integration into TradFi for effective risk management. This study enhances DeFi security by providing users with clear guidance on existing mechanisms and risks in DeFi, reducing susceptibility to misinformation, and promoting secure participation. Additionally, it offers an overview of DeFi's role in shaping the future of the internet.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2bb820128926f50460c116daeb68ecf",
  "timestamp": "2025-05-15T03:01:03.549785"
}