{
  "id": 5556,
  "title": "What Dimensions of Risk Perception are Associated with Avoidance of Buying Processed Foods with Warning Labels?",
  "abstract": "Nutritional Warning Labels (NWLs) inform consumers about processed foods that exceed critical nutrient levels activating the risk perception in consumers. However, this information is limited. The objective was to identify the dimensions of risk perception and to study their associations with avoidance of buying processed foods with warning labels. A survey was applied to 807 decision-makers who choose what to eat at home. The four dimensions of risk perception (performance, financial, physical, and psychological) were identified through exploratory factor analysis. Through a multiple regression model, we determined the dimensions of risk perception and sociodemographic variables that affect the intention to avoid buying processed foods with NWLs. The results show that the performance risk, physical risk, and psychological risk positively affect the intention of avoiding processed foods with NWLs. In addition, the female gender considers NWLs to purchase foods. Nevertheless, the high frequency of consumption and belonging to a lower-income socioeconomic group are barriers to the use of NWLs. In conclusion, NWLs help people to choose processed food that does not impact negatively their food expectations, as well as their mental and physical health. However, health authorities must invest in nutrition education. Specifically, in groups who pay less attention to NWLs. Such groups include people with high daily consumption of processed foods, males, and low-income socioeconomic groups.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2cf3fd2c482ca5bc64fece297693194",
  "timestamp": "2025-05-15T02:48:51.389610"
}