{
  "id": 4052,
  "title": "SEC reviews and earnings quality at IPO",
  "abstract": "PurposeWe aim to examine the sensitivity of Securities and Exchange Commission (SEC) reviews to financial reporting quality in S-1 registration filings of firms conducting Initial Public Offerings (IPOs) in the USA. The investigation is important as market participants rely on this information to make formative investment decisions, while there are well-known incentives for IPO firms to disclose earnings opportunistically.Design/methodology/approachUsing a sample of US IPO filings on NYSE, NASDAQ and AMEX, we initially conduct a manual content analysis of themes covered in a training sample of comments from initial comment letters; then a Na & iuml;ve Bayes machine learning algorithm is employed to expand the coding to the full sample. In testing the hypotheses, a series of negative binomial regression models are developed to examine the relationship between SEC S-1 reviews and earnings management.FindingsWe show that IPO firms with greater accruals-based earnings management tend to experience more extensive SEC reviews, suggesting they are effective in addressing poor accrual quality. Weak evidence on the effectiveness of the SEC review in addressing discretionary-expense-based real earnings management (REM) is identified. These associations have strengthened under the Jumpstart Our Business Startups (JOBS) Act. On the contrary, SEC reviews are insensitive to sales-based REM, particularly under the JOBS Act. Overall, our study sheds new light on the sensitivity of SEC reviews to earnings management, identifying some areas for further scrutiny.Originality/valueWe incrementally add to the literature by demonstrating the SEC are effective in detecting income-increasing earnings management through accruals-based and, to some extent, discretionary-expenses-based manipulations by IPO firms when preparing their registration statements. Further, to the best of the authors' knowledge, this study is the first to identify that SEC reviews appear not to effectively target real earnings management via sales manipulation by IPO firms. We also document an increased risk of earnings management following JOBS, a finding that should be of interest to investors and policymakers, as it implies that the quality of earnings information has deteriorated under the JOBS Act.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2d1010be09d486f190e94d03cb5e5d2",
  "timestamp": "2025-05-15T02:32:27.626115"
}