{
  "id": 6347,
  "title": "Is vulnerability associated with substance use? A study among youth in Switzerland",
  "abstract": "Adolescence is a period of exploration and experimentation that includes risk behaviors such as substance use. Adolescents living in a situation of vulnerability could be more prone to using substances. In this cross-sectional study, we aimed to evaluate the association between the level of vulnerability and substance use considering explanatory factors. Data were obtained from the first wave of the GenerationFRee project (http://www.generationfree.ch), a longitudinal study based on data collected yearly between 2014 and 2019 on youth aged 15-24 years in high schools and professional schools. The sample included 5179 participants. We designated four risk behaviors: current tobacco smoking, alcohol misuse, cannabis use, and other illegal drug use. We defined vulnerability based on three criteria: the relationship with parents, school performance, and the family socioeconomic status (SES). According to this definition, participants were divided into three groups: no vulnerability, moderate vulnerability, and high vulnerability. Each substance was compared by vulnerability level and controlled with explanatory factors such as age, gender, perceived health, emotional well-being, academic track, nationality, living with parents, residence, family structure, money earned, and perceived personal financial situation. The results show that all substances except alcohol misuse are associated with vulnerability at the bivariate level. All the explanatory factors were also significant with the exception of academic track and amount of money earned per month. In the multinomial regression, for the moderate- and high-vulnerability groups, cannabis use was the only behavior that remained significant. In conclusion, this study shows the association between level of vulnerability and substance use, especially cannabis use. The results also demonstrate the complexity around vulnerability and how the interaction with social aspects influences vulnerability. Youths presenting familial, educational, or financial problems need to be especially screened for substance use by healthcare providers. (C) 2020 French Society of Pediatrics. Published by Elsevier Masson SAS. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2ed91ae39a5f1dbe7f003a334accf6d",
  "timestamp": "2025-05-15T02:57:07.746499"
}