{
  "id": 5481,
  "title": "The Relationship Between Volatility and Sovereign Credit Risk in the Emerging Markets: A Nonlinear ARDL Approach",
  "abstract": "This study investigates the short- and long-run nexus between the volatility index of VIX and sovereign credit risk represented by CDS spread in emerging markets, namely Turkey, China, Russia, Brazil, and Mexico. The emerging markets are at the center of investors' interest due to high return opportunities. The relationship between volatility and sovereign credit risk has been studied many times via linear models. However, financial series exhibit asymmetric dynamics, as volatility clustering, excess kurtosis, and others. Thus, we use nonlinear autoregressive distributed lags (NARDL) analysis to capture nonlinear relations between the volatility and the sovereign credit risks of these countries by using daily data from 04.01.2010 to 29.11.2019. The bounds test of the NARDL model confirms the cointegration between VIX and CDS spreads of the countries under study. The analysis of estimated NARDL parameters shows that negative shocks of the volatility index have a long-lasting impact on CDS spreads. Chinese CDS spread are more sensitive to VIX index changes in the short run. The effect of a decrease in volatility on Russian CDS spread is higher than the effect of an increase. Turkish and Brazilian CDS spreads are more reactive to increase in the VIX, whereas Mexican CDS is less sensitive. These findings show that investors, arbitrageurs and speculators should consider global indicators when taking a position on sovereign bonds of emerging markets.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2f51bae9b2962f28aadeb6cec4a13ee",
  "timestamp": "2025-05-15T02:48:23.659889"
}