{
  "id": 9056,
  "title": "Alcohol use and HIV suppression after completion of financial incentives for alcohol abstinence and isoniazid adherence: a randomized controlled trial",
  "abstract": "Background In a recent randomized trial, six months of financial incentives contingent for recent alcohol abstinence led to lower levels of hazardous drinking, while incentives for recent isoniazid (INH) ingestion had no impact on INH adherence, during TB preventive therapy among persons with HIV (PWH). Whether the short-term incentives influence long-term alcohol use and HIV viral suppression post-intervention is unknown. Methods We analyzed twelve-month HIV viral suppression and alcohol use in the Drinkers' Intervention to Prevent Tuberculosis study, a randomized controlled trial among PWH with latent TB and unhealthy alcohol use in southwestern Uganda. We randomly assigned 680 participants (1:1:1:1) initiating six months of INH to: Arm 1, no incentives (control); Arm 2, financial incentives contingent on recent alcohol abstinence; Arm 3, incentives contingent on recent INH use; and Arm 4, incentives for recent alcohol abstinence and INH use, rewarded separately. The 6 months post-intervention outcomes evaluated were pre-specified and included: HIV viral suppression (<200 copies/mL) and no/low alcohol use, defined as Alcohol Use Disorders Identification Test- Consumption negative (<3: women, <4: men) and phosphatidylethanol, an alcohol biomarker, <35 ng/mL. We estimated adjusted risk differences (aRD) for alcohol reduction and INH adherence interventions using multivariable logistic regression adjusting for randomization stratification factors (sex and study site), and baseline alcohol use (alcohol intervention model only). Clinicaltrials.gov registration: NCT03492216, Registered 04/10/2018. Findings Of 600 participants with 12-month viral load results, 556/585 (95%) with baseline results were virally suppressed, and 583/600 (97%) were virally suppressed at 12-months. Twelve-month viral suppression did not differ significantly between either intervention group versus control (alcohol reduction incentives versus control aRD = -0.9% (95% CI: -3.6 to 1.7); INH adherence incentives versus control aRD = 2.2% (95% CI: -0.4 to 4.9)). Of the 617 participants with 12-month alcohol use measures, alcohol reduction incentives led to a significantly greater proportion with no/low alcohol use at 12-months (20.2% [64/317]) versus no alcohol reduction incentives (11.0% [33/300]); aRD = 8.4%, (95% CI: 3.3-13.4), p = 0.001. Interpretation Viral suppression was high (>95%) at baseline and at 12 months: we found no effect of either 6-month alcohol reduction or INH adherence incentives on long-term viral suppression. Six months of alcohol reduction incentives were effective at promoting no/low alcohol use at 12 months, demonstrating persistent effects post- intervention. Copyright (c) 2024 The Author(s). Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2f6b06f3f0459d326767067b0021f45",
  "timestamp": "2025-05-15T03:24:55.015398"
}