{
  "id": 2810,
  "title": "Economic policy uncertainty and capital flows' tail risk in China",
  "abstract": "Since the financial crisis, uncertainty has been a focus of attention in the financial sector. As the two-way opening-up of China's financial market continues to accelerate, special attention must be paid to the risks and challenges arising from cross-border capital flows to maintain financial market stability in China. This study uses predictive quantile regression and skewed t-distribution fitting method to examine the impact of Economic Policy Uncertainty (EPU) on the full probability distribution and tail risks of capital flows. Additionally, we apply the Capital Flows at Risk (CFaR) analysis framework from the new paradigm of macroeconomic research to the situation in China, to study the impact of EPU on CFaR. We find that EPU significantly affects the predictive distribution of capital flows. When EPU is rising, the downside risk of capital flows, that is, the left-tail risk of capital flows, will increase; however, when EPU is declining, the upside risk of capital flows, that is, the right-tail risk of capital flows, will increase. In recent years, the scale of China's CFaR has shown a fluctuating upward trend, and EPU has increased the scale of CFaR in the country. This study is significant for stabilizing international capital flows and preventing and defusing the external financial shocks of cross-border capital inflows and outflows.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2fe9bf240885cbb8909d3ba94399e28",
  "timestamp": "2025-05-15T02:19:08.518295"
}