{
  "id": 4327,
  "title": "Kinetic Oscillation Stimulation for the Preventive Treatment of Chronic Migraine",
  "abstract": "Background and ObjectivesThe Chordate System administers kinetic oscillation stimulation (K.O.S) into the nasal cavity thereby potentially modulating the activity of trigemino-autonomic reflex. Modulation of this reflex has been proposed as a potential therapeutic target in migraine. The aim of this clinical trial was to evaluate the efficacy of K.O.S for the preventive treatment of chronic migraine (CM).MethodsIn this randomized, double-blind, sham-controlled, multicenter clinical trial, patients with CM were treated with K.O.S once per week over a period of 6 weeks. The primary performance endpoint was the mean change in monthly headache days with moderate to severe intensity (MHDs) from the 28-day pretreatment baseline period to the performance assessment period (days 14-42 of treatment). Mean change from baseline in monthly migraine days (MMDs), proportion of participants with 30% and 50% or greater reduction in moderate to severe headache days compared with baseline, and change in the use of abortive medications from baseline were also assessed during the performance assessment period. Headache-related disability and quality-of-life measures were evaluated up to 70-day posttreatment.ResultsThe primary endpoint showed a significantly larger reduction of MHD across the performance assessment period with active treatment (-3.5 days, n = 67) compared with sham (-1.2 days, n = 65) (p = 0.0132). Compared with sham, active treatment consistently also led to significant reduction of MHD during the follow-up period (-2.7 [-4.3; -1.0, p = 0.0014]) as well as of mean MMDs during the assessment (-2.4 [-4.1; -0.7, p = 0.0048]) and follow-up (-2.9 [-4.5; -1.2, p = 0.0008]) periods. 61.8% of participants reported treatment-emergent adverse events (TEAEs) with similar incidences among treatment groups (63.2% [active], 60.3% [sham]), with nasopharyngitis (8.3%), dizziness (6.3%), and epistaxis (6.3%) being the most common TEAEs. Treatment-related serious adverse events were not observed.DiscussionThe Chordate System provides significant benefits to patients with CM by reducing the number of MHDs. The nonpharmacologic nature of the treatment option positions K.O.S as a valuable addition to the current therapeutic portfolio for the management of CM.Trial Registration InformationThe trial was registered on ClinicalTrials.gov (NCT03400059) on January 17, 2018. The first patient was enrolled on March 22, 2018, and the last patient completed the study on October 1, 2022. The trial registration initially described the timing of the secondary endpoints incorrectly due to clerical error, and this was corrected to match the protocol and analysis plan once discovered.Classification of EvidenceThis study provides Class I evidence that weekly intranasal K.O.S is associated with a reduced number of headache days per month in patients with CM.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e2fe45b9df1cb245ff0ceb35d2ae0063",
  "timestamp": "2025-05-15T01:25:50.602774"
}