{
  "id": 6380,
  "title": "Analysis of Yields and Their Determinants in the European Corporate Green Bond Market",
  "abstract": "The green bond market helps to mobilize financial sources toward sustainable investments. Green bonds are similar to conventional bonds but are specifically designed to raise money to finance environmental projects. The feature of green bonds is the existence of greenium, or the lower yield compared to conventional bonds of the same risk. The relevance of the paper is underpinned by the mixed evidence on the existence of 'greenium', especially in corporate green bond markets; there has been limited research on the topic and a narrow focus on global, US, or Chinese green bond markets. Instead, the greenium in European debt markets remains underexplored. The objective of this study is to investigate the existence of greenium and its key determinants in European corporate debt capital markets, including the local markets of the United Kingdom (UK), France, Netherlands, and Germany. The sample included 3851 corporate bonds, both green and conventional ones, between 2007 and 2021 from 33 European countries. Linear regression was applied for the analysis. The results show that the climate corporate bonds in Europe are priced at a discount to the same-risk conventional corporate bonds. The magnitude of greenium is around 3 bps. Determinants of greenium include the presence of an ESG rating and belonging to the utility and financial industry. The remaining drivers of bond yields in the European corporate debt market are the credit quality (expressed by the level of credit rating), the coupon size, the bond tenor, the market liquidity, and macroeconomic variables (growth of gross domestic product and consumer price index). For the local corporate debt markets, our results are controversial. In all markets under consideration except for the UK and the Netherlands, we did not find sustainable evidence of greenium. The results of the research lead to a better understanding of the green bond market for investors, researchers, regulators, and potential issuing companies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e3071e307d37465097abf48a62bedc15",
  "timestamp": "2025-05-15T02:57:38.730190"
}