{
  "id": 4168,
  "title": "Maintaining the Sustainability of the Regional Credit Guarantee Institution in Indonesia",
  "abstract": "This study aimed to analyze the effect of internal and macroeconomic factors on the financial performance of Regional Credit Guarantee Institutions (PT. Jamkrida) in Indonesia. Internal factors included: guarantee risk, gearing ratio, liquidity, and asset management, while macroeconomic includes: gross domestic product and inflation. The population was PT. Jamkrida in Indonesia, which were 18 in total, of which 16 met the requirements as the sample. The type of data was secondary data sourced from the PT. Jamkrida's Annual Financial Report with observations for 2014-2020. The data analysis technique used was multiple regression analysis. This result: internal and external factors affected financial performance PT. Jamkrida in Indonesia. This result also proved the important role of the local government in maintaining PT. Jamkrida's capital to ensure that bank loans to SMEs run well. This study contributes to the RBV theory by providing empirical evidence of the influence of internal resources and external conditions on PT. Jamkrida's financial performance. But, this study has limitations as indicated by the results of an adjusted R square of 13.8%, so it is possible 86.2% of other variables can explain their effect on financial performance. Therefore, it offers opportunities to add other factor specifications, or other methods",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e316c3f7ad05389ae46b6d90cf2166a6",
  "timestamp": "2025-05-15T02:34:13.320689"
}