{
  "id": 8457,
  "title": "The association between COVID-19 related stressors and mental health in refugees living in Australia",
  "abstract": "Background Refugees may be particularly vulnerable to the adverse effects of the COVID-19 pandemic on mental health due to their traumatic pasts and the challenges of the postmigration environment. Objective To evaluate the prevalence of COVID-19 related stressors and their relationship to key mental health and functioning outcomes in a resettled refugee sample. Method N = 656 refugees and asylum seekers living in Australia completed a survey in June 2020 to index their mental health (posttraumatic stress disorder (PTSD), depression, health anxiety and disability) and COVID-19 experiences. The relationship between COVID-19 stressors and mental health was examined using a series of hierarchical linear regression models while controlling for other key demographic factors. Results Refugees' most prevalent stressors related to worries of being infected by COVID-19 or the risk COVID-19 posed to others, which predicted health anxiety and PTSD. Social-related difficulties predicted depression and disability symptoms. Accessing and trusting information from authorities were the least prevalent stressors and were not significantly associated with mental health outcomes; neither was accessing basic supplies and financial support. Fears relating to the future such as concerns about visa application processes predicted health anxiety and disability. Crucially, the strongest predictor of all mental health outcomes was COVID-19 serving as a reminder of difficult past events. Conclusions Refugees may be uniquely affected by COVID-19 because the pandemic serves as a reminder of their past conflict and persecution trauma. It is critical that mental health strategies accommodate the specific needs of refugees during the COVID-19 pandemic.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e338c8cbaa9e5699d7ebffd1a07d4f5f",
  "timestamp": "2025-05-15T03:18:51.733884"
}