{
  "id": 466,
  "title": "Bank Green Credit Risk Assessment and Management by Mobile Computing and Machine Learning Neural Network under the Efficient Wireless Communication",
  "abstract": "The study is aimed at assessing and managing the green credit risk of banks, reduces the systemic risk in the financial industry, and improves the efficiency of the use of bank funds. With the development and evolution of efficient wireless data communication and transmission technology, the study combines theoretical and empirical green credit analysis to analyze listed companies in different industries quantitatively. The index system of credit risk assessment is established through wireless data transmission technology combined with mobile computing and machine learning neural networks. A back-propagation neural network (BPNN) model is confirmed by principal component analysis and factor analysis, and the performance of the model is verified with example data. The results show that the BPNN-based credit risk assessment model can provide 95% accuracy. In addition, 99% of the sample companies have low risk and no green credit risk. However, most companies in the coal industry are at greater risk. Overall, medium and high-risk companies accounted for 11.5%. Compared with other state-of-the-art models, the machine learning neural network adopted here has better data fitting and prediction accuracy, higher learning efficiency, and higher accuracy. The model established inefficient wireless communication is suitable for bank credit risk assessment and has good reference value and practical significance for bank credit risk assessment and management in different industries.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e33fe1b7d1ee8914ac8f213141435589",
  "timestamp": "2025-05-15T01:51:31.192059"
}