{
  "id": 460,
  "title": "Applying Artificial Intelligence in Cryptocurrency Markets: A Survey",
  "abstract": "The total capital in cryptocurrency markets is around two trillion dollars in 2022, which is almost the same as Apple's market capitalisation at the same time. Increasingly, cryptocurrencies have become established in financial markets with an enormous number of transactions and trades happening every day. Similar to other financial systems, price prediction is one of the main challenges in cryptocurrency trading. Therefore, the application of artificial intelligence, as one of the tools of prediction, has emerged as a recently popular subject of investigation in the cryptocurrency domain. Since machine learning models, as opposed to traditional financial models, demonstrate satisfactory performance in quantitative finance, they seem ideal for coping with the price prediction problem in the complex and volatile cryptocurrency market. There have been several studies that have focused on applying machine learning for price and movement prediction and portfolio management in cryptocurrency markets, though these methods and models are in their early stages. This survey paper aims to review the current research trends in applications of supervised and reinforcement learning models in cryptocurrency price prediction. This study also highlights potential research gaps and possible areas for improvement. In addition, it emphasises potential challenges and research directions that will be of interest in the artificial intelligence and machine learning communities focusing on cryptocurrencies.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e36657b1506aec4e342e1aae84f2e92b",
  "timestamp": "2025-05-15T00:43:47.340466"
}