{
  "id": 6608,
  "title": "The U.S. Contagion Effects on Foreign Direct Investment Flows in Developing Countries",
  "abstract": "This study aims to measure the lower tail dependence as risk contagion from the U.S. economy to 18 developing countries affecting FDI inflows using time-series data from 2005 to 2019. Firstly, we utilize four dynamic copula models, namely, Student-t, Clayton, rotated survival Gumbel, and rotated survival Joe, to measure the tail dependence structure between the U.S. and each developing country's real GDP growth. Secondly, we use the regression model to explore the contagion effects on FDI inflows. The results show that there is evidence of the tail dependence between the U.S and developing economies, indicating the presence of the contagion effects. Primarily, we observe that the degree of contagion effects of the global financial crisis varies across countries; a strong impact is observed in Chinese, South African, Russian, Colombian, and Mexican economic growth. Furthermore, we found significant contagion risk affecting FDI inflows positively in China, Indonesia, Columbia, Morocco, and negatively in the Philippines, Bulgaria, and South Africa. This study demonstrates the usefulness of the copulas model in terms of examining contagion. Our findings shed light on the influence of sound policies and regulations to cope with both positive and negative consequences of the contagion on the capital movement.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e381bb5dc6b3ad199dc19e8d156f74c9",
  "timestamp": "2025-05-15T02:59:37.098818"
}