{
  "id": 6649,
  "title": "Investment account holders' market discipline in GCC countries",
  "abstract": "Purpose The purpose of this study is to investigate the two components of market discipline, investment account holder (IAH) monitoring and the consequent reaction of the Islamic banks in GCC countries for the 2004-2013 period, including the recent financial crisis of 2008. Design/methodology/approach We address the research question that Investment Account holders (IAH) in GCC countries suc as Kingdom of Saudi Arabia (KSA), Bahrain and United Arab Emirates (UAE) monitor their banks. Regression analysis was used to examine the dependence level of profit-sharing investment account (PSIA) growth rate on bank risk characteristics (CAMEL variables). Then, the reaction of banks by regression influencing CAMEL variables of one-lagged period on PSIA growth rate was verified. Findings The results provide evidence of the first component of market discipline, i.e. the IAH monitoring, in KSA, Bahrain and UAE. The common result to the three countries is that market actors are concerned with accounting information on capital adequacy. However, in UAE, they are also interested in assets performance, whereas they look more at earnings in Bahrain. The results show evidence of the second component in Bahrain; the bank reaction to IAH monitoring and subsequently IAH discipline in Bahrain. Finally, the results do not support any impact of the financial crisis. Research limitations/implications The sample size is small although it is constituted by banks having a sufficient number of observations. Practical implications This study highlights the importance of IAH discipline, which would help prudential bank monitoring by regulators and wealth development for both investors and managers. It should increase the disclosure of relevant information as for the part of effective accountability of Islamic banks' governance. Originality/value This study contributes to the literature on market discipline by dealing with Islamic banks. It is one of the very few studies to investigate IAH discipline in Islamic banks and the second component of market discipline, i.e. the influence of monitoring on banks.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e389cefbee4d658a6a52b59fe75f3cba",
  "timestamp": "2025-05-15T03:00:05.057091"
}