{
  "id": 3493,
  "title": "Liquidity, informational efficiency and firm default risk: a systematic literature review",
  "abstract": "Purpose This study aims to systematically review the literature in the fields of liquidity, informational efficiency and default risk. The authors outline the key research streams and provide possible pathways for future research.Design/methodology/approach The study adopts bibliographic mapping to identify the most influential studies in the research fields of liquidity, informational efficiency and default risk from 1984 to 2021.Findings The study identifies four key research themes that include efficiency and transparency of markets; corporate yield spreads; market interactions: bonds, stocks and cryptocurrencies; and corporate governance. By assessing publications published from 2018 to 2021, the authors also document seven key emerging research trends: cross markets, managerial learning and corporate governance, state ownership and government subsidies, international evidence, machine learning (FinTech approaches), environmental themes and financial crisis. Drawing on these emerging trends, the authors highlight the opportunities for future research.Research limitations/implications Keyword searches have limitations since some studies might be overlooked if they do not match the specified search criteria, even though their relevance to the topic is under investigation. Adopt the R project to expand this review by incorporating more literature from other databases, such as the Scopus database could be a possible solution.Practical implications The four key research streams contribute to a comprehensive understanding of liquidity, informational efficiency and default risk. The emerging trends integrate existing knowledge and leave the chance for innovative research to expand the research frontier.Originality/value This study fulfills the systematic literature review streams in the fields of liquidity, informational efficiency and default risk, and provides fruitful opportunities for future research.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e39094cf3874556e324d9f8677893ebc",
  "timestamp": "2025-05-15T02:26:48.569618"
}