{
  "id": 4012,
  "title": "Property types diversification strategy of Malaysian real estate investment trust (M-REITs)",
  "abstract": "The aim of this paper is to review the property types diversification strategy of Malaysian REITs. Previous study has found that Malaysian REITs received poor response form investors both local and international. Furthermore, the underperformance of Malaysian REITs was linked to the characteristics of REITs' property types and REITs' portfolio influenced its financial performance. The lack of local study on both of these determinants of influence on performance of Malaysian REITs is a research gap, which needs to be explored that can provide more insight of it. This study showed that the property types such as office space, commercial lot, industrial, hotel and specialized property type are the important determinants, which can influence the performance of REITs. The study comprised of REITs data from 2010 until 2014, and through Multiple Regression Analysis (MRA) reveals there is little influence of property types diversification strategy toward Malaysian REITs' performance. Nevertheless, by employ correlation analysis between each of the five property types with expected return and dividend yield, this study shows Malaysian REITs' performance of dividend yield(DY) has a positive correlation value with commercial lot property type and Malaysian REITs' performance of expected return(ER) have a highest positive correlation value with industrial property types. Also, this study suggests that property type diversification play a significant role in Malaysia REITs. Other determinants such as location of property, market capitalization and REITs' quality of advisory style that might influence the diversification strategy and financial performance of Malaysian REITs.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e3a37a70fadca8de05943f670bb919fe",
  "timestamp": "2025-05-15T01:23:07.335314"
}