{
  "id": 6053,
  "title": "Does fintech lending expansion disturb financial system stability? Evidence from Indonesia",
  "abstract": "Literature suggests two contradictory views regarding the impacts of fintech lending on banks. The competition-instability proponents believe that fintech lending expansion erodes bank market and threatens banks as traditional intermediaries, thereby intensifying bank risk-taking and potentially disturbing financial stability. In contrast, the competition-stability proponents believe fintech lending reduces asymmetric information in the credit market, thus reducing bank risk-taking and increasing bank resilience to a systematic shock. This paper aims to examine the impacts of fintech lending expansion on bank-risk taking, i.e., credit channeling activity and bank risk. This study utilizes the OLS, random effects, fixed effects, and two-step GMM regressions to test the conjectures. Consistent with the competition-stability hypothesis, our evidence indicates that shadow banking increases as banks actively seek channels to diversify their risks but are less likely to use fintech lending as a credit channel. This paper also corroborates the notion that fintech lending expansion encourages banks to diversify their risks. Pertaining to the relationship between fintech lending and bank risk, our results suggest that fintech lending expansion encourages banks to work more efficiently to improve their credit quality rather than to intensify bank risk-taking. These findings also indicate that synergy between fintech lending and banks would increase bank credit quality. This paper also examines the reasonable credit limits for fintech lending firms based on MSMEs' characteristics. Employing the threshold regression, we find that IDR5 billion is the maximum credit provision to induce the profitability of MSMEs whereas IDR6 billion is the maximum credit provision to minimize the default risk of MSMEs.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e3a34de3b765fa3156b3ffcb88fbaf3e",
  "timestamp": "2025-05-15T02:54:03.511510"
}