{
  "id": 3828,
  "title": "A rough set based approach to patent development with the consideration of resource allocation",
  "abstract": "Patent strategy is the overriding mechanism that helps direct investment, resource allocation, expectations, and policy development within an organization. Much studies of patent, for example, patent classification, patent analysis, patent management, patent strategy planning have been made. Due to the high cost of devoting to the research and development for a new patent application, it is essential for a company to develop the patent portfolio based on analyzing related information for fitting with cost constraint and maximizing the benefit. However, only few research attempts to develop new patents with the consideration of resource allocation, for example, optimizing budget utilization. In addition, the previous studies did not derive significant technologies and induct rules for resource allocation through patent analysis. In some cases, the patent analysis may process qualitative information that is difficult to analyze by standard statistical techniques. The rough set approach, which is suitable for processing qualitative information, is required to induct decision rules to derive critical technologies of patents. In this paper, a systematic approach to analyze existing patent information based on rough set theory with the consideration of resource allocation is developed. A case study is presented to demonstrate the contribution of the proposed approach which assists on decision-making in patent reform or invention with constraint resource. (C) 2010 Elsevier Ltd. All rights reserved.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e3abc34fcbde43d84e2ba058a20a220c",
  "timestamp": "2025-05-15T01:21:08.276180"
}