{
  "id": 9118,
  "title": "The impact of introducing ambulance and delivery fees in a rural hospital in Tanzania",
  "abstract": "BackgroundAccess to health care facilities is a key requirement to enhance safety for mothers and newborns during labour and delivery. Haydom Lutheran Hospital (HLH) is a regional hospital in rural Tanzania with a catchment area of about two million inhabitants. Up to June 2013 ambulance transport and delivery at HLH were free of charge, while a user fee for both services was introduced from January 2014. We aimed to explore the impact of introducing user fees on the population of women giving birth at HLH in order to document potentially unwanted consequences in the period after introduction of fees.MethodsRetrospective analysis of data from a prospective observational study. Data was compared between the period before introduction of fees from February 2010 through June 2013 and the period after from January 2014 through January 2017. Logistic regression modelling was used to construct risk-adjusted variable-life adjusted display (VLAD) and cumulative sum (CUSUM) plots to monitor changes.ResultsA total of 28,601 births were observed. The monthly number of births was reduced by 17.3% during the post-introduction period. Spontaneous vaginal deliveries were registered less frequently with a decrease of about 17/1000 births in non-cephalic presentations. Labour complications and caesarean sections increased with about 80/1000 births. There was a reduction in newborns with birth weight less than 2500g. The observed changes were stable over time. For most variables, a significant change could be detected after a few weeks.ConclusionAfter the introduction of ambulance and delivery fees, an increase in labour complications and caesarean sections and a decrease in newborns with low birthweight were observed. This might indicate that women delay the decision to seek skilled birth attendance or do not seek help at all, possibly due to financial reasons. Lower rates of births in a safe health care facility like HLH is of great concern, as access to skilled birth attendance is a key requirement in order to further reduce perinatal mortality. Therefore, free delivery care should be a high priority.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e3b3bf836120f69bc3cc4abfc3ce708c",
  "timestamp": "2025-05-15T03:25:54.539963"
}