{
  "id": 5792,
  "title": "Early warning signals of financial crises using persistent homology",
  "abstract": "This study examines persistent homology to detect early warning signals of financial crises in the United States, Singapore, and Malaysia markets. Persistent homology is applied to obtain a L-1-norm time series, which is then associated with critical slowing down indicators (autocorrelation function at lag 1, variance, and mean power spectrum at low frequencies). Mann-Kendall test is used to anticipate the rising trend in the indicators before financial crises. Significance, structural break, and sensitivity tests are added to validate the method's robustness. Further, we compare the L-1-norms with another representative called residual time series. In our findings, three methods, namely mean power spectrums at low frequencies of the L-1-norms, variances of the residuals and mean power spectrums at low frequencies of the residuals consistently provide a period of significant rising trends and breakpoints before the Dotcom crash and Lehman Brothers bankruptcy in all markets. The outcome indicates their potential as an early warning detection tool. However, these methods depend on their parameters. Despite the dependency, we further analyze these methods by determining the threshold to cover entire trading days and record their performance based on two classification scores (probability of successful anticipation and probability of erroneous anticipation). Overall, the mean power spectrums at low frequencies of the residuals is the finest method to detect early warning signals of financial crises in all markets. It is closely followed by the mean power spectrums at low frequencies of the L-1-norms, which has obtained better scores than the variances of the residuals in the US and Singapore, except for Malaysia. Besides the residuals, our study demonstrates that the L-1-norms obtained from persistent homology also is a meaningful representation to detect early warning signals. In general, this study offers a framework to determine early warning signals of financial crises for risk management purposes. (C) 2021 Elsevier B.V. All rights reserved.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e3d5959f8ae06d0cc8926823b1a0021b",
  "timestamp": "2025-05-15T02:51:30.057091"
}