{
  "id": 7401,
  "title": "Determinants of institutional agricultural credit access and its linkage with farmer satisfaction in India: a moderated-mediation analysis",
  "abstract": "Purpose The study assesses the relationship between institutional credit access and farmer satisfaction using contextual mediating and moderating variables. This study identifies various socioeconomic, service features and service quality determinants impacting institutional credit access. Design/methodology/approach The authors used the stratified random sampling method and selected 512 farmers from 40 villages in Maharashtra, India. Initially, the study employed probit regression analysis to identify the credit adoption determinants. Subsequently, the relationship between institutional credit and farmer satisfaction is identified through moderated-mediation analysis using the Statistical Package for the Social Sciences and Analysis of a Moment Structures (SPSS - AMOS model). Findings Probit model's results suggest that socioeconomic variables like education and bank distance; service quality variables like prompt service and employee behavior; and service characteristics variables like the interest rate, loan sanction time, repayment period, and documents for loan application significantly affect institutional credit adoption across the smallholders. Subsequently, the results of the moderating-mediation analysis show that working capital, perceived value and risk perception partially mediate the association between credit adoption and farmer satisfaction. The mediated effects are further moderated by farm advisory services and financial knowledge and skills. Research limitations/implications The study is restricted in opportunity due to primary data, and it considers only farmers' perspectives to measure service quality and service features as constraints for institutional credit access. Practical implications The government, nongovernment organizations, civil societies and private institutions should provide sufficient financial knowledge and training to the farmers via extension services to utilize the borrowed capital effectively to bring economic welfare and mental satisfaction. Originality/value The existing literature rarely considered banking service quality and service features (demand side) variables as determinants of credit access. Further, the study brings novelty in examining how the capital management cognitive factors of the formal credit adopters influence the relationship between credit access and satisfaction.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e3e61335b2256c9f80af55ddf7a6224f",
  "timestamp": "2025-05-15T03:08:00.867883"
}