{
  "id": 178,
  "title": "Optimization of Financial Asset Allocation and Risk Management Strategies Combining Internet of Things and Clustering Algorithms",
  "abstract": "This study proposes a new method for optimizing household financial asset allocation (FAA) and developing scientific risk control strategies by integrating Internet of Things (IoT) data and clustering algorithms. IoT technology is utilized to collect real-time data, including macroeconomic indicators, market dynamics, and investor behavior. The data comes from national statistical offices, financial market trading platforms, and social media. The optimized K-means++ clustering algorithm is used for asset classification. Moreover, its performance is evaluated through indexes, such as the silhouette coefficient, adjusted rand index (ARI), Davies-Bouldin index (DBI), and mutual information (MI). The results show that the K-means++ algorithm outperforms these indexes, especially in terms of silhouette coefficient (0.62), ARI (0.75), and MI (0.80). In terms of asset allocation optimization, the proportion of stock products and wealth management products has increased to 4.94% and 12.34%, indicating an improvement in asset diversification and risk diversification. Risk assessment reveals that Internet financial behavior and economic development level have a marked impact on asset allocation. For example, the asset allocation of households with active Internet financial behavior is more diversified. The cash deposit ratio in the eastern region is 79.32%, lower than the 86.08% in the western region. This study provides effective methods for managing household financial assets, which can help improve household wealth management, enhance risk management capabilities, and promote the development of financial technology.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e3e635e44ad3d1cb86863fb26edd5a5a",
  "timestamp": "2025-05-15T01:47:52.985777"
}