{
  "id": 8755,
  "title": "Analysis of factors influencing the recurrence of diabetic foot ulcers",
  "abstract": "ObjectiveThe aim of this study is to investigate the factors influencing the recurrence of diabetic foot ulcers (DFU) and provide guidance for reducing the recurrence rate. MethodsA total of 211 patients diagnosed with DFU who were hospitalized and discharged from the hospital from October 2015 to January 2020 were included as the study cohort. Participants were divided into two groups according to whether the foot ulcer recurred during the 2-year follow-up period: a recurrence group (n = 84) and a non-recurrence group (n = 127). The following data were collected and analyzed for the two groups of patients: general information, foot information, laboratory indicators, diabetes comorbidities, and complications. Results(1) The overall recurrence rate of diabetic foot ulcers (DFU) within 2 years was 39.8%, indicating a high recurrence rate. (2) Significant differences were observed between the two patient groups in terms of BMI, HbA1c, TBIL, CRP, financial situation, foot deformity, first ulcer on the sole of the foot, previous amputation history, Wagner grade of the first ulcer, osteomyelitis, DFU duration (>60 days), lower limb vascular reconstruction, peripheral arterial disease (PAD), and diabetic peripheral neuropathy (DPN) (t = 2.455; Z = -1.988, -3.731, -3.618; chi 2 = 7.88, 5.004, 3.906, 17.178, 16.237, 5.007, 24.642, 4.782, 29.334, 10.253). No significant differences were found for the other indicators. (3) Logistic regression analysis revealed that TBIL (OR = 0.886, p = 0.036) was a protective factor against ulcer recurrence. In contrast, PAD, previous amputation history, DPN, and the first ulcer on the sole of the foot (OR = 3.987, 6.758, 4.681, 2.405; p < 0.05 or p < 0.01) were identified as risk factors for ulcer recurrence. ConclusionEarly screening and preventive education targeting high-risk factors such as DPN, PAD and the initial ulcer location on the sole of the foot are essential to mitigate the high long-term recurrence rate of DFU. Furthermore, the protective role of TBIL in preventing ulcer recurrence underscores the importance of monitoring bilirubin levels as part of a comprehensive management strategy for DFU patients.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e3e98658e7ff18d97b8aa6a89b884066",
  "timestamp": "2025-05-15T03:21:56.727743"
}