{
  "id": 1617,
  "title": "Credit risk prediction based on causal machine learning: Bayesian network learning, default inference, and interpretation",
  "abstract": "The predictive and interpretable power of models is crucial for financial risk management. The purpose of this study was to perform credit risk prediction in a structured causal network with four stages-data processing, structural learning, parameter learning, and interpretation of inferences-and use six real credit datasets to conduct empirical research on the proposed model. Compared with traditional machine learning algorithms, we comprehensively explain the results of credit default through forward and reverse reasoning. We also compared our model with the post hoc interpretation models local interpretable model-agnostic explanations (LIME) and shapley additive explanations (SHAP) to verify the interpretability of Bayesian networks. The experimental results show that the prediction performance of Bayesian networks is superior to traditional machine learning models and similar to the performance of ensemble models. Furthermore, Bayesian networks offer valuable insights into the interplay of features by considering their causal relationships and enable an assessment of how individual features influence the prediction outcome. In this study, what-if analysis was performed to assess credit default probabilities under various conditions. This analysis provides decision-makers with the necessary tools to make informed judgments about the risk profile of borrowers. Consequently, we consider Bayesian networks as a viable tool for credit risk prediction models in terms of prediction performance and interpretability.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e403b230fb6850d601b0d8cdd5fc2188",
  "timestamp": "2025-05-15T02:05:42.474165"
}