{
  "id": 9177,
  "title": "ARE CLASSROOM GAMES USEFUL FOR TEACHING 'STICKY' FINANCE CONCEPTS? EVIDENCE FROM A SWAP GAME",
  "abstract": "In the field of finance and economics, teaching the concepts, theory, mathematics and its applications can be challenging at times. Instructors need to adapt their methods to address not only the continual changes in the mission of universities where generic student skills are strongly emphasised, but also the changes to students' expectations in the classroom. Experiential learning has been found to be one of the preferred learning activities in economics as students are transformed from passive listeners to active participants, engaged in communicating opinions and working in teams. Despite long list of documented games in economics and other disciplines, a lack of literature on experiments in finance teaching suggests that academics in the field of finance may have been slower to embrace the benefits of experimental learning than academics in other fields. This paper contributes in closing the gap. Firstly, it documents an example of a role-play game, which might be used in teaching a 'sticky' concept of swaps. The game was designed with the following goals in mind: 1) to enable students to understand how a 'stand-alone' basic plain vanilla swap works; 2) to show how interest rate volatility (interest rate risk) might impact upon financial institutions if positions were left unhedged; and 3) to show how swaps assist financial institutions in hedging interest rate positions. Secondly, the paper discusses students' experiences of the game and provides a summary of the survey results. The findings of this paper add to the evidence that in-class experiments are enjoyable and fun for the participants; they benefit students and instructors in terms of breaking the routine and they improve the reputation of finance teaching among students. The shortcoming of the experiment was the lack of willingness by some students to play the game with serious intent. Finally, the paper contributes to the thin literature of experimental learning effectiveness by presenting evidence on how the participation in the experiment contributed to the assessment result in the relevant examination question. We adopted a two-step analysis of the students' performance. First, we assessed the interaction between attendance of the role-play class and students' willingness to attempt the swap question in the final exam. It appeared that attendance of the role-play class has not played an important role in deciding to pick the swap question or not. The take-up rate for the swap question was still smaller than with any other four questions from other topics, which confirmed the relevant difficulty of the topic. Second, we empirically tested whether attendance of the role-play game class had contributed to the performance of those students who picked the swap question in the exam. Using an Ordinary Least Square regression the analysis reveals a highly significant control variable, showing that students' preparation and abilities played a very important role in their swap question performance. Students who engaged in the role-play game performed, on average, 15 per cent better than the students who did not, after controlling for their abilities and preparation efforts.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e4074d913b92ed78b2868be3829a637f",
  "timestamp": "2025-05-15T03:26:25.938241"
}