{
  "id": 5636,
  "title": "Lifetime Trauma and Cardiovascular Health in Latinas",
  "abstract": "BackgroundPotentially traumatic experiences throughout the life course are associated with poor cardiovascular health among women. However, research on the associations of trauma with cardiovascular health among Latino populations is limited. Understanding the impact of trauma on cardiovascular health within marginalized populations may provide guidance on developing interventions with a particular focus on preventative care.ObjectiveThe purpose of this descriptive cross-sectional study was to examine the associations of lifetime trauma with cardiovascular health among middle-aged and older Latina women.MethodsParticipants were recruited from an existing study in New York City. All participants completed a structured questionnaire to assess lifetime trauma, demographic characteristics (such as age and education), financial resource strain, and emotional support. The Trauma History Questionnaire was used to assess lifetime exposure to potentially traumatic experiences (range 0-24). Cardiovascular health was measured with a validated measure of cardiovascular health from the American Heart Association (Life's Simple 7). We used self-reported and objective data to calculate cardiovascular health scores (range 0-14). Multiple linear regression was used to examine the associations of lifetime trauma with cardiovascular health, adjusted for age, education, financial resource strain, and emotional support.ResultsThe sample included 50 Latina women with a mean age of 63.1 years, 88% were Dominican, and only 6% had completed a college degree. Women reported an average of 4.8 traumatic experiences. Mean cardiovascular health score was 6.5 (SD = 1.6, range 3-10). Linear regression models found that, after adjusting for age, education, financial resource strain, and emotional support, a higher count of lifetime trauma was associated with worse cardiovascular health. However, this association did not reach statistical significance.DiscussionWomen with a higher count of lifetime trauma had worse cardiovascular health scores; this association was not statistically significant. Future studies should investigate associations of lifetime trauma and cardiovascular health in larger and more diverse samples of Latinas. Nurses and other clinicians should incorporate trauma-informed approaches to cardiovascular disease risk reduction to improve the cardiovascular health of Latina women who are survivors of trauma.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e409eb1210db5710a70c51cac4dd8d23",
  "timestamp": "2025-05-15T02:49:50.311167"
}