{
  "id": 2900,
  "title": "Longitudinal models for the progression of disease portfolios in a nationwide chronic heart disease population",
  "abstract": "Background and aimWith multimorbidity becoming increasingly prevalent in the ageing population, addressing the epidemiology and development of multimorbidity at a population level is needed. Individuals subject to chronic heart disease are widely multimorbid, and population-wide longitudinal studies on their chronic disease trajectories are few. MethodsDisease trajectory networks of expected disease portfolio development and chronic condition prevalences were used to map sex and socioeconomic multimorbidity patterns among chronic heart disease patients. Our data source was all Danish individuals aged 18 years and older at some point in 1995-2015, consisting of 6,048,700 individuals. We used algorithmic diagnoses to obtain chronic disease diagnoses and included individuals who received a heart disease diagnosis. We utilized a general Markov framework considering combinations of chronic diagnoses as multimorbidity states. We analyzed the time until a possible new diagnosis, termed the diagnosis postponement time, in addition to transitions to new diagnoses. We modelled the postponement times by exponential models and transition probabilities by logistic regression models. FindingsAmong the cohort of 766,596 chronic heart disease diagnosed individuals, the prevalence of multimorbidity was 84.36% and 88.47% for males and females, respectively. We found sex-related differences within the chronic heart disease trajectories. Female trajectories were dominated by osteoporosis and male trajectories by cancer. We found sex important in developing most conditions, especially osteoporosis, chronic obstructive pulmonary disease and diabetes. A socioeconomic gradient was observed where diagnosis postponement time increases with educational attainment. Contrasts in disease portfolio development based on educational attainment were found for both sexes, with chronic obstructive pulmonary disease and diabetes more prevalent at lower education levels, compared to higher. ConclusionsDisease trajectories of chronic heart disease diagnosed individuals are heavily complicated by multimorbidity. Therefore, it is essential to consider and study chronic heart disease, taking into account the individuals' entire disease portfolio.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e412790ae360da8c1e42ca2eef25c905",
  "timestamp": "2025-05-15T01:11:48.311797"
}