{
  "id": 5250,
  "title": "Financial hardship, positive financial behaviour, and behavioural health outcomes among US soldiers",
  "abstract": "LAY SUMMARY Financial hardship, such as difficulty paying for expenses or having to borrow money from family and friends to pay for needs, is of concern for several reasons, including how it affects mental and physical health. The authors wanted to provide more detailed information on which aspects of health it affects and were also curious about whether positive financial behaviors affected the health of military personnel. This study found that service members who reported more financial hardship also reported higher levels of depression, anxiety, posttraumatic stress disorder, insomnia, and physical aggression, poorer general health, and less sleep. However, positive financial behaviors had little effect on any of the health outcomes. Findings suggest that focusing on reducing financial hardship will be more effective in improving mental health than encouraging positive financial behaviors. This research has implications for the ongoing military efforts to improve financial literacy and reduce financial hardship. Introduction: Financial well-being is an ongoing concern among military personnel, and more research is needed to understand the implications of both financial hardship and positive financial behaviours on behavioural health and well-being. Methods: Using a sample of active duty U.S. Army personnel (N = 850), the authors estimated the prevalence of self-reported past-year financial hardships and positive financial behaviors and examined the relationship of these factors with behavioural health. Results: At least one financial hardship was reported by 31% of participants, whereas 74% engaged in at least one positive financial behaviour. Junior enlisted personnel and personnel with lower income, less education, and larger families reported more financial hardship and fewer positive behaviours. Adjusted multivariate logistic regression analyses indicated that financial hardship was associated with posttraumatic stress disorder, depression, anxiety, fewer sleep hours, insomnia, and self-rated health, but not alcohol misuse. Following a budget was associated with lower alcohol misuse, but there were no other significant relationships between positive financial behaviors and the outcomes. Discussion: This study demonstrates that financial hardship is a risk factor for behavioural health problems among military personnel. Findings illustrate the need to evaluate existing military financial literacy and support programs and regulations intended to improve financial well-being or prevent poor financial decision-making. Future research should contemplate fine-tuned measurement strategies and the role of individual differences in these relationships of interest. Introduction : Le bien-etre financier est une preoccupation constante au sein du personnel militaire, et d'autres recherches devront etre realisees pour comprendre a la fois les consequences des difficultes financieres et des comportements financiers positifs sur la sante comportementale et le bien-etre. Methodologie : Au moyen d'un echantillon de membres du personnel de l'armee americaine en service actif (n = 850), les auteur(e)s ont estime la prevalence des difficultes financieres et des comportements financiers positifs autodeclares de l'annee precedente et ont examine le lien entre ces facteurs et la sante comportementale. Resultats : Au total, 31 % des participant(e)s ont declare au moins une difficulte financiere, tandis que 74 % adoptaient au moins un comportement financier positif. Le personnel junior en service et le personnel ayant un revenu plus faible, etant moins instruit et ayant des familles plus nombreuses declarait plus de difficultes financieres et moins de comportements positifs. Selon les analyses de regression logistique multivariee corrigee, les difficultes financieres etaient associees a un trouble de stress post-traumatique, a la depression, a l'anxiete, a moins d'heures de sommeil, a l'insomnie et a la sante autodeclaree, mais pas au mesusage d'alcool. La tenue d'un budget etait associee a un plus faible mesusage d'alcool, mais aucune autre relation importante n'etait observee entre les comportements financiers positifs et les resultats cliniques. Discussion : Cette etude demontre que les difficultes financieres sont un facteur de risque de troubles de sante comportementale au sein du personnel militaire. Les resultats demontrent la necessite d'evaluer l'alphabetisation financiere des militaires et de soutenir les programmes et la reglementation concus pour ameliorer le bien-etre financier ou prevenir de mauvaises decisions financieres. De prochaines recherches devraient porter sur des strategies de mesure peaufinees et sur le role des differences individuelles dans ces relations d'interet.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e4170f4ee1892232973da8a5e7db0c0d",
  "timestamp": "2025-05-15T02:45:47.477838"
}