{
  "id": 6694,
  "title": "Development and internal validation of a multifactorial risk prediction model for gallbladder cancer in a high-incidence country",
  "abstract": "Since 2006, Chile has been implementing a gallbladder cancer (GBC) prevention program based on prophylactic cholecystectomy for gallstone patients aged 35 to 49 years. The effectiveness of this prevention program has not yet been comprehensively evaluated. We conducted a retrospective study of 473 Chilean GBC patients and 2137 population-based controls to develop and internally validate three GBC risk prediction models. The Baseline Model accounted for gallstones while adjusting for sex and birth year. Enhanced Model I also included the non-genetic risk factors: body mass index, educational level, Mapuche surnames, number of children and family history of GBC. Enhanced Model II further included Mapuche ancestry and the genotype for rs17209837. Multiple Cox regression was applied to assess the predictive performance, quantified by the area under the precision-recall curve (AUC-PRC) and the number of cholecystectomies needed (NCN) to prevent one case of GBC at age 70 years. The AUC-PRC for the Baseline Model (0.44%, 95%CI 0.42-0.46) increased by 0.22 (95%CI 0.15-0.29) when non-genetic factors were included, and by 0.25 (95%CI 0.20-0.30) when incorporating non-genetic and genetic factors. The overall NCN for Chileans with gallstones (115, 95%CI 104-131) decreased to 92 (95%CI 60-128) for Chileans with a higher risk than the median according to Enhanced Model I, and to 80 (95%CI 59-110) according to Enhanced Model II. In conclusion, age, sex and gallstones are strong risk factors for GBC, but consideration of other non-genetic factors and individual genotype data improves risk prediction and may optimize allocation of financial resources and surgical capacity.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e41cd6f42b2b397ac39ccd1b7b2bfe54",
  "timestamp": "2025-05-15T03:00:35.476306"
}