{
  "id": 4327,
  "title": "The Use of Economic Indicators as Early Signals of Stock Market Progress: Perspectives from Market Potential Index",
  "abstract": "The progress of financial markets depends on the way world investors foresee the market potential of the country of choice. Countries that are associated with favorable economic incentives are able to motivate investments in their respective stock markets. The objective of this paper is to examine the role of the many economic components which constitute the Market Potential Index in enhancing stock market progress. The methodology goes through testing and estimation. The tests include linearity versus nonlinearity (RESET), normality, and cointegration. The estimation includes cointegration regression and discriminant analysis to distinguish between high and low stock market progress. This study examines unbalanced panel data that covers the years 1996-2022 for 54 countries where a stock market exists. The results show the following: (a) increases in people's expenditure result in decreases in consumption of investment in financial securities; (b) the investments in infrastructure technology is positively associated with stock market progress; (c) the positive effect of economic freedom indicates that further adaptive trading regulations are beneficial to stock market progress; (d) increases in imports consume large proportions of people's income, coming at the expense of investment in financial securities; (e) stock markets that are associated with high country risk are characterized by a positive risk-return tradeoff, i.e., a high risk premium; (f) the stock markets listed in the MPI can reach high progress by improving three indicators, namely commercial infrastructure, market receptivity, and country risk. This paper offers a thorough and unique examination of the institutional arrangements and stock market progress. The paper offers a guide to policy makers about how economic institutional arrangements can be promoted in order to reach high stock market progress.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e43f1cf843ec4749276819720917ffae",
  "timestamp": "2025-05-15T02:36:05.168532"
}