{
  "id": 8466,
  "title": "The differential rates in cost-related non-adherence to medical care by gender in the US adult population",
  "abstract": "Background: Cost-related non-adherence (CRN) to medical care is a persistent challenge in healthcare in the US. Gender is a key determinant of many healthcare behaviors and outcomes. Understanding variation in CRN by gender may provide opportunities to reduce disparities and improve outcomes. Aims: This study aims to examine the differential rates in CRN by gender across a spectrum of socio-economic factors among the adult population in the US. Method: Data from the 2015 National Financial Capability Study (NFCS) were used for this study. CRN is identified if a respondent indicated not filling a prescription for medicine because of the cost and/or skipping a medical test, treatment, or follow-up recommended by a doctor because of the cost in the past 12 months. The differential rates in CRN by gender were assessed across socio-economic strata. A multivariable logistic regression analysis was performed to evaluate the difference in CRN rates by gender, controlling for potential confounders. Results: A total of 26,287 adults were included in the analyses. Overall, the weighted CRN rate in the adult population is 19.8% for men and 26.2% for women. There was a clear pattern of differential rates in CRN across socio-economic strata by gender. Overall, men were less likely to report CRN (AOR=0.74; 95% CI=0.69-0.79), controlling for other risk factors. Conclusions: More research is needed to understand the behavioral aspects of gender difference in CRN. Patient-centered healthcare needs to take gender difference into account when addressing cost-related non-adherence behavior.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e44beaf2ea383e2e3a4fc24d6bf318e5",
  "timestamp": "2025-05-15T03:19:21.256614"
}