{
  "id": 4658,
  "title": "Cost-Utility Analysis of Dapagliflozin as an Add-On to Standard Treatment for Patients with Type 2 Diabetes and High Risk of Cardiovascular Disease in Thailand",
  "abstract": "Introduction Diabetes treatment has incurred financial burden. We examined the cost-utility of adding dapagliflozin to the standard treatment for treating type 2 diabetes (T2DM) with cardiovascular risk in a Thai context. Methods A two-part model, decision tree and Markov models, was developed to capture the benefits in terms of heart failure (HF) and chronic kidney disease. The model was used to estimate the lifetime costs and outcomes from a societal perspective. Costs were based on local data while the transitional probabilities and utilities were derived from the DECLARE-TIMI 58 clinical trial and published studies. Future costs and outcomes were discounted at an annual rate of 3%. The results were reported as incremental cost-effectiveness ratios (ICER). One-way and probabilistic sensitivity analyses were performed to investigate parameter uncertainty. Results The increased cost of adding dapagliflozin from 8707 USD to 14,455 USD was associated with an increase in quality-adjusted life years (QALYs) from 9.28 to 9.58, yielding an ICER of 18,988 USD/QALY. Compared with the standard treatment, the dapagliflozin group acquired more clinical benefits in terms of fewer HF hospitalizations and macroalbuminuria. Sensitivity analyses revealed that with high prevalence of diabetic nephropathy of 29.4-43.9%, the ICER would decline to 5591-8014 USD/QALY. Conclusion On the basis of the DECLARE study with low incidence of T2DM complications and 4.2 years of median follow-up duration, the add-on dapagliflozin results in an ICER of 18,988 USD/QALY, which exceeds the local threshold of 5310 USD/QALY. Dapagliflozin would show better value for money in the context of high prevalence of T2DM complications.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e45ba9796c0b87986259d18a913731ed",
  "timestamp": "2025-05-15T02:39:27.059029"
}