{
  "id": 6419,
  "title": "Tourist development between security and terrorism: empirical evidence from Europe and the United States",
  "abstract": "Research background: Today's world is torn between extreme conservatism and duality, in opposition, trying to break the classical framework of freedom in the movement of people. In the context of complex global relations, this impulse, especially related to the travels for tourism purposes, raises new issues concerning the safety and security. The tourism industry has a priority for the economic development of many countries in the world and is a large source of export earnings and, at the same time, an important factor in the balance of payments of a significant part of the national economies in the world. The growing importance of the tourism industry, however, puts tourist destinations worldwide at the forefront of new challenges, one of which is terrorism. In this environment, new relationships are emerging and this reflects on the development strategies, as well as on the financial outcomes of tourism industry which are also largely affected. Purpose of the article: Respecting the new realities, the study explores the link between the risk of terrorism and the revenues from international tourism. Its main purpose is to investigate the impact of terrorism on the financial revenues from tourism in the European countries and the United States. The research is deter-mined by the perception that the financial flows from the international tourism are the quantitative manifestation of the hidden effects of the terrorism. Methods: The research method includes a regression cross-section analysis and Granger Causality test. The survey is panel and includes 37 countries from Europe tourism region and the United States from Americas' tourism region (according UNWTO) for the period 2012-2017. Findings & Value added: In conclusion, the effects of terrorism on the studied regions have been summarized, establishing dependence between terrorism and tourism, which illustrates a specific creative-destructive reflections of terrorism on tourism with regions particularities.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e45cecf5443f016cc2cbe0576de3dec3",
  "timestamp": "2025-05-15T02:58:05.583451"
}