{
  "id": 4859,
  "title": "Does livelihood risk matter in disaster preparedness? Insights from flood risk areas of rural China",
  "abstract": "Farmers in flood-risk areas are exposed to disruptions in their daily production and livelihood operations. However, disaster preparedness can reduce risk and minimize household losses, thereby increasing livelihood sustainability for farming families. Although sustainable livelihoods and disaster preparedness of farmers have been categorized, few studies have explored the correlation between livelihood risk and disaster preparedness. This study examines survey data from 540 farming family households in the three counties Gaoxian, Jiajiang, and Yuechi, which are affected by floods. We consider four distinct types of livelihood risks faced by farmers and three categories of disaster preparedness in the study area and construct a Tobit regression model to test the correlation between livelihood risk and disaster preparedness. The results show (1) a significant correlation between livelihood risk and disaster preparedness among farmers; (2) health risk is positively correlated with farmers' physical preparedness; (3) social risk is negatively correlated with farmers' physical, knowledge and skills, and overall disaster preparedness; and (4) financial risk is negatively correlated with farmers' overall disaster preparedness. Our findings may assist in disaster preparedness and in policy formulation pertaining to flood risk management.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e46436406e6bd568d979e6aee0b99678",
  "timestamp": "2025-05-15T02:41:32.861289"
}