{
  "id": 189,
  "title": "Neural network model for energy low carbon economy and financial risk based on PSO intelligent algorithms",
  "abstract": "Extreme value theory can analyze the extreme changes of financial market returns, and it is an effective financial risk management model. The distribution characteristics of financial assets' returns are the core content of all financial models. The assumptions about the fluctuation behavior of returns and its distribution characteristics are of great theoretical and practical significance for the measurement and management of financial risks. We compare the estimates of value at risk by the peak over threshold model with that by the traditional variance-covariance method. During downturns, the peak over threshold model based value at risk estimates is higher relative to that by the traditional variance-covariance approach. At the same time, this paper conducts statistical analysis of basic data through data collection and combines the establishment of statistical methods to study the practical effects of various factors on carbon productivity in China. In addition, this paper constructs a low-carbon economic neural network model based on particle swarm optimization to study carbon emissions. Finally, on the basis of analysis and research, this paper puts forward policy recommendations for China's future low-carbon development model, and then provides reference for guiding the development of China's future low-carbon model and provides theoretical basis for subsequent related research.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e4715d834622d3ea65e5b27ee46ca2fd",
  "timestamp": "2025-05-15T01:47:53.015773"
}