{
  "id": 2842,
  "title": "Sustainable Economic Growth Support through Credit Transmission Channel and Financial Stability: In the Context of the COVID-19 Pandemic",
  "abstract": "All countries worldwide faced the COVID-19 pandemic and had to take actions to lower the economic shock. Financial authorities play an especially significant role in economics and can help to manage the negative consequences. This article focuses on the European central bank monetary policy and actions taken for COVID-19 risk management. This research aims to identify the significant factors influencing the long-term loans for enterprises' credit conditions in a forward-looking approach and determine the impact of the spread of COVID-19 pandemic on banking sector credit risk, financial distress, lending growth, and financial soundness indicators. This research is focused on the credit transmission channel and the role of the Pandemic Emergency Purchase Program in different countries of the euro area. To reach the main goal, panel data regression models are used. Our findings showed that the banks' risk tolerance is a principal factor influencing long-term loan credit standards. We also identified that the spread of the COVID-19 pandemic has a statistically significant negative effect on banking sector credit risk, financial distress, banking sector profitability, and solvency. Furthermore, after analyzing the euro area banking sector, we found that liquidity increased. Hence, it means that banks have enough funds to support sustainable economic growth, but on the other side, commercial banks do not want to take credit risk because of their risk tolerance. Our research findings show the mixed effect of the COVID-19 pandemic on financial stability: while the overall financial distress decreased and banking sector liquidity increased, the profitability and solvency decreased some extent.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e47769e7ab8e2a0325ef2f228f8bfe0f",
  "timestamp": "2025-05-15T02:19:46.675640"
}