{
  "id": 7328,
  "title": "A novel nonlinear programming approach for estimating CAPM beta of an asset using fuzzy regression",
  "abstract": "The evaluation of risky assets is one of the major research tasks in the finance theory. There are several Capital Asset Pricing Models (CAPM) in the literature; the most popular one of those is the Sharpe-Lintner-Black mean-variance CAPM. According to this model, the typical measure of systematic risk is the beta coefficient. The beta coefficient can be evaluated by means of least squares method (LSM), Robust Regression Techniques (RRT), or similar approaches. However, the statistical assumptions of LSM might be invalid in the existence of extreme observations in data set. In order to decrease influence on the beta coefficient of extreme observations, most analyst apply to RRT's. However, either RRT's remove the extreme observations from the data set, or decrease their influences on the beta coefficient. Whereas the omitted observations might be valuable for investors since they carry substantial information about the state of nature. In other words, there is a clash between statistical and financial theory. In this study, to overcome this incompatibility, and to take into account the extreme observations carried worthy information, a novel fuzzy regression approach is proposed. The proposed approach is based on both possibility concepts and central tendency in the estimation of beta coefficient. In application section of this paper, the beta coefficients of three assets traded in Istanbul Stock Exchange (ISE) are estimated by the proposed fuzzy approach and the traditional techniques, and then the results of analysis are compared, and discussed. (C) 2012 Elsevier Ltd. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e47bd5ff82bce03a1a7dc6d90fa5d5cb",
  "timestamp": "2025-05-15T03:07:31.874159"
}