{
  "id": 281,
  "title": "Data depth based support vector machines for predicting corporate bankruptcy",
  "abstract": "In financial distress analysis, the diagnosis of firms at risk for bankruptcy is crucial in preparing to hedge against any financial damage the at-risk firms stand to inflict. Some pre-alarm signals that indicate a potential financial crisis exist when a firm faces a default risk. Early studies on corporate bankruptcy prediction include parametric and nonparametric approaches, such as artificial intelligence (AI), for detecting pre-alarm signals. Among nonparametric techniques, the methods involving support vector machine (SVM) have shown potential in predicting corporate bankruptcy. We propose a hybrid method that combines data depths and nonlinear SVM for the prediction of corporate bankruptcy. We employed data depth functions to condense multivariate financial data with nonlinear and non-normal characteristics into one-dimensional space. The SVM method was introduced to classify the data points on a depth versus depth plot (DD-plot). Based on data set that records failed and non-failed manufacturing firms in Korea over 10 years, the empirical results demonstrated that the proposed method offers a higher level of accuracy in corporate bankruptcy prediction than existing methods. The proposed method is expected to provide a guidance in corporate investing for investors or other interested parties.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e480ba9b6cde0b5c09dd71492cbe0aa3",
  "timestamp": "2025-05-15T01:49:04.564834"
}