{
  "id": 5588,
  "title": "Shrinking the capital costs and beta risk impediments through ESG: study of an emerging market",
  "abstract": "PurposeThis study aims to empirically examine environment, social, and governance (ESG) as an effective strategy to reduce major impediments for a corporation in the form of costs of capital (COC) and systematic risk, especially for emerging markets such as India.Design/methodology/approachA sample of 114 Indian firms from eight prominent industries based on Thomson Reuters classification (TRBC) are used in the study. A panel regression with industry-fixed effects is carried out to account for industry heterogeneity. For robustness, the authors also carry out a matched sample analysis.FindingsThe authors observe a negative and significant relationship between ESG performance with COC and systematic risk, respectively. For the pillar-wise analysis, the authors observe that only governance performance is negatively and significantly related to COC whereas the environmental and social performances are negative and insignificant. For ESG pillar level analysis for beta, the authors observe that all pillars are negative and significant, thus making a case for how firms can fine-tune their ESG strategies according to each pillar.Research limitations/implicationsAs the ESG concept is still in a very nascent stage, data availability is a definite challenge in India.Practical implicationsAs ESG is increasingly becoming relevant for multiple stakeholders, this study aims to provide evidence that can potentially guide the regulators, practitioners, and academicians to address the contemporary needs of these stakeholders, while also doing good for the firm in the traditional sense.Social implicationsThe transition to a sustainable economy is a challenge for emerging economies, especially for a country like India where stakeholders are not only varied but also huge in number. With this study's contribution towards an incremental understanding of ESG, Indian regulators and policymakers can bring forward mandates as to ESG compliances that are rewarding for the firms and give them enough impetus towards complying with ESG norms.Originality/valueThe extant literature on ESG majorly discusses the relationship between ESG performance and financial performance. This study addresses the lacuna of the relationship of ESG with COC and beta in the Indian context.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e4906fc51bb4e05ba1e3c7afab682eac",
  "timestamp": "2025-05-15T02:49:21.694767"
}