{
  "id": 8024,
  "title": "Measuring Emergency Care Survival: The Implications of Risk Adjusting for Race and Poverty",
  "abstract": "ObjectivesWe determined the impact of including race, ethnicity, and poverty in risk adjustment models for emergency care-sensitive conditions mortality that could be used for hospital pay-for-performance initiatives. We hypothesized that adjusting for race, ethnicity, and poverty would bolster rankings for hospitals that cared for a disproportionate share of nonwhite, Hispanic, or poor patients. MethodsWe performed a cross-sectional analysis of patients admitted from the emergency department to 157 hospitals in Pennsylvania with trauma, sepsis, stroke, cardiac arrest, and ST-elevation myocardial infarction. We used multivariable logistic regression models to predict in-hospital mortality. We determined the predictive accuracy of adding patient race and ethnicity (dichotomized as non-Hispanic white vs. all other Hispanic or nonwhite patients) and poverty (uninsured, on Medicaid, or lowest income quartile zip code vs. all others) to other patient-level covariates. We then ranked each hospital on observed-to-expected mortality, with and without race, ethnicity, and poverty in the model, and examined characteristics of hospitals with large changes between models. ResultsThe overall mortality rate among 170,750 inpatients was 6.9%. Mortality was significantly higher for nonwhite and Hispanic patients (adjusted odds ratio [aOR]= 1.27, 95% confidence interval [CI]= 1.19-1.36) and poor patients (aOR= 1.21, 95% CI= 1.12-1.31). Adding race, ethnicity, and poverty to the risk adjustment model resulted in a small increase in C-statistic (0.8260 to 0.8265, p=0.002). No hospitals moved into or out of the highest-performing decile when adjustment for race, ethnicity, and poverty was added, but the three hospitals that moved out of the lowest-performing decile, relative to other hospitals, had significantly more nonwhite and Hispanic patients (68% vs. 11%, p<0.001) and poor patients (56% vs. 10%, p<0.001). ConclusionsSociodemographic risk adjustment of emergency care-sensitive mortality improves apparent performance of some hospitals treating a large number of nonwhite, Hispanic, or poor patients. This may help these hospitals avoid financial penalties in pay-for-performance programs.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e49a378b527d8ebfc118e4b004e90b00",
  "timestamp": "2025-05-15T03:14:37.281553"
}