{
  "id": 7400,
  "title": "Prevalence of mental health symptoms and its effect on insomnia among healthcare workers who attended hospitals during COVID-19 pandemic: A survey in Dhaka city",
  "abstract": "Background: During the COVID-19 pandemic, the high workload, risk of infection, and safety issues for family members may pose a threat to the mental health of healthcare workers (HCWs) working in hospital settings. The study aimed to find out the prevalence of anxiety, depression, and insomnia symptoms were among HCWs, as well as the factors related to these mental health issues. Methods: We conducted an online survey of HCWs employed in Dhaka city from June 6 to July 6, 2020. Symptoms of anxiety, depression, and insomnia were measured using the Generalized Anxiety Disorder, the depression module of the Patient Health Questionnaire, and the Insomnia Severity Index, respectively. The related factors of anxiety, depression, and insomnia symptoms were identified using three regression models. Results: This research included responses from 294 HCWs (mean +/- standard deviation age: 28.86 +/- 5.5 years; 43.5% were female). Anxiety, depression, and insomnia symptoms were found in 20.7%, 26.5%, and 44.2% of HCWs, respectively. The variable financial difficulties was commonly found as an associated factor for anxiety, depression, and insomnia symptoms. Female HCWs were more prone to mental health symptoms and insomnia compared to male HCWs (Adjusted odds ratio- AOR = 2.20, 95% CI = 1.27-3.79). The depression symptoms among HCWs were found to be a factor for insomnia (AOR = 6.321, 95% CI = 3.158-12.650). Conclusion: In the current pandemic, the high prevalence of mental health symptoms among HCWs indicates that this occupational group being associated with increased mental distress. Increasing financial support for HCWs and providing support to female workers in care facilities could help to alleviate the burden of mental illness. Supportive, training, and educational strategies, particularly through knowledge and communication platforms, could be recommended to the care facilities, which can reduce the burden of mental health symptoms among HCWs.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e4a92fe311ae530368eb9469734a9322",
  "timestamp": "2025-05-15T03:08:00.866787"
}