{
  "id": 5332,
  "title": "An eight-year retrospective study of hydatid disease (Echinococcus granulosus sensu stricto) in beef cattle slaughtered at an Australian abattoir",
  "abstract": "A retrospective study was conducted on 1,178,329 cattle slaughtered at an eastern Australian abattoir between 2010 and 2018. The data were searched for records in which a diagnosis of hydatid disease was made by routine meat inspection and apparent prevalence was calculated. True prevalence of hydatid disease in any organ was then estimated using previously reported sensitivity and specificity for diagnosis of hepatic hydatid disease by routine meat inspection. Mixed effects logistic regression was conducted to assess putative associations between dentition (age), sex, and feed-type (grass- or grain-fed), and hydatid disease reported at slaughter, with origin (Property Identification Code [PIC] region) included as a random effect. Regression was also conducted on subsets stratified by dentition and feed-type to account for measurement bias resulting from differences in sensitivity and specificity between groups of cattle. Discrete-Poisson models (SaTScan, v.9.5) were used to detect spatio-temporal clustering of hydatid-positive cattle within PIC regions. The apparent prevalence of hydatid disease reported in any organ was 8.8% (n = 104,038; 95% confidence interval [CI] 8.8-8.9%). The liver, lungs, heart, spleen, and kidneys were reported infected with hydatid cysts. Of cattle reported infected with hydatid cysts, 75.6% had both the liver and lungs reported infected. True prevalence was estimated to be 33.0% (95% CI 24.4-44.4%). Significant interaction between dentition and feed-type was identified. Risk of reported hydatid disease was highest in both eight-tooth grass- and eight-tooth grain-fed cattle (OR 17.5, 95% CI 17.0-18.1, reference level [ref] zero-tooth; OR 4.8, 95% CI 4.4-5.2, ref zero-tooth, respectively). Sex was also significantly associated with reported cases of hydatid disease at slaughter, with the highest odds in females (two-tooth group, OR 1.2, 95% CI 1.1-1.2, ref male). Three spatio-temporal clusters of hydatid-positive regions were identified. The most likely cluster was located in north eastern New South Wales from June 2012 to September 2015 (log likelihood ratio 4774, P < 0.001). This study indicates a higher prevalence of hydatid disease than previously recognised and demonstrates that an effect of sex cannot be ruled out. The identification of clusters could indicate periods when hosts of Echinococcus were more abundant, or localised climatic events that facilitated transmission to cattle. Given the high prevalence, the financial impact of hydatid disease on the Australian beef industry and risk factors associated with variation in spatial distribution should be determined to target interventions.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e4b7129ca185f36f70f90b48ffe652c7",
  "timestamp": "2025-05-15T02:46:44.897827"
}