{
  "id": 9046,
  "title": "Association of Single Nucleotide Polymorphisms of Interleukins-1β,-6, and-12B with Contact Lens Keratitis Susceptibility and Severity",
  "abstract": "Purpose: To investigate whether single nucleotide polymorphisms (SNPs) in interleukin (IL)-1 beta, IL-6, and IL-12 beta are associated with the susceptibility and severity of contact lens-related keratitis. Design: Retrospective, case control study. Participants: One hundred twelve cases of keratitis and 225 controls were recruited from studies conducted at Moorfields Eye Hospital and in Australia during 2003 through 2005. Methods: Buccal swab samples were collected on Whatman FTA cards and were mailed by post for analysis. IL-1 beta (-31), IL-6 (-174, -572, -597), and IL-12B (3' + 1158) genotypes were analyzed with pyrosequencing and analyzed using a regression model for susceptibility (sterile, microbial keratitis, controls) and severity. Statistical significance was set at 0.05. Main Outcome Measures: The relative risk of developing contact lens-related keratitis and more severe forms of the disease based on allele, genotype, and haplotype associations. Results: Carriers of IL-6 SNPs were more likely to experience moderate and severe events compared with those with nonmutated genotypes (-174 heterozygous: odds ratio [OR], 3.1; 95% confidence interval [CI], 1.1-8.3; homozygous: OR, 6.4; 95% CI, 1.4 -28.4; -174/-597: OR, 4.1; 95% CI, 1.6 -11.0). More severe keratitis and microbial keratitis were less likely to occur in wearers with the nonmutated IL-6 haplotype (severity OR, 0.4 [95% CI, 0.2-0.7]; microbial OR, 0.6 [95% CI, 0.4-0.9]). Wearers carrying an IL-12B SNP had an increased risk of sterile keratitis (OR, 9.7; 95% CI, 1.2-76.9) compared with controls. Conclusions: The IL-6 SNPs are known to reduce protein expression of this cytokine and thus ocular immune defense, and carriers of these SNPs were more likely to experience more severe and microbial keratitis, suggesting that IL-6 decreases the severity and susceptibility of contact lens-related keratitis. Carriers of a functional SNP of IL-12B that is known to increase IL-12 expression and stability are more likely to experience sterile keratitis, suggesting that this is associated with the intense inflammatory reaction that occurs in this condition. Financial Disclosure(s): The authors have no proprietary or commercial interest in any of the materials discussed in this article. Ophthalmology 2012;xx:xxx (C) 2012 by the American Academy of Ophthalmology.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e4b8ccda63a14d685bf7be170250dffe",
  "timestamp": "2025-05-15T03:24:54.939377"
}