{
  "id": 6884,
  "title": "The Moderating Role of Policy Intervention on the Relationship of Environment, Social, and Governance (ESG) and Cost of Equity Capital: A Study in Basic Materials Companies in Asia",
  "abstract": "Environment, Social, and Governance (ESG) disclosure is a non-financial disclosure that is expected to enhance firms' transparency, ease estimation of risk, hence lower cost of equity (CoE). However prior studies show mixed results. Using Institutional theory, this paper argues that sustainability policy intervention could have a different effect. However, this framework expects that the more ESG disclosure, the higher firms' cost of equity (CoE) due to shareholders' perception of mindless ESG plan. The policy intervention examined is government regulation of mandatory sustainability practices. This study uses a sample of 98 basic materials sector companies in eleven Asia countries with 5 years study period from 2017-2021 as a research sample. Using panel-data regression analysis, this study finds that there is a positive relationship between ESG scores and CoE. Moreover, the government policy strengthens such a relationship. Therefore, consistent with coercive mechanism in institutional theory, we conclude that mandatory sustainability disclosure in the Asian Basic material sector companies increases firms' CoE and the existence of mandatory regulation strengthens such a relationship.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e4e1e0f3390fa76e8d4a361e84308481",
  "timestamp": "2025-05-15T03:02:41.242670"
}