{
  "id": 4432,
  "title": "The Concept of Restoration of the Leading Role of the Global Financial System in Activation of Growth and Development of the Global Economy",
  "abstract": "The purpose of the work is to determine the difference in the role of the global financial system in provision of growth and development of the global economy before and after the 2008 global crisis and to develop the concept of restoration of the leading role of the global financial system in activation of growth and development of the global economy. The methods of regression analysis are used by determining dependencies between the indicators of development of the financial system - the volume of the global stock market and the volume of direct global foreign investments - and the indicator of the global economy's growth - global GDP per capita. The research is performed for 1998-2007 (before the crisis) and for 2008-2017 (after the crisis) based on statistical data of the World Bank. As a result, it is concluded that the global financial system, which is a platform for movement of direct foreign investments and functioning of the stock market, performed strong positive influence on growth of global GDP per capita before the 2008 crisis. After the crisis, this influence became statistically insignificant. In order to restore the leading role of the global financial system in activation of growth and development of the global economy, the authors' concept is offered for modernization of this system in the aspect of reduction of its risk component and activation of its innovational development.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e4f479809d00be529df165785710e7a9",
  "timestamp": "2025-05-15T02:37:16.811318"
}