{
  "id": 1797,
  "title": "An in-depth investigation of five machine learning algorithms for optimizing mixed-asset REITs",
  "abstract": "Real estate is a favored investment option as it allows investors to diversify their portfolios and minimize risk. Investors can invest in real estate directly by purchasing a property, or through real estate investment funds (REITs) where they can purchase shares in companies that own and manage real estate. Investing in REITs has become increasingly popular because it eliminates some of the disadvantages associated with direct real estate investment, such as the need for a large upfront payment. When investing in mixed asset portfolios, it is crucial to predict future prices accurately to ensure profitable and less risky asset allocation. However, literature on price prediction often focuses on only one or two algorithms, and there is no research that explores REITs' price prediction in the context of portfolio optimization. To address this gap, we conducted a thorough evaluation of 5 machine learning algorithms (ML), including Ordinary Least Squares Linear Regression (LR), Support Vector Regression (SVR), k-Nearest Neighbors Regression (KNN), Extreme Gradient Boosting (XGBoost), and Long/Short-Term Memory Neural Networks (LSTM), as well as other financial benchmarks like Holt's Exponential Smoothing (HES), Trigonometric Seasonality, Box-Cox Transformation, ARMA Errors, Trend, and Seasonal Components (TBATS), and Auto-Regression Integrated Moving Average (ARIMA). We applied these algorithms to predict future prices for 30 REITs from the US, UK, and Australia, as well as 30 stocks and 30 bonds. The assets were then used as part of a portfolio, which we optimized using a genetic algorithm. Our results showed that using ML algorithms for price prediction provided at least three times the return over benchmark models and reduced risk by almost two-fold. For REITs, we observed that the use of ML algorithms led to a higher allocation to REITs diversified by country. In particular, our results showed that SVR was the best-performing algorithm in terms of risk-adjusted returns across different time horizons, as confirmed by our Friedman test results (Sharpe ratio). Overall, our study highlights the effectiveness of ML algorithms in predicting asset prices and optimizing portfolio allocation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5045c47de4f2693e101e886ec85f9ba",
  "timestamp": "2025-05-15T02:07:25.754617"
}