{
  "id": 2481,
  "title": "Thematic Analysis of Financial Technology (Fintech) Influence on the Banking Industry",
  "abstract": "The synthesis of technology and finance is known as financial technology (Fintech), which brings together two of the biggest industries in harmony. Fintech disruption is a deviation from the norm, resulting in a significant shift in banking services and, as a result, risk. This article aims to investigate how Fintech has influenced recent changes in the banking industry and upcoming challenges, with a particular emphasis on blockchain technology. We perform a comprehensive thematic analysis of recent studies on Fintech in the banking industry. We found that Fintech has enormous potential to grow and impact the banking industry and the entire world. The banking industry could benefit from combining emerging technologies such as blockchain, AI, machine learning, or other decision-making layers. However, with the benefits come drawbacks, such as increased reliance on technology, high costs, increased job losses, security risks related to data and fraud, and so on. The use of emerging technology and collaboration between Fintech firms and banks can improve system-wide financial stability while minimising the negative externalities of disruption and competition. These findings can help regulators, policymakers, academics, and practitioners understand the opportunities and challenges of emerging technologies in the banking industry.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e505839072e0b8b7273c5ce1a759a12b",
  "timestamp": "2025-05-15T02:15:59.833133"
}