{
  "id": 6558,
  "title": "EXTERNAL DEBT FINANCING AND REAL EARNINGS MANAGEMENT: EVIDENCE FROM MALAYSIAN FAMILY GROUP AFFILIATION",
  "abstract": "The role of external debt in an emerging country with highly concentrated ownership is expected to raise the expropriation risk by the controlling shareholders as wider separation between cash flow and control rights might increase borrowing cost. This study investigates external debt financing role in exacerbating real earnings management (REM) in family group affiliation firms with complex pyramidal structure. A sample of 1,170 firm-year observations was collected covering 2006 until 2015. The Hausman test was used to determine the estimation method of fixed and random effects regression of each REM activity of the suspected firms towards short-term debt (STD) and long-term debt (LTD). We found a significant positive relationship between STD and REM. STD might motivate stringent monitoring by lenders and encourage family firms to manipulate earnings, possibly to avoid violating debt covenants and to portray healthy financial conditions to mask their entrenchment behavior. We have also found less manipulation of REM with LTD, as lack of tight monitoring by lenders might less likely trigger earnings manipulation. This study provides additional input to users of financial information in making informed decisions. This study, however, only documents the results in family group affiliation firms. Hence, causality of debt in non-family group affiliation firms also requires further theoretical and empirical examination. We argue that this is the first study to examine external debt financing effect on REM in family group affiliation firms in Malaysia.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e51f1d80a9668f6048ee2cfc9d9bf599",
  "timestamp": "2025-05-15T02:59:07.621534"
}