{
  "id": 7099,
  "title": "The role of insurance in the social-economic system",
  "abstract": "The article considers the position and meaning of insurance in the social-economic system of Russia. Insurance is associated primarily with protection of the property interests under risky events. There is a large classification of risks, which is closely related to the insurance institution, and the authors analyze some types of risks providing relevant contemporary examples. Insurance is a means of the risk management system; however, the current economic, political, and social situation has a direct impact on the insurance system. Thus, in periods of instability, insurance companies have to adapt to the economic situation and financial possibilities of people to purchase insurance products. Insurance as a type of activity performs two groups of functions - economic and social. The main task of insurance is to implement effective measures of insurance protection from risky events. The article also considers activities of insurers in Russia from 2012 to 2018: the number of insurance companies, the authorized capital, the peak volume of foreign deposits, insurance payments, reinsurance operations, etc. The authors present two types of insurance - voluntary and compulsory - and consider the features of each type. The data of sociological surveys allows to analyze these features and to identify the role of voluntary and compulsory insurance in the social-economic system (tasks, functions, and so on).",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e525f21bf54ea5104e80c2fd56a6c536",
  "timestamp": "2025-05-15T03:05:03.532877"
}