{
  "id": 2200,
  "title": "Methodological Planning to Determine the Technological Expansion of Smart Metering Systems for Utilities",
  "abstract": "This research uses data analysis and mining techniques to determine the technological expansion of measurement systems in a public service company. It integrates technical, economic, geographic, and social variables into the analysis using machine learning techniques to discover patterns and relationships in large data sets. The fuzzy logic methodology is applied using the MATLAB programming tool Fuzzy Logic to build algorithms that allow for the correct selection of measurement, achieving greater efficiency and precision in the assignment of meter types. The results show that 98% of the metering systems in the significant part are electronic meters, with the Residential BT rate being the most extensive data set. Implementing the fuzzy logic technique recognizes that more than 60% of the meters are electronic, with the registration of active energy, reactive energy, and demand, allowing for greater control over the marketing variables of the distribution system operator. This research suggests that a future restructuring of electrical metering systems benefits the company and its users. By applying the analysis, a portfolio of viable projects for the replacement of measurement systems is obtained, and they are grouped into two clusters based on the total cost of the technological change.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e54152475588dd88218fb9722fdd7f61",
  "timestamp": "2025-05-15T01:04:27.402228"
}