{
  "id": 1245,
  "title": "Comparison Analysis of Machine Learning Algorithms to Rank Alzheimer's Disease Risk Factors by Importance",
  "abstract": "People have always feared aging, and the increasing rate of dementia disease caused this fear to twofold. Dementia is irreversible, unstoppable and has no known cure. According to Alzheimer's Disease International 2015 and World Alzheimer Report 2015, the estimated financial cost for healthcare services of Alzheimer's Disease is $1 Trillion in 2018. This paper discusses the importance of investigating Alzheimer's Disease using machine learning, the need to use both behavioural and biological markers data, and a computational method to rank Alzheimer's Disease risk factors by importance using different machine learning models on Alzheimer's Disease clinical assessment data from ADNI. The dataset contains Alzheimer's Disease risk factors data related to medical history, family dementia history, demographical, and some lifestyle data for 1635 subjects. There are 387 normal control, 87 significant memory concerns, 289 early mild cognitive impairment, 539 late mild cognitive impairment and 333 Alzheimer's Disease subjects. We deployed different machine learning models on the dataset to rank the importance of the variables (risk factors). The results show that some risk factors in subjects genetically, demography and lifestyle are more important than some medical history risk factors. Having APOE4, education level, age, weight, family dementia history, and type of work rank as more influential among Alzheimer's Disease subjects.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5471c47f59c129d9519a237b240993b",
  "timestamp": "2025-05-15T02:00:30.592697"
}