{
  "id": 2846,
  "title": "An empirical evaluation of international capital flows for developing countries",
  "abstract": "Flows of international capital to developing countries have fluctuated substantially over the last three decades. Empirical evidence concerning the main causes of international capital flows is, in general, mixed. There is strong support for the 'push' view that external factors have been important in driving capital inflows to emerging markets. However, the apparent importance of 'push' factors does not preclude the relevance of 'pull' phenomena. 'Pull' factors may be necessary to explain the geographic distribution of capital flows over time. During 1970-1990, international capital flows were mainly in the form of bank lending directed to governments and/or to the private sector. In the 1990s, capital flows took the form of foreign direct investment (FDI) and portfolio investment (PI), including bond and equity flows. The purpose of the paper is to examine the nature of foreign direct investment and portfolio investment, both of which help to finance investment and stimulate economic growth in the developing world. A quantitative classification of empirical international capital flows models forms the database for the paper. After classifying and describing the data, various theoretical and empirical model specifications used in the literature are reviewed analytically and empirically. A comparison of trends and volatilities in international capital flows for nine representative developing countries is given for 1977-2001. (C) 2003 IMACS. Published by Elsevier B.V. All rights reserved.",
  "year": 2004,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5479d555aec144ac27ad93ad1b1a2e2",
  "timestamp": "2025-05-15T01:11:17.304204"
}