{
  "id": 7524,
  "title": "Socioeconomic Vulnerability to Depressive Symptoms in Patients with Chronic Hepatitis B",
  "abstract": "Depression is considered one of the most prevalent psychiatric disorders among patients with hepatitis B virus (HBV)-related liver disease and has adverse effects on the disease progression. However, there is a scarcity of studies contributing to the assessement of depression in hepatitis B patients. There is also little research into risk factors, particularly underlying socio-economic factors in Vietnam where the prevalence of hepatitis B is high. This study aimed to examine depression and identify whether differences in socio-economic status is related to the level of depression amongst chronic hepatitis B patients. A cross-sectional study was conducted on 298 patients with chronic hepatitis B at The Chronic Hepatitis Clinic in the Viet-Tiep Hospital, Hai Phong, Vietnam. The Patient Health Questionnaire-9 (PHQ-9) and EuroQol-5 dimensions-5 levels (EQ-5D-5L) were used to assess the severity of depression and health-related quality of life (HRQOL). Of chronic hepatitis B patients, 37.5% experienced depressive symptoms and most of them suffered minimal depressive symptoms (31.4%). According to the result of the multivariate logistic regression model, we found that higher age, lower income level, unemployement, living with spouse/partners were positively associated with having depression. Furthermore, having physical health problems and lower health-related quality of life were also related to a higher risk of depression. We recommend family support, financial support and active participation in consultation should be conducted during treatment to improve the quality of life and the emotional state of HBV patients.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e54b4d1162c8210deb706f1492246c51",
  "timestamp": "2025-05-15T03:09:36.860047"
}