{
  "id": 2442,
  "title": "Energy efficiency and country's level risk: evidence from China's targeting COP26",
  "abstract": "Country risk, encompassing political, economic, and financial dimensions, represents a burgeoning area of research in contemporary academia. However, its relation with energy technology remains relatively unexplored. Unlike previous studies, the current study enhances the extant literature by investigating the influence of political, economic, and financial risk factors, in addition to GDP, on energy technology advancements within the context of China from 1990 to 2021. The authors employ time series data and select the most suitable econometric techniques for analyzing long-term relationships, such as quantile regression. This approach allows them to track the evolution of these variables, thereby offering valuable empirical insights. The study's main findings are as follows: The Johansen cointegration tests confirm the existence of a long-run relationship among the variables under consideration. Furthermore, the quantile regression shows that political and economic risks reduce energy technology. In contrast, other variables, such as financial risk and GDP contribute positively to developing energy technology within the Chinese economy. These findings offer valuable insights for policymakers emphasizing the need to mitigate political and economic risks to facilitate future investment in energy technology.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e54ce634255aa050e86a47bf11e62e17",
  "timestamp": "2025-05-15T02:15:27.048733"
}