{
  "id": 7141,
  "title": "Childhood Leukemia Survival in the US-Mexico Border: Building Sustainable Leukemia Care Using Health Systems Strengthening Models",
  "abstract": "PURPOSE Pediatric leukemia outcomes are poor in most low- and middle-income countries (LMICs) and exacerbated by health care systems ill equipped to manage cancer. Effective leukemia management in LMICs involves curating epidemiologic data; providing health care workforce specialty training; developing evidence-based treatments and supportive care programs; safeguarding access to medications and equipment; providing patient and family psychosocial, financial, and nutritional support; partnering with nongovernmental organizations, and ensuring treatment adherence. METHODS In 2013, through a partnership between North-American and Mexican institutions, we used the WHO Framework for Action, a health systems strengthening model to implement a leukemia care sustainable program aimed at improving acute lymphoblastic leukemia (ALL) outcomes at a public hospital in Mexico. We prospectively assessed clinical features, risk classification, and survival outcomes in children with ALL at Hospital General-Tijuana from 2008 to 2012 (preimplementation) and from 2013 to 2017 (postimplementation). We also evaluated program sustainability indicators. RESULTS Our approach led to a fully-staffed leukemia service, sustainable training programs, evidence-based and data-driven projects to improve clinical outcomes, and funding for medications, supplies, and personnel through local partnerships. Preimplementation and postimplementation 5-year overall survival for the entire cohort of children with ALL, children with standard-risk ALL, and children with high-risk ALL improved from 59% to 65% (P = .023), 73% to 100% (P < .001), and 48% to 55% (P = .031), respectively. All sustainability indicators improved between 2013 and 2017. CONCLUSION Using the health systems strengthening WHO Framework for Action model, we improved leukemia care and survival in a public hospital in Mexico across the US-Mexico border. We provide a model for the development of similar programs in LMICs to sustainably improve leukemia and other cancer outcomes.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e55f1379710c9a1a602547fc5f4c4d4b",
  "timestamp": "2025-05-15T03:05:32.067807"
}