{
  "id": 2807,
  "title": "Analysis of the Regulatory Science Applied to a Single Portfolio of Eight Biosimilar Product Approvals by Four Key Regulatory Authorities",
  "abstract": "Slow uptake of biosimilars in some regions is often attributed to a lack of knowledge combined with concerns about safety and efficacy. To alleviate physician and patient apprehensions, regulatory reviews from four major regulatory authorities (RAs) (European Medicines Agency, US Food and Drug Administration, Health Canada, and Japan Pharmaceuticals and Medical Devices Authority) across a portfolio of eight biosimilars were analyzed to provide insight into RA review focus and approach. RA queries were evaluated in an unbiased and systematic manner by major classification (Chemistry, Manufacturing and Controls [CMC], nonclinical, clinical or regulatory) and then via detailed sub-classification. There was a consistent, predominant focus on CMC from all RAs. The review focus based on sub-classification of clinical and regulatory queries was influenced by molecular complexity, with significant differences between categories (monoclonal antibody or protein) in the distribution of query topics; specifically, bioanalytical (p = 0.023), comparative safety and efficacy (p = 0.023), and statutory (including the justification of extrapolation) (p = 0.00033). Each biosimilar had a distinct distribution of clinical query topics, tailored to product-specific data. This analysis elucidated areas of heightened RA interest, and validated their application of regulatory science in the evaluation of biosimilar safety and efficacy.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e562fd2f5bd3cb9b5ac684dc11c80342",
  "timestamp": "2025-05-15T01:10:49.485839"
}