{
  "id": 4806,
  "title": "Financial statement fraud litigation, material weaknesses, and board characteristics",
  "abstract": "PurposeThe purpose of this study is to investigate whether the likelihood that a firm will face financial statement fraud litigation is affected by the disclosure of internal control material weaknesses (MW) and the busyness of a firm's board of directors. Design/methodology/approachThe results are derived from logistic regression models and data are collected from the Audit Analytics database augmented by data from CompuStat, the Stanford Law School website and the SEC Accounting and Auditing Enforcement Releases. The authors also test for endogeneity with a propensity score matching procedure. FindingsThe authors find that an MW report is strongly associated with the likelihood of subsequent financial statement fraud litigation, and that the influence of entity-level MW on litigation likelihood is stronger than that of account-level MW. Moreover, the number of outside board directorships significantly increases the influence of entity-level MW on the likelihood of litigation, indicating that board of directors' busyness significantly increases the risk of litigation. Originality/valuePrevious research notes that board members holding multiple directorships cannot effectively oversee the financial reporting process and, thus, are associated with poorer governance. The authors extend this implication of board busyness to the association between disclosure of MW type and the filing of subsequent litigation alleging financial statement fraud. To the best of the authors' knowledge, no other research has done so.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e56d22a30d2b2ee509464203b57fb806",
  "timestamp": "2025-05-15T02:41:00.908108"
}