{
  "id": 5958,
  "title": "Choice of Retirement Funds in Chile: Are Chilean Women More Risk Averse than Men?",
  "abstract": "This study examined the investment decisions of women and men in Chile who were contributing to Chile's mandatory defined contribution (DC) retirement plan, using a large survey of participants (2782 people) conducted in 2009 by Chile's Subsecretariat of Social Protection. The basic research question was whether Chilean women were more risk averse in their retirement investment decisions than Chilean men. Chile's retirement plan offers a default plan for those who do not want to manage their funds. For those wishing to manage their investments, it offers five funds varying in risk from an all bond fund to a fund that is primarily stocks. There was no significant difference in the percentage of men and women choosing the default funds. We used probit analysis to determine what demographic factors affected the choice of the default fund, and found that younger people and men with less education and less income were more likely to choose the default; only age was significant for women. We found no significant gender differences in the fund choices of active investors. We conducted linear regression analysis by gender, where the dependent variable was the fund, with fund 1 having the lowest risk and fund 5 having the highest risk. We found that that the risk taking decreased with age and increased with financial knowledge, psychological risk tolerance, income and unemployment. Chilean women and men seemed similar in their investment decisions.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5817b1e0d1f01e7fd924795bdd11708",
  "timestamp": "2025-05-15T02:53:03.195842"
}