{
  "id": 8603,
  "title": "Factors contributing to hospital readmission in a Hong Kong regional hospital - A case-controlled study",
  "abstract": "Background. As many as 50% of total hospital admissions are readmissions. Because the factors contributing to hospital readmission are multiple, and research findings are not conclusive, it is important for clinicians to gain an understanding of the key factors that contribute to readmission. Objectives: This study explores the factors contributing to hospital readmission and derives an explanatory model that can best identify characteristics of patients at high risk for hospital readmission. Methods: This research was a case-controlled study with readmitted patients (n = 168) as the readmitted group and non-readmitted patients (n = 98) as the control group. The variables included demographic data, health assessment data, medical diagnosis, frequency of admissions, severity of illness, intensity of service and improvement of condition. The study sample was also interviewed to explore the patients' views on their repeated hospitalization. Results: In the bivariate analysis significant differences between the study and control groups were multiple and generally consistent with findings in other studies. Using multiple logistic regression, however, the final model shows that only three factors best predict readmissions: frequency (3-4 times) of readmissions (OR = 9.96, p < .0001) and frequency (more than 5 times) of readmissions (OR = 15.73, p < .0001), financial assistance (OR = 5.03, p < .001), and severity of illness (OR 3.12, p < .01). Our interview data suggest that the readmitted patients required assistance to accomplish daily living activities upon discharge and often returned to the hospital for the same health reason. Conclusion: The study findings suggest that patients who are frequently readmitted to the hospital are severely ill; are on public assistance; and may need special attention when discharged in order to attenuate repeated hospital readmission.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e58ec7b81551f7e780098947640b6a0b",
  "timestamp": "2025-05-15T03:20:22.367136"
}