{
  "id": 4145,
  "title": "The impact of mutual funds' ESG scores on their financial performance during the COVID-19 pandemic. A data envelopment analysis",
  "abstract": "PurposeThe purpose of this study is to evaluate the performance of mutual funds during the COVID-19 pandemic with environmental, social and governance (ESG) criteria. The main research question is whether mutual fund performance differs with respect to the level of the mutual fund's ESG score. Design/methodology/approachThe data set contains global fund data, and mutual fund performance is analyzed using two types of data envelopment analysis (DEA) models: the DEA portfolio index (DPEI) and the range direction measure (RDM) DEA. Propensity score matching and logistic regression are also applied. FindingsThe results reveal that: nonequity mutual funds present significantly higher performance compared to the performance of equity mutual funds; mutual funds with high ESG scores are associated with significantly higher performance compared to those with low to medium ESG scores; funds with high ESG scores experience higher performance irrespective of their type; and efficiency scores derived from the RDM DEA are significantly higher than those derived from the DPEI model. Research limitations/implicationsInvestors, fund managers and market participants can benefit from the findings of this study and improve their investment decision-making process, including more sustainable funds in their portfolios. Regulators and policymakers should further promote or even require the inclusion of more sustainable investments in the financial products offered by institutional investors. The main limitation of the study is related to data availability regarding the ESG score of mutual funds. Originality/valueTo the best of the authors' knowledge, this is the first study that provides robust evidence in support of a positive association between ESG scores and mutual fund performance during the pandemic-induced crisis applying a DEA methodology.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5a6a613075c537d876fa658db5a3570",
  "timestamp": "2025-05-15T01:24:25.320485"
}