{
  "id": 301,
  "title": "OPTIMIZED DEEP LEARNING MODEL ARCHITECTURE FOR THE FEATURE EXTRACTION TO PREDICT TREND IN STOCK MARKET",
  "abstract": "Predicting stock trends is a complex task influenced by various factors such as market sentiment, economic indicators, and company performance. Analysts often employ technical analysis, studying historical price patterns and trading volumes, as well as fundamental analysis, assessing financial statements and industry trends. Deep Learning models have also gained popularity for predicting stock trends, using algorithms to identify patterns and relationships in large datasets. Deep learning algorithms, particularly neural networks, excel at recognizing intricate patterns and relationships within complex datasets, making them well-suited for predicting stock prices, identifying trends, and managing risk. Hence, this paper proposed a Bird Swarm Optimization ARIMA LSTM (BSO-ARIMA-DL) model for stock trend prediction. The proposed BSO-ARIMA-DL model performance is applied in the company datasets Apple, Amazon, and Infosys for stock trend prediction. With the proposed BSO-ARIMA-DL model features are optimized for the identification of features in the dataset for the evaluation of optimal features. Upon the estimation of features, the ARIMA model with the LSTM architecture is implemented for the stock trend analysis. The proposed BSO-ARIMA-DL model deep learning model is implemented for the stock trend prediction in the companies. The results demonstrated that the proposed BSO-ARIMA-DL model exhibits a minimal error of similar to 10% minimal to the conventional ARIMA model.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5af9018720ad91d45311e450dcf3b60",
  "timestamp": "2025-05-15T01:36:22.065628"
}