{
  "id": 1945,
  "title": "Will cultural and regulatory forest services provide enough balance to provisioning services in forest enterprise portfolios in future? Marketing case studies of selected forest enterprises in Slovakia",
  "abstract": "The study aims to identify the difference between the current and future strategic management of forest ecosystem services (FES) portfolios in public enterprises of Slovakia. The case studies focus on forest enterprises in Kosice, Bansk & aring; gtiavnica, Kremnica, and Bratislava, representing the best practice examples of providing cultural services in the country. A marketing decision-making model, Boston Consulting Group (BCG) matrix, was used to analyse each company's current FES portfolio. Content analysis assessed the data collected from interviews with managers of the public forest enterprises. Duncker's forest management approaches classification was applied to evaluate the future strategic management of the FES portfolio, and a horizon of 10 years was set. According to the results, the urban forest enterprise in Bratislava is an example of receiving a subsidy from the capital for building and reconstructing recreational facilities. Therefore, this FES portfolio is and will be the most balanced. The portfolio of the forest enterprises in Kosice, Kremnica, and Bansk & aring; gtiavnica will remain unchanged for the next decade, and they plan to use a combination management approach that caters to economic, ecological, and social needs and objectives. Urban forests in Bratislava will focus even more on close-to-nature forestry.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5dacda575b92e3e2d559bc7424bccf7",
  "timestamp": "2025-05-15T01:01:41.575922"
}