{
  "id": 8577,
  "title": "Do cash transfers alleviate common mental disorders in low- and middle-income countries? A systematic review and meta-analysis",
  "abstract": "A large literature has demonstrated the link between poverty and mental ill-health. Yet, the potential causal effects of poverty alleviation measures on mental disorders are not well-understood. In this systematic review, we summarize the evidence of the effects of a particular kind of poverty alleviation mechanism on mental health: the provision of cash transfers in low- and middle-income countries. We searched eleven databases and websites and assessed over 4,000 studies for eligibility. Randomized controlled trials evaluating the effects of cash transfers on depression, anxiety, and stress were included. All programs targeted adults or adolescents living in poverty. Overall, 17 studies, comprising 26,794 participants in Sub-Saharan Africa, Latin America, and South Asia, met the inclusion criteria of this review. Studies were critically appraised using Cochrane's Risk of Bias tool and publication bias was tested using funnel plots, egger's regression, and sensitivity analyses. The review was registered in PROSPERO (CRD42020186955). Meta-analysis showed that cash transfers significantly reduced depression and anxiety of recipients (d(pooled) = -0.10; 95%-CI: -0.15, -0.05; p<0.01). However, improvements may not be sustained 2-9 years after program cessation (d(pooled) = -0.05; 95%-CI: -0.14, 0.04; ns). Meta-regression indicates that impacts were larger for unconditional transfers (d(pooled) = -0.14; 95%-CI: -0.17, -0.10; p<0.01) than for conditional programs (d(pooled) = 0.10; 95%-CI: 0.07, 0.13; p<0.01). Effects on stress were insignificant and confidence intervals include both the possibility of meaningful reductions and small increases in stress (d(pooled) = -0.10; 95%-CI: -0.32, 0.12; ns). Overall, our findings suggest that cash transfers can play a role in alleviating depression and anxiety disorders. Yet, continued financial support may be necessary to enable longer-term improvements. Impacts are comparable in size to the effects of cash transfers on, e.g., children's test scores and child labor. Our findings further raise caution about potential adverse effects of conditionality on mental health, although more evidence is needed to draw robust conclusions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5e37f69f4d884d29cde26d8d30e0b04",
  "timestamp": "2025-05-15T03:20:22.192205"
}