{
  "id": 4899,
  "title": "Financial performance and bankruptcy concerns of SMEs in their export decision",
  "abstract": "Research background: Due to having lack of financial power and low amount of revenues, most of SMEs' major concerns are bankruptcy and low financial performance. Those issues are risky situations for SMEs when making for their exporting activities. Therefore, depending on their performance and bankruptcy risk, they might more intensively perceive export barriers and this fact might determine their export decisions.Purpose of the article: This paper examines whether financial performance and bankruptcy concerns of SMEs affect their perceptions of export obstacles or not.Methods: This research performs random sampling method and directs an internet-mediated questionnaire to the selected respondents who are the executives of 408 Czech, Slovakian and Hungarian SMEs. To examine the influences of firm performance and bankruptcy on the percep-tions of export impediments by SMEs, this paper employs Ordinal Logistic Regression Test.Findings & value added: The results show that SMEs having less healthy financial conditions less intensively perceive cultural-linguistic export barriers in comparison with SMEs having better financial performance. Moreover, firm performance is not a predictor variable in the per-ceptions of export costs, legislative and tax-related barriers by SMEs. On the other hand, while SMEs having more bankruptcy concerns more intensively perceive tax-related and cultural -linguistic barriers, bankruptcy concerns of SMEs do not influence their perceptions of export costs and legislative differences. Although many studies have investigated the impacts of finan-cial conditions of SMEs on their internationalization and exporting decisions, they are isolated with only a market or only with a financial issue. The limited extents of those studies cause a partial investigation of export and financial issues of SMEs and make readers having a narrow perspective in this specific area. By focusing on various export obstacles and financial issues that SMEs face in different markets, this research offers a detailed understanding of SMEs' percep-tions regarding their financial conditions and export barriers, from a comprehensive perspective. In this regard, this is the research gap that this paper aims to fill.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5e978c3a631682eed29619a7f23d4de",
  "timestamp": "2025-05-15T02:42:04.911393"
}