{
  "id": 7024,
  "title": "The Influence of Emotions and Social Value Orientation on Risk Tolerance and Sustainable Investment Choices",
  "abstract": "Purpose - The intricacy of the decision-making process has increased due to the inherent uncertainty surrounding investments. Therefore, the study aims to investigate the impact of individuals' Social Value Orientation (SVO), Emotional Instability (EI), and demographic factors on their Financial Risk Tolerance (FRT) levels. Additionally, it aims to investigate whether SVO and EI influence the adoption of socially responsible investment (SRI) funds and the diverse investment choices made by individuals. Methodology - A convenient sampling technique was employed to gather data from 355 Indian retail investors through a structured questionnaire. Subsequently, the collected data was then examined and interpreted using binary logistic regression and chi-square tests facilitated by the SPSS 26 software. Findings - The results emphasize that SVO, EI, Age, Marital status and Gender are significant predictors of investors' FRT. Furthermore, our study unveils that investors with a pro -social mindset are more inclined to invest in SRI funds compared to those who prioritize themselves. Originality - The current study contributes to the existing literature by introducing a novel and unexplored variable, i.e., SVO, for academic consideration in risk tolerance. Moreover, this study imparts a profound understanding of behavioural finance by illuminating the influence of investors' values and emotions on their inclination to embrace risk. Social Implication - By examining investors' preferences and interests in SRI, we gain valuable insight into the growing importance of sustainable funds. This aligns harmoniously with the overarching pursuit of Sustainable Development Goals (SDGs), as these conscientious investment funds scrutinize and eliminate companies that harm society.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5f84e288ef8f6d60b832a8bf9c4aded",
  "timestamp": "2025-05-15T03:04:22.988934"
}