{
  "id": 7753,
  "title": "Mental health profiles of autistic children and youth during the COVID-19 pandemic",
  "abstract": "Objectives Canadian province-wide lockdowns have challenged children's mental health (MH) during the COVID-19 pandemic, with autistic children being at particular risk. The purpose of our study was to identify sub-groups of autistic children with distinct mental health change profiles, to understand the child-, parent-, and system-specific factors associated with such profiles in order to ultimately inform future interventions. Methods Data were drawn from a large Canadian cohort (N=1,570) across Ontario, resulting in 265 autistic children (mean age=10.9 years, 76% male). K-means clustering analyses were employed to partition distinct MH profiles in six MH measures (mood, anxiety, OCD symptoms, irritability, inattention, hyperactivity) and group differences were examined with reference to the above factors. Additionally, we investigated the characteristics of children who accessed acute MH services. Results The optimal number of clusters was two; one included those experiencing MH deterioration across all six MH measures (61.3%, 95% confidence interval [CI]=54.9 to 67.4), and a second included youth that did not experience MH changes (38.7%, 95%CI=32.6 to 45.1). Child-specific factors associated with MH deterioration included higher pre-existing internalizing symptoms, high levels of COVID stress. Parental MH challenges and system-specific factors, such as the loss of learning supports, access to physicians and material deprivation, were also associated with MH deterioration. Access to acute MH services were primarily associated with financial insecurity and loss of services. Conclusions More than half of autistic children experienced MH deterioration, and person-specific (pre-existing MH, COVID related stress), parent-specific (Parent MH) and system-level (loss of services and material deprivation) characteristics were associated with such decline, providing clinical and policy opportunities for intervention at multiple levels.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e5f9136a513bbcdbc17eadfe32600d18",
  "timestamp": "2025-05-15T03:11:38.577646"
}