{
  "id": 2727,
  "title": "Improving the financial performance of SMEs The presence in foreign markets and the moderating role of corporate group and alliance portfolio size",
  "abstract": "Purpose The purpose of this paper is to assess the influence of the presence in foreign markets on small- and medium-sized enterprises' (SMEs) financial performance. Furthermore, it seeks to examine the moderating effect of corporate group and alliance portfolio size on this relationship. Design/methodology/approach First, the authors develop hypotheses concerning the relationship between the presence in foreign markets and SMEs' financial performance as well as the moderating role of the size of an SME's corporate group and alliance portfolio. Afterward, the authors used ordinary least square regression to the test the hypotheses based on a sample of 5,885 high-tech US SMEs registered in the Orbis database (Bureau van Dijk). Findings Results of the study reveal that the presence in foreign markets is positively associated with an SME's financial performance, with the size of the corporate group enhancing this relationship, hence confirming the conjectures. Instead, the size of the alliance portfolio appears to not exert any moderating effect, in contrast with the last hypothesis. Originality/value Form a theoretical perspective, the authors dig into the literature assessing the performance outcomes of SMEs and contingent effects of the possibility to tap into external resources of other firms. By so doing, the findings support a specific stream of the literature in claiming the positive effects deriving from being part of a corporate group. Conversely, the findings seem to go in the opposite direction of the majority of the literature that claim a positive impact of alliances on financial performances, while supporting those studies stressing that alliances pose significant challenges for SMEs and should be carefully identified and managed.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e603fffe77b382f8f9deb96cf51fb28d",
  "timestamp": "2025-05-15T01:09:43.389148"
}