{
  "id": 6534,
  "title": "Machine learning and deep learning models for preoperative detection of lymph node metastasis in colorectal cancer: a systematic review and meta-analysis",
  "abstract": "Objective To evaluate the diagnostic performance of Machine Learning (ML) and Deep Learning (DL) models for predicting preoperative Lymph Node Metastasis (LNM) in Colorectal Cancer (CRC) patients. Methods A systematic review and meta-analysis were conducted following PRISMA-DTA and AMSTAR-2 guidelines. We searched PubMed, Web of Science, Embase, and Cochrane Library databases until February 16, 2024. Study quality and risk of bias were assessed using the QUADAS-2 tool. Data were analyzed using STATA v18, applying random-effects models to all analyses. Results Twelve studies involving 8321 patients were included, with most published in 2021-2024 (9/12). The pooled AUC of ML models for predicting LNM in CRC patients was 0.87 (95% CI: 0.82-0.91, I-2:86.17) with a sensitivity of 78% (95% CI: 69-87%) and a specificity of 77% (95% CI: 64%-90%). In addition, when assessing the AUC reported by radiologists, both junior and senior radiologists had similar performance, significantly lower than the ML models. (P < 0.001). Subgroup analysis revealed higher AUCs in prospective studies (0.95, 95% CI: 0.87-1) compared to retrospective studies (0.85, 95% CI: 0.81-0.89) (P = 0.03). Studies without external validation exhibited significantly higher AUCs than those with external validation (P < 0.01). While there was no significant difference in AUC and sensitivity between the T1-T2 and T2-T4 stages, specificity was significantly higher in the T2-T4 stages than the low stages of T1 and T2 (95%, 95% CI: 92-98% vs. 61%, 95% CI: 44-78%; P < 0.01). Conclusion ML models demonstrate strong potential for preoperative LNM staging and treatment planning in CRC, potentially reducing the need for additional surgeries and related health and financial burdens. Further prospective multicenter studies, with standardized reporting of algorithms, modality parameters, and LNM staging, are needed to validate these findings.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e604d8d98807f82c196b1ec2d215a87c",
  "timestamp": "2025-05-15T02:59:07.515419"
}