{
  "id": 5003,
  "title": "Relationship of stress, distress, and inadequate coping behaviors to periodontal disease",
  "abstract": "Background: The association of stress, distress, and coping behaviors with periodontal disease was assessed. Methods: A cross-sectional study of 1,426 subjects between the ages of 25 and 74 years in Erie County, New York, was carried out to assess these relationships. Subjects were asked to complete a set of 5 psychosocial questionnaires which measure psychological traits and attitudes including discrete life events and their impact; chronic stress or daily strains; distress; coping styles and strategies; and hassles and uplifts. Clinical assessment of supragingival plaque, gingival bleeding, subgingival calculus, probing depth, clinical attachment level (CAL) and radiographic alveolar crestal height (ACH) was performed, and 8 putative bacterial pathogens from the subgingival flora measured. Results: Reliability of subjects' responses and internal consistencies of all the subscales on the instruments used were high, with Cronbach's alpha ranging from 0.88 for financial strain to 0.99 for job strain, uplifts, and hassles. Logistic regression analysis indicated that, of all the daily strains investigated, only financial strain was significantly associated with greater attachment and alveolar bone loss (odds ratio, OR = 1.70, 95% CI = 1.09 to 2.65 and OR = 1.68, 95% CI = 1.20 to 2.37, respectively) after adjusting for age, gender, and cigarette smoking. When coping behaviors were evaluated, it was found that those with more financial strain who were high emotion-focused copers (a form of inadequate coping) had a higher risk of having more severe attachment loss (OR = 2.24, 95% CI = 1.15 to 4.38) and alveolar bone loss (OR = 1.91, 95% CI = 1.15 to 3.17) than those with low levels of financial strain within the same coping group, after adjustment for age, gender, and cigarette smoking. Similar results were found among the low problem-focused copers for AL (OR = 2.21, 95% CI = 1.11 to 4.38) and ACH (OR = 2.12, 95% CI = 1.28 to 3.51). However, subjects with high levels of financial strain who reported high levels of problem-based coping (considered adequate or good coping) had no more periodontal disease than those with low levels of financial strain, suggesting that the effects of stress on periodontal disease can be moderated by adequate coping behaviors. Conclusions: We find that psychosocial measures of stress associated with financial strain and distress manifest as depression, are significant risk indicators for more severe periodontal disease in adults in an age-adjusted model in which gender (male), smoking, diabetes mellitus, B. forsythus, and P gingivalis are also significant risk indicators. Of considerable interest is the fact that adequate coping behaviors as evidenced by high levels of problem-based coping, may reduce the stress-associated risk. Further studies also are needed to help establish the time course of stress, distress, and inadequate coping with respect to the onset and progression of periodontal disease, and the mechanisms that explain this association.",
  "year": 1999,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e60716cac189db2112bc99498b369ee9",
  "timestamp": "2025-05-15T02:43:06.841825"
}