{
  "id": 9394,
  "title": "BMI in childhood and adolescence is associated with impaired reproductive function-a population-based cohort study from birth to age 50 years",
  "abstract": "STUDY QUESTION: What is the association between childhood and adolescent BMI and reproductive capacity in women? SUMMARY ANSWER: Adolescent girls with obesity had an increased risk of infertility and childlessness in adulthood independently of their marital status or the presence of polycystic ovary syndrome (PCOS). WHAT IS KNOWN ALREADY: Girls with obesity (BMI (kg/m(2))>95th percentile) more often exhibit menstrual irregularities and infertility problems as compared to those with normal weight, and premenarcheal girls with obesity have an increased risk of childlessness and infertility in adulthood. Follow-up studies on the relation between childhood and adolescence growth patterns and fertility or parity throughout the reproductive life span are limited. STUDY DESIGN, SIZE, DURATION: A prospective, population-based cohort study (the Northern Finland birth cohort 1966) was performed with 5889 women born in 1966 and followed from birth to age 50 years. Postal questionnaires at ages 31 and 46 years addressed questions on reproductive capacity evaluated by decreased fecundability, need for infertility assessment and treatment by 46 years of age. Childlessness and number of children by age 50 years were recovered from registers. Women who did not report ever having attempted to achieve pregnancy (n = 1507) were excluded. The final study population included 4382 women who attempted to achieve pregnancy before age 46 years. PARTICIPANTS/MATERIALS, SETTING, METHODS: Data on BMI were collected by trained personnel at all stages. We assessed association with both prospectively measured BMI at various time points and with early adiposity phenotypes derived from linear mixed models including the timing and the BMI at adiposity peak (AP) and adiposity rebound (AR). Self-reported infertility assessments and treatments were assessed at ages 31 and 46 years. Data on deliveries were collected from the national birth register. Decreased fecundability was defined at age 31 years as time to achieve pregnancy over 12months. Logistic regression analyses were conducted with adjustments for marital status, education level and smoking at age 31 years. Women with PCOS were excluded from stratification-based sensitivity analyses. Obesity at a specific age group was defined by having at least one BMI value above the 95th percentile during the related period. MAIN RESULTS AND THE ROLE OF CHANCE: BMI at the age of AR (5-7 years) was not associated with fertility outcomes after adjustments, but girls with AR <5.1 years had a higher risk of remaining childless compared to girls with AR over 5.1 years (adjusted odds ratio (OR): 1.45 (1.10-1.92)). At ages 7-10 and 11-15 years, obesity was associated with decreased fecundability (adjusted OR 2.05 (1.26-3.35) and 2.04 (1.21-3.44), respectively) and a lower number of children. At age 11-15 years, both overweight and obesity were associated with a higher risk of childlessness (adjusted OR 1.56 (1.06-2.27), 1.77 (1.02-3.07), respectively), even after excluding women with PCOS. Underweight at age 11-15 years was associated with an increased risk for infertility treatment (adjusted OR 1.55 (1.02-2.36)) and a tendency for an increased risk for infertility assessment (adjusted OR 1.43 (0.97-2.10)) after excluding women with PCOS. LIMITATIONS, REASON FOR CAUTION: Despite a high participation rate throughout the follow-up, some growth data for children over the different age groups were missing. Infertility outcomes were self-reported. A potential over-diagnosis of obesity may have reduced the significance of the association between childhood obesity and fertility outcomes, and the diagnosis of PCOS was self-reported. WIDER IMPLICATIONS OF THE FINDINGS: This study supports previous results showing that girls with obesity in late childhood and in adolescence displayed reduced fertility and an increased risk of remaining childless in adulthood, independently of marital history and PCOS in adulthood. These findings corroborate the body of evidence for a causal relation between early adiposity and the reproductive functions in women. We recommend reinforcing the prevention of obesity in school-age girls to reduce the risk of impaired reproductive functions. STUDY FUNDING/COMPETING INTEREST(S): NFBC1966 received financial support from University of Oulu Grant no. 65354, Oulu University Hospital Grant no. 2/97, 8/97, Ministry of Health and Social Affairs Grant no. 23/251/97, 160/97, 190/97, National Institute for Health and Welfare, Helsinki Grant no. 54121, Regional Institute of Occupational Health, Oulu, Finland Grant no. 50621, 54231. The Finnish Medical Foundation, the North Ostrobothnia Regional Fund, the Academy of Finland (project grants 315921, 104781, 120315, 129269, 1114194, 24300796), Center of Excellence in Complex Disease Genetics and SALVE, the Sigrid Juselius Foundation, Biocenter Oulu, University Hospital Oulu and University of Oulu (75617), Jalmari ja Rauha Ahokkaan saatio, The Finnish Medical Foundation, Medical Research Center Oulu, National Institute for Health Research (UK). M. R. J., S. S. and R. N. received funding by the Academy of Finland (#268336) and the European Union's Horizon 2020 research and innovation program (under Grant agreement no. 633595 for the DynaHEALTH action and GA 733206 for LifeCycle). The funders had no role in study design, in the collection, analysis and interpretation of the data, in the writing of the article and in the decision to submit it for publication. The authors have no conflict of interest to disclose.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e60aa5a2673846d82b707cfac19f7009",
  "timestamp": "2025-05-15T03:28:17.609705"
}