{
  "id": 6729,
  "title": "Strategic orientation, risk-taking, corporate life cycle and environmental, social and governance (ESG) practices: Evidence from ASEAN countries",
  "abstract": "Environmental, social, and governance (ESG) considerations have become increasingly important in the business world. Companies are expected to operate responsibly and sustainably, and stakeholders are demanding greater transparency and accountability. Our research aims to examine the influence of determinants on ESG practices in ASEAN countries (Indonesia, Malaysia, Singapore, the Philippines, Thailand, and Vietnam), as measured by ESG performance on the Refinitiv Eikon. Although there have been many studies discussing ESG, only a few have discussed this relationship by involving strategic orientation, risk taking and corporate life cycle simultaneously. We use panel regression based on a sample of 2373 observations from 2004 to 2022. The results show that the prospector strategy orientation encourages a greater increase in ESG practices compared to the defender strategy orientation, which means that companies with a prospector orientation are more willing to practice ESG because they have strategic resources. The increasing risk-taking by companies will reduce ESG practices. The more mature the company's life cycle stage will improve ESG practices. This brings implications that the strategy orientation chosen by the company, risk-taking, and corporate life cycle are the determining factors for companies implementing ESG practices in ASEAN countries. This research contributes to the literature related to corporate sustainability by considering ESG as one of the measurements of sustainability which is currently the main investment trend being observed in financial markets, especially ASEAN countries which are the best areas to invest.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e642d5cb5c0a9179f041209eb21daae2",
  "timestamp": "2025-05-15T03:01:03.554789"
}