{
  "id": 1438,
  "title": "Discovering decision knowledge from Web log portfolio for managing classroom processes by applying decision tree and data cube technology",
  "abstract": "In conventional classrooms, teachers attempt to enhance instruction by monitoring students' learning processes and analyzing their performances by paper records and observation. Similarly, distance learning systems on the Web should be designed to record students' behaviors to assist teachers in assessing performance and making decisions related to curriculum. Recent developments in Web server systems can record the students' access to the learning systems in Web logs. Information processing analysis on the historical classroom processes can help teachers to develop knowledge for applying proper teaching strategies according to available information in Web logs. However, teachers cannot easily infer the pedagogical meaning of Web logs and discover the pedagogical rules of students' behavior patterns in the Web logs to refine teaching strategies. Therefore, to use Web logs for pedagogical purposes, this article adopts decision tree and data cube information processing methodologies to observe students' behaviors and discover the pedagogical rules on students' learning performance from Web logs. The architecture and guidelines of utilizing the data cube and decision tree methodologies for pedagogical purposes are also presented. Consequently, teachers can efficiently estimate and explain the effectiveness of pedagogical strategies, ultimately improving instruction with decision tree and data cube software.",
  "year": 2000,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e6611d650dd33ad406d092739539f2ab",
  "timestamp": "2025-05-15T00:55:28.598550"
}