{
  "id": 7098,
  "title": "THE EFFECT OF OUT OF POCKET PAYMENTS ON THE INCOME OF HOSPITALIZED PATIENTS. EVIDENCE FROM GREECE",
  "abstract": "Purpose - To examine social health insurance's risk pooling mechanisms and the catastrophic impact that health care OOPs can have on insureds' income and wellbeing. Background: The Greek state has reduced their funding on health as part of broader efforts to limit the large fiscal deficits and rising debt ratios to GDP (OECD, 2013). Benefits cuts and limitations of Social Health Insurance (SHI) reimbursements result in Greek population substantial Out of Pocket Payments (OOP). Objective: To examine how well the new Greek SHI reform protects individuals against catastrophic OOPs for unexpected inpatient health shocks in private hospitals. Data: The data was obtained after a cross sectional survey in 2013 and comprised a sample of 413 insured who were hospitalized at once in affiliated private hospitals with SHI in the main three urban centers of the country. Methods: We used ordinary least squares methods, in order to estimate the relationship between OOPs and SHI funding for these hospitalization events. Moreover, the catastrophic impact of OOPs on individuals' living standards based on the widely accepted measurement tools and indicators of the literature set. Results: The regression results indicated that the OOPs for inpatient care in private hospitals have a positive relationship with SHI funding. The empirical results also, showed that the SHI funding is inadequate to total inpatient financing. Conclusion: The health policy makers have to give serious consideration to the perspective of a SHI system which should be supplemented by the Private Health Insurance (PHI) sector. Originality/Value: Financial catastrophe from OOPs incur as well in developed economies despite the presence of pre-paid insurance schemes, as a result of the last financial crisis and the painful austerity adjustments.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e66e2c98445e49c066d521ba863eb002",
  "timestamp": "2025-05-15T03:05:03.530058"
}