{
  "id": 5048,
  "title": "What Explains the Sovereign Credit Default Swap Spreads Changes in the GCC Region?",
  "abstract": "This paper aimed to investigate the drivers of sovereign credit risk spreads changes in the case of four Gulf Cooperation Council (GCC) countries, namely Kingdom of Saudi Arabia (KSA), the United Arab Emirates (UAE), Qatar, and Bahrain. Specifically, we explained the changes in sovereign credit default swap (hereafter SCDS) spreads at different locations of the spread distributions by three categories of explanatory variables: global uncertainty factors, local financial variables, and global financial market variables. Using weekly data from 5 April 2013, to 17 January 2020, and the quantile regression model, empirical results indicate that the global factors outperform the local factors. The most significant variables for all SCDS spreads are the global financial uncertainty embedded in the Chicago Board Options Exchange (CBOE) volatility index (VIX) and the global conventional bond market uncertainty embedded in the Merrill Lynch Option Volatility Estimate (MOVE) index. Moreover, the MOVE index affects the various SCDS spreads only when the CDS markets are bullish. Interestingly, the SCDS spreads are not affected by the global economic policy and the gold market uncertainties. Additionally, a weak dependence is observed between oil prices and SCDS spreads. For the country-specific factors, stock market returns are the most significant variable and impact the SCDS spreads at different market circumstances.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e66ff5a82ace2814fd5022ab3812fa71",
  "timestamp": "2025-05-15T02:43:40.233258"
}