{
  "id": 3954,
  "title": "Social risk factors among individuals with a history of cancer during the COVID-19 pandemic",
  "abstract": "Purpose The coronavirus disease (COVID-19) pandemic and its economic consequences may disproportionately impact cancer survivors and their overall health-related quality of life. The objective of this study was to examine whether cancer survivors experienced higher levels of financial strain or food insecurity compared to those without a history of cancer. Methods Kaiser Permanente Research Bank (KPRB) study participants were invited to complete a series of electronic surveys starting April 2020 to assess the impact of the COVID-19 pandemic. Participants who completed the initial survey and one follow-up survey were included. The odds of financial strain and food insecurity in those with and without a history of cancer were estimated using multinomial logistic regression. Results Cancer survivors (n = 16,231) had lower odds of reporting somewhat hard (AOR = 0.77) and very hard (AOR = 0.67) financial strain, and food insecurity sometimes (AOR = 0.70) and often (AOR = 0.55) compared to those with no history of cancer (n = 88,409). Non-Hispanic (NH) Black and Hispanic cancer survivors had higher odds compared to NH Whites of reporting financial strain and food insecurity. Smokers and those with multiple comorbidities had higher odds of reporting financial strain and food insecurity among cancer survivors. Conclusions While cancer survivors overall did not report greater financial strain or food insecurity than individuals without a history of cancer, subsets of cancer survivors are experiencing greater social risks during the pandemic and should be prioritized for screening for social risk factors. Implications for Cancer Survivors Incorporating screening for social risk factors into care coordination workflows for subsets of cancer survivors should be a priority.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e67e4eb0e111b624c13b58fd41f2ad59",
  "timestamp": "2025-05-15T02:31:28.499430"
}