{
  "id": 8426,
  "title": "A Meta-Regression of Racial Disparities in Wellbeing Outcomes During and After Foster Care",
  "abstract": "Children in foster care face heightened risk of adverse psychosocial and economic outcomes compared with children in the general population. Yet, the effects of foster care as an intervention are heterogeneous. Heterogeneity outcomes by race and ethnicity are of particular interest, given that Black and Indigenous youth experience foster care at higher rates than other racial/ethnic groups and experience group differences in setting, duration, and exits to permanency. This meta-regression explores racial disparities in education, employment, mental health, and behavioral outcomes during and following foster care. A systematic search of PsycINFO, ERIC, and Academic Search Complete using a series of search terms for studies published between January 2000 and June 2021 found 70 articles and 392 effect sizes that provided outcomes of US-based foster care by race/ethnicity. Findings reveal that Black foster care impacted persons (FCIPs) have 20% lower odds (95% CI: .68-.93) of achieving employment or substantial financial earnings and have 18% lower odds (95% CI: .68-1.00) of mental health concerns compared to White FCIPs. Hispanic FCIPs have 10% lower odds (95% CI: .84-.97) of achieving stable housing compared to non-Hispanic FCIPs. Moderator analyses revealed certain study features (i.e. publication type, timing of the study, location of the study, and placement status of the participants) have a significant impact on the gap between Black and non-Black and Hispanic and non-Hispanic FCIPs. The findings provide important implications for racial disparities in foster care outcomes, as well as highlight important gaps and missing information from published studies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e69aefef617c896a5fa048fc405217aa",
  "timestamp": "2025-05-15T03:18:51.553343"
}