{
  "id": 636,
  "title": "Financial accounting intelligence management of internet of things enterprises based on data mining algorithm",
  "abstract": "With the introduction of the information age, enterprise financial management has been challenged as never before, and the application of Internet of Things (IoT) technology can effectively improve the efficiency of financial accounting management and realize the informationization of financial management. In order to solve the problem of enterprise financial accounting data processing, a data mining algorithm is constructed, which uses data mining technology to obtain massive information data and cluster analysis processing to realize the fusion of multiple uncertainty information processing models. Firstly, the financial information cloud platform is designed by using the IoT technology. The financial risk index coefficient of the enterprise is judged by the association rules. Finally, the research sample is divided into the risk group and the normal group according to the ST classification standard, and the 296 financial indicators of the two groups are correlated. The research results show that if the enterprise with a score below 40 points has financial risk, the accuracy rate is 70.9%, which is slightly lower than the financial risk warning model of the decision tree. Through the research of this paper, it has enlightenment to the financial accounting management of IoT enterprises. The data mining technology is applied in the processing of massive data information of accounting, which is more efficient.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e6a893af0774b47e3436f7dc199320b3",
  "timestamp": "2025-05-15T01:53:24.863485"
}