{
  "id": 3704,
  "title": "Does the risk of oil and energy based resources extraction Hinder or Foster sustainable development?",
  "abstract": "Developed economies, particularly the United States, are rapidly developing technology and resources to cut carbon emissions to combat climate change and fulfill the COP27 target. Even though the literature addresses most environmental challenges in developed and developing nations. Nonetheless, the United States remained ignored in identifying the influence of renewables, financial risk, and natural resources on environmental quality. Therefore, it is the need of the time to empirically examine such nexus, the empirical results of which could help policymakers construct relevant and appropriate policies. This research looks at the influence of natural resources, renewable energy consumption, financial risk, and economic development on carbon emissions in the United States between 1989 and 2021. The empirical data for variables demonstrate valid cointegration but have non-linear distributional features. As a result, this study uses the unique approach of moment quantile regression to discover that economic growth is the biggest impediment to meeting the COP27 objective. On the other hand, natural resource exploitation, renewable energy use, and financial risk are all negatively related to carbon emissions. According to the data, the latter factors are the primary drivers of COP27's objective accomplishment. This report recommends sustainable resource exploitation and more investment in the renewable energy industry.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e6bbebca5650b28f0c4d257dd51663c0",
  "timestamp": "2025-05-15T02:29:00.216246"
}