{
  "id": 8923,
  "title": "Household economic burden and outcomes of patients with schizophrenia after being unlocked and treated in rural China",
  "abstract": "Aims Patients with severe mental disorders in low-resource settings have limited access to services, resulting in overwhelming caregiving burden for families. In extreme cases, this has led to the long-term restraining of patients in their homes. China underwent a nationwide initiative to unlock patients and provide continued treatment. This study aims to quantify household economic burden in families after unlocking and treatment, and to identify factors associated with increased burden due to schizophrenia. Methods A total of 264 subjects were enrolled from three geographically diverse provinces in 2012. Subjects were patients with schizophrenia who were previously put under restraints and had participated in the 'unlocking and treatment' intervention. The primary outcome was the current household economic burden, obtained from past year financial information collected through on-site interview. Patient disease characteristics, treatment, outcomes and family caregiving burden were collected as well. Univariate and multivariate linear regression were used to construct risk factor models for indirect economic burden. Results After participating in the intervention, 85% of patients continued to receive mental health services, 70% used medication as prescribed and 80% were never relocked. Family members reported significantly decreased caregiving burden after receiving the intervention. Mean direct and indirect household economic burdens were CNY963 (US$31.7) and CNY11 724 (US$1670) per year, respectively, while family total income was on average CNY12 108 (US$1913) per year. Greater disease severity and poorer patient psychosocial function at time of study were found to be independent factors related to increased indirect burden. Conclusions The 'unlocking and treatment' intervention has improved the lives of patients and families. Indirect burden due to disease is still a major economic issue that needs to be addressed, potentially through improving treatment and patient functioning. Our findings contribute to the unravelling and eventual elimination of chronic restraining of mentally ill patients in low-resource settings.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e6bcbf8d4e25570ce778f61e61571799",
  "timestamp": "2025-05-15T03:23:56.046568"
}