{
  "id": 5611,
  "title": "Loneliness and its Predictors in Lithuania and the Context",
  "abstract": "Loneliness as a subjective consequence of social exclusion has a negative impact on both individual and public health, and impedes societal development. Even though Lithuania has one of the highest rates of loneliness among EU countries, it has not been closely studied. This paper presents for the first time the analysis of the prevalence and factors of loneliness in Lithuania, covering all age groups, and provides the European context. Data from the European Social Survey 7th Wave (2014) were analysed using binary logistic regression. Contrary to our expectations, (older) age is not a predictor of loneliness in Lithuania. Lonely people are more likely to be of other nationality than the majority and the main minorities (i.e. not Lithuanian, Russian or Polish); are less likely to live with a spouse or partner, but more likely to live with children in the same household; more often experience serious financial difficulties; have a history of financial instability in their childhood; tend to have poor subjective health. Not having a partner/spouse and lower economic status are well known risk factors of loneliness from previous international studies. In the context of European countries, the share of lonely people in Lithuania is about average and living without a spouse/partner is a common characteristic of loneliness across all countries. However, other factors of loneliness, such as financial difficulties (current and during childhood), living with children in the same household and poor subjective health appear to be more pronounced in Lithuania.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e6dcaf957f4058e86660dfd96494db1b",
  "timestamp": "2025-05-15T02:49:21.795679"
}