{
  "id": 7142,
  "title": "Audit partner gender and the COVID-19 pandemic: the impact on audit fees and key audit matters",
  "abstract": "PurposeThe purpose of this study is to analyze the influence of the COVID-19 pandemic on audit fees and the reporting of key audit matters (KAMs). Additionally, this study also looks into potential differences in the behavior of male and female audit partners during this period, adding to the existing research on gender's effect on different elements of the audit process. Design/methodology/approachThis study used a sample of all FTSE 350 firms from before the COVID-19 pandemic and during the pandemic. It analyzed the data using Ordinary Least Squares regression analysis to test its hypotheses. FindingsThis paper provides early evidence on the impact of the COVID-19 pandemic on audit fees and KAM disclosures in the UK. The results of this study show an increase in audit fees during the pandemic and greater detail in the reporting of KAMs, with no significant difference between male and female audit partners. These findings will be of interest to audit firms and regulators as they assess the performance of auditors during the pandemic and evaluate the expanded audit report's effectiveness in providing sufficient information to financial statement users. Originality/valueThis study provides first-of-its-kind empirical evidence on how auditors in the UK reacted to the COVID-19 pandemic. The findings of this study will be of interest to audit firms, regulators, such as the Financial Reporting Council, and other stakeholders as they evaluate the performance of auditors during the crisis period. The results will help regulators assess the effectiveness of the expanded audit report in providing sufficient information during a time of heightened risk and scrutiny.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e6dec7a664f04513ea07d798c9334e89",
  "timestamp": "2025-05-15T03:05:32.069304"
}