{
  "id": 4188,
  "title": "Internet banking services and credit union performance",
  "abstract": "Purpose - Existing empirical evidence indicates internet banks worldwide have underperformed newly chartered traditional banks mainly because of their higher overhead costs. The purpose of this paper is to examine the impact of internet banking services on credit union activity. Design/methodology/approach - The impact of internet banking services on credit union over the period 1999-2006 was studied and regression equations were estimated for the growth in assets, operating expenses and return on assets as functions of portfolio characteristics, economic conditions and a dummy variable indicating if the credit union has adopted internet banking services. Findings - The operating costs of credit unions providing web access were found to be significantly higher than those credit unions which do not have any web account offerings. There is increased growth in assets for the credit unions which have worldwide web accounts although this relationship is statistically significant in only three of the eight years studied. The return on assets show that the credit unions with web accounts have similar average profitability to those credit unions that do not provide the facility of internet access to their customers. Research limitations/implications - Consideration could be given to running the regressions with the number of years the web site has been in place instead of just a dummy variable and putting in common bond dummy variables. Some common bonds are so narrow it may not pay to have internet services. Practical implications - Even though there are costs associated with providing internet services, the retention of profitability and the evidence of potentially higher asset growth rates suggest the importance of internet banking and the trend of internet banking adoption is expected to continue in the near future in the credit union industry. Originality/value - This is a pioneering study on the effect of internet banking services on the costs, growth and profitability of Credit Unions in the USA.",
  "year": 2008,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e6e75287951844c9161deb8feacf453a",
  "timestamp": "2025-05-15T01:24:25.489922"
}