{
  "id": 2174,
  "title": "Completion of the Transferof the Online Journal of Public Health Informatics (OJPHI) to JMIR Publications",
  "abstract": "Founded in 2009, the OnlineJournal of Public Health Informatics (OJPHI) strivesto provide an unparalleled experienceasthe platform of choice to advance public and population health informatics. Asapremierpeer-reviewedjournal inthisfield,OJPHI's mission is to serve as an advocate for the discipline through the dissemination of public health informatics research results and best practices among practitioners, researchers, policymakers, and educators. However, in the current environment, running an independent open access journal has not been without challenges. Judging from the low geographic spread of our current stakeholders, the overreliance on a small volunteer management staff, the limited scope of topics published by the journal, and the long article turnaround time, it is obvious that OJPHI requires a change in direction in order to fully achieve its mission. Fortunately, our new publisher JMIR Publications is the leading brand in this field, with a portfolio of top peer-reviewed journals covering innovation, technology, digital medicine and health services research in the internet age. Under the leadership of JMIR Publications, OJPHI plans to expand its scopeto include new topics such as precision public health informatics, the use of artificial intelligence and machine learning in public health research and practice, and infodemiology in public health informatics.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e74ef41532618bd55ecc7bcba1b7e0e7",
  "timestamp": "2025-05-15T01:03:36.724970"
}