{
  "id": 4215,
  "title": "Banking and financial regulation in Sub-Saharan Africa: a systematic literature review and multiple regression approach",
  "abstract": "PurposeA functional financial sector is a major driver of economic development. The purpose of this paper is to provide a comprehensive understanding of existing research findings, gaps in knowledge and emerging trends in the field of banking and finance.Design/methodology/approachBy conducting a systematic literature review, a total of 98 peer-reviewed articles whose focus and relevance match with the subject matter were reviewed and synthesised to answer the research questions. Multiple regression was also carried to investigate the relationship amongst the identified probable factors affecting financial inclusions.FindingsThe outcome of this study highlighted some factors mitigating the growth of the banking sector in the Sub-Saharan Africa (SSA). These include excessive or stringent regulations, market segmentation, high interest rates, information asymmetry, low credit status and uneven distribution of credit amongst others.Practical implicationsSome of the policy recommendations that could aid the development of the banking sector in SSA include: development and deepening of interbank markets, financial inclusion, improvement of overall market efficiency through redistribution of liquidity within the banking system, improvement of price and encouragement of competition. This study recommends financial inclusion by formulating policies that balances the capital adequacy requirements with the risk of insolvency to ensure credit flows and promotes financial stability via effective operations financial institutions.Originality/valueThis study contributes valuable insights to the understanding of banking and financial regulations in SSA, informing both academic research and policy development in the region.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e76599b9241eb5fc6845a0db97ee168f",
  "timestamp": "2025-05-15T02:34:48.871659"
}