{
  "id": 9246,
  "title": "Assessment of Quarantine Understanding and Adherence to Lockdown Measures During the COVID-19 Pandemic in Palestine: Community Experience and Evidence for Action",
  "abstract": "Background: Containment of the coronavirus pandemic relied extensively on the combination of early implementation of quarantine and massive behavioral changes to ensure effectiveness. Decision-makers need to constantly monitor the outbreak situation and the impact of the measures implemented. Yet little is known about the factors influencing adherence and understanding of lockdown measures among the Palestinian community. This study aimed to assess the impact and factors affecting these early public health interventions. Materials and Methods: A cross-sectional web-based questionnaire was distributed throughout social media (Facebook and Instagram). We used a snowball recruiting technique to target Palestinian adult citizens during the coronavirus pandemic quarantine between 6 and 16 April 2020, which corresponded to almost the middle interval of the strict massive lockdown measures in Palestine that lasted from 22 March to 5 May 2020. Multivariate logistic regression models were developed for the outcome variables (staying home adherence, in-home precautions adherence, and quarantine understanding). Results: Our questionnaire was completed by 2,819 participants. The mean (range) age was 29.47 (18-71) years. Of them, 1,144 (40.6%), 1,261 (44.7%), and 1,283 (45.5%) reported low levels of staying home adherence, in-home precautions adherence, and quarantine understanding, respectively. Females, city residents, those with higher educational levels, and those informed by official government sources were associated significantly with higher levels of both staying home adherence and quarantine understanding. Adequate food supply was associated with a higher level of staying home adherence. Higher levels of in-home precautions adherence were noticed in the elderly and those with a high-risk group living at home. Higher monthly income was inversely associated with higher levels of in-home precautions adherence and lower levels of quarantine understanding (P < 0.05). Conclusions: The socio-economic and financial status of the general population and coordination between the major information resources (official government), social media, and the press were the major factors affecting the community in regard to quarantine adherence. For maximum effectiveness and commitment levels amongst the people to decrease the spread of infection, policymakers need to address all those factors. In addition, clear communication between policymakers and the population is essential for reassuring the people and minimizing their fears regarding the unknown future.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e76666d5307abec39db9607f23e3c97b",
  "timestamp": "2025-05-15T03:26:54.593586"
}