{
  "id": 1198,
  "title": "Gold and Bitcoin Optimal Portfolio Research and Analysis Based on Machine-Learning Methods",
  "abstract": "In recent years, the bitcoin market has developed rapidly and has been recognized as a new type of gold by many investors. It may replace gold as a hedge against inflation and become a new investment asset for financial management. The investment relationship with gold has increasingly important research value and practical significance. This paper modeled daily price flow data from 11 September 2016 to 10 September 2021 to help market traders determine whether they need to buy, hold, or sell assets in their portfolios daily. The model predicts price fluctuations through linear regression prediction of machine learning, K-Nearest Neighbor (KNN) algorithm. In the linear regression prediction, the goodness of fit of gold is 89.44%, and the goodness of fit of Bitcoin is 98.43%. In the test set prediction of KNN algorithm, the goodness of fit of gold is 97.25%, and the goodness of fit of Bitcoin is 95.06%. Based on this, the optimal investment strategy and the initial investment value are obtained. Empirical analysis shows that bitcoin price volatility and gold price volatility have a strong substitution effect; gold and currency used will be a suitable combination of hedging, which will bring momentum for the development of the market economy and become an important force in the sustainable development of a high-quality-driven economy.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e79566ba0c58cb3030d83faa11189f15",
  "timestamp": "2025-05-15T00:53:09.857485"
}