{
  "id": 4060,
  "title": "Time-varying firm cash holding and economic policy uncertainty nexus: a quantile regression approach",
  "abstract": "This paper examines the time-varying nature of various decisive factors on cash holding decisions. First, we revisit the issue of cash holding determinants of U.S. corporations and argue that firm cash holding predictability is time-varying. To this end, this research proposes a novel empirical framework that builds on the impact of business cycles on firm cash holding's predictability. Using a three-stage empirical analysis, we also posit that the conventional argument on the EPU-CASH relationship is dependent on the time-varying market structure. Earlier studies have shown that economic policy uncertainty may increase the propensity of cash holding at the firm level. To estimate the theoretical assumption and capture different dynamic relationships, we convert monthly EPU data to annual and develop a cash quantile regression model including several financial characteristics. Employing a large sample of U.S. non-financial firms and non-utilities, we initially estimate 6-year rolling fixed window quantile regressions during the 1970-2016 period. The resulting series of beta estimates are regressed on economic policy uncertainty. The main results confirm the time-varying nature of determinants related to corporate liquidity management. Our findings add a new dimension to the existing literature and therefore be important to the market participants for portfolio allocation in the developed markets. Overall, the new methodology presented in this study contributes to the field of operational research by providing a robust approach to analyze policy uncertainty and its impact on cash management.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7984ca293646f3da24dffaff85cc462",
  "timestamp": "2025-05-15T01:23:27.327897"
}