{
  "id": 6435,
  "title": "Magnitude of problematic anger and its predictors in the Millennium Cohort",
  "abstract": "Background Problematic anger is intense anger associated with elevated generalized distress and that interferes with functioning. It also confers a heightened risk for the development of mental health problems. In military personnel and veterans, previous studies examining problematic anger have been constrained by sample size, cross-sectional data, and measurement limitations. Methods The current study used Millennium Cohort survey data (N = 90,266) from two time points (2013 and 2016 surveys) to assess the association of baseline demographics, military factors, mental health, positive perspective, and self-mastery, with subsequent problematic anger. Results Overall, 17.3% of respondents reported problematic anger. In the fully adjusted logistic regression model, greater risk of problematic anger was predicted by certain demographic characteristics as well as childhood trauma and financial problems. Service members who were in the Army or Marines, active duty (vs. reserves/national guard), and previously deployed with high levels of combat had increased risk for problematic anger. Veterans were also more likely to report problematic anger than currently serving personnel. Mental health predictors included posttraumatic stress disorder (PTSD), major depressive disorder (MDD), and comorbid PTSD/MDD. Higher levels of positive perspective and self-mastery were associated with decreased risk of problematic anger. Conclusion Not only did 1 in 6 respondents report problematic anger, but risk factors were significant even after adjusting for PTSD and MDD, suggesting that problematic anger is more than an expression of these mental health problems. Results identify potential targets of early intervention and clinical treatment for addressing problematic anger in the military and veteran context.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7a02c2d7ec7ebb417a08e0c8b2404de",
  "timestamp": "2025-05-15T02:58:05.682235"
}