{
  "id": 8479,
  "title": "Contemplating the Antecedents of a Sustainable Work Life in an Emerging Economy: Lessons from Early Retirees in the ICT Sector of Pakistan",
  "abstract": "Sustainable careers at present are characterized by elements of both planned and unplanned career transitions traversed over the entire life course. Planned career transitions involve voluntary departure from the routine career while unplanned career displacements come in the form of involuntary retirement decisions resulting from the job-cuts imposed by organizations. Involuntarily-displaced workers are challenged with threats, such as an unwelcoming job-market, depleted skillsets and potential obsolescence which results in limited employability. For developed nations, extant research has investigated to a reasonable extent this budding avenue of post-retirement career decision making and its dependency on various micro-level socioeconomic determinants. However, the same avenue is, as yet, unexplored for developing economies. In an endeavor to fill this gap, the present research is undertaken to study different post-retirement career trajectories chosen by middle-aged and elderly workers after a job loss from the information and communication technology (ICT) sector in Pakistan. We employ the technique of multinomial logistic regression on data obtained from 295 early displaced workers (M = 217, F = 78) to compare different retirement decisions in the light of various socioeconomic factors, such as age, gender and specific measures of human, social and financial capital and risk-taking ability. Age, gender and health status are observed to be major deterrents to sustainable career participation while technical qualification helps to sustain reemployment opportunities. Our research offers notable contributions to the realm of sustainable career development by identifying the factors which influence workers' employability for sustainable workforce participation. Managerial and theoretical implications are discussed followed by conclusions and research limitations.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7a4b57a61db7e70f58ec850b9231b1e",
  "timestamp": "2025-05-15T03:19:21.295101"
}