{
  "id": 2140,
  "title": "Elucidating the Relationships among Demographics, Behavioral Biases, and Risk Factors: A Study of Financial Professionals",
  "abstract": "Financial professionals play an increasingly important role in the financial system. This article examines how demographics relate to the behavioral and risk factors of sophisticated financial professionals. Using an expert validated structured questionnaire to collect survey data from Indian financial professionals, we examine the relationships among the variables through descriptive and regression analyses. The results show the presence of behavioral biases, risk perception, and low risk taking among financial professionals. Our findings reveal that financial professionals' decision-making is not always rational but bounded rational due to these factors. Financial professionals' experience played a decisive role with many behavioral and risk factors, whether analyzed individually or in combination with other demographics. It has a statistically significant and negative relationship to disposition effect, herding bias, and risk taking, and a positive relationship to home bias and risk perception. Gender, age, and education have a significant and strong relationship with several behavioral biases and risk factors. The article is helpful to academia and the financial/investment industry. Senior authorities of the stock market and investment firms may analyze, understand, and work on financial professionals' psychological and risk factors. Earlier academic research is based on individual investors or management/finance specialization post-graduate students; we contribute to the literature by looking at financial professionals and facilitating similar research in the future with other important psychological, social, and cultural factors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7a6af758a930e394899d10dea94da33",
  "timestamp": "2025-05-15T02:11:40.587038"
}