{
  "id": 166,
  "title": "Margin Trader: A Reinforcement Learning Framework for Portfolio Management with Margin and Constraints",
  "abstract": "In the field of portfolio management using reinforcement learning, existing approaches have mainly focused on cash-only trading, overlooking the potential benefits and risks of margin trading. Incorporating margin accounts and their constraints, especially in short sale scenarios, is crucial yet often neglected. To address this gap, we make the first attempt to propose Margin Trader, an innovative and adaptive reinforcement learning framework designed for margin trading in the stock market. Margin Trader integrates margin accounts and constraints into a realistic trading environment for both long and short positions. The framework aims to balance profit maximization and risk management through the Margin Adjustment Module and the Maintenance Detection Module. Margin Trader supports various Deep Reinforcement Learning (DRL) algorithms and offers traders the flexibility to customize critical settings, such as equity allocation, margin ratios, and maintenance requirements, to suit diverse market conditions, individual preferences, and risk tolerance. Experimental results demonstrate that Margin Trader effectively learns profitable trading strategies and hedges risks in both bullish and bearish markets, outperforming other baseline models with the highest Sharpe ratio.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7b1bf4565c697ecf62b913be3a8dc7b",
  "timestamp": "2025-05-15T00:40:02.101024"
}