{
  "id": 3029,
  "title": "Hybrid Crow Search Algorithm-LSTM System for Enhanced Stock Price Forecasting",
  "abstract": "Featured Application The proposed hybrid crow search algorithm (CSA) and long short-term memory (LSTM) system can be utilized for stock price forecasting by simultaneously leveraging multiple datasets, such as technical indicators, leading indicators, and various time series data related to stock prices. This system enhances prediction accuracy. This system can help financial institutions, investment firms, and individual traders make more informed trading decisions and optimize portfolio strategies by accurately forecasting future stock prices.Abstract This study presents a hybrid crow search algorithm-long short-term memory (CSLSTM) system for forecasting stock prices. This system allows investors to effectively avoid risks and enhance profits by predicting the closing price the following day. This method utilizes a stacking ensemble of long short-term memory (LSTM) networks, with the crow search algorithm (CSA) optimizing the weights assigned to the predictions from multiple LSTM models. To improve the overall accuracy, this system leverages three distinct datasets: technical analysis indicators; price fluctuation limits; and variation mode decomposition (VMD) subsignal sequences. The predictions for the three reference-data types are more comprehensive than single-model or single-data-type approaches. The prediction accuracies of the recurrent neural network, gate recurrent unit, and the LSTM network for five stocks were compared. The proposed CSLSTM system outperforms the other standalone models. Furthermore, we conducted backtesting to demonstrate that the prediction information from our model could generate profit in the stock market, enabling users to benefit from complex stock-market dynamics. The stock prices in this study are expressed in New Taiwan Dollars (TWD), the official currency of Taiwan.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7bd85e138b70af80d03c0be542a1dd1",
  "timestamp": "2025-05-15T01:12:43.129225"
}