{
  "id": 729,
  "title": "Adminization: Gatekeeping Consumer Contracts",
  "abstract": "Large companies and debt collectors frequently file unmeritorious claims against consumers. Recent high-profile actions brought by the Consumer Financial Protection Bureau against J.P. Morgan, Citibank, and other large debt collectors illustrate the breadth and importance of this phenomenon. Due to the limited financial power of individuals, consumers often do not defend against such baseless claims, which results in the entry of millions of default judgments every year. To combat this problem, policymakers and scholars have explored a variety of court-based solutions that would make it easier for consumers to defend in court, but these prove ineffectual. To solve the problem of unmeritorious claiming, this Article proposes a budget-friendly solution called Adminization. This novel approach uses an administrative agency as a gatekeeper to civil litigation that is tasked with detecting and sanctioning the filing of baseless claims. The agency samples cases, using statistical methods and potentially deep-learning algorithms, and then investigates selected cases using agency auditors. When the auditors find wrongdoing, they are instructed to levy large fines against wrongdoers. Unlike the current system, Adminization subjects every plaintiff to the risk of thorough investigation and large fines, thus undercutting the financial incentive to engage in wrongful behavior. The importance of Adminization lies in its cost-effectiveness, practicality, and political feasibility relative to the court-based approaches that dominate the discussion today.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7bd1661d9caa1bf2d8388e47ceec519",
  "timestamp": "2025-05-15T01:42:05.365009"
}