{
  "id": 2857,
  "title": "Assessment of Bank Customer's Attitude Toward Financial Technology in Pakistan",
  "abstract": "The financial technology sector is now growing rapidly all over the world, and it has improved the banking system efficiency and customer experience. This research study attempts explicitly to explore the consumer acceptance attitude of FinTech and its products in Pakistan. Technology Acceptance Model was used to assess the entire variable associated with the consumer attitude to adopt new technology. Based on a survey conducted from Pakistan data and by employing the multiple regression analysis, this study proves that the risk involved in FinTech products and services results in less usage of financial technology. The findings of the study also show that the risk should be reduced if banks and other institutes that are involved in financial transactions online must provide security. Moreover, customers are not willing to pay an extra amount for using financial technology. It argues that usefulness helps to change the attitude of banking customers to use financial technology. The attitudes of the customers have a positive relationship with the adoption of financial technology. These results also help guide financial institutions to enhance the adoption of FinTech products. User attitudes must be changed by providing users with more security, less risky applications, and cost-effective products.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7c319b31d705728d07ab4ba8081e4e0",
  "timestamp": "2025-05-15T02:19:46.758254"
}