{
  "id": 7275,
  "title": "Early-Life Adversities and Recalcitrant Smoking in Midlife: An Examination of Gender and Life-Course Pathways",
  "abstract": "Background Little is known about life-course factors that explain why some individuals continue smoking despite having smoking-related diseases. Purpose We examined (a) the extent to which early-life adversities are associated with the risk of recalcitrant smoking, (b) psychosocial factors that mediate the association, and (c) gender differences in the associations. Methods Data were from 4,932 respondents (53% women) who participated in the first and follow-up waves of the Midlife Development in the U.S. National Survey. Early-life adversities include low socioeconomic status (SES), abuse, and family instability. Potential mediators include education, financial strain, purpose in life, mood disorder, family problems/support, and marital status. We used sequential logistic regression models to estimate the effect of early-life adversities on the risk of each of the three stages on the path to recalcitrant smoking (ever-smoking, smoking-related illness, and recalcitrant smoking). Results For women, low SES (odds ratio [OR] = 1.29; 1.06-1.55) and family instability (OR = 1.73; 1.14-2.62) are associated with an elevated risk of recalcitrant smoking. Education significantly reduces the effect of childhood SES, yet the effect of family instability remains significant even after accounting for life-course mediators. For men, the effect of low SES on recalcitrant smoking is robust (OR = 1.48; 1.10-2.00) even after controlling for potential mediators. There are noteworthy life-course factors that independently affect recalcitrant smoking: for both genders, not living with a partner; for women, education; and for men, family problems. Conclusions The findings can help shape intervention programs that address the underlying factors of recalcitrant smoking.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7d9daf7fcb8ce4a23de1fbebc2488e7",
  "timestamp": "2025-05-15T03:07:02.560632"
}