{
  "id": 196,
  "title": "A Black-Litterman Portfolio Selection Model with Investor Opinions Generating from Machine Learning Algorithms",
  "abstract": "Generation error is one of the shortcomings of the classical mean-variance portfolio selection model which would result in unstable performance in out-of-sample data sets. Machine learning provides several potential solutions for reducing the generalization error, such as adding penalty terms and random sampling. Due to some significant advantages of machine learning algorithms, we implement Black-Litterman (BL for short) series portfolio models integrated with quantitative opinions generating from machine learning algorithms in this paper. And, the fundamental factors in the Fama-French model form the basis of quantitative opinions. Considering the non-linearity among fundamental factors, we construct high-order terms and cross terms of basic features by the approach of dimension-increasing transformation. A multi-period portfolio strategy is designed in our work for the timeliness of quantitative opinions, the experimental results reveal that the optimal BL model with investor opinion generating from Random Forest gained over 20% average annual return and a Sharpe Ratio of 1.25. By comparison, S&P 500 index gained about 14.94% annual return and a Sharpe Ratio of 1.00, the 1/N strategy gained about 15.92% annual return and the Sharpe Ratio of 0.99. Moreover, the BL series models are more diversified and robust, about 30% to 60% of assets are selected to construct the portfolio. Even when the transaction cost is taken into account, our proposed models still obtained higher cumulative returns than S&P 500 if the transaction cost is lower than 30% %.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7e596f7f31206770c58b90ca366b88f",
  "timestamp": "2025-05-15T00:40:34.087997"
}