{
  "id": 5651,
  "title": "Corporate risk: CEO overconfidence and incentive compensation",
  "abstract": "Purpose The purpose of this study is to investigate the association between corporate risk and the interaction between CEO incentive compensation and CEO overconfidence. Design/methodology/approach This empirical study performs random and fixed effect (FE) regression analysis. It uses option-implied measures of CEO overconfidence. Findings The authors contribute to the existing literature by showing (1) that the positive association between high CEO incentive compensation and corporate risk only exists in the sphere of overconfident CEOs and (2) that the positive association between overconfident CEOs and corporate risk only exists in the sphere of high CEO incentive compensation. The authors show that the combination of high CEO incentive compensation and CEO overconfidence is associated with an increase in corporate risk of approximately 6% while the individual effects are for all practical reasons negligible. The results imply that only the combination of high CEO incentive compensation and CEO overconfidence is associated with a significantly elevated level of corporate risk. Research limitations/implications The findings are based on S&P 1500 non-financial firms in the period 2007-2016. Practical implications The findings have important implications in terms of CEO selection and compensation. Originality/value This study provides empirical evidence on the importance of the dual presence of high CEO incentive compensation and CEO overconfidence for corporate risk. The previous literature has primarily investigated these phenomena in isolation.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7e77219415624653f682ec26ed5a50a",
  "timestamp": "2025-05-15T02:49:50.379519"
}