{
  "id": 2966,
  "title": "Supply Chain Financial Default Risk Early Warning System Based on Particle Swarm Optimization Algorithm",
  "abstract": "With the advancement of the linkage between financial markets, the probability of credit risk infection is also increasing. Traditional financing methods, which mostly relied on corporate credit to give credit to the whole supply chain, have been replaced by supply chain finance. This paper studies the supply chain financial credit risk through the logistic model and chooses the financial data and supply chain financial operation indicators of relevant listed companies from 2014 to 2016 for analysis. Because not all of companies can find the bad debt rate of accounts receivable from 2014 to 2016, and some agricultural listed companies only have one or two years of relevant data, this paper creates an unbalanced panel data with 91 sample sizes, which is larger than previous studies. Binary logistic regression and principal component analysis are mainly used to accurately calculate the compliance probability of cooperative customers in agricultural supply chain financial products. Unlike the existing literature, which mainly uses s.t to define whether an enterprise defaults, this paper uses Z value to define the default risk of listed companies in agricultural supply chain finance. In terms of the default risk value of the company, Z value not only has high accurate value but also has advantages in accurate prediction, which effectively complements and improves the existing research on supply chain finance.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7e702e8d439a19b51453a39c971ae04",
  "timestamp": "2025-05-15T02:21:19.182190"
}