{
  "id": 7402,
  "title": "Assessing Perspectives of Lower-Income Seniors with Cardiovascular Conditions",
  "abstract": "Introduction: Self-management education and support (SMES) programs can prevent adverse chronic disease outcomes, but factors modifying their reception remain relatively unexplored. We examined how perceptions of an SMES program were influenced by the mode of delivery, and co-receipt of a paired financial benefit. Methods and Patients: Using a cross-sectional survey, we evaluated the perceived helpfulness of a SMES program among 446 lowincome seniors at high risk for cardiovascular events in Alberta, Canada. Secondary outcomes included frequency of use, changes in perspectives on health, satisfaction with the program, and comprehensibility of the material. Participants received surveys after engaging with the program for at least 6 months. We used modified Poisson regression to calculate relative risks. Open-ended questions were analyzed inductively. Results: The majority of participants reported that the SMES program was helpful (>80%). Those who also received the financial benefit (elimination of medication copayments) were more likely to report that the SMES program was helpful (RR 1.24, 95% CI 1.11-1.39). Those who received the program electronically were more likely to use the program weekly (RR 1.51, 1.25-1.84). Both those who received the intervention electronically (RR 1.18, 1.06-1.33), and those who also received copayment elimination (RR 1.17, 1.05-1.31) were more likely to state that the program helped change their perspectives on health. Conclusion: When designing SMES programs, providing the option for electronic delivery appears to promote greater use for seniors. The inclusion of online-delivery and co-receipt of tangible benefits when designing an SMES program for seniors results in favorable reception and could facilitate sustained adherence to health behavior recommendations. Participants also specifically expressed that what they enjoyed most was that the SMES program was informative, helpful, engaging, and supportive.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7e9bf3b0acb96bfb969321b8768bfb3",
  "timestamp": "2025-05-15T03:08:00.878388"
}