{
  "id": 609,
  "title": "Insights into landslide susceptibility: a comparative evaluation of multi-criteria analysis and machine learning techniques",
  "abstract": "Landslides threaten communities worldwide, resulting in financial, environmental, and human losses. Although some studies have employed machine learning (ML) algorithms and multi-criteria analysis (MCA) for landslide susceptibility mapping (LSM), comparative evaluations of these methods remain scarce, particularly regarding predictor importance, performance metrics, and hyperparameter optimization. This research addresses these gaps by comparing logistic regression (LR), random forest (RF), support vector machines (SVM), and MCA, focusing on landslide susceptibility in Petr & oacute;polis, Brazil. The ML models used 29 influencing factors, encompassing geographic, geological, climatic, and anthropogenic variables, where feature importance analysis and hyperparameter tuning were applied to identify the most significant predictors. RF achieved the highest performance, with an accuracy of 0.94, ROC AUC of 0.98, and F1 score of 0.94. SVM and LR also performed well, with ROC AUCs of 0.96 and 0.95 and F1 scores of 0.92 and 0.89, respectively. Conversely, MCA showed lower results, with an accuracy of 0.41, ROC AUC of 0.41, and F1 score of 0.55. We attribute RF's robustness to its adaptability to diverse variable types, reduced overfitting risk, and high predictive accuracy. These findings underscore RF's strength in LSM and highlight ML's potential to support urban planning and mitigate risks in landslide-prone areas.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7ecef565071c1fba645249c01d138a5",
  "timestamp": "2025-05-15T01:52:49.561671"
}