{
  "id": 1336,
  "title": "RETRACTED: Study on the Practice of Enterprise Financial Management System under the Epidemic Norm Based on Artificial Neural Network (Retracted Article)",
  "abstract": "The sudden arrival of the new crown epidemic has had a significant and long-lasting impact on the division's economic environment as well as the production and operation activities of businesses. As far as the financial management is concerned, opportunities and difficulties are faced by enterprises of all types. With reference to the available research data, enterprises have an important contribution to GDP and jobs, but they still face a series of difficulties and challenges in their development in the context of the normalization of the epidemic. By analyzing the impact of the new crown pneumonia epidemic on the financial management work of enterprises, this paper proposes an artificial neural network-based enterprise financial forecasting and early warning method to provide an effective method for enterprise financial management. For the time-series characteristics of enterprise finances, a prediction model based on long- and short-term memory networks is developed which acknowledges the necessity of combining the temporal dimension with the spatial dimension for forecasting. This model incorporates time qualities into the data to the existing forecasting model. It also considers both working and nonworking day data and thoroughly considers the factors influencing corporate finance. Then, using BP neural network for financial risk prediction, nonfinancial index factors should be added to the financial early warning model thus eliminating the limitations of the financial early warning model. At the same time, the accuracy of the prediction can be improved which is more suitable for enterprises to apply in practice. The experimental results demonstrate that the financial prediction model built by multilayer feed forward neural networks and recurrent neural networks based on error back propagation training is inferior to the prediction model built by long- and short-term memory network. Regardless of the degree of fitting or prediction accuracy, the BP neural network model outperforms the conventional model for enterprise financial warning. Under the normalization of the pandemic, the combined use of both can offer an efficient technique for enterprise management.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e7f756503c331d4920c637a992113020",
  "timestamp": "2025-05-15T02:01:44.788258"
}