{
  "id": 8439,
  "title": "Contemporary management of renal cell carcinoma (RCC) in Victoria: implications for longer term outcomes and costs",
  "abstract": "Objective To describe the contemporary patterns of care for renal cell carcinoma (RCC) using a whole of population series from Victoria. Patients and methods Retrospective review of medical records of all patients diagnosed and treated for RCC in Victoria in 2009. Patients were identified via the State-wide Victorian Cancer Registry. Patient demographic characteristics, symptoms, stage, and first-line treatment were assessed. Associations between case residential location (metropolitan or rural) and treatment were examined using multivariate logistic regression after adjusting for age, sex, socioeconomic status, treatment in private or public hospital and comorbidity. Results Data were obtained for 499 of 577 eligible patients. In all, 413 patients (83%) underwent surgery. Laparoscopic radical nephrectomy (RN) was the most common procedure for Stage I pT1a/pT1b tumours (51.2%); partial nephrectomy (PN) was performed for 27% of Stage I RCC In multivariate analysis, regional patients were less likely to receive PN (odds ratio [OR] 0.39, 95% confidence interval [CI] 0.18-0.85) for Stage I RCC, and less likely to receive systemic therapy for Stage IV RCC (OR 0.06, 95% CI 0.01-0.41). Multidisciplinary team meetings were recorded for only 25% of patients and 3% were enrolled in a clinical trial. Conclusion Most contemporary patients diagnosed with RCC are still treated with RN, including those with smaller tumours amenable to PN. This may impact future outcomes, including increased risk of chronic kidney disease and its potential financial healthcare burden. Patterns of treatment also appear to differ between metropolitan and regional populations.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8049c78224c44e32f2e9e38e93660fe",
  "timestamp": "2025-05-15T03:18:51.624797"
}