{
  "id": 3854,
  "title": "Poor and sick? Social health inequalities among students: Results of an online survey of students at Technical University of Applied Sciences Würzburg-Schweinfurt",
  "abstract": "Background Low financial resources and low socioeconomic status are associated with higher morbidity and mortality in the general population. Students generally also have low financial resources and tend to assess a poorer health compared to the general population; in addition, they often exhibit health-related risk behaviors. Aim To describe possible correlations between socioeconomic characteristics and the health and health behavior of students at the Technical University of Applied Sciences W & uuml;rzburg-Schweinfurt (THWS) in order to draw conclusions for student health management. Method Students (N = 238) were asked about their health, health behavior and socioeconomic situation via a cross-sectional online questionnaire study. The evaluation was carried out using descriptive statistics and regression analyses. Results Both positive and negative correlations were found between socioeconomic variables and subjective health as well as health-related risk behaviors. Conclusion Social health inequalities can also be assumed among our students. In particular indebted students, students who perceive their income as insufficient, and students with a low subjective social status should be specifically addressed as potential risk groups via student health management (SGM).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e81053619e243e04c4608f5722f7331d",
  "timestamp": "2025-05-15T02:30:28.786892"
}