{
  "id": 7000,
  "title": "Food insecurity in community-dwelling older Australians",
  "abstract": "Objective: To identify the extent of food insecurity (defined as running out of food in the last 12 months and being unable to afford to buy more) amongst older Australians, and the characteristics of those who experience this condition. Design: Cross-sectional population survey. Setting and subjects: Respondents (n=8881) were community-dwelling older people (65 years and older) living independently in New South Wales, Australia, randomly sampled to participate in a computer-assisted telephone interview conducted during 1999-2000. The response rate was 71%. Responses to a food insecurity questionnaire item were collected along with sociodemographic information, living arrangements, lifestyle and self-rated health. Univariate analyses and logistic regression modelling of factors for reporting food insecurity were conducted. Results: Approximately one in 50 older people reported experiencing food insecurity in the previous 12 months attributable to inadequate finances. The analyses revealed that those at risk can be identified as more likely to report poorer health, limited financial resources, not owning their own home and living alone. Gender and age differences were also evident. Conclusion: While only a minority of older Australians reported experiencing food insecurity attributable to inadequate finances, such people are at higher risk of malnutrition and associated morbidity. Food insecurity is an important public health and equity issue in older people that can be addressed through implementing appropriate income and social support policies.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e81167f2e0b20bffb3ae3d684b8d144d",
  "timestamp": "2025-05-15T03:03:55.837749"
}