{
  "id": 5872,
  "title": "Living alone and depression in Chinese older adults",
  "abstract": "Western literature has repeatedly indicated a strong relationship between living alone and depression among the aged population, however, studies among the Chinese population are scarce. In this paper, we examine whether the association between living alone and depression is independent of health status, social support and financial strain among Chinese older adults, and subsequently assess whether such association persists after adjusting these variables. Cross-sectional data drawn from the Hong Kong Population Census consisting of 2,003 Chinese elderly people aged 60 or over were analyzed. Chi-square tests and logistic regression analyses revealed that living alone results in higher levels of depressive symptoms for older women but not for older men. This relationship remained significant even when socio-demographic variables, health indicators, social support, and financial strains were adjusted; yet, the impact of living alone with depression disappeared when all variables were controlled. In summary, this paper is the first to report that living alone is an independent risk factor contributing to depression among Chinese older women, as well as identifying certain significant factors including social support and health indicators that can affect and explain the link between living alone and depression. Preventive measures and related issues were discussed.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e81294ae9c47466a89a24d1bf7ec1d35",
  "timestamp": "2025-05-15T02:52:31.375792"
}