{
  "id": 8104,
  "title": "Clinical Risk Factors and Postoperative Complications Associated with Unplanned Hospital Readmissions After Cranial Neurosurgery",
  "abstract": "BACKGROUND: Hospital readmission is a key surgical quality metric associated with financial penalties and greater healthcare costs. We examined the clinical risk factors and postoperative complications associated with 30-day unplanned hospital readmissions after cranial neurosurgery. METHODS: We queried the American College of Surgeons National Surgical Quality Improvement Program database from 2011 to 2016 for adult patients who had undergone a cranial neurosurgical procedure. Multivariable logistic regression with backward model selection was used to determine the predictors associated with 30-day unplanned hospital readmission. RESULTS: Of 40,802 cranial neurosurgical cases, 4147 (10.2%) required an unplanned readmission. Postoperative complications were greater in the readmission cohort (18.5% vs. 9.9%; P < 0.001). On adjusted analysis, the clinical factors predictive of unplanned readmission included hypertension, chronic obstructive pulmonary disease, diabetes, coagulopathy, chronic steroid use, and preoperative anemia, hyponatremia, and hypoalbuminemia (P <= 0.01 for all). Higher American Society of Anesthesiology class (III to V), operative time >216 minutes, and unplanned reoperation were also associated with an increased likelihood of readmission (P <= 0.001 for all). The postoperative complications predictive of unplanned readmissions were wound infection (odds ratio [OR], 4.90; P < 0.001), pulmonary embolus (OR, 3.94; P < 0.001), myocardial infarction or cardiac arrest (OR, 2.37; P < 0. 001), sepsis (OR, 1.73; P < 0.001), deep venous thrombosis (OR, 1.50; P = 0.002), and urinary tract infection (OR, 1.45; P = 0.002). Female sex, transfer status, and postoperative pulmonary complications were protective of readmission (P < 0.05 for all). CONCLUSIONS: Unplanned hospital readmission after cranial neurosurgery is a common event. The identification of high-risk patients who undergo cranial procedures might allow hospitals to reduce unplanned readmissions and their associated healthcare costs.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8179c6a1709a6339cd3d98cfda3fe46",
  "timestamp": "2025-05-15T03:15:09.436458"
}