{
  "id": 470,
  "title": "Real-Time Valuation of Large Variable Annuity Portfolios: A Green Mesh Approach",
  "abstract": "The valuation of large variable annuity (VA) portfolios is an important problem of interest, not only because of its practical relevance but also because of its theoretical significance. This is prompted by the phenomenon that many existing sophisticated algorithms are typically efficient at valuing a single VA policy but they are not scalable to valuing large VA portfolios consisting of hundreds of thousands of policies. As a result, this sparks a new research direction exploiting machine learning methods (such as data clustering, nearest neighbor kriging, neural network) on providing more efficient algorithms to estimate the market values and sensitivities of large VA portfolios. The idea underlying these approximation methods is to first determine a set of VA policies that is representative of the entire large VA portfolio. Then the values from these representative VA policies are used to estimate the respective values of the entire large VA portfolio. A substantial reduction in computation time is possible because we only need to value the representative set of VA policies, which typically is a much smaller subset of the entire large VA portfolio. Ideally the large VA portfolio valuation method should adequately address issues such as (1) the complexity of the proposed algorithm; (2) the cost of finding representative VA policies; (3) the cost of the initial training set, if any; (4) the cost of estimating the entire large VA portfolio from the representative VA policies; (5) the computer memory constraint; and (6) the portability to other large VA portfolio valuation. Most of the existing large VA portfolio valuation methods do not necessary reflect all of these issues, particularly the property of portability, which ensures that we only need to incur the start-up time once and the same representative VA policies can be recycled to valuing other large portfolios of VA policies. Motivated by their limitations and by exploiting the greater uniformity of the randomized low discrepancy sequence and the Taylor expansion, we show that our proposed method, a green mesh method, addresses all of the above issues. The numerical experiment further highlights its simplicity, efficiency, portability, and, more important, its real-time valuation application.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e822ced9bfec32086d4bb0c48fd9a5d7",
  "timestamp": "2025-05-15T00:43:47.384570"
}