{
  "id": 5353,
  "title": "A Study of Effective Financial Support for SMEs to Improve Economic and Employment Conditions: Evidence from OECD Countries",
  "abstract": "Using a panel logit regression model, this study analyzes whether or not five categorized financial supports for small and medium enterprises (SMEs) from the governments of 11 Organization for Economic Cooperation and Development (OECD) countries facilitate economic and employment growth: (1) direct government loans to SMEs; (2) government-guaranteed loans to SMEs; (3) the reinforcement of relationship banking; (4) financial stability steps to ease pro-cyclicality; and (5) equity-linked financing. The academic contribution of this research is in identifying the optimal type of government financial support to SMEs given a country's level of financial crisis and market-rate level. The main empirical test results are as follows. First, the type of financial support that contributes most to economic and employment growth is the set of steps that governments take to ease pro-cyclicality. Second, the reinforcement of relationship banking can also contribute to improved economic and employment conditions. Third, in less capital-intensive countries, the results confirm that economic and employment improvement occurs more often if equity-linked financing is used. Fourth, the adoption of dynamic loan-loss provisions to prepare for periods of economic recession is necessary to reduce the pro-cyclicality of SME loans within the 11 OECD countries studied in this paper; it is also necessary to transition from a persistent monetary-easing policy stance to a flexible monetary stance within a country's fiscal policy in order to make commercial banks benefit from an incentive-like risk premium for SME loans despite the existence of economic recessions. Finally, the study finds that the need to apply equity-linked financing methods through the stock market is especially urgent in developing countries. As the managerial perspectives, it is confirmed that easing pro-cyclicality of SME loan and enhancing banking relationship can contribute to SMEs fund management. Copyright (C) 2017 John Wiley & Sons, Ltd.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e82cc0e20d01ec81eec478011ff74206",
  "timestamp": "2025-05-15T02:46:44.988563"
}