{
  "id": 411,
  "title": "Portfolio diversification using subspace factorizations",
  "abstract": "Successful investment management relies on allocating assets so as to beat the stock market. Asset classes are affected by different market dynamics or latent trends. These interactions are crucial to the successful allocation or monies. The seminal work on portfolio management by Markowitz prompts the adroit investment manager to consider the correlation between the assets in his portfolio and to vary his selection so as to optimize his risk-return profile. The factor model, a popular model for the return generating process has been used for portfolio construction and assumes that there is a low rank representation of the stocks. In this work we contribute a new approach to portfolio diversification by comparing a recently developed clustering technique, SemiNMF, with a new sparse low-rank approximate factorization technique, Sparse-semiNMF, for clustering stocks into latent trend based groupings as opposed to the traditional sector based groupings. We evaluate these techniques using a diffusion model based on the Black-Scholes options pricing model. We conclude that Sparse-semiNMF outperforms semiNMF when applied to synthetic stocks as the contribution of each trend to each stock is more disjoint for Sparse-semiNMF than for semiNMF, in an inter-class sense, meaning that the underlying trends for each stock are more readily apparent, whilst preserving the accuracy of the factorization. We conclude that the trend-based asset classes generated by Sparse-semiNMF should be considered in the investment management process to reduce the risk in portfolio selection.",
  "year": 2008,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e83bdbcb59de312ef71fe25f8320a91e",
  "timestamp": "2025-05-15T01:31:50.674881"
}