{
  "id": 224,
  "title": "Credit risk assessment of small and medium-sized enterprises in supply chain finance based on SVM and BP neural network",
  "abstract": "Our country's market economy is composed of enterprises. However, due to their inherent credit deficiencies and high risks of management, it is very difficult for them to obtain financing support. Based on this, this article studies Error Back Propagation (BP) to establish (SMEs). Based on the relevant concepts of the supply chain management budget model, it explores the main factors influencing the financial impact of SMEs and the benefits of the supply chain budget in solving problems expenditure of SMEs, support vector machine is mainly based on solving the main credit risks of small and medium-sized enterprises, such as poor information transparency, low credit and various risk unknown factors. BP neural network is an algorithm that takes into account the components of supply chain financial financing. This article first gives a simple background and theoretical introduction to the under the current supply chain finance model, and then proposes to use SVM and BP neural network algorithms to build and the model has been trained and tested. After collecting relevant references, we will establish authoritative risk assessment rules in accordance with this article according to these standards. These experts are mainly people with many years of experience in the financial industry, and they also have a certain influence in the industry. The risk assessment established for this can be the analysis of factors such as risk indicators and government intervention in this experiment.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8439a4b9eba2669d8026fff66b964f0",
  "timestamp": "2025-05-15T01:48:30.668852"
}