{
  "id": 8316,
  "title": "KNOWLEDGE OF THE ACCA QUALIFICATIONS AMONG THE STUDENTS OF THE ACCREDITED POSTGRADUATE STUDIES",
  "abstract": "Nowadays, under the conditions of an increasing uncertainty and a growing risk, entrepreneurship brings about the necessity for the employers to employ highly skilled professionals who possess vast knowledge of finance and accounting. Due to that, an increasing demand for such professionals has been observed in the labour market. Educational institutions ought to both actively respond to those needs and creatively shape the offer for the labour market. The Management Faculty of the Gdansk University has been continuously immersed in the issues involving the current market requirements by analysing, preparing and offering strictly-profiled accredited master-of-science and postgraduate studies in the areas of finance, accounting, and management. This paper presents the outcomes of the third stage of the questionnaire research carried out at the University of Gdansk as a part of a project titled 'Research on the Students' Knowledge of the Brands of Professional Auditing and Accounting Bodies'. The project was aimed at yielding answers to the following questions: whether the students of the accredited postgraduate studies know the activities performed and the qualifications offered by the ACCA (the Association of Chartered Certified Accountants); what reasons were behind the choice of accredited postgraduate studies by the people currently being employed and whether the employers' expectations had influenced the employees' choice; how the students perceive the financial and the non-financial benefits of attending the accredited postgraduate ACCA Accounting' studies; what is the students' level of English language. The following methods were applied during the conduct of the research: 1 A questionnaire survey was distributed to 59 students of the ACCA Accounting' accredited postgraduate study; responses were received from 54 students, representing the rate of 91.5%. The survey consisted of 32 questions and was divided into two parts: a) the first part concerned the factors influencing the students' choice of the studies, the envisaged realization of the complete qualification, as well as their command of English; b) the second tackled the issues related to the students' familiarity with the ACCA as an organization, the scope of the qualification offered thereby, as well as the financial and the non-financial benefits resulting from the study programme; 2 In order to find out whether the students link their professional careers with the qualification, a logit model (logistic regression) was applied. In social sciences, such dichotomous models are often applied to explain the behaviour of qualitative variables upon the endogenous variables which may also be qualitative. The adopted binary dependent variable and the independent variables have been retrieved from the responses to the survey. The research was concentrated exclusively on the students of the accredited postgraduate 'ACCA Accounting' studies at the University of Gdansk. Therefore, the obtained outcomes are restricted only to this group of the respondents. To enrich the picture, prospective research focusing on other accredited postgraduate studies offered by various universities in Poland should be carried out as well. We believe that the research constitutes a basis for adjusting the university's educational offer to the growing expectations of the employers on the one hand and to the expectations of the professionals who seek to succeed in their careers on the other.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e85a9c6abefdf96e91103e87371241f3",
  "timestamp": "2025-05-15T03:17:49.063177"
}