{
  "id": 6699,
  "title": "Moderators of access and utilization of clinical preventive services in older adults",
  "abstract": "Aim. This paper reports a study exploring the relationships between potential moderators of access and utilization of clinical preventive services in a homogeneous sample of older adults with near universal health coverage. Background. Advancements have occurred in eliminating financial and structural barriers to utilization of clinical preventive services (primary, secondary and tertiary prevention) in most developed countries, but variations in utilization continue. These variations may be attributed to non-social determinants of health moderators that impact utilization in older adults. Methods. Theorized relationships were explored using questions from the United States Behavioral Risk Factor Surveillance System Survey and a homogenous convenience sample of 202 older adults (mean age 84; sd 5.23) with near universal health coverage. Data collected across a 2 year period (20072009) were analysed using Chi-square, MannWhitney U and Hierarchical Logistic Regression. Findings. Several logistic regression models of personal access (advised to lose weight, high blood pressure, high cholesterol); moderators (gender, perceived health status, BMI = 30 kg/m2); and clinical preventive services utilization (check-up in last 12 months; ever had colonoscopy/sigmoidoscopy) showed statistically significant (P < 0.05) improvement in model fit by adding interaction terms (access X moderator). Conclusion. Exploring the impact of moderators on utilization may yield more insight into variations than could be explained by measurement of the direct affect of having near universal health coverage alone.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e85b473332c79275d2d219b51ed26195",
  "timestamp": "2025-05-15T03:00:35.503843"
}