{
  "id": 8819,
  "title": "Identifying Risk Factors for Disparities in Breast Cancer Mortality among African-American and Hispanic Women",
  "abstract": "Background: This study evaluated the risk factors associated with racial disparities in female breast cancer mortality for African-American and Hispanic women at the census tract level in Texas from 1995 to 2005. Methods: Data on female breast cancer cases were obtained from the Texas Cancer Registry. Socioeconomic and demographic data were collected from Census 2000. Network distance and driving times to mammography facilities were estimated using Geographic Information System techniques. Demographic, poverty and spatial accessibility factors were constructed using principal component analysis. Logistic regression models were developed to predict the census tracts with significant racial disparities in breast cancer mortality based on racial disparities in late-stage diagnosis and structured factors from the principal component analysis. Results: Late-stage diagnosis, poverty factors, and demographic factors were found to be significant predictors of a census tract showing significant racial disparities in breast cancer mortality. Census tracts with higher poverty status were more likely to display significant racial disparities in breast cancer mortality for both African Americans (odds ratio [OR], 2.43; 95% confidence interval [CI], 1.95-3.04) and Hispanics (OR, 5.30; 95% CI, 4.26-6.59). Spatial accessibility was not a consistent predictor of racial disparities in breast cancer mortality for African-American and Hispanic women. Conclusion: Physical access to mammography facilities does not necessarily reflect a greater utilization of mammogram screening, possibly owing to financial constraints. Therefore, a metric measuring access to health care facilities is needed to capture all aspects of access to preventive care. Despite easier physical access to mammography facilities in metropolitan areas, great resources and efforts should also be devoted to these areas where racial disparities in breast cancer mortality are often found. Published by Elsevier Inc.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8833e1a8d5cec6aae035055d9391c95",
  "timestamp": "2025-05-15T03:22:57.859750"
}