{
  "id": 6442,
  "title": "Trajectories of maternal depressive symptoms from infancy through early childhood: The roles of perceived financial strain, social support, and intimate partner violence",
  "abstract": "Although new mothers are at risk of heightened vulnerability for depressive symptoms, there is limited understanding regarding changes in maternal depressive symptoms over the course of the postpartum and early childhood of their child's life among rural, low-income mothers from diverse racial backgrounds. This study examined distinct trajectories of depressive symptoms among rural low-income mothers during the first five years of their child's life, at 6, 15, 24, and 58 months, using data from the Family Life Project (N = 1,292). Latent class growth analysis identified four distinct trajectories of maternal depressive symptoms, including Low-decreasing (50%; n = 622), Low-increasing (26%; n = 324), Moderate-decreasing (13%; n = 156), and Moderate-increasing (11%; n = 131) trajectories. Multinomial logistic regression demonstrated that higher perceived financial strain and intimate partner violence, and lower social support predicted higher-risk trajectories (Low-increasing, Moderate-decreasing, and Moderate-increasing) relative to the Low-decreasing trajectory. Compared to the Low-decreasing trajectory, lower neighborhood safety/quietness predicted to the Low-increasing trajectory. Moreover, lower social support predicted the Moderate-increasing trajectory, the highest-risk trajectory, compared to those in Moderate-decreasing. The current analyses underscore the heterogeneity on patterns of depressive symptoms among rural, low-income mothers, and that the role of both proximal and broader contexts contributing to distinct trajectories of maternal depressive symptoms over early childhood.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e88615b85bb5295d08636abbb208f7c8",
  "timestamp": "2025-05-15T02:58:05.724399"
}