{
  "id": 354,
  "title": "A classification framework for carbon tax revenue use",
  "abstract": "Carbon pricing could assist in the dual pursuit of mitigating global climate change and contributing to government coffers. The way in which a government allocates carbon tax revenues is a key factor in the public's acceptance of carbon pricing policy and ultimately in its enduring success. To that end, this article presents an innovative, simple classification framework of carbon tax revenue usage which has four modalities to cater for various policy design features. These are: a constrained approach as opposed to an unconstrained one; a revenue-neutral recycling approach as opposed to a revenue-raising one; an approach according to public preference; and a thematic approach. Thereafter, various attributes are examined to assist policymakers in selecting an appropriate modality. The classification framework will be useful for policymakers as a quick point of reference before embarking on more complex and in-depth policy deliberations. Key policy insights Carbon pricing is the most cost-effective regulatory approach for reducing greenhouse gas emissions and is recognized as a significant contributor to government revenue. Carbon tax revenue use can be classified into four overarching modalities to cater for various policy design attributes. There is no dominating revenue use option from an economic or political viewpoint, owing to trade-offs across various fiscal policy objectives. Carbon taxes are elements of broader tax reform and therefore revenue use options should be aligned with a jurisdiction's broader fiscal policy charter.",
  "year": 2021,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e88a535a09079e389ac493c9f5e8780b",
  "timestamp": "2025-05-15T01:31:13.144170"
}