{
  "id": 51,
  "title": "A multi-scale model with feature recognition for the use of energy futures price forecasting",
  "abstract": "Energy futures pricing is a critical endeavor in terms of the global economy's trend, the sharp fluctuation of which increases the complexity of price series analysis. The majority of previous research has focused on model integration, data-driven factors and information optimization. It is, however, still not straightforward to provide a robust model for understanding the trend of the energy futures prices due to the multifaceted nature of financial markets. To provide feasibility for energy futures prediction, a multiscale model that integrates the decomposition-ensemble approach and the subcomponents clustering method is proposed, which overcomes the fluctuation position of the energy futures price. The subcomponents clustering method is used to obtain a number of subseries with different frequencies after decomposing the energy futures price series into several subcomponents. The linear model is then used to forecast the trend component, while the machine learning method predicts the nonlinearity at the same time. An examination of the multiscale model yields a plausible interpretation. The discussion and analysis evaluate forecasting dependability and feasibility, demonstrating that the developed multiscale model reduces crude oil futures price forecasting by up to 6.11% and natural gas futures price forecasting by up to 2.05%, respectively.",
  "year": 2023,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e88da25431a9a25132236e86f6f3aaa7",
  "timestamp": "2025-05-15T01:28:03.806854"
}