{
  "id": 3889,
  "title": "The Predictive Power of Multi-Factor Asset Pricing Models: Evidence from Pakistani Banks",
  "abstract": "This paper compares the performance of Fama-French three-factor and five-factor models using a dataset of 20 Pakistani commercial banks for the period 2011 to 2020. We focus on an emerging economy as the findings from earlier studies on developed countries cannot be generalized in emerging markets. For empirical analysis, twelve portfolios were developed based on size, market capitalization, investment strategy, and growth. Subsequently, we constructed five Fama-French factors namely, RM, SMB, HML, RMW, and CMA. The OLS regression technique with robust standard errors was applied to compare the predictive power of both the Fama-French models. Further, we also compared the mean-variance efficiency of the Fama-French models through the GRS test. Our empirical analysis provides three unique and interesting findings. First, both asset pricing models have similar predictive power to explain the expected portfolio returns in most cases. Second, our results from the GRS test suggest that there is no noticeable difference in the mean-variance efficiency of one asset pricing model over the other. Third, we find that all factors of both Fama-French models are statistically significant and are important for explaining the volatility of expected commercial bank returns in the context of Pakistan.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8b5953827d1ac93d05fdea260a0d042",
  "timestamp": "2025-05-15T01:21:41.446060"
}