{
  "id": 2313,
  "title": "A Study on the Application of Quantile Regression Equation in Forecasting Financial Value at Risk in Financial Markets",
  "abstract": "With the development of the times and the progress of science and technology, the financial market is constantly reformed and China's financial industry is gradually modernized. However, China's economy has been in the stage of rough growth for a long time, which has led to low efficiency in the allocation of financial resources and unreasonable use of funds, and this has seriously restricted the whole social production activities and the stability and sustainable and healthy development of the national economy, so the prevention and control of financial risks is particularly important. Therefore, how to identify and measure the risks in China's financial industry and manage and invest them in a reasonable way is a very serious issue facing China's financial institutions today. On the other hand, due to the continuous development and innovation of the financial market, China's financial industry has been gradually reformed. However, due to the imperfection of China's economic system and related laws and regulations, some non-performing assets and irregularities in the operation of domestic financial institutions have emerged, and instability in the financial market has also emerged. These phenomena make China's financial industry face huge financial risks in the process of development.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8c32abc6548bdc250daae22d7c72008",
  "timestamp": "2025-05-15T02:14:19.508029"
}