{
  "id": 5028,
  "title": "Financial Costs and Burden Related to Decisions for Breast Cancer Surgery",
  "abstract": "PURPOSE Financial toxicity is a well-recognized adverse effect of cancer care, yet little is known about how women consider treatment costs when facing preference-sensitive decisions for breast cancer surgery or how surgical treatment choice affects financial harm. We sought to determine how financial costs and burden relate to decisions for breast cancer surgery. METHODS Women (>= 18 years old) with a history of breast cancer were recruited from the Army of Women and Sisters Network to complete an 88-item electronic survey. Descriptive statistics and regression analysis were used to evaluate the impact of costs on surgical decisions and financial harm after breast cancer surgery. RESULTS A total of 607 women with stage 0 to III breast cancer were included. Most were white (90%), were insured privately (70%) or by Medicare (25%), were college educated (78%), and reported household incomes of more than $74,000 (56%). Forty-three percent underwent breast-conserving surgery, 25% underwent mastectomy, 32% underwent bilateral mastectomy, and 36% underwent breast reconstruction. Twenty-eight percent reported that costs of treatment influenced their surgical decisions, and at incomes of $45,000 per year, costs were prioritized over breast preservation or appearance. Overall, 35% reported financial burden as a result of their cancer treatment, and 78% never discussed costs with their cancer team. When compared with breast-conserving surgery, bilateral mastectomy with or without reconstruction was significantly associated with higher incurred debt, significant to catastrophic financial burden, treatment-related financial hardship, and altered employment. Among the highest incomes, 65% of women were fiscally unprepared, reporting higher-than-expected (26%) treatment costs. CONCLUSION Cancer treatment costs influenced decisions for breast cancer surgery, and comparably effective surgical treatments differed significantly in their risk of patient-reported financial burden, debt, and impact on employment. Cost transparency may inform preference-sensitive surgical decisions and improve patient-centered care. (C) 2019 by American Society of Clinical Oncology",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8c631f54de4772ea1394a4ee363c227",
  "timestamp": "2025-05-15T02:43:40.123721"
}