{
  "id": 5056,
  "title": "Depression in Mongolian women over the first 2 months after childbirth: Prevalence and risk factors",
  "abstract": "Background: Social, political and economic changes in Mongolia have followed post-Soviet style government policies and contributed to both increased liberalisation and reduced security in employment and family finances. This is the first study to attempt to assess the prevalence of depression in a population of Mongolian women in the post-partum period and assess risk factors, including financial position, associated with the condition. Methods: A total of 1044 women who had delivered healthy babies in Ulaanbaatar between October and December 2002 were screened for depression using the WHO Self Reporting Questionnaire between 5 and 9 weeks post-partum. Further details on the mother, her family and social and economic circumstances were simultaneously collected. Analysis of risk factors for probable depression was undertaken using multiple logistic regression techniques. Results: The prevalence of depression was 9.1% (95% CLs 7.5%-11.1%). Variables significantly and independently associated with risk of probable maternal depression included economic factors, mother being subject to physical abuse, dissatisfied with the pregnancy, concerned about her baby's behaviour, and her own health problems. Limitations: The sample was drawn from a population of mothers all of whom had healthy, fullterm babies of normal birth weight. Clinical confirmation of diagnosis was not established. Conclusions: Mongolian women with young infants in Ulaanbaatar probably experience depression at rates comparable with other cultures. Factors associated with probable depression were dominated by health, relationships and financial position. (C) 2008 Elsevier B.V. All rights reserved.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8d9a66ae2d3e8daad431076d7da6e26",
  "timestamp": "2025-05-15T02:43:40.274389"
}