{
  "id": 6509,
  "title": "Testing times for dementia: a community survey identifying contemporary barriers to risk reduction and screening",
  "abstract": "BackgroundAdvances in pharmacological and non-pharmacological dementia interventions may mean future dementia prevention incorporates a combination of targeted screening and lifestyle modifications. Elucidating potential barriers which may prevent community engagement with dementia prevention initiatives is important to maximise the accessibility and feasibility of these initiatives across the lifespan.MethodsSix hundred seven adults aged over 18 years completed a 54-item, multiple-choice survey exploring contemporary attitudes towards, and barriers to, dementia risk reduction and screening relative to other common health conditions. Participants were sourced from Australia's largest, paid, data analytics service (ORIMA).ResultsFinances (p = .009), poor motivation (p = .043), and time (p <= .0001) emerged as significant perceived barriers to dementia risk reduction behaviours. Lack of time was more likely to be reported by younger, relative to older, participants (p <= .0001), while females were more likely than males to report financial (p = .019) and motivational (p = .043) factors. Binary logistic regression revealed willingness to undertake dementia testing modalities was significantly influenced by gender (genetic testing, p = .012; saliva, p = .038, modifiable risk factors p = .003), age (cognitive testing, p <= .0001; blood, p = .010), and socio-economic group (retinal imaging, p = .042; modifiable risk-factor screening, p = .019). Over 65% of respondents felt adequately informed about risk reduction for at least one non-dementia health condition, compared to 30.5% for dementia.ConclusionsThis study found perceived barriers to dementia risk reduction behaviours, and the willingness to engage in various dementia testing modalities, was significantly associated with socio-demographic factors across the lifespan. These findings provide valuable insight regarding the accessibility and feasibility of potential methods for identifying those most at risk of developing dementia, as well as the need to better promote and support wide-scale engagement in dementia risk reduction behaviours across the lifespan.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8e2a950d678104dd41ac6066cfc1fb4",
  "timestamp": "2025-05-15T02:58:34.327814"
}