{
  "id": 7461,
  "title": "Research on Customer Lifetime Value-Based on the Adjustment of Beta Factor about Compensate Risk",
  "abstract": "Customer Lifetime Value (CLV) is used as an indicator to measure the value contribution of auto insurance customers, and effective renewal business management is carried out, thereby transforming auto insurance short-term transactions into long-term value. This is the development direction of auto insurance business in the future. Therefore, it is very important to build a precise customer value assessment model. Based on the traditional CLV model, this paper draws on the method of risk correction of individual assets in the financial sector, introduces the customer compensate risk factor as an adjustment factor of the discount rate, and creates the RCLV model in order to solve the problem that the CLV model cannot distinguish the potential high-value customers under the same profit cash flow level created by customers with different compensation risks. The RCLV model focuses on how to determine the form of the coefficient. The customer compensate risk factor is defined as the ratio of single customer's loss rate to the overall customer's loss rate, and actively explores the influence of human factors such as the NCD coefficients of Motor Vehicle Insurance, NCD Coefficients of Motor Vehicle Accident Liability Compulsory Insurance, and limitation of Third-party Liability Insurance of Motor Vehicles. In the selection of quantitative models, since the individual claims ratio is consistent with the cumulative loss trend, and there are a large number of zero claims insurance in reality, the zero-adjustment regression model can be reasonably predicted. This paper uses the auto insurance actuarial data of a property insurance company in Beijing in 2015 to extract typical samples for RCLV measurement, and compares it with the original CLV model calculation results to show that the established model can indeed avoid misjudgment of potential good customers.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8e5b1bbfb810326bcb7060b28d847e7",
  "timestamp": "2025-05-15T03:08:37.998505"
}