{
  "id": 1934,
  "title": "Deep learning-based solar power forecasting model to analyze a multi-energy microgrid energy system",
  "abstract": "Multi-energy microgrids (MEM) are a new class of power grids focusing on the distributed form of generation and integrating different energy sectors. The primary idea of MEM is to increase renewable energy share in the final energy demand while maintaining the energy balance at all times. However, integrating renewable technology into the grid has some technical limitations that must be analyzed before being deployed in the real world. This study examines the impact of increasing renewable penetration and portfolio design on a multi-energy microgrid energy system from a technical standpoint. As the accuracy of the system analysis is primarily a factor of modeling accuracy, an artificial neural network-based model is trained and deployed to develop forecasts for solar power generation. The forecasting model is integrated with the EnergyPLAN simulation tool to analyze the multi-energy microgrid system regarding renewable share in primary energy consumption and import/export of energy from the primary grid. The Norwegian energy system is considered a case study, as the energy generation and consumption patterns are interesting from both renewable energy and demand contexts for a cold country. One interesting conclusion is that the portfolio and capacities of coupling components such as combined heat and power plants negatively impact renewable integration, while heat pumps positively impact renewable integration by increasing renewable energy utilization. Additionally, the photovoltaic system size has a high degree of correlation to imports and exports compared to wind generation systems.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8ec590d158dfc5a5e8cfdc5af051e6a",
  "timestamp": "2025-05-15T01:01:06.224006"
}