{
  "id": 7234,
  "title": "Construction and validation of a predictive model for the risk of contralateral patent processus vaginalis in children with unilateral inguinal hernia or hydrocele",
  "abstract": "To develop a nomogram model for predicting contralateral patent processus vaginalis in children with unilateral inguinal hernia or hydrocele. A retrospective analysis was conducted on 259 children with unilateral inguinal hernia or hydrocele who underwent laparoscopic surgery at the Southern Hospital of Southern Medical University from January 2021 to December 2023. The patients were randomly divided into a training set (n = 207) and a validation set (n = 52) in an 8:2 ratio to analyze the characteristics of CPPV. Multivariate logistic regression analysis was used to screen for independent risk factors for CPPV, and a nomogram prediction model was constructed. The predictive ability, calibration, and clinical net benefit of the model were evaluated by plotting receiver operating characteristic (ROC) curves, calibration curves (HL), and clinical decision curves (DCA). Among children under 1 year old, the laparoscopic exploration revealed a CPPV incidence rate of 55.17%. The incidence rates for children aged 2-10 years ranged from 29.03 to 39.13%, and the incidence rate for children aged 11-14 years was 21.21%. Multivariate logistic regression analysis showed that age (OR = 0.9, 95%CI 0.82-0.99, P = 0.035) and female gender (OR = 2.42, 95%CI 1.21-4.83, P = 0.013) were independent risk factors for CPPV, and the incidence of CPPV decreased with age. The area under the ROC curve (AUC) for the training set of the constructed model was 0.632, and the AUC for the validation set was 0.708. The Hosmer-Lemeshow goodness-of-fit test indicated good model fit (training set P = 0.085, validation set P = 0.221), and the DCA curve suggested good clinical benefit.The nomogram model developed in this study demonstrates good clinical value. Children with unilateral inguinal hernia or hydrocele who are younger in age and female gender should undergo careful intraoperative exploration for the presence of CPPV. What is Known:center dot The probability of developing inguinal hernia in children with CPPV is 11%-25%, and redo surgery can increase surgical risks and financial burden.center dot The risk factors of unilateral inguinal hernia combined with CPPV are controversial.What is New:center dot Age and female gender are independent risk factors for CPPV.center dot A nomogram prediction model was constructed to provide a theoretical basis as well as an assessment tool for preoperative evaluation of whether children with unilateral indirect inguinal hernia are susceptible to CPPV.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e8fec98fe8b6e30b6c526922a81aa5f8",
  "timestamp": "2025-05-15T03:06:35.378830"
}