{
  "id": 5530,
  "title": "The heterogeneous effect of governance mechanisms on zero-leverage phenomenon across financial systems",
  "abstract": "Purpose The purpose of this paper is to investigate whether the effect of country and corporate governance mechanisms on zero leverage is heterogeneous across market- and bank-based financial systems. Design/methodology/approach Using logit regression methods and a sample of listed firms from 14 Western European countries for the 2002-2016 period, this study examines the propensity of firms having zero leverage in different financial systems. Findings Country governance mechanisms have a heterogeneous effect on zero leverage, with higher quality mechanisms increasing zero-leverage propensity in bank-based countries and decreasing it in market-based countries. Board dimension and independency have no impact on zero leverage. A higher ownership concentration decreases the propensity for zero-leverage policies in bank-based countries. Research limitations/implications This study's findings show the importance of considering both country- and firm-level governance mechanisms when studying the zero-leverage phenomenon and that the effect of those mechanisms vary across financial and legal systems. Practical implications For managers, this study suggests that stronger national governance makes difficult (favours) zero-leverage policies in market (bank)-based countries. In bank-based countries, it also suggests that the presence of shareholders that own a large stake makes the adoption of zero-leverage policies difficult. This last implication is also important for small shareholders by suggesting that investing in firms with a concentrated ownership reduces the risk that zero-leverage policies are adopted by entrenched reasons. Originality/value To the best of the authors' knowledge, this is the first study to consider simultaneously the effects of both country- and firm-level governance mechanisms on zero leverage and to allow such effects to vary across financial systems.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9261b37f02ec71201b71a56f085781b",
  "timestamp": "2025-05-15T02:48:51.306689"
}