{
  "id": 3971,
  "title": "Is there a trade-off between housing and pension system generosity? Empirical evidence from the Luxembourg Wealth Study",
  "abstract": "This study contributes to the discussion about the role of housing in the old-age security. It attempts to identify some patterns concerning wealth accumulation preferences among elderly households. We pose a question whether these patterns can be associated with pension generosity measured by the level of income replacement. The study employs micro-data from the Luxembourg Wealth Study dataset. Using statistical analysis and multinomial logistic regression modelling we examine housing wealth patterns among elderly households with a special focus on the possible linkage between housing and pension system's generosity. The results of cross-country comparisons imply that there are large country differences in terms of housing wealth accumulation. Analyses of the relationship between (average) pension system generosity and the (average) share of housing assets in total assets at the country level using aggregated values do not provide any evidence for the pensions-housing trade-off. However, when the level of aggregation is reduced, a different picture emerges. Especially when the households having very small or no housing assets relative to total assets are excluded, it becomes clearer that individuals receiving higher pension tend to differentiate their asset portfolio. A possible explanation for this result could be that housing equity becomes less attractive as its role of old-age security is limited by pension generosity.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e93637f7aca591a2f7b8bf3f2c58263a",
  "timestamp": "2025-05-15T01:22:39.408887"
}