{
  "id": 179,
  "title": "Rural Micro Credit Assessment using Machine Learning in a Peruvian microfinance institution",
  "abstract": "Microcredits are an important component in the development of the peruvian rural economy, which are granted by microfinance institutions, the assessment process for the rural an poor people has a high risk index which is traditionally controlled by the business rural advisor, whose main tasks are the evaluation and verification of the clients requesting these microcredits. This research proposes a model that presents the best level of assertiveness for microcredits assessment process based on determination analysis of rural variables based on the specialized literature in the area. This model serves as a decision-support tool for business rural advisor in order to reduce the credit risk of the rural microfinance institution, The most representative variables of the financial and microfinance segment have been evaluated; the data has been pre-processed; Machine Learning models have been selected, trained, validated and evaluated through different metrics. The most assertive model in the assessment process of the granting of rural microcredit, based on the variables and data used by the analyzed entity, are: the Artificial Neural Network (93.72), on Logistic Regression (86.07), Random Forest (66.35), Support Vector Machine (84.44), Decision Tree (88.80) and k-Nearest Neighbor (65.98). Finally, the level of assertiveness achieved by ANN model 93.72% is better than the entity traditional methodology 76.81%, showing an improvement of 16.91% in the index of default customers. (C) 2021 The Authors. Published by Elsevier B.V. This is an open access article under the CC BY-NC-ND license (https://creativecommons.org/licenses/by-nc-nd/4.0) Peer-review under responsibility of the scientific committee of the International Conference on Identification, Information and Knowledge in the internet of Things, 2020.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e953d316c209325bb9c905fd8aab103d",
  "timestamp": "2025-05-15T01:47:52.989306"
}