{
  "id": 1088,
  "title": "A portfolio construction model based on sector analysis using Dempster-Shafer evidence theory and Granger causal network: An application to National stock exchange of India",
  "abstract": "With the emerging areas of economy, the diverse sector-based investment portfolios are considered more significant. This paper presents an integrated approach of portfolio construction based on sector analysis for investment in National Stock Exchange of India. The model is developed in four stages: First, multiple evidences are collected using historical data to analyze the performance of different sectors, and ranked using DempsterShafer evidence theory. The top-ranked sectors are considered as the strong sectors. Second, Granger causality test is employed for determining interdependencies between the strong sectors using the past closing price time series. Then, the strong sectors with no causal relationships are selected to diversify the investment. Third, leading stocks of the selected sectors are picked on the basis on their performance in previous years. Thus, the portfolio of best stocks from strong and diverse sectors is constructed. Fourth, for optimizing of the constructed portfolio or to obtain optimal ratio allocations of stocks in the portfolio, an optimization function is constructed and simulated using a deep recurrent neural network. The results obtained by the proposed portfolio are found very significant which confirms its effectiveness. The applicability of the proposed model is verified by empirical study over the existing models.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e958d136e40948ac9eb4872930244056",
  "timestamp": "2025-05-15T00:51:25.971122"
}