{
  "id": 7619,
  "title": "Association Between 6-Week Postdischarge Risk Classification and 12-Month Outcomes After Orthopedic Trauma",
  "abstract": "IMPORTANCE Numerous studies have demonstrated that long-term outcomes after orthopedic trauma are associated with psychosocial and behavioral health factors evident early in the patient's recovery. Little is known about how to identify clinically actionable subgroups within this population. OBJECTIVES To examine whether risk and protective factors measured at 6 weeks after injury could classify individuals into risk clusters and evaluate whether these clusters explain variations in 12-month outcomes. DESIGN, SETTING, AND PARTICIPANTS A prospective observational study was conducted between July 16, 2013, and January 15, 2016, among 352 patients with severe orthopedic injuries at 6 US level I trauma centers. Statistical analysis was conducted from October 9, 2017, to July 13, 2018. MAIN OUTCOMES AND MEASURES At 6 weeks after discharge, patients completed standardized measures for 5 risk factors (pain intensity, depression, posttraumatic stress disorder, alcohol abuse, and tobacco use) and 4 protective factors (resilience, social support, self-efficacy for return to usual activity, and self-efficacy for managing the financial demands of recovery). Latent class analysis was used to classify participants into clusters, which were evaluated against measures of function, depression, posttraumatic stress disorder, and self-rated health collected at 12 months. RESULTS Among the 352 patients (121 women and 231 men; mean [SD] age, 37.6 [12.5] years), latent class analysis identified 6 distinct patient clusters as the optimal solution. For clinical use, these clusters can be collapsed into 4 groups, sorted from low risk and high protection (best) to high risk and low protection (worst). All outcomes worsened across the 4 clinical groupings. Bayesian analysis shows that the mean Short Musculoskeletal Function Assessment dysfunction scores at 12 months differed by 7.8 points (95% CI, 3.0-12.6) between the best and second groups, by 10.3 points (95% CI, 1.6-20.2) between the second and third groups, and by 18.4 points (95% CI, 7.7-28.0) between the third and worst groups. CONCLUSIONS AND RELEVANCE This study demonstrates that during early recovery, patients with orthopedic trauma can be classified into risk and protective clusters that account for a substantial amount of the variance in 12-month functional and health outcomes. Early screening and classification may allow a personalized approach to postsurgical care that conserves resources and targets appropriate levels of care to more patients.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e96553cd24521f820c549d79084372a0",
  "timestamp": "2025-05-15T03:10:32.980220"
}