{
  "id": 6961,
  "title": "Perceived risk and risk management strategies under irrigated rice farming: Evidence from Tono and Vea irrigation schemes-Northern Ghana",
  "abstract": "The study investigated risk perception, adoption of risk management instruments and the intensity of adoption among irrigated-rice farmers in the Upper East Region of Ghana. A multistage sampling technique was employed to draw 477 farmers for the study. The perception index, multivariate probit and Poisson regression models were used for the analysis. The results show that the perception index score was positive (0.43), which implies that farmers agreed that various types of risk (production, marketing and financial risks) affect their farming. It was found that the farmers combined diverse techniques to manage risk. All the farmers were using improved va-rieties and agrochemicals, yet none had any form of agricultural insurance. Also, farmers' socio-demographic, farm-level, institutional, risk perceptions and environmental changes have a significant and heterogeneous ef-fect on risk management practice. Particularly, gender, years of education, total farm size, rice farm size and soil fertility status significantly predict crop diversification. Gender, years of education, total farm size, rainfall prediction and soil fertility status are the determinants of off-farm work participation. Again, gender, age, years of education, farming experience, extension access, the land tenure system, total farm size, rice farm size and market risk explains farmers' credit uptake. The practice of crop rotation is influenced by gender, farming experience, access to extension services, the land tenure system, total farm size, market risk perception, and soil fertility status; whiles extension services predict engagement in contract farming. Also, the intensity of adopting risk management instruments is influenced by farmers' age, farming experience, the land tenure system, extension access, total farm size and erratic rainfall, heterogeneously. Further, market risk perceptions augment crop rotation and credit access adoption, validating the Protection Motivation Theory. We recommend that in-surance companies develop strategies to ensure the uptake of the policies by farmers within the irrigation scheme. Also, investment in organisations like extension services, research centres, and ICOUR is crucial for development because it may persuade farmers to use the right risk management tools. Further, stakeholders should consider farmers' risk perception when designing risk management policies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e96fc906805e226a147bc5d41b59d63a",
  "timestamp": "2025-05-15T03:03:13.555309"
}