{
  "id": 8787,
  "title": "Diet quality as assessed by Healthy Eating Index-2015 among Hungarian Roma living in settlements of Northeast Hungary",
  "abstract": "Inequalities in diet quality are increasingly reported, but such studies among Roma are scarce and challenging. Here we attempt to examine diet quality and adherence to food based dietary guidelines among Hungarian Roma (HR) ethnic minority living in segregated settlements while comparing a sample of Hungarian adults from the general population (HG). Data were obtained from a complex comparative health survey conducted in Northeast Hungary in 2018, including sociodemographic and physical examination data. Dietary data were collected using two non-consecutive 24-h dietary recalls. We assessed diet quality based on using a 13-component Healthy Eating Index-2015 (HEI-2015, range 0-100). Differences in median intakes of food and nutrients and HEI-2015 scores were evaluated by Mann-Whitney test or Kruskal-Wallis test. Quantile regression was used to adjust HEI-2015 scores for socioeconomic factors including age, sex, educational status, and perceived financial status. This analysis included 393 and 415 subjects, aged between 18 to 70 years, of HR and HG populations, respectively. Results showed overall low median HEI-2015 scores for both HR and HG, with significantly lower total score among HR participants (41.6, interquartile range (IQR): 39.5-42.8) compared to HG (47.2, IQR: 45.7-51.1). Scores for individual components, such as intake of fruits, greens and beans, whole grains, seafood, and plant proteins were particularly suboptimal among both groups, but significantly lower among the HR population. Scores for refined grains, sodium, saturated fats and added sugar reflected high intakes of these components but did not differ between study groups. Our findings revealed an unfavorable diet quality among the HR compared to HG and a potentially increased risk for diet-related NCDs. Future health intervention programs are warranted to address dietary disparities of segregated minorities in Hungary while considering ethnic and cultural differences.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e97a10daad37016ca0afc02a67b9264c",
  "timestamp": "2025-05-15T03:22:26.056902"
}