{
  "id": 6518,
  "title": "Impact of Pandemic on European Well-Being: Visualizing Scenarios from the SHARE Database",
  "abstract": "The objective of this study is to analyse the effect of a pandemic shock on the well-being of the European population aged 50 or over. Data comes from wave 7 of the Survey of Health, Ageing and Retirement in Europe (SHARE), carried out in 28 countries and representing over 170 million aged individuals in Europe. We start by designing two indicators in order to capture the risk of being unhealthy and economically vulnerable; next, we combine them with socio-demographic information and obtain the vulnerability profiles by means of the k-prototypes clustering algorithm. Subsequently, we design a shock similar to the COVID-19 pandemic and measure its effects on the vulnerability profiles. The results suggest that the average level of economic and health vulnerability is relatively low, although levels differ across European regions, with the most vulnerable being Eastern European countries. It was observed that the shock most affected countries with a greater proportion of individuals initially deemed vulnerable in terms of mental and physical health, as well as countries where tourism and retail sectors are the most vital for their economies. These findings led us to conclude that public policies should be differentiated by European regions, and Governments must establish action plans in order to better meet the physical and mental health needs of their citizens, as well as addressing monetary poverty and financial difficulties.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9914d373e672f1def41c6eb84e0e8b8",
  "timestamp": "2025-05-15T02:59:07.406641"
}