{
  "id": 4238,
  "title": "Embracing AI advisors for making (complex) financial decisions: an experimental investigation of the role of a maximizing decision-making style",
  "abstract": "PurposeThis study investigates the impact of experimentally priming a maximizing decision-making style on individuals' likelihood of using artificial intelligence (AI) advisors for making complex financial decisions, such as building an investment portfolio for their retirement. It examines whether individuals with stronger maximizing tendencies are more likely to perceive algorithms as effective, thereby reducing their algorithm aversion, and ultimately increasing the likelihood of using AI advisors in their financial decision-making.Design/methodology/approachA qualitative pre-study amongst individuals differing in their maximizing tendencies to learn more about the existing usage patterns of AI advisors for financial decisions was combined with a quantitative study to experimentally test our hypotheses. For both studies, US participants were recruited through Prolific. The data were analyzed using thematic analysis in NVivo and regression analysis in the SPSS Process macro.FindingsThe results show that individuals primed with a maximizing mindset demonstrated a higher likelihood of using AI advisors for their financial decisions. This effect was serially mediated by the perception of enhanced algorithm effectiveness and reduced algorithm aversion.Practical implicationsThis study provides actionable insights for financial service providers such as banks, pension funds and insurance companies into strategies on how to reduce algorithm aversion and encourage greater AI usage in decision-making amongst their (potential) clients. In particular, to increase the likelihood that consumers will rely on AI advisors for financial decisions, financial service providers can induce a maximizing mindset in these individuals by adjusting the wording of their marketing communications material.Originality/valueThis study extends our understanding of how maximizing tendencies influence the likelihood of using AI advisors. It contributes to the literature by highlighting the role of perceived effectiveness and algorithm aversion and by demonstrating that experimentally inducing a maximizing mindset can increase AI usage for financial decisions; doing so is important as AI can help provide consumers with personalized advice in a cost-effective way.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9bc6a02a9a784d153b21787d722b2ea",
  "timestamp": "2025-05-15T01:24:51.548728"
}