{
  "id": 4573,
  "title": "High-Risk Credit Borrowing Patterns: A Comparison of Cancer With Major Chronic Diseases",
  "abstract": "PURPOSE Although financial toxicity from cancer care is well documented, how cancer and other high-mortality chronic diseases affect credit overuse and high-risk borrowing remains unknown.METHODS We retrospectively analyzed households in the 2012-2018 Health and Retirement Study. Outcomes included nonhousing financial debt and credit card debt. For homeowning households, outcomes also included access to a home equity line of credit (HELOC) and a loan against HELOC. Linear probability regression models compared changes in financial outcomes among households with new cancer diagnosis or major chronic diseases (diabetes, stroke, or heart disease) with those without health shocks. Analyses were stratified by wealth.RESULTS Among 14,188 households (age 68 years, 42% male, 21% Black, 13% Hispanic), 33% had financial debt, 26% had credit card debt, and 10% of homeowners used HELOC. Below-median wealth households were more likely to be Black or Hispanic. They were less likely to be headed by a female and to have college-level education. In these households, 22% had negative financial wealth (v 0% for above-median wealth), and new cancer was associated with a 4.9 percentage point (PPT) increase in rates of financial debt (13.1% effect size; P = .03; 95% CI, 0.005 to 0.094) and a 3.9 PPT increase in HELOC use (65%; P = .04; 95% CI, 0.002 to 0.076) compared with households with no new health changes. Households developing major chronic diseases were 3.6 PPT more likely to develop financial debt (9.6%; P = .015; 95% CI, 0.007 to 0.065) without affecting HELOC use. Such differences disappeared in above-median wealth households.CONCLUSION Below-median wealth households with cancer incurred higher financial debt and refinanced their home more often compared with those without cancer, highlighting credit overuse and borrowing even in a fully insured population.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9c4d093b453f70eac28ec8290c1e30e",
  "timestamp": "2025-05-15T02:38:56.250255"
}