{
  "id": 8087,
  "title": "Differentiating stages of functional vision loss from glaucoma using the Disc Damage Likelihood Scale and cup:disc ratio",
  "abstract": "BackgroundGlaucoma staging is critical for treatment planning but has rarely been tested in severe/end-stage disease. We compared the performance of the Disc Damage Likelihood Scale (DDLS) and cup:disc ratio (CDR) using a functional glaucoma staging system (GSS) as the reference standard. MethodsPost hoc analysis of a randomised controlled trial at the Eye Department of Kilimanjaro Christian Medical Centre, Tanzania. Eligible participants (aged >= 18 years) with open-angle glaucoma, intraocular pressure (IOP) of >21 mm Hg, were randomised to timolol 0.5% eye drops or selective laser trabeculoplasty. Fundoscopy established vertical and horizontal CDRs and DDLS. Visual acuity and static visual fields were graded (GSS). The study used area under the receiver operating characteristic (AROC) curves and Spearman's rank correlation coefficients to compare staging systems. Logistic regression with generalised estimating equations determined risk factors of functional severe/end-stage glaucoma. Results382 eyes (201 participants) were evaluated; 195 (51%) had severe or end-stage glaucoma; mean IOP was 26.7 (SD 6.9) mm Hg. DDLS yielded an AROC of 0.90 (95% CI 0.87 to 0.93), vertical cup:disc ratio (vCDR) of 0.88 (95% CI 0.85 to 0.91, p=0.048) for identifying severe/end-stage disease. Correlation coefficients comparing GSS to DDLS and vCDRs were 0.73 and 0.71, respectively. Advanced structural stages, vision impairment, higher IOP and less financial resources were risk factors of functional severe/end-stage glaucoma. ConclusionThis study indicates that both structural staging systems can differentiate severe/end-stage glaucoma from less severe disease, with a moderate advantage of DDLS over CDR. Clinical examination of the optic disc plays an important role in addition to functional assessment when managing severe/end-stage glaucoma.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9d08be254941e18d08f3393eecc27a8",
  "timestamp": "2025-05-15T03:15:09.349776"
}