{
  "id": 907,
  "title": "Impact of Physiological and Psychological Stress on Glaucoma Development and Progression: A Narrative Review",
  "abstract": "Glaucoma is a leading cause of irreversible blindness worldwide. Presently, elevated intraocular pressure (IOP) is the only approved modifiable risk factor. A consensus of the current literature suggests that both physiological and psychological stress may also impact the lifelong course of glaucoma. Specifically, stress is known to influence sympathetic nervous system activity. An increase in sympathetic nervous system activity may elevate a person's blood pressure (BP) and IOP, and both are strongly associated with glaucomatous disease. Anxiety and depression have more conflicting evidence in relation to glaucoma. Socioeconomic and environmental stress may worsen adherence to therapy and disease outcomes due to a lack of financial resources and related access to healthcare. Neighborhood quality and environmental conditions, particularly urban environments, have been associated with glaucoma risk factors, higher glaucoma prevalence, and delayed surgical interventions. Racial differences have also been identified, with Black patients being more stressed and likely to present with increased glaucoma severity and faster disease progression than White patients. Mindfulness, meditation, and other forms of psychological relaxation have been shown to reduce IOP and stress biomarkers and result in improved quality of life (QOL). Larger studies in more diverse populations are needed to clarify risk and identify the best therapeutic approaches to reduce stress as a method to improve clinical outcomes and QOL for glaucoma patients.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9de960105416566a8492bf4c036dab9",
  "timestamp": "2025-05-15T01:43:54.716743"
}