{
  "id": 2764,
  "title": "Factors associated with perceived donation-related financial burden among living kidney donors",
  "abstract": "The perception of living kidney donation-related financial burden affects willingness to donate and the experience of donation, yet no existing tools identify donors who are at higher risk of perceived financial burden. We sought to identify characteristics that predicted higher risk of perceived financial burden. We surveyed 51 living kidney donors (LKDs) who donated from 01/2015 to 3/2016 about socioeconomic characteristics, predonation cost concerns, and perceived financial burden. We tested associations between both self-reported and ZIP code-level characteristics and perceived burden using Fisher's exact test and bivariate modified Poisson regression. Donors who perceived donation-related financial burden were less likely to have an income above their ZIP code median (14% vs. 72%, P=.006); however, they were more likely than donors who did not perceive burden to rent their home (57% vs. 16%, P=.03), have an income <$60000 (86% vs. 20%, P=.002), or have had predonation cost concerns (43% vs. 7%, P=.03). Perceived financial burden was 3.6-fold as likely among those with predonation cost concerns and 10.6-fold as likely for those with incomes <$60000. Collecting socioeconomic characteristics and asking about donation-related cost concerns prior to donation might allow transplant centers to target financial support interventions toward potential donors at higher risk of perceiving donation-related financial burden. In this single-center study of perceived donation-related financial burden among living kidney donors, the authors observe that key socioeconomic factors, including home ownership and household income, are associated with perceived burden, potentially allowing centers to identify and support donors at higher risk of perceived financial burden early in the evaluation process.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9e18cd8e4996428433959bb300799ca",
  "timestamp": "2025-05-15T02:19:08.329818"
}