{
  "id": 5070,
  "title": "A strategy for forecasting option prices using fuzzy time series and least square support vector regression with a bootstrap model",
  "abstract": "Recently, the strategy for forecasting option price has become a popular financial topic because options are important tools on risk management in financial investments. The well-known Black-Scholes model (B-S model) is widely used for option pricing. In B-S model, the normal distribution assumption is important. However, the financial data in real life may not follow the normal distribution assumption. For this reason, this paper proposes a novel hybrid model, which is a nonlinear prediction model without normal distribution assumptions to forecast the option prices. The proposed model is composed of a Fuzzy Time Series (FTS) model, a Least Square Support Vector Regression (LSSVR), and a bootstrap method. In the proposed model, FTS model is firstly used to fuzzify dataset and to build historical database. Subsequently, the proposed method uses the remainder contractual time to search similar historical trends as training samples. Finally, we use the bootstrap method on LSSVR to enhance the prediction accuracy. The experiment results show that the proposed model outperforms traditional time series models and several hybrid models in terms of the Root Mean Square Error (RMSE), the Mean Absolute Error (MAE) and the correlation coefficient (r) of actual and forecasted option price. (C) 2014 Sharif University of Technology. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9e8ad19409699ca08613df685d487d0",
  "timestamp": "2025-05-15T02:44:10.977264"
}