{
  "id": 5680,
  "title": "Socio-economic costs of rare diseases and the risk of financial hardship: a cross-sectional study",
  "abstract": "Background To achieve universal healthcare coverage (UHC), the rare disease (RD) population must also receive quality healthcare without financial hardship. This study evaluates the impact of RDs in Hong Kong (HK) by estimating cost from a societal perspective and investigating related risk of financial hardship.Methods A total of 284 RD patients and caregivers covering 106 RDs were recruited through HK's largest RD patient group, Rare Disease Hong Kong, in 2020. Resource use data were collected using the Client Service Receipt Inventory for Rare disease population (CSRI-Ra). Costs were estimated using a prevalence-based, bottom-up approach. Risk of financial hardship was estimated using catastrophic health expenditure (CHE) and impoverishing health expenditure (IHE) indicators. Multivariate regression was performed to identify potential determinants.Findings Annual total RD costs in HK were estimated at HK$484,256/patient (United States (US) $62,084). Direct non-healthcare cost (HK$193,555/US$24,814) was the highest cost type, followed by direct healthcare (HK$187,166/ US$23,995), and indirect (HK$103,535/US$13,273) costs. CHE at the 10% threshold was estimated at 36.3% and IHE at the $3.1 poverty line was 8.8%, both significantly higher than global estimates. Pediatric patients reported higher costs than adult patients (p < 0.001). Longer years since genetic diagnosis was the only factor significantly associated with both total costs (p = 0.026) and CHE (p = 0.003).Interpretation This study serves as the first in the Asia Pacific region to simultaneously assess the societal costs and financial hardship related to RDs and highlights the importance of an early genetic diagnosis. These results contribute to existing evidence on the globally ubiquitous high costs of RDs, warranting collaboration between different stakeholders to include RD population in UHC planning.Funding Health and Medical Research Fund, and the Society for the Relief of Disabled Children.Copyright (c) 2023 The Author(s). Published by Elsevier Ltd. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9f3038656abc9813ac3c00a7d494856",
  "timestamp": "2025-05-15T02:50:21.212280"
}