{
  "id": 9319,
  "title": "Determinants of SMEs liquidation: board heterogeneity and applicability of survival models",
  "abstract": "Purpose As small and medium-size enterprises (SMEs) rely on board heterogeneity to raise capital and establish credit relationships with suppliers, it is crucial to investigate the board heterogeneity effect on their survival. In this study, the first research objective is to provide further insights on the discriminatory power of survival approaches, specifically on semiparametric approaches in survival analysis that take into consideration both fixed and time-varying covariates. The second objective is to examine the relationship between board size and SME liquidation by using resource-based theories that focus on measuring board heterogeneity through board size. Design/methodology/approach This paper uses survival approaches for modelling SMEs survival by examining the survival of more than 68,000 SMEs in the UK covering the before, onset and post 2008 crisis periods and with firms' demographic characteristics and financial indicators. Survival analysis is effective to examine multiple causes of default/failure and how do particular circumstances or characteristics increase or decrease the probability of survival. Survival analysis brings more advantages than linear-based regression approaches by effectively handling the censoring of observations. Findings Motivated by resource-based theories, the authors find that the likelihood of a firm being liquidated robustly increases with a reduction in its board heterogeneity measured through board size. This finding is held under non-parametric, parametric, and semiparametric approaches using survival analysis. The research shows better causal explanation and discriminatory power on using the semiparametric-based survival analysis approach considering both fixed and time-varying covariates. Practical implications This study demonstrates the better performance and causal explanation of the survival model using time-varying covariates compared with those using fixed covariates. In addition, the authors delve into board heterogeneity, measuring through the board size to investigate how the number of board directors affects the firm liquidation, it is also a factor worth considering when a small and medium firm is forming its board. Originality/value This research investigates the board heterogeneity effect on firm survival using survival analysis approaches. The authors contribute to the knowledge on board heterogeneity of SMEs. Specifically, the size of more than three directors could help reduce SMEs liquidation risk. This result gives a recommendation to firms or start-ups when forming their director board. This research also provides further insights on the applicability of survival models with unique UK SMEs data covering the before, onset and post 2008 crisis periods.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9f5b524812df4775267565e0c051af9",
  "timestamp": "2025-05-15T03:27:53.301130"
}