{
  "id": 8400,
  "title": "Polycentricity, reciprocity, and farmer adoption of conservation practices under community-based governance",
  "abstract": "Significant steps have occurred under Australia's 'regional delivery model' towards devolving responsibilities for natural resource management (NRM) to community-based regional bodies, particularly in respect of motivating farmers to adopt priority conservation practices. Challenges remain in effectively engaging the large populations covered by these bodies, especially with these bodies expected to assume responsibilities that risk them becoming perceived as extensions of government and favoring particular stakeholders. In this article, I examine whether polycentric systems of collaborative community-based governance can help address these challenges. The examination involves double-censored regression analyses of data from postal surveys of farmers in three regions. The findings suggest that community-based approaches are capable under the regional delivery model of motivating greater voluntary cooperation from farmers than otherwise possible. They highlight the importance of farmers coming to adopt reciprocity strategies in their key institutional relationships under this model. It seems subregional bodies have an advantage over regional bodies in motivating such behavior from farmers because the former are better positioned to engage them sufficiently to turn around norms of free-riding or opposition entrenched by earlier paternalistic approaches to agri-environmental conservation. This indicates the value of a polycentric approach to community-based NRM wherein responsibilities are devolved to the lowest possible governance level consistent with the principle of subsidiarity. The economic dividend from increased voluntary adoption of conservation practices under this approach arises from the reduced transaction, political and other opportunity costs of achieving the same result entirely through coercion or financial inducements. (C) 2008 Elsevier B.V. All rights reserved.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9f9642332b74f9e397f521339ebd969",
  "timestamp": "2025-05-15T03:18:19.671963"
}