{
  "id": 6283,
  "title": "Suicide in males and females with cardiovascular disease and comorbid depression",
  "abstract": "Background: Myocardial infarction (MI) has been associated with an increased risk of suicide, further increased among individuals with a comorbid psychiatric illness. A paucity of studies have examined details of suicide among individuals with cardiovascular disease (CVD) and comorbid depression. We aimed to compare demographic, clinical and suicide-specific characteristics between suicide victims with CVD with depression (CVD+D) and without comorbid depression (CVD-D). Methods: Coroner data on suicide decedents with CVD (n=413) occurring in Toronto, Canada from 1998 to 2012 were collected. Characteristics were compared between the CVD+D and CVD-D groups. Regression analysis examined for gender differences in these groups. Results: CVD+D subjects compared to CVD-D were more likely to have had a past suicide attempt (p = 0.008), and to have experienced a bereavement (p = 0.008) or financial stressor (p = 0.005) in the past year. Each of these variables remained significantly associated with the presence of depression after the regression analysis. Within the CVD+D group, females were more likely to die from suicide by self poisoning (p < 0.0001) and males by shooting (p = 0.001). Limitations: Psychological autopsies were not available. The definition of CVD was broad and the accuracy of its diagnosis could not be confirmed. Conclusion: Individuals with CVD+D who died from suicide had significant differences in clinical characteristics and specific stressors compared to those without depression. These data may help to better characterize suicide risk and prevention in this vulnerable population. (C) 2016 Elsevier B.V. All rights reserved.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "e9ff135e750d361e4efb0310e087d814",
  "timestamp": "2025-05-15T02:56:37.332589"
}