{
  "id": 8872,
  "title": "Perceived neighborhood social cohesion and subsequent health and well-being in older adults: An outcome-wide longitudinal approach",
  "abstract": "Background: Growing research documents associations between neighborhood social cohesion with better health and well-being. However, other work has identified social cohesion's dark side and its ability to promote negative outcomes. It remains unclear if such diverging findings are attributable to differences in study design, or other reasons. To better capture its potential heterogeneous effects, we took an outcome-wide analytic approach to examine perceived neighborhood social cohesion in relation to a range of health and well-being outcomes. Methods: Data were from 12,998 participants in the Health and Retirement Study-a large, diverse, prospective, and nationally representative cohort of U.S. adults age >50. Multiple regression models evaluated if social cohesion was associated with physical health, health behavior, psychological well-being, psychological distress, and social well-being outcomes. All models adjusted for sociodemographics, personality, and numerous baseline health and well-being characteristics. To evaluate the effects of change in cohesion, we adjusted for prior social cohesion. Bonferroni correction was used to account for multiple testing. Results: Perceived neighborhood social cohesion was not associated with most physical health outcomes (except for reduced risk of physical functioning limitations and better self-rated health) nor health behavior outcomes (except for more binge drinking). However, it was associated with numerous subsequent psychosocial well-being (i.e., higher: positive affect, life satisfaction, optimism, purpose in life, mastery, health mastery, financial mastery; reduced likelihood of infrequent contact with friends) and psychological distress outcomes (i.e., lower depression, hopelessness, negative affect, loneliness) over the 4-year follow-up period. Conclusions: With further research, these results suggest that perceived neighborhood social cohesion might be a valuable target for innovative policies aimed at improving well-being.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ea0caa008e4be80aeae0de6ea99cfddb",
  "timestamp": "2025-05-15T03:23:27.760043"
}