{
  "id": 5955,
  "title": "Effects of carbon emissions on audit fees",
  "abstract": "PurposeThis paper aims to examine the effect of carbon emissions on audit fees. The authors hypothesize that firms in cities with higher carbon emission levels have lower reporting transparency, higher return volatility or are subject to higher reputation risk, causing them to be charged higher audit fees for auditing services.Design/methodology/approachThe authors use panel data of 25,960 firm-year observations from a sample of Chinese firms. The carbon emission data for each Chinese city are obtained from the China Emission Accounts and Datasets for Emerging Economies. This paper adopts a multiple regression model to study the impact of carbon emissions on audit fees.FindingsThe authors find that firms located in cities with higher carbon emission levels and firms with more carbon emissions are charged, on average, a higher audit fee. This audit fee effect of carbon risk is transmitted by lessened information transparency and elevated financial risk within these firms. This paper shows that auditors consider carbon risk in their audit fee decisions and other factors that could influence audit risk and effort.Originality/valueThis study draws a connection between carbon emissions and audit fees. It is especially relevant due to the increasing importance of environmental factors in the audit risk assessment. In addition, the findings suggest that a firm implementing a proactive environmental strategy benefits the economy and decreases the costs to the firm for services such as auditing.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ea3c51b09062b4b64e01e48a560025aa",
  "timestamp": "2025-05-15T02:53:03.180552"
}