{
  "id": 9010,
  "title": "Investigating the effect of recall period on estimates of inpatient out-of-pocket expenditure from household surveys in Vietnam",
  "abstract": "Out-of-pocket payments (OOPs), direct payments by households or individuals for healthcare are part of the health financing landscape. Data on OOPs is needed to monitor progress in financial risk protection, and the evaluation of health financing policies. In low-and-middle-income countries, estimates of OOPs rely heavily on self-reported data from household surveys. These surveys require respondents to recall events in the past and can suffer from recall biases. This study investigates the effect of recall period on the agreement of the amount and timing of inpatient OOPs between household reports and provider records in Bavi, Vietnam. We recruited 1397 households for interview using records from the district hospital. The households were interviewed with identical questionnaires except that the recall period was either 12 or 6 months. We linked household with provider data and excluded medicine costs from both household and provider OOPs since they could be purchased outside the hospital. We estimated the effect of recall period on the overall mean and variability of ratios of household to hospital reported OOPs using the Bland-Altman approach for method comparison. We estimated the effect of recall period on whether a transaction was recalled correctly in expenditure and time using multinomial regression. The households reported higher amounts of OOPs than did the hospital for both recall periods. There was no evidence of an effect of recall period on the mean of the ratios of household- to hospital-reported OOPs, although the confidence intervals are not inconsistent with previous studies indicating higher OOPs for shorter recall periods. The geometric mean ratio for the 6-month period was estimated to be a multiple of 1.4 (95% CI 0.9, 2.1) times that of the 12-month period. Similarly, there was no evidence of an effect of recall period on the risk of reporting lower or higher amounts than provider OOPs. The occurrence and timing of inpatient stays generally recalled well, with 70% remembered in the correct month declining slightly over time. Respondents for the 6-month recall period had a significantly lower risk of failing to report the event (RR 0.8 (0.7, 1.0)). The results suggest the best recall period may depend on whether the purpose of a survey is for the recall of the timing of events, in which case the 6 month period may be better, or the amounts of OOPs, where there was no significant difference and the provider records are not a gold standard but the 12 month period had a tendency to be in closer agreement with the provider OOPs.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ea41e10fada8cd0e7ad47bfca06529a8",
  "timestamp": "2025-05-15T03:24:26.423074"
}