{
  "id": 833,
  "title": "The Role of IT Governance in the Integration of AI in Accounting and Auditing Operations",
  "abstract": "IT governance is a framework that manages the efficient use of information technology within an organization, focusing on strategic alignment, risk management, resource management, performance measurement, compliance, and value delivery. This study investigates the role of IT governance in integrating artificial intelligence (AI) in accounting and auditing operations. Data were collected from 228 participants from Saudi Arabia using a combination of convenience sampling and snowball sampling methods. The collected data were then analyzed using structural equation modeling. Unexpectedly, the results demonstrate that AI, big data analytics, cloud computing, and deep learning technologies significantly enhance accounting and auditing functions' efficiency and decision-making capabilities, leading to improved financial reporting and audit processes. The results highlight that IT governance plays a crucial role in managing the complexities of AI integration, aligning business strategies with AI-enabled technologies, and facilitating these advancements. This research fills a gap in previous research and adds significantly to the academic literature by improving the understanding of integrating AI into accounting and auditing processes. It builds on existing theoretical frameworks by investigating the role of IT governance in promoting AI adoption. The findings provide valuable insights for accounting and auditing experts, IT specialists, and organizational leaders. The study provides practical insights on deploying AI-driven technology in organizations to enhance auditing procedures and financial reporting. In a societal context, it highlights the broader implications of AI on transparency, accountability, and trust in financial reporting. Finally, the study offers practitioners, policymakers, and scholars valuable insights on leveraging AI advancements to optimize accounting and auditing operations. It highlights IT governance as an essential tool for effectively integrating AI technologies in accounting and auditing operations. However, successful implementation encounters significant organizational challenges like organizational support, training, data sovereignty, and regulatory compliance.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ea53c4a2a75963aead0f7a3ba3df85a5",
  "timestamp": "2025-05-15T01:43:20.577654"
}