{
  "id": 5403,
  "title": "Optimizing Care Delivery in Patients with Chronic Kidney Disease in the United States: Proceedings of a Multidisciplinary Roundtable Discussion and Literature Review",
  "abstract": "Background: Approximately 37 million individuals in the United States (US) have chronic kidney disease (CKD). Patients with CKD have a substantial morbidity and mortality, which contributes to a huge economic burden to the healthcare system. A limited number of clinical pathways or defined workflows exist for CKD care delivery in the US, primarily due to a lower prioritization of CKD care within health systems compared with other areas (e.g., cardiovascular disease [CVD], cancer screening). CKD is a public health crisis and by the year 2040, CKD will become the fifth leading cause of years of life lost. It is therefore critical to address these challenges to improve outcomes in patients with CKD. Methods: The CKD Leaders Network conducted a virtual, 3 h, multidisciplinary roundtable discussion with eight subject-matter experts to better understand key factors impacting CKD care delivery and barriers across the US. A premeeting survey identified topics for discussion covering the screening, diagnosis, risk stratification, and management of CKD across the care continuum. Findings from this roundtable are summarized and presented herein. Results: Universal challenges exist across health systems, including a lack of awareness amongst providers and patients, constrained care team bandwidth, inadequate financial incentives for early CKD identification, non-standardized diagnostic classification and triage processes, and non-centralized patient information. Proposed solutions include highlighting immediate and long-term financial implications linked with failure to identify and address at-risk individuals, identifying and managing early-stage CKD, enhancing efforts to support guideline-based education for providers and patients, and capitalizing on next-generation solutions. Conclusions: Payers and other industry stakeholders have opportunities to contribute to optimal CKD care delivery. Beyond addressing the inadequacies that currently exist, actionable tactics can be implemented into clinical practice to improve clinical outcomes in patients at risk for or diagnosed with CKD in the US.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ea5e36ee645a786f65e2dab7ad4ead14",
  "timestamp": "2025-05-15T02:47:14.076733"
}