{
  "id": 938,
  "title": "Do incentives work? A qualitative study of managers' motivations in hazardous industries",
  "abstract": "Incentive schemes are one way that companies seek to align the interests of their employees with corporate goals. Indicators of major accident risk management have been historically excluded from such incentives. However, analyses of the recent BP disasters found that the incentives worked against process safety, and it was recommended that companies move to include indicators to support the safe management of their complex technologies. The extent to which this recommendation has been applied, and its appropriateness in practice has not been the subject of systematic inquiry. Drawing on the literature on human motivation and incentives, this article addresses the present and potential role of incentives to manage major accident risk in hazardous industries. It focuses on the extent to which senior managers are motivated by incentives in their daily decisions. This analysis is based on qualitative interviews, observation, and document analysis in 11 case study companies across the oil and gas, petrochemical, pipeline, and mining sectors. We argue that despite discomfort with the concept that safety decisions might be influenced by money, incentives influence priorities and behaviours because they do not rely for their effect on economic self-interest alone. Instead they tap a number of human motives, among them the need for approval, and the need to be recognised as making a valuable contribution. We conclude that if incentives continue to be used as a motivation strategy for financial and business performance, safety particularly as it relates to major accident prevention must also be incentivised in this way. (C) 2014 Elsevier Ltd. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ea5fa2354a69521e6a85ebcc8c0bee03",
  "timestamp": "2025-05-15T01:44:35.469641"
}