{
  "id": 8526,
  "title": "Risk factors for domestic violence: findings from a South African cross-sectional study",
  "abstract": "In 1998 a cross-sectional study of violence against women was undertaken in three provinces of South Africa. The objectives were to measure the prevalence of physical, sexual and emotional abuse of women, to identify risk factors and associated health problems and health service use. A multi-stage sampling design was used with clusters sampled with probability proportional to number of households and households were randomly selected from within clusters. One randomly selected woman aged 18-49 years was interviewed in each selected home. Interviews were held with a total 1306 women, the response rate was 90.3% of eligible women. For the risk factor analysis, multiple logistic regression models were fitted from a large pool of candidate explanatory variables, while allowing for sampling design and interviewer effects. The lifetime prevalence of experiencing physical violence from a current or ex-husband or boyfriend was 24.6%, and 9.5% had been assaulted in the previous year. Domestic violence was significantly positively associated with violence in her childhood, her having no further education, liberal ideas on women's roles, drinking alcohol, having another partner in the year, having a confidant(e), his boy child preference, conflict over his drinking, either partner financially supporting the home, frequent conflict generally, and living outside the Northern Province. No significant associations were found with partners' ages, employment, migrant status, financial disparity, cohabitation, household possessions, urbanisation, marital status, crowding, communication, his having other partners, his education, her attitudes towards violence or her perceptions of cultural norms on women's role. The findings suggest that domestic violence is most strongly related to the status of women in a society and to the normative use of violence in conflict situations or as part of the exercise of power. We conclude by discussing implications for developing theory on causal factors in domestic violence. (C) 2002 Elsevier Science Ltd. All rights reserved.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ea6a797ff5baa4c7199f97fd2d48efec",
  "timestamp": "2025-05-15T03:19:52.038310"
}