{
  "id": 4149,
  "title": "Predicting citation impact from altmetric attention in clinical and translational research: Do big splashes lead to ripple effects?",
  "abstract": "Publications are commonly used to evaluate the productivity and impact of research programs. Traditional metrics examine publication impact through slowly accumulating academic citations. Altmetrics are a new way to describe early publication influence in nonacademic media/community spheres (news, tweets, and blogs). Articles with significant altmetric attention make a big splash of immediate impact, whereas papers with high rates of academic citation reflect ripple effects of influence over time. Past research has found weak associations between altmetrics and academic citations. However, no previous research has focused on clinical/translational research, which aims to translate scientific discoveries to public use. Further, no previous research has assessed the relationship between altmetrics and modern citation impact factors like the National Institutes of Health (NIH)'s Relative Citation Ratio (RCR). It is also unclear whether publication in journals with higher journal impact factors (JIFs) may drive both public attention and academic impact. We investigated whether early altmetric indicators of splash predict citation ripples, beyond the effect of the JIF. For a portfolio of 2188 publications supported by the NIH's Georgia Clinical and Translational Science Alliance from 2007-2020, we collected 2020 Altmetric Attention Scores (AAS), 2020 JIFs, and 2021 RCRs. All three were significantly correlated with one another. Regression analyses revealed that AAS significantly predicts later RCR, controlling for JIF and publication year. Findings indicate that in clinical/translational science, articles that make a big splash of altmetric attention have ripple effects through increased citation influence, which is not entirely due to publication in higher impact journals. Altmetric attention may be a useful early indicator of eventual influence and potential for translational advancement.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ea9110eca56f8a8b0b45d784bf2162f6",
  "timestamp": "2025-05-15T01:24:25.328479"
}