{
  "id": 8152,
  "title": "Medicaid and Indigent Patients Experience Delayed Fixation of Distal Radius Fractures, Resulting in Worse Consequential Radiographic Outcomes",
  "abstract": "Distal radius fractures are the most common upper extremity injury. Pa- tients referred to safety -net tertiary facilities following a fracture experi- ence significant delays in treatment because of financial and language barriers as well as poor access to care at outlying community hospitals. This delay in treatment can affect postoperative functional outcomes and complication rates because of failure to restore anatomic alignment. The purpose of this multicenter study was to assess for risk factors associ- ated with delayed fixation of distal radius fractures and evaluate the im- pact of delayed treatment on radiographic alignment. Patients with a distal radius fracture treated surgically during a 2 -year period were identified. Measures included time from injury to surgery, demographic information, fracture classification, and radiographic parameters. The effect of surgery delay on radiographic outcomes was assessed with delayed surgery de- fined as 11 or more days out from injury. A total of 183 patients met study inclusion criteria. Medicaid and indigent patients were more likely to ex- perience a delay in surgical treatment. Specifically, 70% of these patients were treated in a delayed fashion. Delayed treatment of 11 days or more was associated with worse radial height and inclination on postoperative radiographic imaging. Medicaid and indigent patients are more likely to experience delayed fixation in the treatment of distal radius fractures. This delayed surgery negatively affects postoperative radiographic outcomes. These findings suggest a need to improve access to care for Medicaid and indigent patients and to proceed with operative intervention within 10 days for distal radius fractures. [Orthopedics. 2024;47(2):e93 -e97.]",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ea9a083fc7fd40ffd4884822182773d2",
  "timestamp": "2025-05-15T03:15:38.461379"
}