{
  "id": 3994,
  "title": "Capital adequacy and corporate performance of non-financial firms: Empirical evidence from Nigeria",
  "abstract": "This research assesses the effect of capital adequacy on the corporate performance of quoted non-financial firms operating in Nigeria. Several studies on the influence of capital adequacy on corporate performance have been conducted without specific focus on non-financial entities despite their growing contribution to the country's gross domestic product (GDP). The study utilized the ex-post facto research design using secondary data obtained for the period 2011-2020. A sample of thirty-eight (38) out of sixty-three (63) listed non-financial firms were purposively selected while data obtained were analyzed using multivariate regression. The study found that while capital adequacy ratio, equity capital/total assets ratio and cost income ratio negatively affected corporate performance, debt equity ratio and firm size positively influenced corporate performance of quoted non-financial firms operating in Nigeria. It therefore concluded that firm size and profitable use of debt capital in the capital mix of non-financial firms are key factors that can positively drive their corporate performance. Consequently, it recommended that the management of non-financial firms should explore opportunities inherent in profitable use of debt capital to further improve their performance and hence returns to their respective stakeholders. Additionally, regulators of non-financial firms operating in Nigeria should strengthen the risk management monitoring framework to ensure market discipline and balanced growth and development of the firms.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ea9a36a14f08385832b8121957e8184b",
  "timestamp": "2025-05-15T02:31:58.655936"
}