{
  "id": 9044,
  "title": "Do outcomes differ between work and non-work-related injury in a universal injury compensation system? Findings from the New Zealand Prospective Outcomes of Injury Study",
  "abstract": "Background: Poorer recovery outcomes for workers injured in a work setting, as opposed to a non-work setting, are commonly attributed to differences in financial gain via entitlement to compensation by injury setting (ie. workers compensation schemes). To date, this attribution hasn't been tested in a situation where both work and non-work-related injuries have an equivalent entitlement to compensation. This study tests the hypothesis that there will be no differences in recovery outcomes for workers by injury setting (work and non-work) within a single universal entitlement injury compensation scheme. Methods: Workforce active participants from the Prospective Outcomes of Injury Study (POIS) cohort were followed up at 3-and 12-months following injury. Participants who were injured in the period June 2007-May 2009 were recruited from New Zealand's universal entitlement injury compensation scheme managed by the Accident Compensation Corporation (ACC). An analysis of ten vocational, disability, functional and psychological recovery outcomes was undertaken by injury setting. Modified Poisson regression analyses were undertaken to examine the relationship between injury setting and recovery outcomes. Results: Of 2092 eligible participants, 741 (35%) had sustained an injury in a work setting. At 3 months, workers with work-related injuries had an elevated risk of work absence however, this difference disappeared after controlling for confounding variables (adjusted RR 1.10, 95% CI 0.94-1.29). By 12 months, workers with work-related injuries had poorer recovery outcomes with a higher risk of absence from work (aRR 1.37, 95% CI 1.10-1.70), mobility-related functional problems (aRR 1.35, 95% CI 1.14-1.60), disability (aRR 1.32, 95% CI 1.04-1.68) and impaired functioning related to anxiety/depression (aRR 1.21, 95% CI 1.00-1.46). Conclusion: Our study, comparing recovery outcomes for workers by injury setting within a single universal entitlement injury compensation scheme, found mixed support for the hypothesis tested. After adjustment for possible covariates recovery outcomes did not differ by injury setting at 3 months following injury, however, by 12 months vocational, disability and some functional outcomes, were poorer for workers with work-related injuries. Given our findings, and other potential mechanisms for poorer outcomes for workers with work-related injuries, further research beyond differences in entitlement to compensation should be undertaken to inform future interventions.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eaa6e0a3a3d8319aed4546ca676f1bb2",
  "timestamp": "2025-05-15T03:24:54.933374"
}