{
  "id": 2307,
  "title": "Apples or oranges? Identification of fundamental load shape profiles for benchmarking buildings using a large and diverse dataset",
  "abstract": "Buildings are responsible for 30-40% of the anthropogenic greenhouse gas emissions and energy consumption worldwide. Thus, reducing the overall energy use and associated emissions in buildings is crucial for meeting sustainability goals for the future. In recent years, smart energy meters have been deployed to enable monitoring of energy use data with hourly or sub-hourly temporal resolution. The concurrent rise of information technologies and data analytics enabled the development of novel applications such as customer segmentation, load profiling, demand response, energy forecasting and anomaly detection. In this paper, we address load profiling and benchmarking, i.e., determining peer groups for buildings. Traditionally, static characteristics, e.g., primary space use (PSI)) together with the annual energy-use-intensity (EUI) have been used to compare the performance of buildings. Data-driven benchmarking approaches have begun to also consider the shape of the load profiles as a means for comparison. In this work, we identify three fundamental load shape profiles that characterize the temporal energy use in any building. We obtain this result by collecting a dataset of unprecedented variety in size (3829 buildings) and primary use (75 programs), and applying a rigorous clustering analysis followed by entropy calculation for each building. The existence of fundamental load shape profiles challenges the manmade, artificial classification of buildings. We demonstrate in a benchmarking application that the resulting data-driven groups are more homogeneous, and therefore more suitable for comparisons between buildings. Our findings have potential implications for portfolio management, building and urban energy simulations, demand response and renewable energy integration in buildings.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eab04bb7e6be738ea1cb965591d63d2f",
  "timestamp": "2025-05-15T01:05:39.616435"
}