{
  "id": 3600,
  "title": "Addressing child health inequity through case management of under-five malaria in Nigeria: an extended cost-effectiveness analysis",
  "abstract": "Background Under-five malaria in Nigeria is a leading cause of global child mortality, accounting for 95,000 annual child deaths. High out-of-pocket medical expenditure contributes to under-five malaria mortality by discouraging care-seeking and use of effective anti-malarials in the poorest households. The significant inequity in child health outcomes in Nigeria stresses the need to evaluate the outcomes of potential interventions across socioeconomic lines. Methods Using a decision tree model, an extended cost-effectiveness analysis was done to determine the effects of subsidies covering the direct and indirect costs of case management of under-five malaria in Nigeria. This analysis estimates the number of child deaths averted, out-of-pocket (OOP) expenditure averted, cases of catastrophic health expenditure (CHE) averted, and cost of implementation. An optimization analysis was also done to determine how to optimally allocate money across wealth groups using different combinations of interventions. Results Fully subsidizing direct medical, non-medical, and indirect costs could annually avert over 19,000 under-five deaths, 8600 cases of CHE, and US$187 million in OOP spending. Per US$1 million invested, this corresponds to an annual reduction of 76 under-five deaths, 34 cases of CHE, and over US$730,000 in OOP expenditure. Due to low initial treatment coverage in poorer socioeconomic groups, health and financial-risk protection benefits would be pro-poor, with the poorest 40% of Nigerians accounting for 72% of all deaths averted, 55% of all OOP expenditure averted, and 74% of all cases of CHE averted. Subsidies targeted to the poor would see greater benefits per dollar spent than broad, non-targeted subsidies. In an optimization scenario, the strategy of fully subsidizing direct medical costs would be dominated by a partial subsidy of direct medical costs as well as a full subsidy of direct medical, nonmedical, and indirect costs. Conclusion Subsidizing case management of under-five malaria for the poorest and most vulnerable would reduce illness-related impoverishment and child mortality in Nigeria while preserving limited financial resources. This study is an example of how focusing a targeted policy-intervention on a single, high-burden disease can yield large health and financial-risk protection benefits in a low and middle-income country context and address equity consideration in evidence-informed policymaking.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eab1d95223ca57b6970d0add8073e8c3",
  "timestamp": "2025-05-15T02:27:54.099901"
}