{
  "id": 9110,
  "title": "Explore Potential Profiles and Influencing Factors for Financial Toxicity in Patients with Colorectal Cancer Undergoing Chemotherapy: A Cross-Sectional Study",
  "abstract": "Objectives: To explore the potential financial toxicity (FT) profiles in patients with colorectal cancer (CRC) undergoing chemotherapy and analyze its influencing factors. Methods: A cross-sectional study was conducted on 373 CRC patients undergoing chemotherapy in southwest China from January 2024 to May 2024. We utilized the General Information Questionnaire, the FT based on Patient-Reported Outcome Measures (COST-PROM), the Brief Illness Perception Questionnaire (BIPQ), and the Family APGAR Index (APGAR). Latent profile analysis (LPA) by Mplus8.3 was used to identify the latent profiles of the FT. Multinomial logistic regression analysis was used to analyze the relevant factors in the different categories. Results: The patients with CRC undergoing chemotherapy were divided into four profiles: high FT group (44.5%), moderate FT-low psychological adaptation group (22.8%), moderate FT-high psychological adaptation group (18.0%), and low FT group (14.7%). Age, average monthly household income per capita, employment status, disease duration, round of chemotherapy, illness perception, and family function were the influencing factors for potential profiles of FT in CRC chemotherapy patients (P < 0.05). Conclusions: There are four potential profiles of FT in patients with CRC undergoing chemotherapy. Healthcare providers should pay attention to patients with CRC undergoing chemotherapy aged 18 to 59 years old, employed and unemployed, with lower average monthly household income per capita, disease duration of less than 1 year, and more times of chemotherapy. Additionally, reducing patients' negative perceptions of the disease and improving family function can help lower the level of FT. Implication for Nursing Practice: This research can assist nurses in identifying patients at high risk of FT, enabling early intervention and the implementation of targeted psychological nursing interventions. Nurses can help patients develop positive perceptions of the disease and improve family relationships, thereby mitigating the negative effects of FT. (c) 2024 Elsevier Inc. All rights are reserved, including those for text and data mining, AI training, and similar technologies.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eab479f6e8f1fccdd52401ea4b077e1d",
  "timestamp": "2025-05-15T03:25:27.812215"
}