{
  "id": 5160,
  "title": "Causes of Refraining From Buying Prescribed Medications Among the Elderly in Kaunas, Lithuania",
  "abstract": "Background and Objective. Accessibility to medications among the elderly is a source of concern in Lithuania and beyond. However, there are no studies carried out on this topic in Lithuania. Therefore, the aim of this study was to evaluate the causes of refraining from buying prescribed medications among the elderly in Kaunas, Lithuania. Material and Methods. The data were collected in a cross-sectional ABUEL study in 2009. A total of 624 filled-in questionnaires (response rate, 48.9%) from the elderly aged 60-84 years living in Kaunas (Lithuania) were received. For evaluation of the impact of explanatory variables on the analyzed event (binary dependent variable), an Enter model of logistic regression was used. Results. The study showed that 32.7% of the respondents refrained from buying prescribed medications. The most common reasons (respondents could select several options) for this decision were financial problems (48.0%), disappearance of problems (40.7%), and fear of side effects (22.5%). Refraining from buying prescribed medications was positively associated with age (OR, 0.85; 95% CI. 0.74 to 0.99). Higher education was associated with a reduced risk of refraining from buying prescribed medications due to financial problems (OR, 0.49; 95% CI 0.31 to 0.78) and an increased risk of refraining from buying medications due to the disappearance of health problems (OR, 1.75; 95% CI, 1.15 to 2.68). An opposite association with worries about daily expenses was observed. Conclusions. Study has revealed that one-third of the elderly refrained from buying prescribed medications, and the main reasons for this were financial problems and disappearance of health problems.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eaba1408b7be1fe1d597e6b8073a93b0",
  "timestamp": "2025-05-15T02:44:44.030499"
}