{
  "id": 8491,
  "title": "Tackling gender bias in equity crowdfunding: an exploratory study of investment behaviour of Latin American investors",
  "abstract": "Purpose Belonging to the financial technologies' companies, equity-based crowdfunding platforms offer investors the opportunity to become shareholders through the purchase of small equity stakes of new innovative ventures. This paper aims to investigate gender-related differences in the behaviour of investors in firms seeking equity financing in Latin America. Design/methodology/approach Using a unique database, with combined information from different equity crowdfunding platforms in Brazil, Chile and Mexico, the authors study the population of 492 projects between 2013 and 2017. To analyse the relationship between investors' gender-related differences and equity crowdfunding investment, this paper applies Poisson regression. Findings Results suggest that the probability that an investor finances a firm is based on gender bias. Investors prefer firms led by entrepreneurs that are similar to them in terms of gender. Furthermore, the authors find evidence that both female and male investors are risk-averse and are more likely to invest in the equity of firms that are older and offer a higher percentage of equity. However, female investors are associated with firms that are on average older and offer 0.02% more equity. Practical implications These findings have implications for crowdfunding platforms managers when selecting their target companies and policymakers when defining political actions to promote greater use of equity crowdfunding among female entrepreneurs and decrease barriers hindering women's access to investment. Originality/value Unique in its proposition and data usage, this study sheds light on the relationship between investors and entrepreneurs in the Latin American equity crowdfunding market.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eacedc317da9f07bf27d4360c92a9c89",
  "timestamp": "2025-05-15T03:19:21.338538"
}