{
  "id": 716,
  "title": "An Evidential Reasoning Rule-Based Ensemble Learning Approach for Evaluating Credit Risks with Customer Heterogeneity",
  "abstract": "Credit risk evaluation has been vital for financial institutions to identify default customers and to avoid financial loss. Machine learning and data mining techniques have been adopted to develop scoring models for enhancing the prediction performance of default customers. However, it is difficult for these machine learning models for explaining the rejection or approval decision-making process to customers and other non-technical personnel. This paper presents an evidence reasoning (ER) rule-based ensemble learning approach for credit risk evaluation considering customer heterogeneity. Firstly, customers are segmented into different groups by k-means clustering algorithms and a two-stage weighting method is proposed to determine the significances of attributes by their discriminating powers between groups and within groups. Then, the attribute-related evidence is obtained by Bayesian statistics to represent the relationships between the attributes and credit risks, and a two-stage weighting evidential reasoning (TER) is developed as a base learner for credit scoring. Lastly, multiple base learners TERs are aggregated for evaluating customers' credit risks. An empirical study on three credit datasets demonstrated that the proposed approach can achieve high performance with good explainability. The predicted results of the model can be well comprehended by providing the contribution of attributes and the activated rules in evidential reasoning processes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eae6e5bb62f72678f0755c71e17e823b",
  "timestamp": "2025-05-15T01:54:33.984006"
}