{
  "id": 9048,
  "title": "FACTORING MANAGEMENT ON THE BASIS OF FORMATION OF OPTIMIZING FACTORING PORTFOLIO OF TRADE ENTERPRISES",
  "abstract": "The article is devoted to the study of the effectiveness of factoring management as an innovative product based on the formation of the optimization factoring portfolio of trade enterprises, which will serve as a basis for management decisions on the implementation of this service in business. As a result of the research a number of conclusions and methodical recommendations of practical direction are formulated. The formation of the optimization factoring portfolio is based on the principles of the CAPM portfolio investment model proposed by W. Sharp. The conditions for the formation of portfolio investments, which are reflected in the price model of the capital market, were adapted to the formation of the factoring portfolio. The key conditions of the factoring agreement are: limits on credit risk and a given level of income, that is the company must choose a portfolio with the maximum profitability, which is achieved by minimizing the cost of this service; seek to increase the funding limit for debtors; to remove from the portfolio of debtors of the enterprise with a high risk of non-repayment of debt. We propose to determine the debtors of the enterprise that will form the optimization factoring portfolio through the variables x(1) - x(n). When x = 1, the debtor is added to the factoring portfolio, and if x = 0, then it is necessary to exclude the debtor from the portfolio. In the language of factoring regression agreements, you can use a continuous linear programming problem in which the variable x will be in the range from 0 to 1, that is funding limits for debtors can be broken. The target function of the factoring portfolio of commercial enterprises is proposed both for invoice-discounting (only receivables financing) and for full factoring, that is full-fledged factoring (the use of additional related factoring services). The profitability of the enterprise from factoring operations depends on the number of debtors in the factoring portfolio. The greater the number of debtors in the portfolio, the higher the profitability of the company from factoring. However, the company needs to consider debtors with high credit risk in order to minimize the non-repayment of receivables. Therefore, debtors with the highest credit risk of factoring should be excluded from the factoring portfolio. To assess the economic efficiency of factoring management of trade enterprises on the basis of the formed optimization factoring portfolios, we propose to use the Cronbach & Gleser method. The proposed proposals for the management of factoring of commercial enterprises, which is based on the formation of factoring portfolios, will regulate debt relations between enterprises with the involvement of third parties, that is, to prevent the occurrence of negative phenomena in the debt relations between commercial enterprises in the future, as well as will help maximize profits in the studied business entities. Further research will focus on adapting the factoring portfolio of commercial enterprises to changes in the value of financial resources under the influence of transformational changes in the economy.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eb0a14fc054e2c95b083fba46e0f6bc6",
  "timestamp": "2025-05-15T03:24:54.941763"
}