{
  "id": 4371,
  "title": "An Empirical Analysis of the Dynamics Influencing Bank Capital Structure in Africa",
  "abstract": "Financial institutions, particularly banks, have long grappled with the dilemma of structuring their capital optimally. This process, commonly referred to as capital structure decision-making, is of paramount importance, especially within the financial services sector, where strict regulations are imposed by reserve and central banks in alignment with global Basel guidelines. This study unveils the key factors that determine the capital structure choices of African banks, using panel data encompassing 45 listed banks across six nations that had embraced the Basel III Accord spanning the years 2010 to 2019. The study used the system-generalised moment methods (sys-GMM) estimator to fit the formulated panel data regression model. The study findings showed positive associations between ZSCORE, an indicator of bank financial stability, and net interest margin ratio (NIMR) with bank leverage (TCTE). In addition, the results revealed positive correlations between earnings volatility (EV), profitability (P), and risk (R) with bank leverage (TDCE). This suggests that profitable banks are inclined to favour debt financing, a phenomenon driven by their ability to comfortably service debt obligations with free cash flows. This study's overarching conclusion underscores the dominant influence of the Liquidity Coverage Ratio (LCR) on African bank capital structures. Whether assessing traditional or Basel III-prescribed measures of bank leverage, LCR consistently emerged as the primary determinant. This finding is of significant relevance to bank executives and regulators, offering them essential insights for informed decision-making by considering striking a balance between equity and debt financing based on financial stability, profitability, and risk profiles.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eb0bb73911a9086cb80c059b191a33ed",
  "timestamp": "2025-05-15T02:36:38.383955"
}