{
  "id": 3811,
  "title": "The long-term financial experiences of adolescent and young adult cancer survivors",
  "abstract": "Background Cancer-related financial hardship can negatively impact financial well-being and may prevent adolescent and young adult (AYA) cancer survivors (ages 15-39) from gaining financial independence. This analysis explored the financial experiences following diagnosis with cancer among AYA survivors. Methods We conducted a cross-sectional, anonymous survey of a national sample of AYAs recruited online. The Comprehensive Score for Financial Toxicity (COST) and InCharge Financial Distress/Financial Well-Being Scale (IFDFW) assessed financial hardship (cancer-related and general, respectively), and respondents reported related financial consequences and financial coping behaviors (both medical and non-medical). Results Two hundred sixty-seven AYA survivors completed the survey (mean 8.3 years from diagnosis). Financial hardship was high: mean COST score was 13.7 (moderate-to-severe financial toxicity); mean IFDFW score was 4.3 (high financial stress). Financial consequences included post-cancer credit score decrease (44%), debt collection contact (39%), spending more than 10% of income on medical expenses (39%), and lacking money for basic necessities (23%). Financial coping behaviors included taking money from savings (55%), taking on credit card debt (45%), putting off major purchases (45%), and borrowing money (42%). In logistic regression models, general financial distress was associated with increased odds of experiencing financial consequences and engaging in both medical- and non-medical-related financial coping behaviors. Discussion AYA survivors face long-term financial hardship after cancer treatment, which impacts multiple domains, including their use of healthcare and their personal finances. Interventions are needed to provide AYAs with tools to navigate financial aspects of the healthcare system; connect them with resources; and create systems-level solutions to address healthcare affordability. Implications for Cancer Survivors Survivorship care providers, particularly those who interact with AYA survivors, must be attuned to the unique risk for financial hardships facing this population and make efforts to increase access available interventions.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eb10945f025d6151dbcd0dd53be25ceb",
  "timestamp": "2025-05-15T02:29:59.252736"
}