{
  "id": 592,
  "title": "A hierarchical attention-based feature selection and fusion method for credit risk assessment",
  "abstract": "A stable financial environment is requisite for the continuous growth of the E -business market, emphasizing the importance of credit risk assessment. Generally, credit risk assessment involves evaluating the creditworthiness of the economic entity and predicting the probability of defaulting on their financial obligations. Existing works mainly focus on exploring more features from various sources to help default prediction, but tend to overlook the feature cost and feature fusion problem. In this paper, we proposed a novel credit risk assessment model based on the hierarchical attention method, characterizing the ability to manage feature acquisition cost and adaptively integrate multi -view features. Particularly, to fulfill the utility of multi -source features, three segmenting standards are proposed to categorize multi -source features into different views according to their characteristics and statistical attributes. Then, a feature -level attention mechanism is proposed to estimate feature importance and guide feature selection, while a view -level attention mechanism is proposed to aggregate view representations and produce default predictions. The proposed method is capable of enhancing crucial features in a hierarchical way and undertaking feature selection to meet feature acquisition cost, thereby boosting the model performance with feature cost awareness. Experimental results show that the proposed method can approximate the best performance with 5% of selected features, and can also achieve a 1.1% AUC improvement compared with the best baseline method over the full feature set, demonstrating our effectiveness of enhancing default prediction performance while reducing feature costs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eb2701c74b6f99dd4485b87c99029edb",
  "timestamp": "2025-05-15T01:40:14.288372"
}