{
  "id": 7374,
  "title": "Hardship financing of healthcare among rural poor in Orissa, India",
  "abstract": "Background: This study examines health-related hardship financing in order to get better insights on how poor households finance their out-of-pocket healthcare costs. We define hardship financing as having to borrow money with interest or to sell assets to pay out-of-pocket healthcare costs. Methods: Using survey data of 5,383 low-income households in Orissa, one of the poorest states of India, we investigate factors influencing the risk of hardship financing with the use of a logistic regression. Results: Overall, about 25% of the households (that had any healthcare cost) reported hardship financing during the year preceding the survey. Among households that experienced a hospitalization, this percentage was nearly 40%, but even among households with outpatient or maternity-related care around 25% experienced hardship financing. Hardship financing is explained not merely by the wealth of the household (measured by assets) or how much is spent out-of-pocket on healthcare costs, but also by when the payment occurs, its frequency and its duration (e. g. more severe in cases of chronic illnesses). The location where a household resides remains a major predictor of the likelihood to have hardship financing despite all other household features included in the model. Conclusions: Rural poor households are subjected to considerable and protracted financial hardship due to the indirect and longer-term deleterious effects of how they cope with out-of-pocket healthcare costs. The social network that households can access influences exposure to hardship financing. Our findings point to the need to develop a policy solution that would limit that exposure both in quantum and in time. We therefore conclude that policy interventions aiming to ensure health-related financial protection would have to demonstrate that they have reduced the frequency and the volume of hardship financing.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eb3cbcd2c20b47c0336b80cd66035587",
  "timestamp": "2025-05-15T03:08:00.756860"
}