{
  "id": 8601,
  "title": "Associations Between Peer Victimization and Aggression and Three Types of Domestic Violence in Adolescents with Attention-Deficit/Hyperactivity Disorder",
  "abstract": "Background/Objectives: Peer victimization and aggression can be detrimental to the physical and mental health of adolescents. Adolescents with attention-deficit/hyperactivity disorder (ADHD) are one of the risk groups involved in peer victimization and aggression. The association between multiple types of domestic violence and engagement in peer victimization and aggression warrants more examination in adolescents with ADHD. This study examined the associations of parent-to-child aggression (PCA), witness to domestic violence (WDV), and child-to-parent violence (CPV) with the experiences of peer victimization and aggression among adolescents with a clinical diagnosis of ADHD in Taiwan. Materials and Methods: In total, 247 adolescents with ADHD (206 boys and 41 girls, mean age [SD] = 13.2 [2.0] years) agreed to participate in this study. Adolescents' peer victimization and aggression, PCA, WDV, and CPV in the previous year were collected. Results: This study found that 28.3% and 12.6% of adolescents with ADHD reported experiences of peer victimization and aggression, respectively. The rates of having PCA, WDV, and CPV ranged from 38.1% to 56.3%. The results of multivariable logistic regression analysis found that child-to-parent financial demand (p = 0.016) and child-to-parent control or domination (p = 0.018) significantly correlated with the experiences of peer victimization. PCA (p = 0.010) and child-to-parent control or domination (p = 0.042) significantly correlated with the experiences of peer aggression. Conclusions: The results of this study show that both CPV and PCA significantly correlate with the experiences of peer victimization and aggression in adolescents with ADHD. CPV and PCA should be included in adolescent prevention programs.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eb50de95687ccfaef1fe87e4c2092c73",
  "timestamp": "2025-05-15T03:20:22.344463"
}