{
  "id": 5821,
  "title": "Impact of financial support on the prognosis of HER2-positive breast cancer from 2002 to 2020: a prospective cohort from western China",
  "abstract": "Background: Trastuzumab has significantly improved the outcomes of human epidermal growth factor receptor 2 (HER2)-positive breast cancer over 20 years, and remains a cornerstone of treatment for this subtype today. Higher mortality was reported in underinsured breast cancer, but the mechanism remains unclear. Financial support for trastuzumab has transitioned from no support, to the Breast Cancer Assistant Program (BCAP), and finally, health insurance. Exploring the association between survival outcomes and different financial supports is necessary to further improve the outcomes of HER2-positive breast cancer in resource-limited regions. Methods: A prospective cohort of primary early unilateral HER2-positive breast cancer patients registered between January 2002 and December 2020 was used. Patients were divided into the following 3 groups, based on when they were diagnosed with breast cancer: (I) before 2011 (no financial support); (II) 2011-2017 (BCAP support); and (III) 2018 onwards (health insurance support). Overall survival and invasive disease-free survival (iDFS) were the primary outcomes. The follow-up was performed according the standard procedure. Cox proportional hazards regression was used to explore the association between financial support and prognosis with adjustment of demographic and clinicopathological characteristics, and treatments. Results: A total of 2,972 patients were finally identified. During the median follow-up period of 3.9 years, there were 153 breast cancer-related deaths. When fully adjusted potential covariates, patients supported by the BCAP had a 37% [hazard ratio (HR): 0.63, 95% CI: 0.41-0.96] decreased risk of overall mortality and that of patients covered by health insurance had a 64% decreased of overall mortality (HR: 0.36, 95% CI: 0.17-0.74) when compared with those who did not receive any financial support. Lower overall mortality was observed in patients covered by a higher reimbursement rate (HR: 0.68, 95% CI: 0.49-0.94) or the urban scheme (HR: 0.61, 95% CI: 0.43-0.86) than those covered by a lower reimbursement rate or the rural scheme. The same trends were also observed for iDFS and breast cancer-specific survival. Conclusions: Our findings revealed the independent role of financial support in improving the survival outcomes of the HER2-positive breast cancer in resource-limited regions and the underneath mechanism.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eb6a117c4fed074195ca5b9e44a82779",
  "timestamp": "2025-05-15T02:51:58.523377"
}