{
  "id": 8784,
  "title": "Rationale of Basic and Cellular Mechanisms Considered in Updating the Staging System for Diabetic Retinal Disease",
  "abstract": "Purpose: Hyperglycemia is a major risk factor for early lesions of diabetic retinal disease (DRD). Updating the DRD staging system to incorporate relevant basic and cellular mechanisms pertinent to DRD is necessary to better address early disease, disease progression, the use of therapeutic interventions, and treatment effectiveness. Design: We sought to review preclinical and clinical evidence on basic and cellular mechanisms potentially pertinent to DRD that might eventually be relevant to update the DRD staging system. Participants: Not applicable. Methods: The Basic and Cellular Mechanisms Working Group (BCM-WG) of the Mary Tyler Moore Vision Initiative carefully and extensively reviewed available preclinical and clinical evidence through multiple iterations and classified these. Main Outcome Measures: Classification was made into evidence grids, level of supporting evidence, and anticipated future relevance to DRD. Results: A total of 40 identified targets based on pathophysiology and other parameters for DRD were grouped into concepts or evaluated as specific candidates. VEGFA, peroxisome proliferator-activated receptor- alpha related pathways, plasma kallikrein, and angiopoietin 2 had strong agreement as promising for use as biomarkers in diagnostic, monitoring, predictive, prognostic, and pharmacodynamic responses as well as for susceptibility/risk biomarkers that could underlie new assessments and eventually be considered within an updated DRD staging system or treatment, based on the evidence and need for research that would fit within a 2year timeline. The BCM-WG found there was strong reason also to pursue the following important concepts regarding scientific research of DRD acknowledging their regulation by hyperglycemia: inflammatory/cytokines, oxidative signaling, vasoprotection, neuroprotection, mitophagy, and nutrients/microbiome. Conclusion: Promising targets that might eventually be considered within an updated DRD staging system or treatment were identified. Although the BCM-WG recognizes that at this stage little can be incorporated into a new DRD staging system, numerous potential targets and important concepts deserve continued support and research, as they may eventually serve as biomarkers and/or therapeutic targets with measurable benefits to patients with diabetes. Financial Disclosure(s): Proprietary or commercial disclosure may be found in the Footnotes and Disclosures at the end of this article. Ophthalmology Science 2024;4:100521 (c) 2024 by the American Academy of Ophthalmology. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/ licenses/by-nc-nd/4.0/). Supplemental material available at www.ophthalmologyscience.org.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eb812b878c5db7906e9d98c3df0d72f3",
  "timestamp": "2025-05-15T03:22:26.042870"
}