{
  "id": 5026,
  "title": "Does ESG enhance asset quality and funding cost management in banking diversification?",
  "abstract": "This study examines the impact of Environmental, Social, and Governance (ESG) practices on asset quality and funding cost management within the global banking sector, focusing on the role of income diversification. Motivated by the increasing importance of sustainability in finance, this research explores how ESG performance influences banks' loan portfolio quality and funding costs, particularly through a focus on classical interest income from lending activities versus non-traditional non-interest income. Utilizing a dataset of 1,865 banks across both developed and emerging markets from 2005 to 2022, this study employs panel fixed-effect regression models to assess the relationship between ESG integration, income diversification, and financial outcomes. The findings reveal that banks with stronger ESG performance experience enhanced asset quality and reduced funding costs due to a greater reliance on interest income activities. However, over-diversification into non-interest income activities is associated with deteriorating asset quality and increased credit costs. These results have significant implications for financial risk management, regulatory policy, and the development of sustainable banking practices in both mature and developing financial markets. The study provides a foundation for guiding banking sector policies that balance revenue diversification and ESG sustainability, ultimately enhancing banks' asset quality and funding cost management.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eb90ba5a2ec2d4298b8ec67db2717c8a",
  "timestamp": "2025-05-15T02:43:40.121190"
}