{
  "id": 6013,
  "title": "Disclosure of Information on Risk Factors and Value Relevance on B3's Novo Mercado",
  "abstract": "This research aimed to analyze the influence of disclosure of risk factors on the value relevance of Brazilian companies participating in the new market. For this purpose, annual data from non-financial companies were used between 2016-2020, totaling 506 observations. The risk factors disclosure was measured through content analysis in the reference forms, based on a checklist prepared based on the Normative Instruction CVM no 552/2014 requirements. The model adapted from Ohlson (1995) was used to analyze the value relevance of this disclosure for the Brazilian market. The results found through the regression analysis by fixed effects showed that the disclosure of risk factors did not present a significant relationship with the price of shares. Therefore, they do not have value relevance. This evidence demonstrates that investors may not consider this information when valuing assets. Thus, it was impossible to validate the formulated hypothesis that the disclosure of risk factors has value relevance for B3's new market. These results, therefore, demonstrate that, in the analyzed context, the commitment of the regulatory bodies to an increase in the disclosure of risks did not bring informational gain to the stakeholders. These findings are relevant, as they indicate to companies the need for reflection on how information is evidenced, providing more specific information that allows investors to assess the severity of the risks that companies are exposed to.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ebab928453584184d3aafb4291493105",
  "timestamp": "2025-05-15T02:54:03.309404"
}