{
  "id": 5091,
  "title": "Capitation for cardiologists: Accepting risk for coronary artery disease under managed care",
  "abstract": "Patients with chronic disease may be excluded from capitated managed care plans due to higher than average expected costs, In an attempt to remedy this inequity, one type of risk adjustment technique proposes to set separate capitation rates for certain chronic illnesses, including coronary artery disease (CAD), Cardiologists, who increasingly are requested to accept capitation, will benefit from understanding the impact of using clinical factors as opposed to using demographic factors to set capitation rates. Using a 5% national random sample of the 1992 Medicare population, we determined mean annual expenditures and variation in expenditures of individuals with CAD, We compared the use of 2 demographic factors currently used for capitation rate adjustment (age and gender) with 2 factors not currently used-3-digit international Classification of Disease (ICD-9) code (a measure for severity) and Charlson index (a measure for comorbidity), Mean annual expenditures for individuals with CAD were more than double mean annual expenditures for the general Medicare population ($6,944 vs $3,247). Among individuals with CAD, mean expenditures of subgroups defined by both age and gender ranged from $6,205 to $7,724. in comparison, stratifying by measures of severity and comorbidity identified subgroups with lower and higher mean expenditures, producing a range of $1,702 to $19,959. Substantial variation of expenditures For individuals within subgroups defined by severity and comorbidity remained, with few patients having substantially higher expenditures than the rest. When capitation rates are set with the use of demographic factors alone, patients may be subjected to risk selection and physicians to financial loss. Using clinical measures may decrease the incentive for patient risk selection, but substantial financial risk to physicians would remain, because of a relatively few patients with high expenditures (or costs). (C) 1998 by Excerpta Medica, Inc.",
  "year": 1998,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ebbddc7431d1105c5926ec5be673374e",
  "timestamp": "2025-05-15T02:44:11.037521"
}