{
  "id": 5296,
  "title": "Living with disadvantages: how does healthcare professional inequality spatially affect NCD mortality in Thailand?",
  "abstract": "Non-communicable diseases (NCDs) are the leading cause of death globally, including in Thailand. As exposure to risk factors becomes more prevalent and the population ages, the economic cost, especially in terms of lost productivity, and the burden on the healthcare system can be immense. With Thailand often cited for its universal health coverage success, it is worth investigating whether the distribution of healthcare resources, particularly healthcare professionals, plays any significant role in reducing NCD mortality. This study maps the spatial distribution and clustering of NCD mortality and healthcare professionals, and empirically assesses the spatial impact of healthcare professionals on NCD mortality using a novel provincial-level dataset from Thailand, covering 77 provinces over a 10-year period. Counterintuitively, the results reveal a positive spatial association between NCD mortality and the presence of nurses, possibly due to reverse causality or confounding variables. The relationship between physicians and NCD mortality is negative but not statistically significant, potentially highlighting the predominant role of behavioral and environmental risk factors in NCD mortality. The study also highlights that provinces with higher per capita income tend to have lower NCD mortality rates, underscoring the critical role of income in NCD prevention. Living in disadvantaged conditions, where financial constraints limit access to protective measures, along with unhealthy lifestyle choices such as smoking and poor diet, emerges as a significant risk factor for NCDs. Therefore, merely increasing the number of healthcare professionals is insufficient in reducing NCD mortality. Instead, effective health policies should prioritize comprehensive prevention, early detection of risk factors, and the promotion of healthy lifestyles.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ebcc0dbf85e802d30f5987a8c5adb031",
  "timestamp": "2025-05-15T02:46:16.255466"
}