{
  "id": 9433,
  "title": "Burden of Atopic Dermatitis in Adults and Adolescents: a Systematic Literature Review",
  "abstract": "Introduction: Although previously regarded as a children's disease, it is clear that atopic dermatitis (AD) is also highly prevalent in adults. Because AD is not associated with mortality, it is usually neglected compared with other, fatal diseases. However, several studies have highlighted that AD burden is significant due to its substantial humanistic burden and psychosocial effects. This study aims to summarize and quantify the clinical, economic, and humanistic burden of AD in adults and adolescents. Methods: A systematic literature search was performed in PubMed, Scopus, Cochrane, Centre for Reviews and Dissemination (CRD), EconPapers, The Professional Society for Health Economics and Outcomes Research (ISPOR), The National Institute for Health and Care Excellence (NICE), and The Canadian Agency for Drugs and Technologies in Health (CADTH). Studies were included if they reported clinical, economic, or humanistic effects of AD on adults or adolescents, from January 2011 to December 2020. The Grading of Recommendations Assessment tool was used to assess risk of bias for the included studies. Regression models were used to explain the correlation between factors such as disease severity and quality of life (QoL). Results: Among 3400 identified records, 233 studies were included. Itch, depression, sleep disturbance, and anxiety were the most frequently reported parameters related to the clinical and humanistic burden of AD. The average utility value in studies not stratifying patients by severity was 0.779. The average direct cost of AD was 4411 USD, while the average indirect cost was 9068 USD annually. Conclusions: The burden of AD is significant. The hidden disease burden is reflected in its high indirect costs and the psychological effect on QoL. The magnitude of the burden is affected by the severity level. The main limitation of this study is the heterogeneity of different studies in terms of data reporting, which led to the exclusion of potentially relevant data points from the summary statistics. PLAIN LANGUAGE SUMMARY Atopic dermatitis is a very common skin disease among children and adults. The disease is nonfatal but may lead to patients and families having a low quality of life and decreased productivity, especially in its severe state. Because atopic dermatitis is more common in children than adults, most published research is directed to studying the effect of the disease on children. Atopic dermatitis affects patients' health, quality of life, financial state, and productivity. Therefore, our study aims to study and quantify the burden caused by the disease represented in the clinical burden, humanistic burden, and economic burden. We conducted a systematic literature review to determine all relevant studies providing specific values for the burden. The studies included are those providing information on the percentage of patients affected by specific symptoms, costs paid for treatment, number of days of productivity lost due to the disease, and quality-of-life questionnaire results for patients with atopic dermatitis or their caregivers. We analyzed the data from all relevant studies to calculate average values and quantify the burden. The results of our study should help healthcare sector decision-makers in understanding the real effect of the disease on adults and adolescents and rearrange their priorities for treating different diseases based on the specific burden of each disease.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ebd0959b556497c0f2c1555877ec9cfb",
  "timestamp": "2025-05-15T03:28:46.294955"
}