{
  "id": 7128,
  "title": "Forgoing physician visits due to cost: regional clustering among cancer survivors by age, sex, and race/ethnicity",
  "abstract": "Background Innovative treatments have improved cancer survival but also increased financial hardship for patients. While demographic factors associated with financial hardship among cancer survivors are known in the USA, the role of geography is less clear. Methods We evaluated prevalence of forgoing care due to cost within 12 months by US Census region (Northeast, North Central/Midwest [NCMW], South, West) by demographic factors (age, sex, race/ethnicity) among 217,981 cancer survivors aged 18 to 82 years from the 2015-2019 Behavioral Risk Factor Surveillance System survey. We summarized region- and group-specific prevalence of forgoing physician visits due to cost and used multilevel logistic regression models to compare regions. Results The prevalence of forgoing physician visits due to cost was highest in the South (aged < 65 years: 19-38%; aged >= 65: 4-21%; adjusted odds ratios [OR], NCMW versus South, OR: 0.63 [0.56-0.71]; Northeast versus South, OR: 0.63 [0.55-0.73]; West versus South, OR: 0.73 [0.64-0.84]). Across the USA, including regions with broad Medicaid expansion, younger, female, and persons of color most often reported cost-related forgoing physician visits. Conclusion Forgoing physician visits due to cost among cancer survivors is regionally clustered, raising concerns for concentrated poor long-term cancer outcomes. Underlying factors likely include variation in regional population compositions and contextual factors, such as Medicaid expansion and social policies. Disproportionate cost burden among survivors of color in all regions highlight systemic barriers, underscoring the need to improve access to the entire spectrum of care for cancer survivors, and especially for those most vulnerable.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ebd3b7d3ca43c0d2ea62eb0207f01f33",
  "timestamp": "2025-05-15T03:05:32.019687"
}