{
  "id": 6924,
  "title": "Adding Social Determinant Data Changes Children's Hospitals' Readmissions Performance",
  "abstract": "Objectives To determine whether social determinants of health (SDH) risk adjustment changes hospital-level performance on the 30-day Pediatric All-Condition Readmission (PACR) measure and improves fit and accuracy of discharge-level models. Study design We performed a retrospective cohort study of all hospital discharges meeting criteria for the PACR from 47 hospitals in the Pediatric Health Information database from January to December 2014. We built four nested regression models by sequentially adding risk adjustment factors as follows: chronic condition indicators (CCIs); PACR patient factors (age and sex); electronic health record-derived SDH (race, ethnicity, payer), and zip code-linked SDH (families below poverty level, vacant housing units, adults without a high school diploma, single-parent households, median household income, unemployment rate). For each model, we measured the change in hospitals' readmission decile-rank and assessed model fit and accuracy. Results For the 458 686 discharges meeting PACR inclusion criteria, in multivariable models, factors associated with higher discharge-level PACR measure included age <1 year, female sex, 1 of 17 CCIs, higher CCI count, Medicaid insurance, higher median household income, and higher percentage of single-parent households. Adjustment for SDH made small but significant improvements in fit and accuracy of discharge-level PACR models, with larger effect at the hospital level, changing decile-rank for 17 of 47 hospitals. Conclusions We found that risk adjustment for SDH changed hospitals' readmissions rate rank order. Hospital-level changes in relative readmissions performance can have considerable financial implications; thus, for pay for performance measures calculated at the hospital level, and for research associated therewith, our findings support the inclusion of SDH variables in risk adjustment.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ebd4bdfe7eb77005bb3b9ad4c5b23da8",
  "timestamp": "2025-05-15T03:03:13.426168"
}