{
  "id": 9192,
  "title": "Telephone counselling for smoking cessation",
  "abstract": "Background Telephone services can provide information and support for smokers. Counselling may be provided proactively or offered reactively to callers to smoking cessation helplines. Objectives To evaluate the effect of telephone support to help smokers quit, including proactive or reactive counselling, or the provision of other information to smokers calling a helpline. Search methods We searched the Cochrane Tobacco Addiction Group Specialised Register, clinicaltrials. gov, and the ICTRP for studies of telephone counselling, using search terms including 'hotlines' or 'quitline' or 'helpline'. Date of the most recent search: May 2018. Selection criteria Randomised or quasi-randomised controlled trialswhich offered proactive or reactive telephone counselling to smokers to assist smoking cessation. Data collection and analysis We used standard methodological procedures expected by Cochrane. We pooled studies using a random-effects model and assessed statistical heterogeneity amongst subgroups of clinically comparable studies using the I-2 statistic. In trials including smokers who did not call a quitline, we used meta-regression to investigate moderation of the effect of telephone counselling by the planned number of calls in the intervention, trial selection of participants that were motivated to quit, and the baseline support provided together with telephone counselling (either self-help only, brief face-to-face intervention, pharmacotherapy, or financial incentives). Main results We identified 104 trials including 111,653 participants that met the inclusion criteria. Participants were mostly adult smokers from the general population, but some studies included teenagers, pregnant women, and people with long-term or mental health conditions. Most trials (58.7%) were at high risk of bias, while 30.8% were at unclear risk, and only 11.5% were at low risk of bias for all domains assessed. Most studies (100/104) assessed proactive telephone counselling, as opposed to reactive forms. Among trials including smokers who contacted helplines (32,484 participants), quit rates were higher for smokers receiving multiple sessions of proactive counselling (risk ratio (RR) 1.38, 95% confidence interval (CI) 1.19 to 1.61; 14 trials, 32,484 participants; I2 = 72%) compared with a control condition providing self-help materials or brief counselling in a single call. Due to the substantial unexplained heterogeneity between studies, we downgraded the certainty of the evidence to moderate. In studies that recruited smokers who did not call a helpline, the provision of telephone counselling increased quit rates (RR 1.25, 95% CI 1.15 to 1.35; 65 trials, 41,233 participants; I2 = 52%). Due to the substantial unexplained heterogeneity between studies, we downgraded the certainty of the evidence to moderate. In subgroup analysis, we found no evidence that the effect of telephone counselling depended upon whether or not other interventions were provided (P = 0.21), no evidence that more intensive support was more effective than less intensive (P = 0.43), or that the effect of telephone support depended upon whether or not people were actively trying to quit smoking (P = 0.32). However, in meta-regression, telephone counselling was associated with greater effectiveness when provided as an adjunct to self-help written support (P < 0.01), or to a brief intervention from a health professional (P = 0.02); telephone counselling was less effective when provided as an adjunct to more intensive counselling. Further, telephone support was more effective for people who were motivated to try to quit smoking (P = 0.02). The findings from three additional trials of smokers who had not proactively called a helpline but were offered telephone counselling, found quit rates were higher in those offered three to five telephone calls compared to those offered just one call (RR 1.27, 95% CI 1.12 to 1.44; 2602 participants; I-2 = 0%). Authors' conclusions There is moderate-certainty evidence that proactive telephone counselling aids smokers who seek help from quitlines, and moderatecertainty evidence that proactive telephone counselling increases quit rates in smokers in other settings. There is currently insufficient evidence to assess potential variations in effect from differences in the number of contacts, type or timing of telephone counselling, or when telephone counselling is provided as an adjunct to other smoking cessation therapies. Evidence was inconclusive on the effect of reactive telephone counselling, due to a limited number studies, which reflects the difficulty of studying this intervention.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ebfd7d16deab3d651a06a2bb6bbe23d2",
  "timestamp": "2025-05-15T03:26:25.993489"
}