{
  "id": 2822,
  "title": "Investigating foreign portfolio investment holdings: Gravity model with social network analysis",
  "abstract": "Foreign portfolio investment (FPI) has been modelled with the aim of observing patterns, discovering potential inefficiencies and providing evidence for theories. Over the course of many studies, bilateral FPI appears to increase with an increase in the correlation between the gross domestic product growth rates of the sender and the receiver. The Capital Asset Pricing Model in financial theory predicts the opposite-and this is known as the correlation puzzle. One possible explanation is that the correlation is a proxy for both diversification benefits and informational asymmetry. Using seven cross-sections of bilateral FPI holdings data from the CEPII Coordinated Portfolio Investment Survey for the years 2000-2006, we attempt to explain the correlation puzzle by augmenting the gravity model with random effects to account for heterogeneity in propensity to send and receive investments and with latent space position models to account for effects of unobserved country attributes, as well as transitivity, clustering, and balance in order to capture the information asymmetry and leave the correlation coefficient as a measure of the diversification benefit. We use maximum likelihood Heckman sample selection estimators to account for potential bias in estimators that can be caused by frequent zeros in our data, describing a model for the presence or absence of FPI between the two countries and a model for the level of FPI between two countries conditional on its presence. We find that if there is a presence of FPI between countrysand countryr, then as the correlation between the economic growth of these countries increases, the level of investment will decrease. However, this correlation has no significant impact on the decision of countrysto invest in countryr.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec2aa61d0d2d6755eef5405d56ae05a1",
  "timestamp": "2025-05-15T01:10:49.539846"
}