{
  "id": 8349,
  "title": "Association of self-perceived income sufficiency with cognitive impairment among older adults: a population-based study in India",
  "abstract": "BackgroundGreater cognitive performance has been shown to be associated with better mental and physical health and lower mortality. The present study contributes to the existing literature on the linkages of self-perceived income sufficiency and cognitive impairment. Study also provides additional insights on other socioeconomic and health-related variables that are associated with cognitive impairment in older ages.MethodsData for this study is derived from the 'Building Knowledge Base on Population Ageing in India'. The final sample size for the analysis after removing missing cases was 9176 older adults. Descriptive along with bivariate analyses were presented to show the plausible associations of cognitive impairment with potential risk factors using the chi-square test. Also, binary logistic regression analysis was performed to provide the relationship between cognitive impairment and risk factors. The software used was STATA 14.ResultsAbout 43% of older adults reported that they had no source of income and 7.2% had income but not sufficient to fulfil their basic needs. Older adults with income but partially sufficient to fulfil their basic needs had 39% significantly higher likelihood to suffer from cognitive impairment than older adults who had sufficient income [OR: 1.39; OR: 1.21-1.59]. Likelihood of cognitive impairment was low among older adults with asset ownership than older adults with no asset ownership [OR: 0.83; CI: 0.72-0.95]. Again, older adults who work by compulsion (73.3%) or felt mental or physical stress due to work (57.6%) had highest percentage of cognitive impairment. Moreover, older adults with poor self-rated health, low instrumental activities of daily living, low activities of daily living, low subjective well-being and low psychological health were at increased risk for cognitive impairment.ConclusionThe study highlights the pressing need for care and support and especially financial incentives in the old age to preserve cognitive health. Further, while planning geriatric health care for older adults in India, priority must be given to financially backward, with no asset ownership, with poor health status, older-older, widowed, and illiterate older individuals, as they are more vulnerable to cognitive impairment.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec3a6861640b0b9077ef73cdd010f974",
  "timestamp": "2025-05-15T03:17:49.184055"
}