{
  "id": 735,
  "title": "A Bankruptcy Prediction Model Based on Risk Feature Fusion and a Multihead Residual Self-Attention Mechanism",
  "abstract": "With the continuous development of financial markets, the investment environment has become increasingly complex. Strengthening financial risk control and carrying out enterprise bankruptcy prediction have become increasingly important. Enterprise bankruptcy prediction can effectively assist investors in identifying companies at risk of bankruptcy and avoiding investment losses and plays an indispensable role in preventing extreme risks. Therefore, we propose a bankruptcy classification model that combines risk feature fusion and a multihead residual attention mechanism. Specifically, according to financial theory, the proposed model classifies enterprise indicators according to risk attributes and uses a neural network for major feature extraction. Then, the major risk characteristics are introduced into the multihead residual attention module to extract the comprehensive deep features of the data to achieve bankruptcy classification. To validate the effectiveness of this method, we compare it with eight bankruptcy prediction algorithms on public datasets. The experimental results show that our model achieves the best performance on the core indicators of bankruptcy prediction accuracy and F1-score. The results also show that the model has high practical value and can be used as a reliable tool for investors to manage investment and predict risks.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec4602f251dba381b8525b0c5ac6875d",
  "timestamp": "2025-05-15T01:54:34.036170"
}