{
  "id": 2905,
  "title": "Evaluating meaningful levels of financial toxicity in gynecologic cancers",
  "abstract": "Objective The Comprehensive Score for Financial Toxicity (COST) is a validated instrument measuring the economic burden experienced by patients with cancer. We evaluated the frequency of financial toxicity at different COST levels and stratified risk factors and associations with cost-coping strategies by financial toxicity severity. Methods We analyzed previously collected survey data of gynecologic oncology patients from two tertiary care institutions. Both surveys included the COST tool and questions assessing economic and behavioral cost-coping strategies. We adapted a proposed grading scale to define three groups: no/mild, moderate, and severe financial toxicity and used chi(2), Fisher's exact test, and Wilcoxon rank sum test to compare groups. We used Poisson regression to calculate crude and adjusted risk ratios for cost-coping strategies, comparing patients with moderate or severe to no/mild financial toxicity. Results Among 308 patients, 14.9% had severe, 32.1% had moderate, and 52.9% had no/mild financial toxicity. Younger age, non-white race, lower education, unemployment, lower income, use of systemic therapy, and shorter time since diagnosis were associated with worse financial toxicity (all p<0.05). Respondents with moderate or severe financial toxicity were significantly more likely to use economic cost-coping strategies such as changing spending habits (adjusted risk ratio (aRR) 2.7, 95% CI 1.8 to 4.0 moderate; aRR 3.6, 95% CI 2.4 to 5.4 severe) and borrowing money (aRR 5.5, 95% CI 1.8 to 16.5 moderate; aRR 12.7, 95% CI 4.3 to 37.1 severe). Those with severe financial toxicity also had a significantly higher risk of behavioral cost-coping through medication non-compliance (aRR 4.6, 95% CI 1.2 to 18.1). Conclusions Among a geographically diverse cohort of gynecologic oncology patients, nearly half reported financial toxicity (COST <26), which was associated with economic cost-coping strategies. In those 14.9% of patients reporting severe financial toxicity (COST <14) there was also an increased risk of medication non-compliance, which may lead to worse health outcomes in this group.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec4be0ab9d7cf86a2f94751c3208d751",
  "timestamp": "2025-05-15T02:20:16.975581"
}