{
  "id": 4538,
  "title": "The classical and Bayesian logistic regression in the research on the financial standing of enterprises after bankruptcy in Poland",
  "abstract": "The problem of the enterprise's bankruptcy is an important issue of economic sciences. In the literature the applications of multivariate statistical analysis are focused more on the prediction of bankruptcy than the evaluation of the financial standing of enterprises after bankruptcy. Studying the path of recovering from insolvency can be a source of valuable information useful in assessing the probability of a success of the restructuring. The aim of the paper is to present the results of the pilot research on the financial standing of construction enterprises after bankruptcy in comparison with the situation of financially sound companies. We use the logit model to classify enterprises as healthy ones and the ones after bankruptcy. The maximum likelihood estimation (classical approach) and Bayesian approach is applied. The point and interval estimators of probability of a bankruptcy risk are compared with medians and histograms of their posterior distributions. The evaluation of the classification accuracy is based on the sensitivity, specificity, and AUC measures. We apply the one-dimensional methods (quartile analysis, Tukey's criterion) and the multi-dimensional method (projection depth function) to detect outliers. We also employ a method of analyzing discriminatory power of financial ratios. The pilot research covers construction enterprises in Poland in 2005 and 2009.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec4f3f27720b0d324d1de0e8f85a9e82",
  "timestamp": "2025-05-15T02:38:20.390973"
}