{
  "id": 1639,
  "title": "Research on the investment value of chinese real estate listed companies based on factor analysis and clustering analysis",
  "abstract": "As the housing price rises continuously and the real estate industry flourishes, the investment value of Chinese real estate listed companies becomes a hot research topic gradually. By the end of 2005, there has been 68 real estate listed companies in China, among them 27 companies are in Shenzhen and 41 companies in Shanghai stock exchange which have become an important component of Chinese listed companies. Based on the investment value theory, the paper applies the factor analysis and clustering analysis method to measure the investment value of the real estate listed companies using 17 financial indexes. Firstly it uses the factor analysis to extract the development ability, profitability, credit capacity, operating ability, cash sales capacity and cash flow ability these six common factors from 17 financial indexes and calculates each company's factor score which is fitting with the actual performance condition of it. Consequently the paper measures the inherent investment value of the companies accurately and provides guide for analyzing single corporate value for the investors. Applying these six common factors as the classification standards, the paper further uses the clustering analysis method to divide these 68 listed companies into six categories which have different characteristics of investment value. Then the investors can design an appropriate portfolio to reduce the investment risk and increase the investment return according to their investment preferences.",
  "year": 2007,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec582018a44ea4371bce1ea3c6bc7476",
  "timestamp": "2025-05-15T02:05:42.593412"
}