{
  "id": 223,
  "title": "Comparative data-driven enhanced geothermal systems forecasting models: A case study of Qiabuqia field in China",
  "abstract": "Geothermal energy is gaining global attractiveness owing to its abundance and sustainable nature. An in-depth understanding of potential geothermal production provides the energy industry a possibility to diversify the supply portfolio. With the development of artificial intelligence, machine learning offers an efficient alternative to the conventional numerical simulation method in forecasting energy harvesting. However, a comprehensive comparison and an effective algorithm selection are absent from the machine learning applications in forecasting geothermal energy recovery. In this study, four machine learning algorithms based data-driven models are created to determine the optimal choice in predicting geothermal production, including K-Nearest Neighbors (KNN), Support Vector Machine (SVM), Extreme Gradient Boosting (XGBoost) and Artificial Neural Network (ANN). To investigate their application range, two different sizes of data groups are involved to train and test these models, and their performance is comprehensively compared. As the results show, the highest coefficient of determination R2 of 0.998 is demonstrated in the ANN models showing its promising predictive ability. Besides, the ANN is the most stable with the lowest performance variances between a training set and a validation set. In addition, the ANN is the most adaptable due to its minimal performance differences between different sizes of data groups. By jointly considering the prediction accuracy, stability and adaptability, the ANN is the best choice to substitute numerical simulation for predicting geothermal development. Importantly, the successful imple-mentation of the proposed data-driven model requires 2700 times less computational time compared to nu-merical simulation, demonstrating a considerable improvement in the prediction efficiency. The results provide a beneficial reference for operators in conducting machine learning to simulate the development of the geothermal system studied, and can be effectively applied in other energy systems.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec580c6f20d4e10cfbde27f57bca0ecb",
  "timestamp": "2025-05-15T00:40:34.199340"
}