{
  "id": 4056,
  "title": "Moderating role of political stability and economic policy uncertainty between country governance practice and stock market performance. A comparative analysis of Pakistan and Kurdistan Region of Iraq",
  "abstract": "The objective of the study is to explore the relationship between country governance practices along with political stability and Economic policy uncertainty, and stock market performance of two different economies, Pakistan and Kurdistan region of Iraq. To meet our objectives, we used the 25 years past data from 1996 to 2021. Data is collected from the DataStream database. The regression analysis is used as the method of estimation for linear and moderation effect. Our results show that regulatory quality, rules of law and political stability has significant positive relationship with stock market performance of Pakistan, but all the governance indicators have significant positive relationship with stock market performance of the Kurdistan Region of Iraq. Moreover, political stability has significant moderating impact between the governance practices and the performance of the stock markets of both economies indicating that the governance practices perform well with the political stability that leads to rise in the stock market indices of selected countries. Economic policy uncertainty has significant negative moderation impact due to creating the risk in both economies that decrease the performance of the stock markets of the selected economies. Finally, our study advocated some implications for the investors to increase their confidence on the stock of high political stability and low economic policy uncertainty economies. Government can take significant measures to control the uncertainty of the policy and portfolio managers can adjust their risk on the ground of the political stability and efficient governance practices countries.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec766ef8e46c9cc4a2066f441eaa6b1c",
  "timestamp": "2025-05-15T01:23:27.317355"
}