{
  "id": 8605,
  "title": "Obstetric and perinatal outcomes among immigrant and non-immigrant women in Berlin, Germany",
  "abstract": "In Germany, regular immigrants and their descendants have legal and financial access to health care equal to the general citizenry. Nonetheless, some of their health outcomes are comparatively unfavorable, and that is only partially explained by their lower socioeconomic status (SES). The aim of this study was to assess whether this disparity exists also for obstetric and perinatal outcomes. We compared obstetric and perinatal outcomes between immigrant women (first or second generation) and non-immigrant women, delivering at three maternity hospitals in Berlin, Germany, 2011-2012. Multivariable logistic regression analysis was used to assess immigrant status and other possible risk factors for the baby being delivered preterm, small for gestational age (SGA), or transferred to neonatal care. The final database retained 6702 women, of whom 53.1% were first- or second-generation immigrants. First-generation Turkish immigrant women had significantly lower odds of preterm birth (OR 0.37, P < 0.001), SGA (OR 0.60, P = 0.0079), and transfer of the newborn to neonatal care (OR 0.61, P = 0.0034). Second-generation immigrant women had significantly lower odds of preterm birth (OR 0.67, P = 0.0049) or transfer of the newborn to neonatal care (OR 0.76, P = 0.0312). Moreover, women with education below university level, age 35+, or smokers had higher odds for poor outcomes. This study provides strong evidence that health disparities for obstetric and perinatal health outcomes do not exist in immigrants relative to native Germans, but exist instead in women without post-secondary-level education compared to women with such education, regardless of ethnicity or migration history.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec82dcb6204541ea468f2ef55df2cb97",
  "timestamp": "2025-05-15T03:20:22.392709"
}