{
  "id": 8307,
  "title": "International students' perceived quality of university health centre services: an exploratory sequential mixed methods study",
  "abstract": "Aim: This study aims to investigate international students' perspectives on service quality and analyse factors contributing to the perceived service quality of the university health centre.Background: International students are at increased risk of experiencing poor mental health, isolation from families and cultures, language barriers, financial stress and academic pressures. It is important that universities support international students to enable them to complete their degrees and reach their desired level of achievement and performance. One of the supports required by international students is the availability of healthcare services. Therefore, improving the quality of services to meet international students' requirements, including healthcare services, is essential.Methods: A three-phase exploratory sequential mixed methods design was used. Phase 1 aims to explore international students' perceptions of primary healthcare quality by conducting in-depth interviews and focus group discussions. Data were analysed using thematic analysis. Phase 2 is to form questionnaire items based on the results of the qualitative study. The questionnaire is subject to pilot testing to measure validity and reliability. Phase 3 analyses factors influencing international students' perceived primary healthcare service quality. Multiple regression was used to analyse factors contributing to the perceived service quality of international students.Findings: The qualitative strand revealed five major themes representing the study participants' thoughts about the quality of services in the university healthcare context. Perceived quality attributes identified in this study were primarily empathy, equity, effectiveness, efficiency and safety. The quantitative strand found that 35.57% of participants consider the perceived quality of the centre as good. The highest and lowest service quality attributes were related to safety and efficiency, with a score of 21.12 +/- 3.58 and 19.57 +/- 4.34, respectively. The multiple linear regression analyses showed that PhD students from Health Faculty and Scholarship awardees were significantly associated with the perceived quality of healthcare services. Thus, the university management needs to improve service quality considering the diversity of international students' socio-demographic characteristics.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec96c56966715a056f0946e3f94dafc0",
  "timestamp": "2025-05-15T03:17:21.598096"
}