{
  "id": 6968,
  "title": "Correlations Between Acute Coronary Syndrome and Novel Inflammatory Markers (Systemic Immune-Inflammation Index, Systemic Inflammation Response Index, and Aggregate Index of Systemic Inflammation) in Patients with and without Diabetes or Prediabetes",
  "abstract": "Purpose: Type 2 diabetes mellitus (DM) is a recognized independent risk factor for both chronic coronary syndrome (CCS) and its complication, acute coronary syndrome (ACS). Patients with DM and prediabetes (preDM) face an increased ACS risk. Inflammation plays a significant role in the pathogenesis of both CCS and ACS. This study delves into novel inflammatory markers, such as the systemic immune -inflammation index (SII), systemic inflammation response index (SIRI), and aggregate index of systemic inflammation (AISI, also known as SIIRI or PINT), to explore their relationship with ACS and CCS in patients that have been or have not been diagnosed with DM or preDM. Patients and Methods: This study included data of 493 patients with chest pain undergoing coronary angiography. They were categorized into four groups: 1) without DM/preDM and with CCS; 2) with both DM/preDM and CCS; 3) without DM/preDM and with ACS, 4) with both DM/preDM and ACS. Standard methods of statistical analysis were used to reveal possible differences between groups and to find the most influential ACS risk factors in groups with DM/preDM and without DM/preDM. Results: The analysis showed no significant differences in SII, SIRI, or AISI between the respective patient groups. A logistic regression analysis generated a model incorporating SII, high -density lipoprotein, and low -density lipoprotein levels as the influential ACS risk factors for patients with DM/preDM. The model demonstrated 71.0% accuracy, 37.0% sensitivity, and 89.4% specificity. Conclusion: The findings suggest that the aforementioned inflammatory markers may have potential for distinguishing DM/preDM patients at higher risk of ACS at a low financial cost. However, further comprehensive and well -designed research is required to validate their clinical utility.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ec9850bfc059fc349bd5813f34218e1d",
  "timestamp": "2025-05-15T03:03:55.675906"
}