{
  "id": 3219,
  "title": "The prediction model of suicidal thoughts in Korean adults using Decision Tree Analysis: A nationwide cross-sectional study",
  "abstract": "The purpose of this retrospective decisional analysis study is to develop the prediction model of suicidal ideation. We used a Decision Tree Analysis using SPSS 23.0 program to explore predictors of suicide thoughts for 12,015 Korean adults aged 19-98 years. As a result, the most powerful predictor of suicidal ideation was the level of depression. Of people who suspected depression (CESD-11>16), 32.6% experienced suicidal ideation, which is 12 times higher than that of total subjects. The group with the highest rate of suicidal ideation was people who experienced financial difficulties in depression-suspected group and the rate of suicidal thoughts in this group was 56.7%, which was the highest rate. However, in the non-depressive group, the satisfaction of family relationship was the strongest predictor of suicidal ideation. In the non-depressive group, the rate of suicidal thoughts of people with high level of family relationship satisfaction and high level of health satisfaction was 0.6%, which was the lowest rate. The contribution of this study was that it provided the combination of variables to predict the risk groups of adult suicide. This study suggests that researchers and clinicians should consider comprehensively depressive symptoms, family relationships, economic difficulties, and health status to prevent the suicide of adults.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ecaa650d98b1ceba046dbbb374a8af15",
  "timestamp": "2025-05-15T02:24:05.014395"
}