{
  "id": 2921,
  "title": "Impact of Financial Crisis on Credit Risk: Pre- and Post-financial Crises in an Emerging Economy",
  "abstract": "This aim of the article is to establish a model to discuss the reasons for changing the level of credit risk among the commercial banks of Bangladesh during the global financial crisis (GFC). Credit risk has been remaining as the essential and core risk in commercial banking activities. Multiple regression analysis is used to test the relationship among the level of credit risk as a dependent variable and financial crisis, other bank-level variables and macroeconomic variables. The causes of the GFC revealed not only systematic or structural imbalances but also the necessity to keep and strengthen the principles of credit risk management. We analyse the leading causes of the recent GFC. Moreover, the lessons that must be learnt from the weaknesses of credit risk management systems. Credit risk was found to respond to macroeconomic conditions, which indicate strong feedback effects from the banking system to the real economy. This article represents the analysis of the influence of the financial crisis on credit risk management in commercial banks and summarizes the challenges faced by banks for credit risk improvement. We hope that this reality creates new opportunities for managing credit risk in the future to increase this importance in the banks and the overall economy of Bangladesh.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ecc5484d3eba2aeebf8d6000535b2f57",
  "timestamp": "2025-05-15T02:20:48.114972"
}