{
  "id": 4065,
  "title": "A transparent epoxy vitrimer with outstanding flame retardancy, toughness, and recyclability enabled by a hyperbranched P/ N-derived polyester",
  "abstract": "Despite the tremendous advances in vitrimers, it is still a challenge to realize advanced vitrimers with high transparency, toughness, and fire safety. To achieve this performance portfolio, the closed-loop recyclable transesterification vitrimer (HPN1.80) with excellent transparency, toughness, and flame retardancy was prepared by incorporating a hydroxy-terminated hyperbranched polyester (HPN) into diglycidyl ether of bisphenol-A (DGEBA)/methyl tetrahydrophthalic anhydride (MeTHPA) system. HPN was easily obtained by esterification of triethanolamine (TEOA) and 9,10-dihydro-10-(2,3-dicarboxypropyl)-9-oxa-10-phosphaphenanthrene 10-oxide (DDP). Owing to the favorable compatibility of HPN with the matrix, the resulting HPN1.80 exhibited a high transmittance of 85.9% at 700 nm, a toughness of 2.3 MJ/m3, and an impact strength of 4.5 kJ/m2. The phosphorus-containing groups of HPN played an important role in the gas/condensed flame retardancy, allowing HPN1.80 to pass the vertical burning (UL-94) V-0 classification with a limiting oxygen index (LOI) of 32.6%. Due to the catalysis by hydroxyl and tertiary amines, the broken HPN1.80 can be recycled by hot-pressing at 200 degrees C for 1 h. The regenerated HPN1.80 achieved an LOI of 31.8% and a UL-94 V-0 rating even after two physical reprocessing cycles. For the carbon fiber-reinforced HPN1.80 (CF/HPN1.80) composites, the non-destructive recycling of carbon fibers (CFs) can be achieved due to the presence of a degradable ester group within HPN1.80. This work offers a rational strategy for creating advanced epoxy vitrimers with recyclability, transparency, toughening, and flame retardancy.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ecdeb0e96bce87258253c4dd8fcd0bbf",
  "timestamp": "2025-05-15T01:23:27.342162"
}