{
  "id": 4452,
  "title": "Is Working Risky or Protective for Married Adolescent Girls in Urban Slums in Kenya? Understanding the Association between Working Status, Savings and Intimate-Partner Violence",
  "abstract": "Introduction Previous studies have shown that women's empowerment, though beneficial in many aspects, can also increase the risk of intimate-partner violence (IPV). This study seeks to examine the association between work and experience of physical violence among married adolescents, and to understand the impact of access to independent financial resources on this risk. Authors draw on the asset-building framework and the ecological model. Methods The data is from a baseline survey of girls aged 15-19 residing in urban slums in four cities and towns in Kenya (Nairobi, Thika, Nakuru and Kisumu). The analytic sample is 452 married girls. Logistic regression is used to examine associations between working status, savings and experience of IPV in the previous six months, controlling for other factors. This is complemented by content analysis of in-depth interviews with 32 adolescent girls and 16 young men. Results Compared to girls who did not work, working with no regular savings was significantly associated with greater odds (OR = 1.96, p < 0.01) of experiencing IPV. There was no difference between girls who did not work and those who worked but had regular savings. Qualitative findings indicate savings decrease girls' dependency on men and allow them to leave abusive partners. Discussion Findings imply that in these communities with patriarchal gender norms and high levels of poverty, female employment and financial conflicts can be triggers of violence in marriages. On the other hand, girls' management of and access to independent financial resources through savings can potentially help to reduce this risk.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ece13350b3a13f82b493d7630eae94fe",
  "timestamp": "2025-05-15T02:37:16.960085"
}