{
  "id": 4466,
  "title": "Non-Pathological Psychological Distress among Mainland Chinese in Canada and Its Sociodemographic Risk Factors amidst the Pandemic",
  "abstract": "The COVID-19 pandemic has exacerbated health inequalities, with a potentially heightened mental health risk for Mainland Chinese in Canada, given the rising anti-Chinese discrimination, and barriers in assessing health services. In this context, this study aimed to assess non-pathological psychological distress towards COVID-19 and identify its sociodemographic risk factors among Mainland Chinese in Canada at the early stages of the pandemic. Methods: A sample of 731 Mainland Chinese aged 16 or older completed an on-line survey to examine their attitudes, behavioural, and psychological responses towards COVID-19. Non-pathological psychological distress was assessed with a 7-item self-report scale to capture common emotional reactions towards COVID-19. Results: A factor analysis revealed a single-factor structure of the 7-item COVID-19 psychological distress scale (Eigen lambda = 3.79). A composite psychological distress index (PDI) score was calculated from these items and used as the outcome variable. Multivariate regression models identified age, financial satisfaction, health status, and perceived/experienced discrimination as significant predictors of psychological distress (ps <= 0.05). Conclusions: Mainland Chinese in Canada who were over 25, in poor financial/health status, or with perceived/experienced discrimination were at a higher risk for COVID-19-related psychological distress. The health inequity across these factors would inform the services to mitigate mental health risk in minority groups.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ece483e235ab21476688e27cf67fd27c",
  "timestamp": "2025-05-15T02:37:47.473438"
}