{
  "id": 3881,
  "title": "Global Stock Markets Volatility Correlation Structure and Implication of Portfolio Based on Complex Network Theory",
  "abstract": "This paper constructs the volatility network of stock price indices in 49 countries, taking the COVID-19 event as an external shock to examine the impact of major emergencies on the volatility network of stock indices, the risk transmission mechanism across borders and the characteristics of key nodes. We further analyze the centrality of the network theory and empirical mechanism of the optimal portfolio weighting under the mean-variance framework while extending the results to portfolio risk management scenarios. The key findings are the impact of COVID-19 has led to a significant increase in convergence in the behavioral patterns of main countries stock indexes, changes in volatility network nodes and significant differences in topological structure characteristics. Compared with markets of emerging countries, the stock indexes in developed markets show the highest correlation before and after the epidemic. The main countries stock indexes volatility network based on geographic distribution reflects the characteristics of clustering and homogeneity. The stock indexes of few countries, such as Singapore, France, Germany, and the Netherlands, are the key market and source of market risk during the outbreak. Under the mean-variance framework, theoretical and empirical analysis shows that the optimal portfolio is more inclined to allocate more weight to stock indexes with low centrality, low volatility, and high Sharpe ratio. Because the marginal asset portfolio with less centrality is more conducive to reducing the overall risk of the asset portfolio. The main research objective of this paper is to provide financial regulators and financial practitioners with relevant ideas and strategies for inter-country portfolio risk management under major emergencies, and to provide important insights for them to understand the correlation structure and risk transfer characteristics of the global stock indexes of main countries under the impact of major emergencies, and for market participants to optimize their portfolio structure and manage portfolio risks.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ece6328aee7498e11ff616fbd057acdb",
  "timestamp": "2025-05-15T02:30:58.268652"
}