{
  "id": 1168,
  "title": "RETRACTED: Application of artificial intelligence technology in financial data inspection and manufacturing bond default prediction in small and medium-sized enterprises (SMEs)",
  "abstract": "This work aims to solve the problem that the traditional deep learning model has low prediction accuracy and is not suitable for enterprise default risk prediction. Firstly, it expounds the definition and influencing factors of corporate bond default, including macroeconomic factors, industry factors, policy factors, and financial factors. Secondly, the fault prediction model for manufacturing corporate bonds is realized based on Convolutional Neural Network. Finally, 20 manufacturing enterprises in the current financial market are selected. By establishing the evaluation index system and designing simulation experiments, their financial data is tested and analyzed to verify the model's effectiveness. The experimental results reveal that the main differences between the experimental group (defaulting company) and the control group (non-defaulting company) lie in the internal financial indicators and the self-characteristics of the company. The overall capital flow rate of the defaulting company is lower than that of the non- defaulting company, and the average total operating interest rate and return on net assets are 15.16% and 11.6%, respectively, lower than 26.3% and 18.9% in the control group. Additionally, the prediction accuracy of the Convolutional Neural Network model for defaulting companies is 80%; the average prediction error is 1.87, which is 65.4% lower than that of Random Forest model. To sum up, the Convolutional Neural Network model shows better performance in corporate default prediction. This work effectively reduces the default risk of China's bond enterprises and provides important technical support to ensure the healthy development of the bond market.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eceb317b0322ea99851ae2c761147969",
  "timestamp": "2025-05-15T01:59:56.250043"
}