{
  "id": 3967,
  "title": "The interplay between renewable portfolio standards and voluntary green power markets in the United States",
  "abstract": "Utility voluntary green power programs that allow energy consumers to pay a premium for electricity generated from renewable energy sources have gained great momentum worldwide in recent years. While there is growing literature examining customer behaviors related to green power purchases, limited work has been done to systematically evaluate the efficacy of voluntary green power programs implemented in conjunction with government-led renewable energy policies. In this research, we construct an innovative panel dataset for 49 U.S. states and Washington, D.C. from 2001 to 2013, with the goal to understand factors influencing total sales and customers of voluntary green power programs. Hybrid random effects regression models are estimated to investigate the impact of state renewable portfolio standards (RPSs) on the performance of voluntary green power markets. We find that for a given state, an increase in RPS policy stringency by one unit would lead to a reduction of green power program customer enrollment by 12.37%, and a reduction in green power program sales by 12.98%. Our results suggest that the competing effect is dominant between the voluntary green power market and the renewable energy regulatory regime: state RPSs tend to crowd out cheap renewable-sourced electricity that is available for sale through utility green power programs. (c) 2021 Elsevier Ltd. All rights reserved.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eceb3d56c46a1a44434edd078a3386cc",
  "timestamp": "2025-05-15T01:22:39.394298"
}