{
  "id": 6012,
  "title": "Testing Race Differences in Risk of Gestational Diabetes Mellitus Associated with Household Food Insecurity (Using NHANES 2007-2018)",
  "abstract": "Objective This study aimed to estimate the association of household food insecurity with gestational diabetes mellitus (GDM) risk by race and ethnic group.Study Design The study was a secondary analysis from the National Health and Nutrition Examination Survey from 2007 to 2018. A survey-weighted logistic regression model was constructed with self-reported GDM as the response. The primary independent variable was a four-level food security indicator, defined as the inability to obtain food in a socially acceptable way due to the lack of financial resources and controlled for several established risk factors. Analyses were stratified by race (White and Black) and ethnicity (Hispanic) to provide insight into how gestational diabetes risk differs by subpopulation.Results Results indicated that family history of diabetes is a risk factor across all races (adjusted odds ratio [aOR]: 4.22-16.26), while household food insecurity is a significant risk factor for only Hispanic women living with a partner (aOR: 8.50 for very low food security). Conclusion In the United States, Hispanic women's GDM risk may be uniquely impacted by food insecurity.Key Points center dot This study provides a national estimate of the GDM risk from food insecurity by race and ethnicity.center dot The results in this study suggest a statistically significant relationship between household food insecurity and an increasing risk of developing GDM for Hispanic individuals.center dot White women who live alone (without spouse or partner) were also at elevated risk of GDM.center dot Age at delivery, poverty ratio, and family history of diabetes are also risk factors for the disease.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ecef2bf98d33b5de0b9e10dcc6cc2d46",
  "timestamp": "2025-05-15T02:53:33.517849"
}