{
  "id": 5590,
  "title": "Primary caregivers of in-home oxygen-dependent children: predictors of stress based on characteristics, needs and social support",
  "abstract": "Aim. To identify the predictors of primary caregivers' stress in caring for in-home oxygen -dependent children by examining the association between their levels of stress, caregiver needs and social support. Background. Increasing numbers of primary caregivers of oxygen -dependent children experience caregiving stress that warrants investigation. Design. The study used a cross-sectional design with three psychometric scales Modified -Parenting Stress Index, Caregiver Needs Scale and Social Support Index. Methods. The data collected during 2010-2011 were from participants who were responsible for their child's care that included oxygen therapy for >= 6 hours/day; the children's ages ranged from 3 months -16 years. Descriptive statistics and multivariable linear regression were used. Results. A total of 104 participants (M = 34, F = 70) were recruited, with an average age of 39.7 years. The average age of the oxygen -dependent children was 6.68 years and their daily use of oxygen averaged 11.39 hours. The caregivers' overall levels of stress were scored as high and information needs were scored as the highest. The most available support from family and friends was emotional support. Informational support was mostly received from health professionals, but both instrumental and emotional support were important. Levels of stress and caregiver needs were significantly correlated. Multivariable linear regression analyses identified three risk factors predicting stress, namely, the caregiver's poor health status, the child's male gender and the caregiver's greater financial need. Conclusion. To support these caregivers, health professionals can maintain their health status and provide instrumental, emotional, informational and financial support.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ecfa7aebe543ee5bf63faf63788c1eaa",
  "timestamp": "2025-05-15T02:49:21.701617"
}