{
  "id": 6780,
  "title": "Default rates in the syndicated bank loan market: A mortality analysis",
  "abstract": "The most fundamental aspect of credit risk models is the rating of the underlying assets and the associated expected and unexpected migration patterns. The most important migration is to default. While default rate empirical studies of corporate bonds are now commonplace, there has never been a study on the default rate in the corporate bank loan market. This paper assesses, for the first time, the default rate experience on large, syndicated bank loans. The results are stratified by original loan rating using a mortality rate framework for the 1991-1996 period. We find that the mortality rates on bank loans are remarkably similar to that of corporate bonds when measured cumulatively over the five-year period after issuance, but loan default rates appear to be considerably higher than bonds for the first two years after issuance. Since loans have an average effective maturity of under two years, this shorter maturity difference is of considerable relevance, especially if confirmed when our database will cover a longer sample period and more actual defaults. We do attempt to estimate the impact and bias on our results of the study's sample period which only covers the recent benign credit cycle in the US. Our results provide important new information for assessing the risk of corporate loans not only for bankers but also mutual fund investors and analysts of structured financial products, credit derivatives and credit insurance. (C) 2000 Elsevier Science B.V. All rights reserved. JEL classification: G33; G21; G3.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed08ab47ed5eafd784a2ad07f58b58df",
  "timestamp": "2025-05-15T03:01:31.403426"
}