{
  "id": 1722,
  "title": "Tail Risk Dynamics under Price-Limited Constraint: A Censored Autoregressive Conditional Fréchet Model",
  "abstract": "This paper proposes a novel censored autoregressive conditional Fr & eacute;chet (CAcF) model with a flexible evolution scheme for the time-varying parameters, which allows deciphering tail risk dynamics constrained by price limits from the viewpoints of different risk preferences. The proposed model can well accommodate many important empirical characteristics of financial data, such as heavy-tailedness, volatility clustering, extreme event clustering, and price limits. We then investigate tail risk dynamics via the CAcF model in the price-limited stock markets, taking entropic value at risk (EVaR) as a risk measurement. Our findings suggest that tail risk will be seriously underestimated in price-limited stock markets when the censored property of limit prices is ignored. Additionally, the evidence from the Chinese Taiwan stock market shows that widening price limits would lead to a decrease in the incidence of extreme events (hitting limit-down) but a significant increase in tail risk. Moreover, we find that investors with different risk preferences may make opposing decisions about an extreme event. In summary, the empirical results reveal the effectiveness of our model in interpreting and predicting time-varying tail behaviors in price-limited stock markets, providing a new tool for financial risk management.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed235af398cc9461db540e620a827d69",
  "timestamp": "2025-05-15T02:06:52.663637"
}