{
  "id": 6226,
  "title": "Student loan debt in retirement: identifying the correlates and implications for policy, practice and research",
  "abstract": "PurposeResearch shows that having student loan debt in retirement is associated negatively with life satisfaction, suggesting that student debt is a bane of retiree well-being. The rationale for this study is to determine the factors related to owing student debt in retirement, given the adverse effects on the well-being of retired households.Design/methodology/approachThe study utilizes pooled cross-sectional data from the 2015 and 2018 U.S. National Financial Capability Study. The empirical analysis uses a sample of retired Americans aged 65 years and older (N = approximately 8,000) and estimates two-block logistic regression models to examine the effects of demographic, socioeconomic and behavioral factors on student loan indebtedness in retirement. A sensitivity analysis is performed for the subsample of retirees holding student debt for their children's education. Statistical interpretations use odds ratios.FindingsThe findings indicate that financial literacy, age, homeownership and high subjective financial knowledge are associated with a low likelihood of holding student loan debt in retirement. However, being Black, having postsecondary education, having difficulty covering expenses, having financially dependent children, having high-risk preferences and spending more than income increase the likelihood of holding student debt in retirement. The ensuing discussion will assist financial planners and educators identify practical ways to shape decisions regarding student loan debt in retirement.Research limitations/implicationsThe amount of student loan debt is unavailable in the dataset for analysis. One cannot infer causal relations from the study. The factors examined do not reflect the time the student loan was obtained.Originality/valueThe study focuses on the determinants of student loan indebtedness among retired Americans rather than young adults or older adults on the verge of retirement. The paper enhances the understanding of student loan holdings in the decumulation phase of the life cycle. Many US individuals have low retirement savings from which they draw a retirement income. The more the student debt burdens on retired Americans, the greater the likelihood of outliving their resources and experiencing poverty.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed2dddad654dd6c01ded6cff54357e1f",
  "timestamp": "2025-05-15T02:56:10.858563"
}