{
  "id": 4043,
  "title": "ECONOMIC AND LEGAL BASIS OF IMPLEMENTATION OF COMPLIANCE IN BUSINESS PROCESSES OF ENTERPRISES",
  "abstract": "Background: In today's economic world, an effective compliance doctrine is a mandatory component of the management portfolio of any reputable business structure. Currently, compliance strategy is being implemented in all countries of the globalised world, but in different ways: in some countries, actively and comprehensively, and in others, passively and fragmentedly. This study, using analytical and statistical methodological approaches, explains why compliance is implemented differently in businesses around the world. The authors evaluate the effectiveness of the leading types of compliance (anticorruption, criminal law, environmental, financial, and labour) in the economies of OECD countries and other countries. The authors also substantiate that to strengthen the political will of governments, especially those of developing countries, to extend compliance into the national business environment, it is necessary to develop a national strategic document on the phased implementation of the compliance system in business processes of enterprises, as well as to develop an international document of general application (in the form of a UN Convention) to promote more active implementation of all types of compliance by governments around the world. Methods: The methodological apparatus of legal and economic sciences was used to study the compliance doctrine. The methodological apparatus of the study included mathematical calculation methods and graphical methods for assessing the degree of compliance implementation in countries of the world, probabilistic methods for providing recommendations for management actions and testing for clustering countries of the world. The study also uses special legal methods: formal legal methods for classifying the main features of the compliance phenomenon, comparative legal methods for comparing compliance regulation in different countries, and logical legal methods for improving legal regulation of compliance as a means of the economic well-being of enterprises. Results and Conclusions: The article reveals the content of business process compliance; assesses the effectiveness of this instrument in the economies of OECD member states, the EU and other countries in priority areas; develops proposals for regulation, including legislative regulation and implementation of compliance at the international, national and enterprise levels in the context of digitalisation and sustainable development.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed4c628aa9e7622df82f6bdccd988f59",
  "timestamp": "2025-05-15T01:23:27.266092"
}