{
  "id": 3970,
  "title": "Opportunities for the United States hotel industry to recover from COVID-19: a multi-period DEA analysis of key efficiency determinants",
  "abstract": "PurposeThis study examines empirically the development of efficiency levels in the hotel industry and its key drivers, by juxtaposing pre- and post-COVID-19 results in the four most important cities in the United States in terms of international arrivals.Design/methodology/approachA two-step approach was employed by first utilising the data envelopment analysis method to characterise the efficiency of United States hotels. A multiple linear regression analysis was performed to compare hotel performance in the two years prior to the COVID-19 outbreak with the first two years after the outbreak.FindingsThe results indicated the positive effect of size and the economy hotel category on efficiency, while increasing property age, urban location and a lack of brand affiliation showed a negative effect. During the pandemic, size and the economy category remained significant and positive, whereas urban location continued to represent a negative effect.Practical implicationsThis study assists decision makers regarding prospective investments, supports existing and future portfolio analyses, contributes to observations on competition, and offers a wider perspective of the industry.Originality/valueFirst, this study investigated the evolution of factors that influenced efficiency before and after the outbreak of the COVID-19 pandemic. Second, the results offer insights into the impact of the pandemic on hotels' efficiency levels. Third, the study proposes directions for the restoration of hotel efficiency to pre-COVID-19 levels.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed52531560770d930ad3f610cb815825",
  "timestamp": "2025-05-15T01:22:39.407388"
}