{
  "id": 502,
  "title": "A robust possibilistic programming approach for selecting a clustering-based index tracking portfolio",
  "abstract": "Traditional mathematical index tracking models increase computational complexity and are not suitable for different capital market conditions. To overcome the problems related to the estimation of stock market asset returns, this study proposes a methodology based on the clustering optimization model of index tracking for Tehran Stock Exchange. The proposed model is developed by imposing turnover and buy-in threshold constraints to provide investment conditions. Then, to further converge the problem towards real conditions, the optimization model is implemented with the approaches of possibilistic chance-constrained programming and robust possibilistic programming to deal with the uncertainty of the model parameters. The parameters of portfolio size and correlation coefficients between pairs of stocks are uncertain, and fuzzy and robust uncertainty frameworks are used to control them. The Pearson's correlation coefficient is used as a similarity operator for the index tracking problem. A real-world case study using Tehran Stock Exchange data is conducted to verify the applicability of the proposed methodology. Several sensitivity analyses have been performed on the optimization model results to prove its theoretical and operational capabilities. These analyses include comparing the proposed model with other similar models, examining the impact of key parameters on the results, evaluating the model under different capital market conditions, and demonstrating the model's performance in certain and uncertain situations. Finally, Based on the findings, the advantages and achievements of the methodology are stated.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed56cd9845d243a4b42161ff9be7eb3d",
  "timestamp": "2025-05-15T00:44:20.940784"
}