{
  "id": 3840,
  "title": "The impact of bitcoin fear and greed on good and bad network connectedness: the case of the US sectoral high frequency returns",
  "abstract": "This article is the first one to examine the moderating role of bitcoin sentiment indices on the short term and long-term time-frequency-based good and bad network connectedness of all US sectors. In more detail, the paper quantifies the above relationship between the 11 US sectoral high frequency returns and then identifies the moderating impact of bitcoin investors' fear and greed sentiment on good and bad network connectedness during pre-Covid-19 and Covid-19. For the said purpose, we decompose the returns into good and bad volatility, and rely on time and frequency dependent spillover measures and quantify a spillover symmetrical and asymmetrical measure for network connectedness for different investment horizons. Furthermore, we also quantify the NET good-bad volatility transmission and reception capability of all our sectors within the frequency dependent network. The extracted good and bad network connectedness indices are then regressed on multiple thresholds of bitcoin sentiment indices. Quantile regression results revealed that fear, extreme fear, greed and extreme greed moderate the short term and long term good and bad volatility spillovers within the network connectedness. Finally, we also utilize hedge ratios and optimal portfolio weight selection strategies to explain whether short positioning in the US sectoral returns can be used to hedge against bitcoin sentiment risk.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed5bfd72f2d33e13c9129535df9512ce",
  "timestamp": "2025-05-15T01:21:41.224032"
}