{
  "id": 1860,
  "title": "Modeling systematic risk and point-in-time probability of default under the Vasicek asymptotic single-risk-factor model framework",
  "abstract": "Systematic risk has long been a focus for stress testing and risk capital assessment. Under the Vasicek asymptotic single-risk-factor model framework, entity default risk for a risk homogeneous portfolio divides into two parts: systematic and entity-specific. While entity-specific risk can be modeled by a probit or logistic model using a relatively short period of portfolio historical data, modeling of systematic risk is more challenging. In practice, most default risk models do not fully or dynamically capture systematic risk. In this paper, we propose an approach to modeling systematic and entity-specific risks by parts and then aggregating together analytically. Systematic risk is quantified and modeled by a multifactor Vasicek model with a latent residual, a factor accounting for default contagion and feedback effects. The asymptotic maximum likelihood approach for parameter estimation for this model is equivalent to least squares linear regression. Conditional entity probabilities of default (PDs) for scenario tests and through-the-cycle entity PDs all have analytical solutions. For validation, we model the point-in-time entity PD for a commercial portfolio and stress the portfolio default risk by shocking the systematic risk factors. Rating migration and portfolio loss are assessed.",
  "year": 2014,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed5de67a1341af6fb5783bb7ab312972",
  "timestamp": "2025-05-15T01:00:27.341882"
}