{
  "id": 6882,
  "title": "Cost-related non-adherence to medications among adults with asthma in the USA, 2011-2022",
  "abstract": "Background Uncontrolled asthma is possibly caused by medication non-adherence, and financial hardship can be a major contributor to non-adherence. Since economic conditions and asthma management have changed over time, a comprehensive investigation of cost-related medication non-adherence (CRN) among adults with asthma is crucial.Objective To evaluate trends, prevalence and determinants of CRN, and its impact on asthma control among US adults with asthma.Methods Data from 2011 to 2022 National Health Interview Survey were used. Joinpoint regression analysis was used to evaluate trends in the prevalence of CRN. A multivariable logistic regression model was used to identify factors associated with CRN. Two additional multivariable logistic regression models were used to examine associations between CRN and asthma-related adverse events, including asthma attacks and emergency room (ER) visits for asthma.Results A total of 30 793 adults with asthma were included, representing 8.1% (19.38 million) of the US population. From 2011 to 2022, a declining trend in the prevalence of CRN among US adults with asthma was observed. Approximately every one in six adults with asthma was non-adherent to medications due to cost. Several factors, including demographics and comorbidities, were associated with CRN. Adults with asthma who had CRN were at an increased risk of experiencing asthma attacks (adjusted OR, 1.95; 95% CI 1.78 to 2.13) and ER visits for asthma (adjusted OR, 1.63; 95% CI 1.44 to 1.84).Conclusion Since asthma is one of the leading chronic diseases, the burden of cost-related non-adherence to medications highlights the need for appropriate policies and social supports to address such problems.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed96a4ea9c9f6e97ceb5962921489cd0",
  "timestamp": "2025-05-15T03:02:41.240653"
}