{
  "id": 392,
  "title": "Long-term forecasting in asset pricing: Machine learning models' sensitivity to macroeconomic shifts and firm-specific factors",
  "abstract": "This study investigates the long-term forecasting capabilities of five prominent machine learning models-decision tree, random forest, gradient boosted regression trees, support vector machines, and neural networks-within the domain of asset pricing. Applying these models to S&P 500 constituent stocks from 2000 to 2023, we examine their predictive performance over extended horizons. Our findings indicate that Gradient Boosting and Random Forest models stand out for their superior performance, though their predictive accuracy exhibits sensitivity to the prevailing economic stability. Furthermore, these models show enhanced effectiveness in forecasting returns for larger companies, with their performance demonstrating significant variation across different industry sectors. A notable decline in accuracy with the increase in forecasting horizons underscores the challenges inherent in long-term financial prediction. Our results highlight the substantial impact of macroeconomic factors, particularly Consumer Sentiment and Net Exports, whose influences fluctuate over time. Practically, machine learning models, especially Gradient Boosting and Random Forest, are shown to consistently surpass the benchmark S&P 500 index in portfolio construction scenarios. We show the importance of economic stability, firm size, and industry sector context, providing novel insights for the strategic application of machine learning in asset pricing and the formulation of investment strategies suited to diverse market conditions.",
  "year": 2025,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed9c06b769689bda651553c2e95d95c7",
  "timestamp": "2025-05-15T00:43:10.463842"
}