{
  "id": 7126,
  "title": "A Model for Assessment of Organizational Knowledge Based on Financial Risk Management",
  "abstract": "In many knowledge management approaches, intellectual capital is assumed to be part of organizational assets. These assumed assets are categorized and rated according to different evaluation criteria. In our approach, we base the assessment of an enterprise's knowledge base and related activities or processes on a risk management approach. We assume that successful IC management is a result of applying well defined risk-reducing strategies. The proposed assessment method of knowledge risks is based on the Basel II classification of risks in the banking industry. The central idea behind the approach is that failure of managing knowledge raises the probability of specific loss events. These loss events imply financial losses that are measurable in terms of defined positions in a company's balance sheet or in terms of standard risk indicators depending on several such positions. Typical knowledge related loss events are innovation losses due to insufficient knowledge safeguarding (e.g., caused by insufficient patent or licensing policies) or insufficient knowledge acquisition (e.g., failure to implement a competency based hiring policy, failure to manage rights on knowledge assets, failure to set up a suitable knowledge exchange infrastructure). More generally, the model behind the explanation of loss events in terms of knowledge risks can be any of the well known knowledge management building blocks discussed in the knowledge management literature. The key advantage of our approach is that we do not need to assume any kind of measurement model of knowledge itself. Rather, we set up structures for statistical models that identify causal influences leading from knowledge elements or knowledge management processes (and potentially many other influencing factors) to loss events. More precisely, Bayesian networks can be used to predict probable future losses due to missing or inadequately implemented KM processes or to infer probable causes of losses incurred in terms of missing or inadequately implemented KM processes.",
  "year": 2008,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ed9cb577b069dfac850aab8277af3647",
  "timestamp": "2025-05-15T03:05:32.017039"
}