{
  "id": 5752,
  "title": "Financial Incentives for COVID-19 Vaccines Among People Experiencing Homelessness",
  "abstract": "Introduction: Novel strategies are needed to address barriers to COVID-19 vaccination among people experiencing homelessness (PEH), a population that faces increased COVID-19 risk. Although growing evidence suggests that financial incentives for vaccination are acceptable to PEH, their impact on uptake is unknown. This study aimed to assess whether offering $50 gift cards was associated with the uptake of the first doses of COVID-19 vaccine among PEH in Los Angeles County. Methods: Vaccination clinics began on March 15, 2021; the financial incentive program was implemented from September 26, 2021 to April 30, 2022. Interrupted time-series analysis with quasi-Poisson regression was used to evaluate the level and slope change in the number of weekly first doses administered. Time-varying confounders included the weekly number of clinics and the weekly number of new cases. Demographic characteristics were compared for PEH vaccinated before and after the implementation of the incentive program using chi-square tests. Results: Offering financial incentives was associated with the administration of 2.5 times (95% CI=1.8, 3.1) more first doses than would have been expected without the program. Level (-0.184, 95% CI= -1.166, -0.467) and slope change (0.042, 95% CI=0.031, 0.053) were observed. Individuals who were unsheltered, aged <55 years, and identified as Black or African American accounted for a higher percentage of those vaccinated during the post-intervention period than during the pre-intervention period. Conclusions: Financial incentives may be an effective tool for increasing vaccine uptake among PEH, but important ethical considerations must be made to avoid coercion of vulnerable populations. (c) 2023 American Journal of Preventive Medicine. Published by Elsevier Inc. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "edab257de19e06bf856e88d816638ed5",
  "timestamp": "2025-05-15T02:50:54.014855"
}