{
  "id": 3549,
  "title": "Impacts of bank loan performance, stability and risk factors on sustainable development goals: insights from South and Southeast Asia",
  "abstract": "This study examined the impacts of bank loan performance, financial stability and risk factors on achieving Sustainable Development Goals (SDGs) in South and Southeast Asia from 2009 to 2023 using advanced econometric methods, including Instrumental Variables Generalized Method of Moments (IV-GMM) and Panel Quantile Regression. The analysis incorporates data from 14 countries and evaluates six key banking indicators: Bank Non-Performing Loans to Gross Loans (BNPLGL), Bank Credit to Bank Deposits (BCBD), Bank Z-Score (BZS), Liquid Assets to Deposits and Short-Term Funding (LADSTF), Provisions to Non-Performing Loans (PNPL), and Bank Capital to Total Assets (BCTA). The IV-GMM results revealed significant regional differences. In South Asia, BZS (coefficient: 0.101, p < 0.001), BCBD (0.096, p = 0.005), and LADSTF (0.067, p < 0.001) showed strong positive relationships with SDG progress, highlighting the critical role of financial stability and liquidity in fostering sustainable development. Conversely, in Southeast Asia, results were more varied, BCBD (0.027, p < 0.001) positively contributing to SDGs while BNPLGL (- 0.017, p = 0.314) and BZS (- 0.002, p = 0.867) exhibiting weak or negligible effects. Panel Quantile Regression underscored the importance of financial stability and risk management, particularly in low-performing countries, where BZS and BNPLGL significantly drove SDG progress. SDG-specific analysis highlighted banking contributions to poverty reduction (SDG1), health improvements (SDG3) and sustainable cities (SDG11), alongside challenges in climate action (SDG13) and biodiversity conservation (SDG15). The findings emphasize the need for region-specific banking reforms to strengthen financial stability, improve credit quality and align banking practices with the 2030 Agenda for Sustainable Development.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "edb1fb521c020d184a5183457891844c",
  "timestamp": "2025-05-15T02:27:19.124558"
}