{
  "id": 8227,
  "title": "CFO appointment and debt-equity choice",
  "abstract": "Purpose There is some evidence that firms appoint internal candidates to exploit their unique firm specific knowledge and that the type of appointments may have signaling value to the market. However, these studies are limited to chief executive officer appointments whereas other top executives could also play an important role in corporate decision making. The purpose of this paper is to focus on the chief financial officer (CFO) appointments and firm's debt-equity choice. Design/methodology/approach The authors employ a multiple regression framework. To control for potential endogeneity, the authors use an instrumental variable approach with both two-stage least squares and generalized method of moments estimators. Findings The authors find that firms with internal CFO hires issue more equity than firms that hire from the external labor market. The authors also find that internal CFOs significantly reduce information asymmetry (IA), which may lower market risk and the cost of financing through equity issues. Furthermore, consistent with the value maximizing role of reduced IA the authors find that this effect is concentrated in value firms. In firms with higher IA this preference for equity by the internal CFO may be weaker as even internal CFOs will prefer debt financing for its disciplining role and to reduce IA. A subsample analysis with growth firms shows this diminishing impact on the financing choice of an internal CFO. Originality/value This study provides important information about the influence the CFO has on a firm's capital structure decisions.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "edb3102452c5d2937607c40208b7a6f5",
  "timestamp": "2025-05-15T03:16:48.892107"
}