{
  "id": 1428,
  "title": "How knowledge sharing contributes to project portfolio success Empirical analysis of construction firms in China",
  "abstract": "Purpose The purpose of this paper is to investigate the relationship between knowledge sharing and project portfolio success in Chinese construction firms. It also examines how and under what conditions knowledge sharing contributes to project portfolio success. Design/methodology/approach The authors collected questionnaire survey from 178 construction enterprises in China that manage project portfolio as a main form of their business. Hierarchical multiple regression was used to test the proposed framework. Findings The empirical results indicate that all three types of knowledge sharing (knowledge sharing within the project, knowledge sharing among projects and knowledge sharing within the organization) are positively related to project portfolio success. Portfolio management quality (PMQ) conduits the impact of knowledge sharing on project portfolio success. Furthermore, portfolio interdependency moderates the main effect. Originality/value This research is among the first to explicitly differentiate three types of knowledge sharing existing in project portfolios. Also, this research contributes to the literature on the antecedents of project portfolio success by showing the effect of knowledge sharing. Furthermore, this study empirically contributes to portfolio management research by clarifying the critical role of PMQ and portfolio interdependency in the mechanism of knowledge sharing and project portfolio success.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eddd486ff1f5670bff8b7b1986e174f0",
  "timestamp": "2025-05-15T00:55:28.575889"
}