{
  "id": 5429,
  "title": "Trauma system resource preservation: A simple scene triage tool can reduce helicopter emergency medical services overutilization in a state trauma system",
  "abstract": "BACKGROUND Helicopter emergency medical services improve survival in some injured patients but current utilization leads to significant overtriage with considerable numbers of transported patients discharged home from the emergency department or found to have non-time-sensitive injuries. Current triage models for utilization are complex and untested. METHODS Data from a state trauma registry were reviewed from 1987 to 1993 and from 2013 to 2015 and compared. Data from 2013 to 2015 were analyzed for field information found to influence mortality and a model for low mortality-risk patients designed. RESULTS Indexed to population, a major increase in numbers of injured patients transported directly to designated trauma centers (39.849-167.626/100,000/year) occurred with an increased portion transported by helicopter emergency medical services from 7.28% to 9.26%. A simple triage tool to predict low mortality rates was designed utilizing results from logistic regression. Nongeriatric adult patients (age, 16.0-69.9 years) with a blunt injury mechanism, normal Glasgow Coma Scale motor score, pulse rate of 60 bpm to 120 bpm and respiratory rate of 10 breaths per minute to 29 breaths per minute are at low risk for mortality. Cost for helicopter transportation was substantially higher than ground transportation based on available data. Cost differentials in transport mode increased patient financial risk when helicopter transportation was utilized. CONCLUSION Implementing a simple decision tool designating nongeriatric adult patients with a blunt injury mechanism, normal Glasgow Coma Scale motor score, systolic blood pressure greater than 90 mm Hg, pulse rate of 60 bpm to 120 bpm, and respiratory rate of 10 breaths per minute to 29 breaths per minute to ground transportation would result in substantial savings without an increase in mortality and reduce risk of patient financial harm.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "edde7d9d62f755de6f0ad54332d3f36b",
  "timestamp": "2025-05-15T02:47:42.956419"
}