{
  "id": 7795,
  "title": "Retinopathy of Prematurity in Infants Weighing Less Than 500 Grams at Birth Enrolled in the Early Treatment for Retinopathy of Prematurity Study",
  "abstract": "Purpose: To describe patient characteristics, classification, and onset of prethreshold retinopathy of prematurity (ROP), and ocular findings at 6 months corrected age in infants with birth weights <500 g who were enrolled in the Early Treatment for Retinopathy of Prematurity (ETROP) Study. Design: Multicenter randomized clinical trial. Participants: Sixty-three infants with birth weights <500 g who developed ROP and were enrolled in the ETROP Study. Methods: Infants <1251 g at birth were logged at 26 study centers from October 1, 2000, to September 30, 2002, and underwent examinations for ROP. Infants who developed ROP and whose parents/legal guardians consented were enrolled in the ETROP Study. Infants who developed high-risk prethreshold ROP were randomized; 1 eye was treated early with peripheral retinal ablation and the other eye was managed conventionally, or, in asymmetric cases, the high-risk eye was randomized to early peripheral retinal ablation or conventional management. All eyes reaching prethreshold ROP were examined when infants reached 6 months corrected age. Main Outcome Measures: Retinopathy of prematurity incidence, characteristics, and ocular findings among participants. Results: Thirty-four infants reached prethreshold or worse severity in 1 or both eyes. Retinopathy of prematurity was located in zone I in 43.3% of all prethreshold eyes, and plus disease was present in 46.7%. Median postmenstrual age for diagnosis of all prethreshold ROP was 36.1 weeks, but earlier (35.1 weeks) for eyes that developed high-risk prethreshold ROP. In the 27 surviving infants with prethreshold ROP, ophthalmic examination at 6 months corrected age showed a normal posterior pole in 22 (81.5%), a favorable structural outcome with posterior pole abnormalities in 4 (14.8%), and an unfavorable structural outcome (stage 4B) in 1 (3.7%). One infant developed amblyopia, 4 infants developed nystagmus, 4 infants developed strabismus, and 8 infants developed myopia >-5.00 diopters. Conclusions: This is the first report on characteristics of prethreshold ROP in infants with birth weights <500 g. These infants are at high risk for developing prethreshold ROP, although many initially achieve a favorable structural outcome. They are at risk of developing strabismus, nystagmus, high myopia, and abnormal retinal structure and should therefore receive continued long-term follow-up. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2011; 118: 1145-1151 (C) 2011 by the American Academy of Ophthalmology.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee05ac288ecf7db023cd8199816a2971",
  "timestamp": "2025-05-15T03:12:11.660243"
}