{
  "id": 8807,
  "title": "The Effect and Impact of Signals on Investing Decisions in Reward-Based Crowdfunding: A Comparative Study of China and the United Kingdom",
  "abstract": "When traditional financial institutions faced difficulties in the task of assisting micro, small and medium-sized enterprises (MSMEs) with capital allocations, crowdfunding can upsurge as an innovative and vibrant vehicle that can support and assist the activity of such MSME's, by financing their activity and instrumenting the process of risk-sharing. Simultaneously with its enormous growth and popularity, crowdfunding is faced by several key challenges, one of biggest such challenges referring to the problem of information asymmetry that can exist between fundraisers and potential backers. Based on the signaling theory, a research taxonomy has been developed for a comparative analysis between China and the UK. This has been accomplished by retrieving secondary data from the following crowdfunding platforms: Dreamore (Chinese platform) and Crowdfunder (UK platform). The objective of the study is to investigate both the effect and the impact that signals (goal setting, project comments and updates) have upon mitigating the problem of information asymmetry, in order to make the project successful. We have thus deployed an Ordinary Least Square (OLS) regression and validated the models through a robustness check. The findings reveal that signals actively mitigate the problem of information asymmetry in both countries, but this varies in the sense that higher goal setting has a more positive/impactful relationship with project success in the UK than it does in China. Project comments are more positively associated with project success in China as compared to the UK, whereas project updates are more negatively related to project success in China as compared to the UK. These findings demonstrate the importance that signals have upon successful crowdfunding activities/campaigns, highlighting the theoretical and practical influence and relevance for potential fundraisers in the two aforementioned economies.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee06f209af8fc5524315c61d7dc24810",
  "timestamp": "2025-05-15T03:22:26.121586"
}