{
  "id": 1706,
  "title": "Prospective Association of the Portfolio Diet with All-Cause and Cause-Specific Mortality Risk in the Mr. OS and Ms. OS Study",
  "abstract": "The Portfolio Diet has demonstrated its cardiovascular benefit from interventions, but the association between Portfolio Diet adherence and the risk of all-cause and cause-specific mortality has not been examined in Chinese population. The present study has collected Portfolio Diet adherence (assessed by food frequency questionnaire), lifestyle factors and mortality status of 3991 participants in the Mr. Osteoporosis (OS) and Ms. OS Study. Cox regression models were used to examine the association between the Portfolio Diet adherence and mortality risk (all-cause, cardiovascular disease or cancer). The highest quartile of the Portfolio Diet score was associated with a 28% lower risk of all-cause (hazard ratio, HR: 0.72) and cancer (HR: 0.72) mortality, respectively. The association between Portfolio Diet adherence and cardiovascular disease mortality did not reach statistical significance (HR: 0.90, 95% CI = 0.64, 1.26). Among male participants, the highest adherence to the Portfolio Diet was also associated with a lower risk of all-cause (HR: 0.63) and cancer mortality (HR: 0.59), and there was an inverse association between food sources of plant protein and the risk of cardiovascular mortality (HR: 0.50). However, most associations between the Portfolio Diet and mortality were not significant among females. The protection for cancer mortality risk might reach the plateau at the highest adherence to the Portfolio Diet for females. To conclude, greater adherence to the Portfolio Diet was significantly associated with a lower risk of mortality in Hong Kong older adults, and the associations appeared stronger among males.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee0a80465a6a4af5dacf00098bce3f6f",
  "timestamp": "2025-05-15T00:58:50.605085"
}