{
  "id": 9180,
  "title": "Genome-wide Association Studies of Retinal Vessel Tortuosity Identify Numerous Novel Loci Revealing Genes and Pathways Associated With Ocular and Cardiometabolic Diseases",
  "abstract": "Purpose: To identify novel susceptibility loci for retinal vascular tortuosity, to better understand the molecular mechanisms modulating this trait, and reveal causal relationships with diseases and their risk factors. Design: Genome-wide Association Studies (GWAS) of vascular tortuosity of retinal arteries and veins followed by replication meta-analysis and Mendelian randomization (MR). Participants: We analyzed 116 639 fundus images of suitable quality from 63 662 participants from 3 cohorts, namely the UK Biobank (n = 62 751), the Swiss Kidney Project on Genes in Hypertension (n = 397), and Methods: Using a fully automated retina image processing pipeline to annotate vessels and a deep learning algorithm to determine the vessel type, we computed the median arterial, venous and combined vessel tortuosity measured by the distance factor (the length of a vessel segment over its chord length), as well as by 6 alternative measures that integrate over vessel curvature. We then performed the largest GWAS of these traits to date and assessed gene set enrichment using the novel high-precision statistical method PascalX. Main Outcome Measure: We evaluated the genetic association of retinal tortuosity, measured by the distance factor. Results: Higher retinal tortuosity was significantly associated with higher incidence of angina, myocardial infarction, stroke, deep vein thrombosis, and hypertension. We identified 175 significantly associated genetic loci in the UK Biobank; 173 of these were novel and 4 replicated in our second, much smaller, metacohort. We estimated heritability at w25% using linkage disequilibrium score regression. Vessel type specific GWAS revealed 116 loci for arteries and 63 for veins. Genes with significant association signals included COL4A2, ACTN4, LGALS4, LGALS7, LGALS7B, TNS1, MAP4K1, EIF3K, CAPN12, ECH1, and SYNPO2. These tortuosity genes were overexpressed in arteries and heart muscle and linked to pathways related to the structural properties of the vasculature. We demonstrated that retinal tortuosity loci served pleiotropic functions as cardiometabolic disease variants and risk factors. Concordantly, MR revealed causal effects between tortuosity, body mass index, and low-density lipoprotein. Conclusions: Several alleles associated with retinal vessel tortuosity suggest a common genetic architecture of this trait with ocular diseases (glaucoma, myopia), cardiovascular diseases, and metabolic syndrome. Our results shed new light on the genetics of vascular diseases and their pathomechanisms and highlight how GWASs and heritability can be used to improve phenotype extraction from high-dimensional data, such as images. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology Science 2023;3:100288 & COPY; 2023 by the American Academy of Ophthalmology. This is an open access article under the CC BY license (http://creativecommons.org/licenses/by/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee0ce4a71644a9000822694ca55cf916",
  "timestamp": "2025-05-15T03:26:25.961767"
}