{
  "id": 5156,
  "title": "Application of a simple, affordable quality metric tool to colorectal, upper gastrointestinal, hernia, and hepatobiliary surgery patients: the HARM score",
  "abstract": "Quality is the major driver for both clinical and financial assessment. There remains a need for simple, affordable, quality metric tools to evaluate patient outcomes, which led us to develop the HospitAl length of stay, Readmission and Mortality (HARM) score. We hypothesized that the HARM score would be a reliable tool to assess patient outcomes across various surgical specialties. From 2011 to 2015, we identified colorectal, hepatobiliary, upper gastrointestinal, and hernia surgery admissions using the Vizient Clinical Database. Individual and hospital HARM scores were calculated from length of stay, 30-day readmission, and mortality rates. We evaluated the correlation of HARM scores with complication rates using the Clavien-Dindo classification. We identified 525,083 surgical patients: 206,981 colorectal, 164,691 hepatobiliary, 97,157 hernia, and 56,254 upper gastrointestinal. Overall, 53.8% of patients were admitted electively with a mean HARM score of 2.24; 46.2% were admitted emergently with a mean HARM score of 1.45 (p < 0.0001). All HARM components correlated with patient complications on logistic regression (p < 0.0001). The mean length of stay increased from 3.2 +/- 1.8 days for a HARM score < 2 to 15.1 +/- 12.2 days for a HARM score > 4 (p < 0.001). In elective admissions, for HARM categories of < 2, 2-< 3, 3-4, and > 4, complication rates were 9.3, 23.2, 38.8, and 71.6%, respectively. There was a similar trend for increasing HARM score in emergent admissions as well. For all surgical procedure categories, increasing HARM score, with and without risk adjustment, correlated with increasing severity of complications by Clavien-Dindo classification. The HARM score is an easy-to-use quality metric that correlates with increasing complication rates and complication severity across multiple surgical disciplines when evaluated on a large administrative database. This inexpensive tool could be adopted across multiple institutions to compare the quality of surgical care.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee0dd53c924ae329987f833973ca9d94",
  "timestamp": "2025-05-15T02:44:43.992949"
}