{
  "id": 5967,
  "title": "Multiple social risk factors are adversely associated with diabetes management and psychosocial outcomes among adults with diabetes",
  "abstract": "Adults from structurally marginalized populations have disproportionately higher rates of diabetes, highlighting the importance of addressing social risk factors in diabetes prevention and management. This study examined the correlations among multiple social risk factors and their respective burden on diabetes management and psy-chosocial health outcomes among adults with diabetes. Data came from the baseline assessment of an ongoing randomized controlled trial evaluating approaches to addressing unmet social needs among 579 adults with diabetes. Four social risks (food insecurity, financial insecurity, housing insecurity, and utility insecurity) were assessed, dichotomized and summed to create a score of cumulative social risk factors. The outcomes of interest were: hemoglobin A1c, cost-related non-adherence for diabetes, diabetes distress, and anxiety or depression. Multivariate regression models were used to examine the associations between cumulative social risk factors and health outcomes, adjusting for sociodemographic characteristics and diabetes duration. Approximately 18% of study participants reported one social risk, 18% reported two social risks, and 23% reported three or four social risks. After multivariate adjustment, adults with three or four social risk factors had a greater likelihood of cost -related non-adherence (OR 2.81, 95% CI 1.95, 4.06), diabetes distress (OR 3.03, 95% CI 2.13, 4.31), and anxiety or depression (OR 5.36, 95% CI 3.39, 8.47), compared to adults with no social risk factors. Significant dos-e-response relationships were observed with greater social risk factors and poorer diabetes-related outcomes. These findings support efforts to address systemic contributors to diabetes management and care to better promote individual and population health.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee0d6e5ea0a94ed5c91102a4cec37969",
  "timestamp": "2025-05-15T02:53:33.342752"
}