{
  "id": 6657,
  "title": "Synergy between climate risk perception, adaptation responses, and agricultural productivity: the case of rice farming communities in Pakistan",
  "abstract": "The climate variability in Pakistan adversely affects rice crops and undermines the food security and livelihoods of millions of rural households whose survival depends directly on rice farming. This study examines farmers' risk perception, adaptation responses, and adaptation impact on rice productivity. We employed a multi-stage sampling method for selecting 480 farmers from the rice production zone of Punjab province, a region that produces more than 60% of the total rice in the country and faces significant production decline due to climate change. We used the risk matrix method to determine farmers' perception of climate change-induced risk and used the propensity score matching (PSM) technique to analyze the impact of adaptation measures on rice yield and crop returns. Results show that farmers had high perceptions and were concerned about biological and financial risks, followed by biophysical, atmospheric, and social risks. Farmers applied supplementary irrigation, changed rice cultivation dates, changed rice varieties, resized farms, and altered irrigation application times as adaptation measures to cope with changing climate effects. Probit regression analysis showed that the adaptation measures had been largely affected by farmers' socioeconomic attributes and risk perceptions. The PSM estimates showed that all adaptation measures had a positive impact on rice yield and crop return. Specifically, the cultivation of alternative rice varieties, farm resizing, and supplementary irrigation were the most effective strategies, followed by the adjustment in cultivation dates and irrigation time. Having implications beyond Pakistan, this study suggests improving farmers' access to irrigation water, credit, and farm advisory services to facilitate the extent of adaptation.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee1daff1f8f5a22c90984559965e997d",
  "timestamp": "2025-05-15T03:00:05.080494"
}