{
  "id": 2346,
  "title": "Production Planning and Scheduling Using Machine Learning and Data Science Processes",
  "abstract": "Increasing manufacturing efficiency has been a constant challenge since the First Industrial Revolution. What started as mechanization and turned into electricity-driven operations has experienced the power of digitalization. Currently, the manufacturing industry is experiencing an exponential increase in data availability, but it is essential to deal with the complexity and dynamics involved to improve manufacturing indicators. The aim of this study is to identify and allow an understanding of the unfilled gaps and the opportunities regarding production scheduling using machine learning and data science processes. In order to accomplish these goals, the current study was based on the Knowledge Development Process - Constructivist (ProKnow-C) methodology. Firstly, selecting 30 articles from 3608 published articles across five databases between 2015 and 2019 created a bibliographic portfolio. Secondly, a bibliometric analysis, which generated comparative charts of the journals' relevance regarding its impact factor, scientific recognition of the articles, publishing year, highlighted authors and keywords was carried out. Thirdly, the selected articles were read thoroughly through a systemic analysis in order to identify research problems, proposed solutions, and unfilled gaps. Then, research opportunities identified were: (i) Big data and associated analytics; (ii) Collaboration between different disciplines; (iii) Solution Customization; and (iv) Digital twin development.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee28231d8b77d1f33334d5efbfab4c13",
  "timestamp": "2025-05-15T01:06:10.650790"
}