{
  "id": 5136,
  "title": "Investigating the Impact of Agricultural, Financial, Economic, and Political Factors on Oil Forward Prices and Volatility: A SHAP Analysis",
  "abstract": "Accurately forecasting crude oil prices is crucial due to its vital role in the industrial economy. In this study, we explored the multifaceted impact of various financial, economic, and political factors on the forecasting of crude oil forward prices and volatility. We used various machine learning models to forecast oil forward prices and volatility based on their superior predictive power. Furthermore, we employed the SHAP framework to analyze individual features to identify their contributions in terms of the prediction. According to our findings, factors contributing to oil forward prices and volatility can be summarized into four key focal outcomes. First, it was confirmed that soybean forward pricing overwhelmingly contributes to oil forward pricing predictions. Second, the SSEC is the second-largest contributor to oil forward pricing predictions, surpassing the contributions of the S&P 500 or oil volatility. Third, the contribution of oil forward prices is the highest in predicting oil volatility. Lastly, the contribution of the DXY significantly influences both oil forward price and volatility predictions, with a particularly notable impact on oil volatility predictions. In summary, through the SHAP framework, we identified that soybean forward prices, the SSEC, oil volatility, and the DXY are the primary contributors to oil forward price predictions, while oil forward prices, the S&P 500, and the DXY are the main contributors to oil volatility predictions. These research findings provide valuable insights into the most-influential factors for predicting oil forward prices and oil volatility, laying the foundation for informed investment decisions and robust risk-management strategies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee3fecaf34edad4af9c41244360ceb1d",
  "timestamp": "2025-05-15T02:44:43.878016"
}