{
  "id": 4347,
  "title": "Modeling Time-Varying Currency Betas: New Evidence from the Selected Markets",
  "abstract": "In the past decade, studies of exchange rate exposure have mainly focused on three approaches. The first approach uses conventional methods such as sub-sampling, dummy variables, and overlapping moving window regression to capture exchange rate exposure. The second approach uses pre-specified determinants of exposure coefficients to analyze the time-variation of exchange rate exposure. For example, Allayannis (1997) suggests that currency beta is determined by export and import shares, and finds support for time-variation of exposure in some 4-digit level SIC industries. The third approach employs time-varying second moments to derive time-varying exchange rate exposure (see, for instance, Hunter, 2005; Lim, 2005). Hunter (2005) analyzes the time-varying exchange rate exposure of small and large firms using size-based portfolios of the Fama-French-type, and Lim (2005) derives both market and currency betas at country level, with allowance for non-orthogonality between risk factors. It is believed that the third approach is more appealing as the well-documented bivariate GARCH-type models are often employed to estimate the time-varying exchange rates conditional on available information. There are three models associated with this approach, namely, the VECH models; the BEKK models; and the Constant Conditional Correlation GARCH (CCC-GARCH) models. However, the VECH model is less popular because of the difficulty in maintaining positive definiteness of the variance and covariance matrix and other computational hindrance on convergence during estimation, while the CCC-GARCH model is too restrictive as the computed covariance between returns and exchange rate changes can be either negative or positive in all periods, depending on the sign of the constant conditional correlation coefficient. In reality, exchange rate changes may affect returns on stock index either positively and/or negatively in different time periods. Hence, it is inappropriate to assume time-constancy in the conditional correlation coefficient. In this paper, we adopt the general framework of conditional ICAPM proposed by Adler and Dumas (1983) and De Santis and Gerard (1998) to estimate the time varying currency betas and the time-varying market betas for nine developed and emerging countries. A trivariate BEKK-GARCH-type model is used to estimate the conditional variance and covariance of return variables using a set of daily data spanning from 5 January 1999 to 30 December 2005. In particular, we compute the time-varying currency betas and market betas using estimates of the conditional variance and covariance of returns from country stock index, world market portfolio and changes in exchange rate of the trading country. To the best of our knowledge, this is the first study that estimates such betas from a BEKK-GARCH-type specification based on daily returns. The main advantage of BEKK parameterization is that it guarantees the variance and covariance matrix to be positive definiteness during estimation, and the often alleged difficulty of interpreting parameters in BEKK models is not an issue. Our results indicate that currency betas are generally more volatile than that of the world market betas. In addition, currency betas in the emerging markets, such as Korea, Taiwan and Thailand, are more volatile than those in the developed markets. We also find some evidence of long-memory in the estimated currency betas. The findings have important implications for investment and hedging strategies.",
  "year": 2011,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee53da9caa23d62fb253684dfe5bbca0",
  "timestamp": "2025-05-15T01:26:26.191660"
}