{
  "id": 4787,
  "title": "Longitudinal analysis of the impact of economic empowerment on risk for intimate partner violence among married women in rural Maharashtra, India",
  "abstract": "The purpose of this study was to assess via longitudinal analysis whether women's economic empowerment and financial inclusion predicts incident IPV. This prospective study involved analysis of three waves of survey data collected from rural young married women (n = 853 women) in Maharashtra at baseline and 9&18 month follow-ups. This study, which was in the field from 2012 to 2014, was conducted as part of a larger family planning evaluation study unrelated to economic empowerment. Participants were surveyed on economic empowerment, as measured by items on women's income generation and joint decision-making of husband's income, and financial inclusion, as measured by bank account ownership. Women's land ownership and participation in microloan programs were also assessed but were too rare (2-3% reporting) to be included in analyses. Longitudinal regression models assessed whether women's economic empowerment predicted incident IPV at follow-up. At Wave 1 (baseline), one in ten women reported IPV in the past six months; 23% reported income generation; 58% reported having their own money; 61% reported joint control over husband's money, and 10% reported bank ownership. Women's income generation and having their own money did not predict IPV over time. However, women maintaining joint control over their husband's income were at a 60% reduced risk for subsequent incident IPV (AOR = 0.40; 95% CI = 0.18, 0.90), and women gaining joint control over time were at a 70% reduced risk for subsequent incident IPV (AOR = 0.30; 95% CI = 0.13, 0.72), relative to women whose husbands maintained sole control over his income. Women who initiated a new bank account by Wave 3 also had a 56% reduced likelihood of reporting incident IPV in this same wave (AOR = 0.44; 95% CI = 0.22, 0.93), relative to those who maintained no bank account at Waves 1 and 3. These findings suggest that women's joint control over husband's income and her financial inclusion as indicated by bank ownership appear to reduce risk for IPV, whereas her income generation or control over her own income do not. Awareness of and participation in financial inclusion services may help reduce women's risk for IPV in rural India and elsewhere.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee56a96885361d67999d27a80260d46d",
  "timestamp": "2025-05-15T02:41:00.854417"
}