{
  "id": 5787,
  "title": "Financial toxicity and health-related quality of life in long-term survivors of acute promyelocytic leukaemia",
  "abstract": "Objectives We aimed to investigate the association between financial toxicity (FT) and the health-related quality of life profile of long-term survivors of acute promyelocytic leukaemia (APL) treated within a universal healthcare system.Methods We evaluated FT using the financial difficulties item of the European Organisation for Research and Treatment of Cancer Quality of Life Questionnaire-Core 30 (EORTC QLQ-C30). We also compared the prevalence of clinically important problems and symptoms between the survivors of APL with or without FT, using evidence-based thresholds for the EORTC QLQ-C30. A multivariable logistic regression analysis was performed to explore potential risk factors associated with FT.Results Overall, 352 long-term survivors of APL, with a median age of 53.9 years and a median time since diagnosis of 12.2 years, were analysed. Of these, 71 (20.2%) reported having FT. The prevalence of clinically important problems and symptoms was generally higher across most EORTC QLQ-C30 scales for those survivors who reported FT. The three largest differences between patients with and without FT were observed for emotional functioning (+35.4 percentage points), dyspnoea (+33.1 percentage points) and physical functioning (+27.0 percentage points). The presence of FT was independently associated with having comorbidities and not receiving a salary/pension.Conclusions These findings suggest that even many years after being diagnosed, one-fifth of long-term survivors of APL experience FT. Interventions to assist with employment may be critical to minimise the risk of FT in the most vulnerable survivors.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee5aaaa8cbe3dfd1cf0c059acb7feec6",
  "timestamp": "2025-05-15T02:51:30.047506"
}