{
  "id": 5199,
  "title": "Reporting Business Risks: A Necessity of Sound Corporate Governance Mechanisms",
  "abstract": "The recent financial crisis enhanced the necessity for both practitioners and researchers to reconsider risk management and to propose ways for its improvement. More precisely, the need to prevent risk exposure and failure of strategic risk management was documented in a harsh manner through current realities. When looking at research and trade literature in the area of risk management we notice preoccupations for the development of a holistic approach existing over the last three decades and intensifying over the last one. While theoretical studies debate risk management's ability to create value for the company, empirical studies document determinants of risk management and the use of derivatives. Furthermore, we notice the coherence between the results of empirical studies and the theoretical grounding of using derivatives in order to hedge risk. While it is documented that hedging risk and using derivatives can increase the value of the company, it is corporate governance's role to shape sound policies for derivatives usage. Meanwhile, sound corporate governance mechanisms require informational transparency, accounting information and the financial reporting process playing an important role in this regard. Our paper approaches risk management from an accounting perspective, focusing on reporting business risks. The importance of the approached topic relies on the assumption that investors, as well al other stakeholders' improved understanding of business risks should generate improved stewardship for companies and higher efficiency when it comes to resources' allocation. The developed study undertakes both qualitative and quantitative analysis. The qualitative analysis focuses on debating developments in the area of risk reporting as well as perspectives for its improvement in relation to the extant of recent expectations calling for changes. The quantitative analysis investigates the case of an emerging economy by considering risk reporting practices of companies listed on the Romanian capital market. A disclosure index is computed and furthermore used within a regression analysis trying to identify determinants of risk reporting practices. The obtained results document a low level of risk related information being presented by companies listed on the Romanian capital market. Still, corporate governance elements can be used in explaining companies' current risk reporting practices.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee64c85b70852cddb1a94770a0215178",
  "timestamp": "2025-05-16T17:50:25.560875"
}