{
  "id": 1460,
  "title": "Predicting retail customers' distress in the finance industry: An early warning system approach",
  "abstract": "Predicting credit defaults is crucial for financial institutions to assess risk and make informed lending decisions. One of the most recent strategies banks and financial institutions have been testing to minimize losses that arise from credit default is the deployment of Early Warning Systems (EWS). By nature, this technique was primarily proposed and explored for commercial customers. However, this study proposes a comprehensive datadriven approach to model Early Warning Systems (EWS) for retail customers in the financial industry while using different Machine Learning (ML) models. We use Logistic Regression (LR), Gradient Boosting (GB), and Random Forest (RF) to classify customers' status, indicating the need to include potential default in a watch list. Additionally, we implement a fourth model (i.e., meta-model), whose predictions are based on the output of the other algorithms used (LR, GB, RF). Results indicate that the meta-model achieves higher accuracy than GB or any other individual model tested. From the management perspective, the findings indicate that a higher threshold for warning signals results in alerts closer to the overdue date, indicating increased sensitivity to emerging client deterioration. Conversely, lower thresholds focus more on the client's overall status. Furthermore, using the top ten features for training yields satisfactory overall results, but incorporating features beyond the top ten provides valuable supplementary information to be used in the decision-making process.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee680873f7145b650569042909ad2efa",
  "timestamp": "2025-05-15T02:03:00.822849"
}