{
  "id": 7334,
  "title": "A biopsychosocial model of severe fear of COVID-19",
  "abstract": "Introduction COVID-19 is a respiratory infection that causes not only somatic health issues, but also frequently psychosocial burdens. The aims of this study were to investigate biopsychosocial factors that might further aggravate fear of COVID-19, and to establish a biopsychosocial model of severe fear of COVID-19. Methods 368 participants were included in this study. Biopsychosocial factors observed comprised biological factors (somatic risk), psychological factors (state/trait anxiety, physical symptoms of anxiety, severe health anxiety, specific phobias, depression), and psychosocial factors (social support, financial losses, social media consumption, social contacts with COVID-19 infected people). Psychometric questionnaires included State-Trait Anxiety Inventory, Beck's Anxiety Inventory, Whiteley-Index / Illness Attitude Scales, Specific Phobia Questionnaire, WHO-5 and Social Support Survey. Results 162/368 (44.0%) participants had almost no fear, 170/368 (46.2%) participants had moderate fear, and 45/368 (12.2%) participants had severe fear of COVID-19. Female participants showed higher levels of fear of COVID-19 than male participants (gender: chi 2 = 18.47, p<0.001). However, the level of fear of COVID-19 increased in male participants when they had contact with people who were infected with COVID-19, while in contrast the level of fear of COVID-19 decreased in female participants when they had such contacts [ANCOVA: fear of COVID-19 (contact x gender): F(1,363) = 5.596, p = .019]. Moreover, participants without relationships showed higher levels of fear of COVID-19 (marital status: chi 2 = 14.582, p = 0.024). Furthermore, financial losses due to the COVID-19 were associated with higher levels of fear of COVID-19 [ANCOVA: fear of COVID-19(financial loss x gender): F(1, 363) = 22.853, p< .001]. Multiple regression analysis revealed female gender, severe health anxiety (WI-IAS) and state /trait anxiety (STAI) as significant predictors of severe fear of COVID-19. Conclusion In this study significant predictors of severe fear of COVID-19 were female gender, pre-existing state and trait anxiety, as well as severe health anxiety. The finding of significant predictors of fear of COVID-19 might contribute to detect people who might suffer most from severe, overwhelming fear of COVID-19 at an early stage.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee6bd7464ce3a4814e7cfcb91d98b1e1",
  "timestamp": "2025-05-15T03:07:31.883753"
}