{
  "id": 3734,
  "title": "Climate transition risk in US loan portfolios: Are all banks the same?",
  "abstract": "We examine banks' exposure to climate transition risk using a bottom-up, loan-level methodology incorporating climate stress test based on the Merton probability of default model and transition pathways from the Inter-governmental Panel on Climate Change (IPCC). Specifically, we match machine learning predictions of corporate carbon footprints to syndicated loans initiated in 2010-2018 and aggregate these to loan portfolios of the twenty largest banks in the United States. Banks vary in their climate transition risk not only due to their exposure to the energy sectors but also due to borrowers' carbon emission profiles from other sectors. Banks generally lend a minimal amount to coal (0.4%) but hold a considerable exposure in oil and gas (8.6%) and electricity firms (4.6%) and thus have a large exposure to the energy sectors (13.5%). We observe that climate transition risk profile was stable over time, save for a temporary (in some cases) and permanent (in others), reduction in their fossil-fuel exposure after the Paris Agreement. From the stress testing, the median loss is 0.5% of US syndicated loans, representing a decrease in CET1 capital of 4.1% when extrapolated to the whole balance sheet. The loss is twice as large in the 1.5 degrees C scenarios (1.4%-2.1% of loan value, 12%-16% of CET1 capital) compared to the 2 degrees C target (0.6%-1.1% of loan value, 5%-9% of CET1 capital) with significant tail-end risk (7.7% of loan value, 62% of CET1 capital). Banks' vulnerabilities are also driven by the ex-ante financial risk of their borrowers more generally, highlighting that climate risk is not independent from conventional risks.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee6ecfc74627ebd8c884a85e6ab11bda",
  "timestamp": "2025-05-15T02:29:28.016001"
}