{
  "id": 3422,
  "title": "The development of a carbon roadmap investment strategy for carbon intensive food retail industries",
  "abstract": "This work presents an approach to develop an innovative decarbonisation investment strategy framework for carbon intensive UK industries by using statistical analysis and optimisation modelling. The case study focuses on taking a representative sample of retail buildings and assesses the financial viability of installing low-carbon Combined Heat and Power units (CHPs) and Photovoltaic Solar Panels (PVs) across a portfolio of buildings. Simulation of each building are initially conducted, and the results generate a set of regression coefficients, via a multivariate adaptive regression splines (MARS), which are inputted into a Mixed Integer Linear Programming (MILP) problem. Solving the MILP yields the optimal decarbonisation investment strategy for the case study up to 2050, considering market trends such as electricity prices, gas prices and policy incentives. Results indicate the level of investment required per year, the operational and carbon savings associated, and a program for such investments. This method is reiterated for several scenarios where different parameters such as utility prices, capital costs and grid carbon factors are forecasted up to 2050 (following the Future Energy Scenarios from National Grid). This work shows how a clear mathematical framework can assist decision-makers in commercial organisations to reduce their carbon footprint cost-effectively and thus reach science-based targets. (C) 2019 The Authors. Published by Elsevier Ltd.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee6f66b1d223d52d99dc2da43a720e38",
  "timestamp": "2025-05-15T01:16:55.539823"
}