{
  "id": 3974,
  "title": "Mutual fund manager turnover: an empirical investigation of performance",
  "abstract": "Purpose When a fund manager leaves, the investment strategy of the fund changes or remains the same. The departing fund manager's resignation is either forced or voluntary. The study investigates the relationship between the portfolio manager's transition and the fund's investment strategy and how the change affects the mutual fund returns in the subsequent period. Design/methodology/approach The authors examine 148 fund manager changes in India between April 2005-March 2018 using three performance measures: abnormal return (fund return minus benchmark return), Jensen's alpha and Carhart four-factor alpha. The analysis includes an event study methodology, followed by a two-step Fama-MacBeth regression approach. Findings Contrary to the previous studies conducted in the developed markets, the authors find that fund performance improves irrespective of whether the fund manager change is forced or voluntary. The outperformance after the fund manager's exit is significant for funds belonging to the larger fund families. Originality/value In the context of investment management, the authors provide a conceptual framework to understand the effect of fund manager exit on mutual fund performance. The authors substantiate their arguments with empirical evidence. To the best of the authors' understanding, this is the first research to examine the effect of changing mutual fund managers in an emerging market setting.",
  "year": 2022,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee7c9c0f5d56e5162026729f9d84ea2b",
  "timestamp": "2025-05-15T01:22:39.414474"
}