{
  "id": 4705,
  "title": "Household financial burden associated with healthcare for older people in Viet Nam: a cross-sectional survey",
  "abstract": "Background Population ageing and the associated increase in the healthcare needs of older people are putting pressure on the healthcare system in Viet Nam. The country prioritizes healthcare for older people and has developed financial protection policies to mitigate financial hardship due to out-of-pocket health expenditures (OOPHEs) borne by their households. This study examines the level and determinants of the financial burden of OOPHE among households with people aged >= 60 years in Viet Nam. Methods A cross-sectional household survey was conducted among a sample of 1536 older people living in 1477 households in three provinces representing the North, Central and South regions of Viet Nam during 2019-2020. The financial outcomes were catastrophic health expenditure (CHE), using WHO's definition, and financial distress due to OOPHE. Multivariate binary logistic regression analysis was employed to determine the factors associated with these outcomes. Results OOPHE for older household members accounted for 86.3% of total household health expenditure. Of households with older people, 8.6% (127) faced CHE, and 12.2% (181) experienced financial distress due to OOPHE. Households were at a higher risk of incurring financial burdens related to health expenditures if they had fewer household members; included only older people; were in rural or remote, mountainous areas; and had older members with noncommunicable diseases. There was no significant association between health insurance coverage and financial burden. However, when older people sought tertiary care or private care, the possibility of a household facing CHE increased. Regardless of the type and level of care, health service utilization by older people results in a higher likelihood of a household encountering financial distress. Conclusions This study reveals that OOPHE for older people can impose substantial financial burdens on households, leading them to face CHE and financial distress. This study provides evidence to justify reforming financial protection policies and introducing policy interventions targeted at better protecting older people and their households from the financial consequences of OOPHE. There is also the need to strengthen the grassroots health facilities to provide primary care closer to home at lower costs, particularly for the management of noncommunicable diseases.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee85482a5377e3ea56555feded107562",
  "timestamp": "2025-05-15T02:39:57.618338"
}