{
  "id": 4918,
  "title": "Video-Assisted Thoracic Surgery Lobectomy Cost Variability: Implications for a Bundled Payment Era",
  "abstract": "Background. In 2013, the Centers for Medicare and Medicaid Services began its Bundled Payments for Care Improvement Initiative. If payments are to be bundled, surgeons must be able to predict which patients are at risk for more costly care. We aim to identify factors driving variability in hospital costs after video-assisted thoracic surgery (VATS) lobectomy for lung cancer. Methods. Our institutional Society of Thoracic Surgeons data were queried for patients undergoing VATS lobectomy for lung cancer during fiscal years 2010 to 2011. Clinical outcomes data were linked with hospital financial data to determine operative and postoperative costs. Linear regression models were created to identify the impact of preoperative risk factors and perioperative outcomes on cost. Results. One hundred forty-nine VATS lobectomies for lung cancer were reviewed. The majority of patients had clinical stage IA lung cancer (67.8%). Median length of stay was 4 days, with 30-day mortality and morbidity rates of 0.7% and 37.6%, respectively. Mean operative and postoperative costs per case were $8,492.31 (+/- $2,238.76) and $10,145.50 (+/- $7,004.71), respectively, resulting in an average overall hospital cost of $18,637.81 (+/- $8,244.12) per patient. Patients with chronic obstructive pulmonary disease and coronary artery disease, as well as postoperative urinary tract infections and blood transfusions, were associated with statistically significant variability in cost. Conclusions. Variability in cost associated with VATS lobectomy is driven by assorted patient and clinical variables. Awareness of such factors can help surgeons implement quality improvement initiatives and focus resource utilization. Understanding risk-adjusted clinical-financial data is critical to designing payment arrangements that include financial and performance accountability, and thus ultimately increasing the value of health care. (C) 2014 by The Society of Thoracic Surgeons",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee87422e950376ae6f924268c62da6e7",
  "timestamp": "2025-05-15T02:42:36.118852"
}