{
  "id": 9165,
  "title": "Hospitalizations and Deaths Among Adults With Cardiovascular Disease Who Underuse Medications Because of Cost A Longitudinal Analysis",
  "abstract": "Context: It is well-documented that the financial burden of out-of-pocket expenditures for prescription drugs often leads people with medication-sensitive chronic illnesses to restrict their use of these medications. Less is known about the extent to which such cost-related medication underuse is associated with increases in subsequent hospitalizations and deaths. Objective: We compared the risk of hospitalizations among 5401 and of death among 6135 middle-aged and elderly adults with one or more cardiovascular diseases (diabetes, coronary artery disease, heart failure, and history of stroke) according to whether participants did or did not report restricting prescription medications because of cost. Design and Setting: A retrospective biannual cohort study across 4 cross-sectional waves of the Health and Retirement Study, a nationally representative survey of adults older than age 50. Using multivariate logistic regression to adjust for baseline differences in sociodemographic and health characteristics, we assessed subsequent hospitalizations and deaths between 1998 and 2006 for respondents who reported that they had or had not taken less medicine than prescribed because of cost. Results: Respondents with cardiovascular disease who reported underusing medications due to cost were significantly more likely to be hospitalized in the next 2 years, even after adjusting for other patient characteristics (adjusted predicted probability of 47% compared with 38%, P < 0.001). The more survey waves respondents reported cost-related medication underuse during 1998 to 2004, the higher the probability of being hospitalized in 2006 (adjusted predicted probability of 54% among respondents reporting cost-related medication underuse in all 4 survey waves compared with 42% among respondents reporting no underuse, P < 0.001). There was no independent association of cost-related medication underuse with death. Conclusions: In this nationally representative cohort, middle-aged and elderly adults with cardiovascular disease who reported cutting back on medication use because of cost were more likely to report being hospitalized over a subsequent 2-year period after they had reported medication underuse. The more extensively respondents reported cost-related underuse over time, the higher their adjusted predicted probability of subsequent hospitalization.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee96ba9458960967d15b2adf2b5e7860",
  "timestamp": "2025-05-15T03:26:25.879808"
}