{
  "id": 3940,
  "title": "Asset pricing: an alternative estimation for the five-factor model",
  "abstract": "Purpose - This paper introduces a comprehensive approach to estimating the five-factor model in financial markets, emphasizing flexibility and predictive improvement via GAMLSS models. We highlight the innovative potential of this methodology in asset pricing theory. Theoretical framework - This paper seeks to evaluate the behavior of asset prices under conditions of uncertainty. Fama and French (2015) inspired us to present an extension via structured additive distributional regression using GAMLSS for the five-factor model. Design/methodology/approach - The sample contains information from the Brazilian financial market from 1994 to 2018. Given the violation of the conditional normal distribution commonly observed in these data, we propose adopting GAMLSS modeling. This approach allows for the flexibility of probability distributions associated with stock portfolio returns, more accurately accommodating location and scale. Findings - GAMLSS modeling significantly enhances predictive performance, providing a robust alternative to traditional models that use the normal distribution. Furthermore, no evidence of specification error was observed using GAMLSS models, reinforcing their reliability. Practical & social implications of research - The use of flexible GAMLSS modeling for asset pricing is proposed In the Brazilian financial market. This would improve decision-making capacity related to financial markets and asset pricing. Originality/value - In terms of contribution, the article proposes a new estimation approach for the five-factor model using GAMLSS models.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ee9baa5b2eb3206e9fe4746c4bf5ec86",
  "timestamp": "2025-05-15T01:22:39.284787"
}