{
  "id": 5330,
  "title": "Safer Prescribing - A Trial of Education, Informatics, and Financial Incentives",
  "abstract": "BACKGROUND High-risk prescribing and preventable drug-related complications are common in primary care. We evaluated whether the rates of high-risk prescribing by primary care clinicians and the related clinical outcomes would be reduced by a complex intervention. METHODS In this cluster-randomized, stepped-wedge trial conducted in Tayside, Scotland, we randomly assigned participating primary care practices to various start dates for a 48-week intervention comprising professional education, informatics to facilitate review, and financial incentives for practices to review patients' charts to assess appropriateness. The primary outcome was patient-level exposure to any of nine measures of high-risk prescribing of nonsteroidal antiinflammatory drugs (NSAIDs) or selected antiplatelet agents (e.g., NSAID prescription in a patient with chronic kidney disease or coprescription of an NSAID and an oral anticoagulant without gastroprotection). Prespecified secondary outcomes included the incidence of related hospital admissions. Analyses were performed according to the intention-to-treat principle, with the use of mixed-effect models to account for clustering in the data. RESULTS A total of 34 practices underwent randomization, 33 of which completed the study. Data were analyzed for 33,334 patients at risk at one or more points in the preintervention period and for 33,060 at risk at one or more points in the intervention period. Targeted high-risk prescribing was significantly reduced, from a rate of 3.7% (1102 of 29,537 patients at risk) immediately before the intervention to 2.2% (674 of 30,187) at the end of the intervention (adjusted odds ratio, 0.63; 95% confidence interval [CI], 0.57 to 0.68; P<0.001). The rate of hospital admissions for gastrointestinal ulcer or bleeding was significantly reduced from the preintervention period to the intervention period (from 55.7 to 37.0 admissions per 10,000 person-years; rate ratio, 0.66; 95% CI, 0.51 to 0.86; P=0.002), as was the rate of admissions for heart failure (from 707.7 to 513.5 admissions per 10,000 person-years; rate ratio, 0.73; 95% CI, 0.56 to 0.95; P=0.02), but admissions for acute kidney injury were not (101.9 and 86.0 admissions per 10,000 person-years, respectively; rate ratio, 0.84; 95% CI, 0.68 to 1.09; P=0.19). CONCLUSIONS A complex intervention combining professional education, informatics, and financial incentives reduced the rate of high-risk prescribing of antiplatelet medications and NSAIDs and may have improved clinical outcomes.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eeb91831d6ed47cf058558c6fa5043af",
  "timestamp": "2025-05-15T02:46:44.889893"
}