{
  "id": 5790,
  "title": "How the real estate indexes have performed during the COVID-19 crisis? Multifractal analysis revisited with wavelet",
  "abstract": "PurposeThe purpose of this paper is to test the existence of stylized facts, such as the volatility clustering, heavy tails seen on financial series, long-term dependence and multifractality on the returns of four real estate indexes using different types of indexes: conventional and Islamic by comparing pre and during COVID-19 pandemic.Design/methodology/approachFirstly, the authors examined the characteristics of the indexes. Secondly, the authors estimated the parameters of the stable distribution. Then, the long memory is detected via the estimation of the Hurst exponents. Afterwards, the authors determine the graphs of the multifractal detrended fluctuation analysis (MF-DFA). Finally, the authors apply the WTMM method.FindingsThe results suggest that the real estate indexes are far from being efficient and that the lowest level of multifractality was observed for Islamic indexes.Research limitations/implicationsThe inefficiency behavior of real estate indexes gives us an idea about the prediction of the behavior of future returns in these markets on the basis of past informations. Similarly, market participants would do well to reassess their investment and risk management framework to mitigate new and somewhat higher levels of risk of their exposures during the turbulent period.Originality/valueTo the authors' knowledge, this is the first real estate market study employing STL decomposition before applying the MF-DFA in the context of the COVID-19 crisis. Likewise, the study is the first investigation that focuses on these four indexes.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eebd541c1315233392e97f21660d1d92",
  "timestamp": "2025-05-15T02:51:30.052060"
}