{
  "id": 2409,
  "title": "Manufacturer's servitization level and financial performance: the role of risk management",
  "abstract": "Purpose The objective of this research is to investigate the impact of offering product-linked services on the effectiveness of risk management and, subsequently, on financial performance. Design/methodology/approach The investigation is based on an empirical analysis employing structural equation modeling (SEM) and cross-industry and multi-country survey data of 307 companies. The theorization is guided by the information processing theory (IPT). Findings Considering the basic and advanced classification of services, the analysis suggests that only the provision of advanced services influences the effectiveness of risk management. Specifically, the provision of advanced services strengthens the preventive dimension of risk management. Surprisingly, the analysis reveals a negative direct impact of preventive risk management on financial performance. Preventive risk management, however, indirectly enhances financial performance by supporting reactive risk management. Practical implications For practitioners, the research suggests a positive impact of servitization in a long term rather than in form of instant financial benefits. The research attempts to highlight the specific role of supply chain risk management (SCRM) through which servitization has a positive impact on financial performance. Originality/value Although there are assumptions about both reduction and increase in risk when manufacturers offer services, the extant literature lacks an empirical investigation on the association between servitization and the effectiveness of risk management. This study addresses the stated gap and offers novel insights into the role of SCRM in the performance consequences of servitization.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eebfa49f5c7524d6c6933879e64b82b5",
  "timestamp": "2025-05-17T10:37:00.351676"
}