{
  "id": 8657,
  "title": "Towards universal access to healthcare for older adults: an assessment of the old-age exemption policy under Ghana's National Health Insurance Scheme",
  "abstract": "Background Despite calls for governments to provide universal health coverage for all, social health insurance programmes (SHI) that specifically target older adults continue to be largely absent in many African countries. Only a few African countries have implemented SHI programmes that include specific provisions for older adults. Ghana's National Health Insurance Scheme (NHIS) is one of the few programmes in Africa that exempts older adults from paying premiums for health insurance. This study examined socio-demographic factors associated with old-age premium exemption under Ghana's NHIS. Methods The study used data from the seventh round of the Ghana Living Standards Survey (GLSS 7) conducted in 2017. Descriptive statistics and binary logistic regression were used in analysing data from a sample of 1532 older adults aged 70 years and older. Results The results reveal that only about 43% of older adults who were enrolled on the NHIS at the time of the survey acquired their membership through the old-age exemption policy. Additionally, increasing age was associated with higher odds of reporting exemption from paying premiums for health insurance. Also, older adults who are living in rural areas were more likely to pay premiums rather than being exempt as compared to their counterparts living in urban areas. Conclusions These findings indicate that the old-age exemption policy is not achieving the intended goal of providing financial risk protection for some older adults. Additionally, the policy is not reaching those who need it most, particularly those living in rural areas. Specific targeting is required for older adults living in rural areas who are less likely to benefit from the old-age exemption policy in spite of being eligible.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eec30e1fceffd0c61830d306e27def27",
  "timestamp": "2025-05-15T03:20:55.999244"
}