{
  "id": 8177,
  "title": "In Vivo Confocal Microscopic Findings of Corneal Wound Healing after Corneal Epithelial Debridement in Diabetic Vitrectomy",
  "abstract": "Purpose: To study healing of corneal wounds using in vivo confocal microscopy in patients who received corneal epithelial debridement during pars plana vitrectomy for proliferative diabetic retinopathy and to investigate risk factors for delayed healing. Design: Prospective, observational case series. Participants: Forty-four eyes of 40 patients were enrolled. Methods: In vivo confocal microscopy was used to evaluate selected images of the corneal basal and apical surface epithelial cells and subbasal nerves before surgery, weekly for the first month, and at 3 and 6 months after surgery. Slit-lamp biomicroscopy was carried out at the same time. Multiple linear regression analysis of selected potential risk factors was performed to investigate the main determinants of delayed corneal healing. Main Outcome Measures: Healing rate of corneal epithelial cells and subbasal nerves and factors influencing the healing. Results: By slit-lamp biomicroscopy, corneal epithelial defects were found in 22.8% of eyes at 2 weeks and in 5.4% at 1 month after surgery. In vivo confocal microscopy demonstrated incomplete healing of basal epithelial cells in 72.1%, 15.2%, and 0% of eyes and incomplete healing of surface apical epithelial cells in 81.1%, 9.1%, and 0% of eyes at 1, 3, and 6 months after surgery. The percentage of subbasal nerves regaining preoperative appearance was 0%, 6.8%, and 89.3% at 1, 3, and 6 months after surgery. Regression analysis revealed infusion of silicone oil (P = 0.020) and C3F8 (P = 0.017) resulted in delayed healing by slit-lamp biomicroscopy; age (P = 0.028), diabetic treatment regimen (P = 0.014), and scleral buckling (P = 0.001) correlated with delayed recovery of basal cells by in vivo confocal microscopy. The latter 2 factors also were related to delayed reconformation of apical cells (P = 0.011 and 0.004, respectively). Neither healing of apical and basal cells showed a significant correlation to findings by slit-lamp biomicroscopy (r = 0.19 and 0.09). Conclusions: Healing of corneal epithelial wounds in diabetic eyes is slow. Both the basal and apical epithelial layers were involved in the slow healing process. Age, diabetic treatment regimen, and several intraoperative factors may alter healing rates. Financial Disclosure(s): The author(s) have no proprietary or commercial interest in any materials discussed in this article. Ophthalmology 2009;116:1038-1047 (C) 2009 by the American Academy of Ophthalmology.",
  "year": 2009,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eee76f8ad0e248dafb440f740ded7869",
  "timestamp": "2025-05-15T03:16:17.371394"
}