{
  "id": 5697,
  "title": "The impact of rating classifications on stock prices of Brazilian companies",
  "abstract": "PurposeThis paper aims to identify if there is an impact of the rating announcements issued by the agencies on the returns of the stocks of Brazilian companies listed on Brasil Bolsa Balcao, from August 2002 to August 2018, identifying which types of announcement (upgrade, downgrade or the same initial classification) cause variations in prices around the date of disclosure of the rating. Design/methodology/approachThe event study methodology was applied to verify the market reaction around the announcement dates in a 21-day event window (-10, +10). The market model was used to calculate the abnormal returns (ARs), and subsequently, the accumulated ARs. FindingsThe hypotheses tests allowed to verify that the accumulated ARs are different, before and after the three types of rating announcements (upgrades, downgrades and the same classification); in upgrades, the mean of accumulated ARs increases in the days before the event, while in downgrades, this increase occurs after the event. This paper concluded that the rating announcements have an impact on the return of stock of the Brazilian market and that the market reaction occurs most of the time before the event happens, which indicates that the market can anticipate the information contained in the changes in credit ratings. Practical implicationsThe results have considerable implications for portfolio managers, institutional investors and traders. It facilitates investment decision-making in the face of rating classification announcements. Market participants can pay more attention to their investment strategies and asset allocation during periods of risk rating announcements. Additionally, traders can understand the form of investment strategy for superior earnings. Originality/valueThe importance of the study is related to the fact that the results may explain the causes of specific movements in the Brazilian financial market related to a source of information that may or may not be able to influence the decisions of the financial agents that operate in this market. The justification is centred on the idea that, for investors who somehow react to the announcements, it is relevant to understand the impact of rating classifications on companies, as access to such information allows for more conscious decision-making.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eeeb4f5d1fdd147ac7d66aea6ad0e817",
  "timestamp": "2025-05-15T02:50:21.321023"
}