{
  "id": 8155,
  "title": "Mental and behavioral health problems among displaced Myanmar adults exhibiting suboptimal adherence to chronic disease medication treatment in Thailand",
  "abstract": "Background: People living with non-communicable diseases (NCDs) such as hypertension and diabetes are at high risk for mental health and psychosocial problems. These problems, in turn, can lead to social isolation, lower quality of life, greater health needs, and poorer health outcomes. The prevalence of NCDs is rising in humanitarian settings, where residents are already at an increased risk of mental health problems due to trauma and stressful living conditions. Yet there has been limited focus on understanding experiences and intersections between these often-co-occurring health conditions in humanitarian settings. Improving this understanding holds promise for supporting integrated care and better patient health outcomes. Objective: To describe mental health problems of displaced Myanmar adults with current poor medication adherence for hypertension and/or type 2 diabetes mellitus and identify factors associated with poor mental health among this population. Methods: Cross-sectional analysis of 224 adults with poor medication adherence (<70 %) for diabetes and/or hypertension treatment. Medication adherence was assessed using pill count. Demographic and physical health characteristics were collected; mental and behavioral health outcomes included a mental health symptom severity score generated based on symptoms of depression, anxiety and posttraumatic stress as well indicators of substance use. Data on sleep quality and self-efficacy for managing chronic disease were also collected. Multiple linear regression was used to identify factors associated with more severe mental health symptoms. Findings: Among the 224 participants, 63.84 % were taking medication for hypertension, 17.86 % for diabetes mellitus, and 18.30% for both. The sample was 70.98 % female and more than a third (37.5 %) were overweight or obese. Among the total sample, 29.91 % and 65.63 % reported ever using tobacco and betel nuts, respectively. In bivariate analyses, reported religious affiliation, financial situation, hypertension and diabetes comorbidity and more sleep problems were all significantly associated with poorer mental health; all of these factors other than religious affiliation remained significant in the multivariate analysis. Conclusions: More than one-third of the displaced Myanmar adults who had suboptimal adherence to their chronic illness medications are living with moderate to severe mental health problems. The factors associated with more severe mental health problems were identified as having debt along with poor financial situation, having comorbid hypertension and diabetes, and having the worse scoring on the sleep problems scale. Integrating mental health support programs into chronic disease care systems is needed to help improve the overall health of this vulnerable population. Holistic approaches to improve economic and health outcomes should be considered for the people living with chronic conditions in humanitarian setting.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eefa9f0de4cb7301c1a2eeae09755a22",
  "timestamp": "2025-05-15T03:15:38.474560"
}