{
  "id": 1271,
  "title": "Integrating the Fuzzy Cloud Model with Back Propagation Neural Network in Supply Chain Management under FinTech Innovation",
  "abstract": "This paper aims to analyze the influencing factors of supply chain risk management under FinTech innovation. It takes Enterprise A as the research object. To begin with, the basic knowledge of supply chain risk management is introduced, and its five influencing factors are discussed. Furthermore, the relevant theories of the cloud model are analyzed and three kinds of cloud generators are compared. Combined with Back Propagation Fuzzy Neural Network (BPFNN), a supply chain management model is constructed based on the fuzzy cloud model - BPFNN. Eventually, the middle-level and above managers at Enterprise A and experts are provided with questionnaires to assess the various factors impacting supply chain risk. The model ' s effectiveness is verified through error convergence in training samples and the fitting of test samples. The results show that the test set sample's mean square error is stable at 0.0137, indicating the model ' s strong generalization ability. The cloud fuzzy neural network model for financial supply chain collaborative innovation's risk assessment is successfully established. According to the weight analysis, the highest risk factors in the financial industry ' s supply chain collaborative innovation management are trust risk, capability risk, loss of key customers, and changes in customer demand. This research on the influencing factors of supply chain risk management under collaborative innovation has certain practical significance for the risk management of collaborative innovation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef03602bc9d7e9abc737db1a3b18efe4",
  "timestamp": "2025-05-15T02:01:11.799956"
}