{
  "id": 7765,
  "title": "JOURNEYS TO DEFAULT: APPLYING THE HOUSING-NICHE MODEL TO FORECLOSURE RISK AND CONSEQUENCE",
  "abstract": "Foreclosures tend to cluster in particular geographies and populations. The evidence for clustering is based primarily on quantitative analysis of lending or population characteristics. In this paper, we employ the housing-niche model, which uses both a quantitative sampling strategy and qualitative interviews to understand the differences between neighborhoods with high foreclosure rates, the paths residents took to arrive in these neighborhoods, the particular loans they were given, and their choices when facing foreclosure. Our ecological methodology explores the experiences of homeowners who were delinquent on their mortgages in the two neighborhoods in Nashville; Tennessee (USA), that were hit hardest by foreclosures: North Nashville and Antioch. Throughout the paper, we refer to these homeowners as defaulters to illustrate that all of the interviewees were delinquent and threatened with foreclosure but that only a few (n = 3) were actually in the process of formal foreclosure proceedings. The defaulters we interviewed in North Nashville felt at home in their primarily African-American community and had few neighborhood options when purchasing homes. They received high-cost loans with terms that they often did not comprehend. The defaulters we interviewed in Antioch, who were of varied ethnicities, sought speculative returns from the booming housing market and blamed minorities when the market deteriorated The housing-niche model captures the history of individual neighborhoods and how financial practices and social conditions bring people to reside in them. Findings suggest that researchers, municipal planners, and housing advocates should use ecological models with both qualitative and quantitative analytical methods to understand concurrently the complex dimensions of high-risk households and neighborhoods with high foreclosure rates. Copyright (C) 2014, Locke Science Publishing Company, Inc. Chicago, IL, USA All Rights Reserved",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef070e068c1f32bb56076fda4bc57628",
  "timestamp": "2025-05-15T03:12:11.473493"
}