{
  "id": 4241,
  "title": "Machine and deep learning-based stock price prediction during the COVID-19 pandemic: the case of CAC 40 index",
  "abstract": "PurposeThe goal of this study is to investigate the predictive performance of the machine and deep learning methods in predicting the CAC 40 index and its 40 constituent prices of the French stock market during the COVID-19 pandemic. The study objective in forecasting the CAC 40 index is to analyze if the index and the individual prices will preserve the continuous increase they acquired at the beginning of the administration of vaccination and containment measures or if the negative effect of the pandemic will be reflected in the future.Design/methodology/approachThe authors apply two machine and deep learning methods (KNN and LSTM) and compare their performances to ARIMA time series model. Two scenarios have been considered: optimistic (high values) and pessimistic (low values) and four periods are examined: the period before COVID-19 pandemic, the period during the COVID-19, and the period of vaccination and containment. The last period is divided into two sub-periods: the test period and the prediction period.FindingsThe authors found that the KNN method performed better than LSTM and ARIMA in forecasting the CAC 40 index for both scenarios. The authors also identified that the positive effect of vaccination and containment outweighs the negative effect of the pandemic, and the recovery pattern is not even among major companies in the stock market.Practical implicationsThe study empirical results have valuable practical implications for companies in the stock market to respond to unexpected events such as COVID-19, improve operational efficiency and enhance long-term competitiveness. Companies in the transportation sector should consider additional investment in R&D on communication and information technology, accelerate their digital capabilities, at least in some parts of their businesses, develop plans for lights out factories and supply chains to keep pace with changing times, and even include big data resources. Additionally, they should also use a mix of financing sources and securities in order to diversify their capital structure, and not rely only on equity financing as their share prices are volatile and below the pre-pandemic level. Considering portfolio allocation, the transportation sector was severely affected by the pandemic. This displays that transportation equities fail to be a candidate as a good diversifier during the health crisis. However, the diversification would be worth it while including assets related to the banking and industrial sectors. On another strand, the instability of this period induced an informational asymmetry among investors. This pessimistic mood affected the assets' value and created a state of disequilibrium opening up more opportunities to benefit from potential arbitrage profits.Originality/valueThe impact of COVID-19 on stock markets is significant and affects investor behavior, who suffered amplified losses in a very short period of time. In this regard, correct and well-informed decision-making by investors and other market participants requires careful analysis and accurate prediction of the stock markets during the pandemic. However, few studies have been conducted in this area, and those studies have either concentrated on some specific stock markets or did not apply the powerful machine learning and deep learning techniques such as LSTM and KNN. To the best of our knowledge, no research has been conducted that used these techniques to assess and forecast the CAC 40 French stock market during the pandemic. This study tries to close this gap in the literature.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef17cd3dea569a5dbd33847acdf100d6",
  "timestamp": "2025-05-15T01:25:23.212979"
}