{
  "id": 8437,
  "title": "Does country governance and bank productivity Nexus matters?",
  "abstract": "Purpose This study aims to examine the impact of country governance and other potential bank-specific characteristics and macroeconomic condition determinants on bank productivity in the period of 2006-2016. Design/methodology/approach The productivity level of total 167 banks selected from Malaysia, Indonesia, Brunei and Singapore are evaluated using the data envelopment analysis-based Malmquist productivity index method. A panel regression analysis framework based on ordinary least squares, a fixed effect and a random effect models then are used to identify its main determinants. Findings The empirical findings indicate that the total factor productivity changes of Islamic banks is higher than conventional banks. The liquidity and global financial crisis influence both banks' productivity. Bank size, credit risk, market power, management efficiency and inflation merely influence Islamic banks' productivity. On the country governance dimensions, voice and accountability are found to positively influence both banks' productivity. Regulatory quality and rule of law (RL) significantly influences the conventional parts. Political stability and absence of violence, government effectiveness, RL and control of corruption negatively influence the banks' productivity, but this influence is only significant for the Islamic banks. Originality/value Country governance has received surprisingly little attention in the banking industry over the past few decades. Majority of the studies that examine the effect of governance on bank performance have focused more on the micro governance dimension. Thus, to the best of the researcher's knowledge, no study has been done to address the effect of country governance on the productivity of the Islamic and conventional banks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef1a66e85b3da69f8f0a04ae343c4832",
  "timestamp": "2025-05-15T03:18:51.618922"
}