{
  "id": 6615,
  "title": "The Impact of Capital Requirement on Bank Performance: Empirical Evidence from Vietnamese Commercial Banks",
  "abstract": "This paper examines the effects of regulatory capital on a bank's profitability and risk. We employ annual data from Vietnamese commercial banks from 2005 to 2020 and use the dynamic GMM regression method to address the potential endogeneity issue, more suitable for panel data with relatively low time dimensions. Our panel regressions indicate that higher regulatory capital would significantly improve the bank's profitability and lower the bank risks. In particular, a one percent increase in the regulatory capital would significantly increase the bank's return on assets by 1.9%. We further explore the heterogeneous impacts of regulatory capital on the Vietnamese bank's performance across bank characteristics. We find that smaller, non-state-owned and non-listed banks would benefit from stringent regulatory capital requirements. The improvements in bank performance are mainly driven by reductions in the risk premium of the banks, resulting in lower funding costs and higher profitability. These findings are essential since Vietnam, as an emerging market, has only implemented the Basel II reform recently on a stable and fast-growing background rather than as a reaction to the global financial crisis. Thus, our empirical results support stringent regulatory capital in emerging countries to ensure a stable banking sector and boost economic growth",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef25fdedba6133881138e5393ba24c2d",
  "timestamp": "2025-05-15T03:00:04.923175"
}