{
  "id": 9251,
  "title": "Determinants of household catastrophic costs for drug sensitive tuberculosis patients in Kenya",
  "abstract": "BackgroundDespite free diagnosis and treatment for tuberculosis (TB), the costs during treatment impose a significant financial burden on patients and their households. The study sought to identify the determinants for catastrophic costs among patients with drug-sensitive TB (DSTB) and their households in Kenya.MethodsThe data was collected during the 2017 Kenya national patient cost survey from a nationally representative sample (n=1071). Treatment related costs and productivity losses were estimated. Total costs exceeding 20% of household income were defined as catastrophic and used as the outcome. Multivariable Poisson regression analysis was performed to measure the association between selected individual, household and disease characteristics and occurrence of catastrophic costs. A deterministic sensitivity analysis was carried using different thresholds and the significant predictors were explored.ResultsThe proportion of catastrophic costs among DSTB patients was 27% (n=294). Patients with catastrophic costs had higher median productivity losses, 39 h [interquartile range (IQR): 20-104], and total median costs of USD 567 (IQR: 299-1144). The incidence of catastrophic costs had a dose response with household expenditure. The poorest quintile was 6.2 times [95% confidence intervals (CI): 4.0-9.7] more likely to incur catastrophic costs compared to the richest. The prevalence of catastrophic costs decreased with increasing household expenditure quintiles (proportion of catastrophic costs: 59.7%, 32.9%, 23.6%, 15.9%, and 9.5%) from the lowest quintile (Q1) to the highest quintile (Q5). Other determinants included hospitalization: prevalence ratio (PR)=2.8 (95% CI: 1.8-4.5) and delayed treatment: PR=1.5 (95% CI: 1.3-1.7). Protective factors included receiving care at a public health facility: PR=0.8 (95% CI: 0.6-1.0), and a higher body mass index (BMI): PR=0.97 (95% CI: 0.96-0.98). Pre TB expenditure, hospitalization and BMI were significant predictors in all sensitivity analysis scenarios.ConclusionsThere are significant inequities in the occurrence of catastrophic costs. Social protection interventions in addition to existing medical and public health interventions are important to implement for patients most at risk of incurring catastrophic costs.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef2bfb95bdb9bd99a34075242e236492",
  "timestamp": "2025-05-15T03:26:54.604090"
}