{
  "id": 97,
  "title": "RETRACTED: A Hybrid Intelligent System for Company Financial Risk Detection Based on Tree-Based Model and Deep Neural Network (Retracted Article)",
  "abstract": "At present, the process of security issuance in China has changed from examination and approval system to approval system. With the increasing stock that enters the capital market through the IPO, establishing an effective financial risk monitoring and control system of listed companies has great practical significance and application value. In the perspective of big data, this paper constructs a new practical financial early warning integration model. A total of 32,283 financial statements of 3,025 listed companies are collected from 2000 to 2017. First, this paper collected and built a financial crisis prediction database: a total of 32,283 financial statements of 3,025 listed companies occurred from year 2000 to 2017 and corresponding financial indicators including 6 primary indicators and 25 secondary indicators are collected. Next, the financial crisis model based on financial indicators is proposed and trained by the classic machine learning method such as random forest and gradient boosting decision tree. And then, through natural language processing and deep learning technology, this paper also builds a financial crisis prediction model based on financial statement text. Finally, an ensemble model is proposed and its performances are evaluated; the results indicate that the proposed ensemble model performed the best and significantly outperforms other benchmark methods for financial crisis prediction and identification, indicating that it can be employed as an intelligent identification system to enhance identification accuracy for early warning and identification of financial crisis of listed companies in China stock marketing.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef4182166188d6632db2c9ade4fce222",
  "timestamp": "2025-05-15T01:46:39.600946"
}