{
  "id": 9309,
  "title": "Assessment of hospital length of stay and direct costs of type 2 diabetes in Hubei Province, China",
  "abstract": "Background: The incidence of type 2 diabetes is increasing, creating a huge burden for China's social healthcare system. This study aimed to evaluate hospital length of stay (LOS) based on admission characteristics and direct costs correlated with various types of complications for type 2 diabetic inpatients in Hubei Province, China. Methods: A total of 1528 inpatients diagnosed with type 2 diabetes discharged between April 1, 2013, and March 31, 2014, were included in this study. Information regarding patients' admission and hospitalization were obtained from the hospital information system. The relationship between admission characteristics and LOS, distribution of total costs, and types of complications were described and analysed. Results: (1) The mean LOS was 11.65 days (median: 10 days). Multiple linear regression analysis demonstrated that inpatients with New Cooperative Medical Scheme (NCMS), aged 80 and above, had longer LOS than the reference group, and inpatients with chronic or acute + chronic complications had shorter LOS than those without. (2) Mean total costs per patient were US$159.72 +/- 130.83 (median: US$135.33), US$ 240.60 +/- 166.58 (median: US$ 192.09), and US$ 247.98 +/- 166.22 (median: US$ 200.99) for inpatients with no complications, chronic complications, and acute + chronic complications, respectively. Total and individual costs were significantly less for patients without complications than for those with the two types of complications (p < 0.001). (3) Mean total costs per patient were US$ 225.40 +/- 115.32 (median: US$ 200.34), US$ 221.25 +/- 177.64 (median: US$ 170.05), and US$ 275.18 +/- 193.14 (median: US$ 217.91) for inpatients with microvascular complications, macrovascular complications, and microvascular + macrovascular complications, respectively. Total costs were significantly higher for patients with microvascular + macrovascular complications than for those with other types of chronic complications (p < 0.001). (4) Drugs were the greatest expense for patients, and the least expensive treatment was nursing care. Conclusions: Medical insurance status, age, and type of complication may help to predict LOS for patients with type 2 diabetes in Hubei Province, China. The total and individual costs for patients with complications were higher than for those without, and hospitalization expenses posed a heavy burden. Efforts should be made to reduce the financial impact on patients by integrating the medical insurance system of urban and rural areas, and by reducing the risk of complications, especially microvascular complications.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef4e15f6338fa3a558d85bbd65fc01bd",
  "timestamp": "2025-05-15T03:27:25.130304"
}