{
  "id": 4838,
  "title": "Does corporate sustainability performance matter for cash holdings? International evidence",
  "abstract": "PurposeWe examine the impact of corporate sustainability performance (CSP) on corporate cash holdings, focusing on the moderating impacts of industry's concentration, financial constraints, and institutional environments.Design/methodology/approachThe empirical analysis is conducted on a sample of 31 countries from 2002 to 2018. We use the pooled OLS regressions controlling for fixed effects. We further address endogeneity issues using an instrumental variable approach, the Difference-in-Differences regression based on an exogenous shock, and the propensity score matching.FindingsWe find that firms with superior CSP hold more cash. This result is valid after a series of tests for robustness and endogeneity issues, suggesting a causal effect of CSP on corporate cash holdings. In the cross section, the positive impact of CSP on cash holdings is more pronounced for firms operating in highly concentrated industries, but attenuated for firms with financial constraints and for those operating in countries with better institutional environments. We further show that CSP affects cash holdings through the channel of financial distress risk.Practical implicationsIn making investment decisions, investors should not only examine corporate financial performance and sustainability profile, but also understand the related cash holding levels and financial distress costs. Corporate managers making decisions on levels of cash holdings should pay more attention to their sustainability behavior, especially for firms operating in concentrated industries and/or facing financial constraints. Governments and authorities can apply regulations to encourage firms to engage more in sustainable activities, as well as establish good institutional environments in the country.Originality/valueUsing a comprehensive international dataset, our paper contributes to two strands of literature: the economic impact of CSP and the driver of cash holdings. We further focus on the moderating role of industry concentration and firms' financial constraints. Our international sample also allows us to exploit the effect of country-level informal institutions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef53219cf0e20ecac25e7e83898e9ce8",
  "timestamp": "2025-05-15T02:41:32.745917"
}