{
  "id": 373,
  "title": "Association of Reference Pricing with Drug Selection and Spending",
  "abstract": "BACKGROUND In the United States, prices for therapeutically similar drugs vary widely, which has prompted efforts by public and private insurers to steer patients toward the lower-priced options. Under reference pricing, the insurer or employer establishes a maximum contribution it will make toward the price of a drug or procedure, and the patient pays the remainder. METHODS We used difference-in-differences multivariable regression methods to analyze changes in prescriptions and pricing for 1302 drugs in 78 therapeutic classes in the United States, before and after implementation of reference pricing by an alliance of private employers. We assessed trends for the study group relative to those for an employee group that was not subject to reference pricing. The study included 1,122,741 prescriptions that were reimbursed during the period from 2010 through 2014. RESULTS Implementation of reference pricing was associated with a higher percentage of prescriptions that were filled for the lowest-priced reference drug within its therapeutic class (difference in probability, 7.0 percentage points; 95% confidence interval [CI], 4.0 to 9.9), a lower average price paid per prescription (-13.9%; 95% CI, -23.8 to -2.7), and a higher rate of copayment by patients (5.2%; 95% CI, 0.2 to 10.4) than in the comparison group. During the first 18 months after implementation, spending for employers was $1.34 million lower and the amount of copayments for employees was $0.12 million higher than in the comparison group. CONCLUSIONS Implementation of reference pricing was associated with significant changes in drug selection and spending for a population of patients covered by employment-based insurance in the United States.",
  "year": 2017,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef536c7ac0844e56cd8ad04e11350b1f",
  "timestamp": "2025-05-15T01:31:13.183919"
}