{
  "id": 8669,
  "title": "Colonic diverticular bleeding and predictors of the length of hospitalization: An observational study",
  "abstract": "Background and Aim A significant percentage of patients with colonic diverticular bleeding (CDB) experience bleeding that is severe enough to necessitate prolonged hospitalization. Prolonged hospitalization causes deterioration in patients' quality of life, as well as difficulties with cost-effective utilization of medical resources, and is a financial burden to the society. Therefore, we investigated the factors associated with the length of hospitalization for the optimal management of patients hospitalized with CDB. Methods This study included patients who were hospitalized for the treatment of CDB and underwent colonoscopy between July 2008 and February 2016. Logistic regression analysis was performed to investigate the association between the length of hospitalization and the patients' baseline characteristics, in-hospital procedures performed, and the clinical outcomes. Results The study included 223 patients. Diabetes mellitus (odds ratio [OR] 3.4, P = 0.014) and blood transfusion (OR 3.1, P = 0.0006) were identified as risk factors for prolonged hospitalization (>= 8 days). Urgent colonoscopy (OR 0.41, P = 0.0072) predicted a shorter length of hospitalization (<= 7 days). The study also indicated that endoscopic treatment showed a stronger association with urgent colonoscopy (OR 7.8, P < 0.0001) than with elective colonoscopy and that urgent colonoscopy was not associated with an increased rate of adverse events or re-bleeding. Conclusions Compared with elective colonoscopy, urgent colonoscopy shortens the length of hospitalization in patients with CDB. Moreover, it is not associated with an increased rate of adverse events. Urgent colonoscopy may be impracticable in a few cases; however, if possible, aggressive urgent colonoscopy should be considered for the efficient management of the patient's hospital stay.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef5c27abc916ac91f62719ad6d0bd345",
  "timestamp": "2025-05-15T03:21:24.619972"
}