{
  "id": 6918,
  "title": "Ocean Based Water Allocation Forecasts Using an Artificial Intelligence Approach",
  "abstract": "The initial general security water allocation announcements for water users in the Murrumbidgee Valley are made during July/August. The initial water allocation announcement is very conservative as the allocations are based on storage levels and historic minimum inflows to dams during the irrigation seasons. There is a greater than 99% chance that the more water allocations would be available as the season proceeds. Water availability during the cropping season is a major factor influencing planting decisions made by irrigators and can have a major bearing on the financial viability and irrigation efficiency of irrigation areas. Increased knowledge on the likely end-of season allocation can assist in minimising cropping risk and can help optimise farm returns and achieve better irrigation efficiencies. In this paper a water allocation prediction framework for the Murrumbidgee Catchment is described which learns from results of detailed hydrological models and ocean based climate forecasts to predict water allocations using Artificial Neural Network (ANN) method. The ANN was successfully trained using hydrological modelling data from 1891 to 2003, to forecast water allocation for October and January months starting with a start of the season allocation in August. Subsequently Sea Surface Temperature (SST) and Southern Oscillation Index (SOI) data were added to gain greater lead times for forecasts. This network learnt well with different network parameters to that of previous networks and significantly correlated SST and SOI with water allocation. The interactive model works in a risk management context by providing probability of water allocation for the prediction month using historic data and/or with the incorporation of SST/SOI information from the previous months. The model has been validated by forecasting January allocations from 1999 to 2005. The SST and SOI based predictions show good correspondence with the actual announced January general security allocations. Table A1 shows a comparison of historic announced and model predicted general security allocations using the ANN trained on the basis of historic data and SOI. A comparison of historic data and SOI based data show that at 50% risk factor the SOI based model results are very close to the actual announced January general security water allocations. SST incorporated ANN model overestimated January water allocations for the 2002-2004 period. This may be due to exceptionally low starting water allocations and borrowing of water from the future years which was outside the training data sets. [GRAPHICS] This study has shown that long term hydrologic simulation based water allocations at the start of the irrigation season and incorporation of a risk factor could be utilised to forecast water allocation at the end of peak irrigation demand season. Furthermore, SST, SOI and SST/SOI incorporated ANN models have significantly shown the capability to forecast end of the irrigation demand season water allocation.",
  "year": 2005,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef66657f5188673dddd362550ac98693",
  "timestamp": "2025-05-15T03:03:13.403154"
}