{
  "id": 8116,
  "title": "Relationships Between Provider-Led Health Plans and Quality, Utilization, and Satisfaction",
  "abstract": "OBJECTIVES: To compare healthcare quality, utilization, and patient satisfaction between provider-led health plans ((PLHPs) and non-PLHPs. STUDY DESIGN: Observational study of 2016 Medicare Advantage (MA) plans. METHODS: We included 3 quality outcomes (MA Star Rating System, Healthcare Effectiveness Data and Information Set [HEDIS] effectiveness aggregate score, and HEDIS access aggregate score), 4 utilization outcomes (HEDIS average procedure rates, discharge rates, inpatient days, and readmission probability), and 1 patient satisfaction outcome (National Committee for Duality Assurance consumer satisfaction rating). We performed regression analysis to compare the 8 selected outcomes between PLHPs and non-PLHPs, controlling for key covariates, including region, profit status, patient risk, and patient-related and provider-related demographics. RESULTS: Our sample included 64 contracts offered by 31 PLHPs Irepresenting 3,197,284 enrollees) and 311 contracts offered by 55 non-PLHPs Irepresenting 13,881,210 enrollees). Compared with non-PLHPs, in our primary multivariable model, PLHPs were associated with higher star ratings (beta=0.41; 95% CI, 0.15-0.67), effectiveness scores (beta=3.11; 95% CI, 1.43-4.801, and patient satisfaction (beta=0.57; 95% CI, 0.30-0.841, and lower procedure rates (beta=-0.47; 95% CI, -0.79 to -0.16). There were no significant differences in access, discharges, inpatient days, and readmission probability. The association between PLHPs and outcomes differed by plan size, nonprofit status, and region. CONCLUSIONS: Receipt of care within a PLHP was associated with improved quality, effectiveness, and patient satisfaction, as well as lower procedure rates. As providers bear increasing financial risk under alternative payment models, there is momentum to integrate healthcare provision and payment through PLHPs. Our results demonstrate the potential of such organizations to deliver high-quality care, although opportunities remain to optimize utilization.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef683df3eac7456027a5ccb44a91b287",
  "timestamp": "2025-05-15T03:15:38.336418"
}