{
  "id": 8365,
  "title": "Area-level deprivation and adverse childhood experiences among high school students in Maryland",
  "abstract": "Background Nearly one-half of Americans have been exposed to at least one adverse childhood experience (ACE) before turning 18, contributing to a broad array of problems spanning physical health, mental and behavioral health, and psychosocial functioning. Methods This was a cross-sectional, survey research study, using 2018 data from a state adolescent health surveillance system, i.e., Maryland Youth Risk Behavior Survey/Youth Tobacco Survey. The population-based sample of Maryland high school students (n = 41,091) is representative at the state and county levels. The outcome variables included five binary measures of ACEs (i.e., food insecurity, parental substance use/gambling, parental mental illness, family member in jail/prison, and caregiver verbal abuse), and number of ACEs. The main exposure variable, area-level socioeconomic disadvantage, was assessed at the county level using a continuous measure of the area deprivation index (ADI). Additional covariates included: rural county status, age, race/ethnicity, sex, and sexual or gender minority (SGM) status. We used mixed-effect multivariate logistic regression to estimate the odds of ACEs in association with socioeconomic deprivation. Models were adjusted for all covariates. Results County-level ADI was associated with 3 of the 5 ACES [i.e., food insecurity (OR = 1.10, 95% CI: 1.07-1.13), parental substance use/gambling (OR = 1.05, 95% CI: 1.02-1.07), and incarceration of a family member (OR = 1.14, 95% CI: 1.09-1.19)]; and with having at least one ACE (i.e., OR = 1.08, 95% CI: 1.05-1.10). Odds of reporting at least one ACE were higher among girls, older adolescents (i.e., aged 16 and >= 17 relative to those aged <= 14 years), and among SGM, Black, and Latinx students (all ORs > 1.20). Conclusions ACEs greatly increase risk for adolescent risk behaviors. We observed an increased likelihood of adversity among youth in more deprived counties and among Black, Latinx, or SGM youth, suggesting that social and structural factors play a role in determining the adversity that youth face. Therefore, efforts to address structural factors (e.g., food access, family financial support, imprisonment as a sanction for criminal behavior) could be a critical strategy for primary prevention of ACEs and promoting adolescent health.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef6e574445a9c19e4d9b7fdfe0c05a3d",
  "timestamp": "2025-05-15T03:18:19.500267"
}