{
  "id": 7632,
  "title": "Association of childhood maltreatment with subsequent dating violence: An analysis of revictimization among the Korean population",
  "abstract": "Childhood maltreatment is a universal issue impacting developmental outcomes, including the likelihood of experiencing violence in later life. Although previous works have focused on the cycle of abuse, the cycle of revictimization and neglect is less well-understood. In the current study, childhood exposure to maltreatment (physical abuse, emotional abuse, and neglect) are examined as potential risk factors for dating relationships in adulthood. A group of 1200 adults (mean age = 46.60 years; range: 20-84 years) were recruited from the registered residential population of the Ministry of Public Administration and Security. Logistic regression analyses were conducted and revealed that childhood physical abuse was associated with physical, emotional, and financial violence in dating relationships. In addition, childhood emotional abuse exposure was associated with physical and sexual dating violence. Although childhood exposure to neglect did not explain any types of adulthood dating violence, it appears that experiencing abuse during childhood is highly related to dating violence in adulthood. Our findings revealed the importance of understanding the different types of childhood maltreatment, especially in terms of how they relate to violence victimization in the context of dating in adulthood. Interventions should address the various types of childhood victimization by family members to help prevent dating violence in adulthood.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef75f3021d3ae0e9e87c446cc0d6b9a4",
  "timestamp": "2025-05-15T03:10:33.012729"
}