{
  "id": 7812,
  "title": "Depressive symptoms in middle-aged men: Results from a household survey in Hong Kong",
  "abstract": "Background: To evaluate the prevalence and risk factors of depressive symptoms in middle-aged Chinese men aged 45-64. Methods: A community-based cross-sectional household survey was performed in Hong Kong. Demographic, lifestyle and medical information were obtained from a standardized questionnaire. Clinically relevant depressive symptoms were measured by the Centre for Epidemiological Studies Depression Scale (CES-D). Results: Five hundred forty five men participated in this study (response rate: 72.4%); 18.1% suffered from clinically depressive symptoms. For psychosocial factors in bivariate analyses, being divorced/separated/widowed, living alone, having an education level of primary school or less, having a low income, unemployment and having experienced a significant life event over the past year were associated with an increased odds of having depressive symptoms. In multiple regression analysis, living alone, being unemployed and having experienced a negative life event such as having experienced serious financial trouble, having given up a hobby or activity that was important to subject and having been separated from a child, close friend or relative were associated with increased odds of having clinically relevant depressive symptoms. Limitations: Although random sampling was performed, there might be a selection bias for men who were unemployed and at home at the time of the interview. Conclusions: Clinically relevant depressive symptoms are an important public health problem in Chinese middle-aged men particularly those who are unemployed, have a negative life events and live alone. As middle-aged men are at high risk for suicide, public health intervention should be targeted at these men. (c) 2006 Elsevier B.V. All rights reserved.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef7d25fb13722d7f3501868245f38f14",
  "timestamp": "2025-05-15T03:12:11.729730"
}