{
  "id": 6261,
  "title": "A comparative analysis of current credit risk models",
  "abstract": "The new BIS 1998 capital requirements for market risks allows banks to use internal models to assess regulatory capital related to both general market risk and credit risk for their trading book. This paper reviews the current proposed industry sponsored Credit Value-at-Risk methodologies. First, the credit migration approach, as proposed by JP Morgan with CreditMetrics, is based on the probability of moving from one credit quality to another, including default, within a given time horizon. Second, the option pricing, or structural approach, as initiated by KMV and which is based on the asset value model originally proposed by Merton (Merton, R., 1974. Journal of Finance 28, 449-470). In this model the default process is endogenous, and relates to the capital structure of the firm. Default occurs when the value of the firm's assets falls below some critical level. Third, the actuarial approach as proposed by Credit Suisse Financial Products (CSFP) with CreditRisk+ and which only focuses on default. Default for individual bonds or loans is assumed to follow an exogenous Poisson process. Finally, McKinsey proposes CreditPortfolioView which is a discrete time multi-period model where default probabilities are conditional on the macro-variables like unemployment, the level of interest rates, the growth rate in the economy, ... which to a large extent drive the credit cycle in the economy. (C) 2000 Elsevier Science B.V. All rights reserved. JEL classification: G21; G28; G13.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef8b906458d3936886a7eb7ea0bfac05",
  "timestamp": "2025-05-15T02:56:11.065281"
}