{
  "id": 4720,
  "title": "Women's Employment in Industries and Risk of Preeclampsia and Gestational Diabetes: A National Population Study of Republic of Korea",
  "abstract": "Background: Some working conditions may pose a higher physical or psychological demand to pregnant women leading to increased risks of pregnancy complications.Objectives: We assessed the association of woman's employment status and the industrial classification with obstetric complications. Methods: We conducted a national population study using the National Health Information Service database of Republic of Korea. Our analysis encompassed 1,316,310 women who experienced first-order live births in 2010-2019. We collected data on the employment status and the industrial classification of women, as well as their diagnoses of preeclampsia (PE) and gestational diabetes mellitus (GDM) classified as A1 (well controlled by diet) or A2 (requiring medication). We calculated odds ratios (aORs) of complications per employment, and each industrial classification was adjusted for individual risk factors.Results: Most (64.7%) were in employment during pregnancy. Manufacturing (16.4%) and the health and social (16.2%) work represented the most prevalent industries. The health and social work exhibited a higher risk of PE (aOR 1/4 1.11, 95% confidence interval [CI]: 1.03-1.21), while the manufacturing industry demonstrated a higher risk of class A2 GDM (1.20, 95% CI: 1.03-1.41) than financial intermediation. When analyzing both classes of GDM, women who worked in public administration and defense/social security showed higher risk of class A1 GDM (1.04, 95% CI: 1.01, 1.07). When comparing high-risk industries with nonemployment, the health and social work showed a comparable risk of PE (1.02, 95% CI: 0.97, 1.07).Conclusion: Employment was associated with overall lower risks of obstetric complications. Health and social service work can counteract the healthy worker effect in relation to PE. This highlights the importance of further elucidating specific occupational risk factors within the high-risk industries.(c) 2023 The Authors. Published by Elsevier B.V. on behalf of Occupational Safety and Health Research Institute, Korea Occupational Safety and Health Agency. This is an open access article under the CC BY-NC-ND license (http://creativecommons.org/licenses/by-nc-nd/4.0/).",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef9058303511ae1bd5a43d63ab1c8fd0",
  "timestamp": "2025-05-15T02:40:27.870925"
}