{
  "id": 7638,
  "title": "Psychosocial correlates of prolonged postpartum depression in mothers of children with movement disorders: cross-sectional study from a paediatric developmental rehabilitation centre in Peshawar",
  "abstract": "Objective: To identify potential predictors of prolonged postpartum depression in mothers of children with physical disabilities. Methods: The cross-sectional, correlational study was conducted at a paediatric neurodevelopmental rehabilitation centre in Peshawar, Pakistan, from December 9, 2016, to January 23, 2017, and comprised mothers of children with movement disorders born between January, 2014, and June, 2016. Prolonged postpartum depression was defined as onset of maternal depression between 6 and 36 months after birth. Edinburgh Postnatal Depression Scale was used with a cut-off score of 13/30, while a pretested questionnaire examined risk and protective factors predicting prolonged postpartum depression using binary logistic regression. SPSS 20 was used for data analysis. Results: There were 171 subjects with a mean age of 27 +/- 6.4 years. Among them, prolonged postpartum depression was found in 95(55.6%). Six significant predictors of the condition were identified: supportive husband, child's disability having negative effect on social ties, daily physical help in childcare by at least one family member, pregnancy-induced hypertension, mother being blamed for child's disability, and financial problems (p<0.05 each). Conclusion: The identified predictors specific to local settings played a distinctive role in prolonged postpartum depression occurrence, particularly in the context of disability.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef909d44cec09f0b44d65177e3f5cce3",
  "timestamp": "2025-05-15T03:10:33.033270"
}