{
  "id": 6630,
  "title": "Loneliness during the COVID-19 Pandemic: A Comparison of Urban and Rural Areas",
  "abstract": "Although studies have explored how loneliness varies between rural and urban areas during the COVID-19 pandemic, the results have been inconsistent, and most studies are observational. Therefore, it remains unclear how urban-rural differences affected loneliness in a pandemic. Our study uses nationwide data to clarify this, covering periods before and during the pandemic. We analyze a longitudinal dataset from Hiroshima University's Household Behavior and Finance Survey, which collected demographic, socioeconomic, and psychological characteristics of Japanese adults in 2020, 2021, and 2022, thus reflecting the COVID-19 pandemic timeline. The results show that approximately 50% of those surveyed experienced long-term loneliness, while about 6.5% developed loneliness during the pandemic. Although our weighted logit regression models showed few differences in loneliness during the pandemic between urban and rural areas, socioeconomic changes, such as beginning to live alone, leaving full-time employment, and decreased financial satisfaction, were identified as high-risk factors for loneliness, and their impact varied between rural and urban areas. Our results reflect that rural-urban differences have an effect on people's loneliness during a pandemic but need to be considered together with socioeconomic changes. This knowledge can aid governments and healthcare providers in identifying those most at risk of loneliness within urban-rural regional boundaries.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "ef944a9de9e48448853e2f3bddd64a26",
  "timestamp": "2025-05-15T03:00:04.989142"
}