{
  "id": 4050,
  "title": "The Beta coefficient of an unlisted bank",
  "abstract": "The problem that we set ourselves in this work is related to the determination of capital return invested in an unlisted bank, particularly, in a credit cooperative bank. The model that we use is the Capital Asset Pricing Model (CAPM) equation, with its various difficulties in applying it to a category of unlisted activities. The biggest obstacle in using CAPM is given by the Beta determination representing the systematic risk of the units under examination. Therefore, to determine this risk coefficient, we assumed a first step in which we consider a similar sector sample, consists of a portfolio of listed banks, from which we obtain a Business Risk Index (BRI), that we use to go back to unlisted bank Beta under consideration. In a second case, it is thought of a target market constituted by the whole unlisted banks sample of the same sector under analysis, then relating the returns of individual observed banks with average returns provided by this market, we obtain the Regression Beta. A third step, provides the Business Risk Index determination of the sector, in this case obtained from the unlisted banks market, and then to reach to our banks Beta under observation. Comparing the results obtained from this analysis allows us to suggest a quite satisfying line for determining the Beta of an unlisted bank and consequently for its expected return estimation. (C) 2016 The Authors. Published by Elsevier Ltd.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "efb3143acaee54dcec21b36492ad19fa",
  "timestamp": "2025-05-15T01:23:27.287904"
}