{
  "id": 4289,
  "title": "Associating stock prices with web financial information time series based on support vector regression",
  "abstract": "Over the past years, the effect of massive information from the web on the financial market has increased. How to process and utilize such information attracts both researchers and portfolio managers. In this paper, financial information obtained daily from the web is treated as a time series and then associated with stock price volatilities. First, six research topics on financial time series are outlined, namely, analyses of stock price time series P, trading volume time series V, web information time series W, and relationship between P and V, P and W, as well as V and W. Second, a model connecting P and W based on the support vector regression (SVR) is examined as an example of the six research topics. Third, given that a typically successful way of computer-based natural language processing is through the conduct of keyword analysis, the novel finance-computer time series W is explicitly defined in terms of financial keywords and is used in the present paper as the topic of investigation. The relationship between P and W is modeled using SVR. Because during the pre-web era people cannot manually and efficiently process image information from the newspapers and sounds from the television and radio over a longer period of time (e.g., a year), they were unable to obtain the time series W. Therefore, it is the web that makes the research on the relationship between P and Win the meaning of quantity of W possible. Finally, experiments on the Shanghai and Shenzhen security markets revealed that the introduction of W helps improve model accuracies. As the web further develops, more and more ordinary people share their views on the web. The long-tail of massive financial information formed by these grass roots has a noticeable effect on the financial markets. In financial markets, those who quickly capture and interpret financial information have the potential to generate profits. With the use of the newly found model connecting P with W and fast decision making, financial market practitioners can be rewarded. (C) 2013 Elsevier B.V. All rights reserved.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "efbbd5075c3275863e71e2c5dc19bc7c",
  "timestamp": "2025-05-15T01:25:23.432868"
}