{
  "id": 2552,
  "title": "Application of data mining in enterprise financial risk prediction based on genetic algorithm and linear adaptive optimization",
  "abstract": "In the construction of enterprise financial risk prediction model, the obtaining of the optimal solution has a key impact on the prediction effect of the prediction model. Exploring the optimization and improvement of the prediction model to obtain the optimal solution is an urgent problem. In this paper, based on genetic algorithm and data mining technology, a genetic algorithm model based on adaptive improvement is proposed. Through linear adaptive optimization, the optimal solution of complex problems is obtained. When estimating parameters, EM algorithm is used to estimate, so that the final effect of model fusion can reach the expectation. At the same time, it integrates data mining technology, Borderline STATE EasyEnsemble sampling method and SVM intelligent technology to build an optimized comprehensive risk early warning model, which realizes the automatic integration and prediction of financial risks. The adjusted mathematical model is better than the single technical model. This study verified that the prediction ability of the improved model for minority samples has been greatly improved. Under the new method, F1 + F2 + F3 has increased by 14.83% compared with the single F1 feature, and the prediction accuracy of most types of samples has not been reduced. The prediction effect has generally improved. Finally, according to the current situation of enterprise finance, this paper puts forward effective measures to prevent enterprise financial risks.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "efbeb3a18d5a55a092880e3bb0ce1702",
  "timestamp": "2025-05-15T02:16:32.719077"
}