{
  "id": 8494,
  "title": "When working is not enough: food insecurity in the Canadian labour force",
  "abstract": "Objective Food insecurity, lack of access to food due to financial constraints, is highly associated with poor health outcomes. Households dependent on social assistance are at increased risk of experiencing food insecurity, but food insecurity has also been reported in households reporting their main source of income from employment/wages (working households). The objective of the present study was to examine the correlates of food insecurity among households reliant on employment income. Design Working households reporting food insecurity were studied through analysis of the Canadian Community Health Survey, 2007-2008, employing descriptive statistics and logistic regression. Food insecurity was measured using the Household Food Security Survey Module; all provinces participated. Setting Canada. Subjects Canadian households where main income was derived through labour force participation. Social assistance recipients were excluded. Results For the period 2007-2008, 4 % of working households reported food insecurity. Canadian households reliant on primary earners with less education and lower incomes were significantly more likely to experience food insecurity; these differences were accentuated across some industry sectors. Residence in Quebec was protective. Working households experiencing food insecurity were more likely to include earners reporting multiples jobs and higher job stress. Visible minority workers with comparable education levels experienced higher rates of food insecurity than European-origin workers. Conclusions Reliance on employment income does not eliminate food insecurity for a significant proportion of households, and disproportionately so for households with racialized minority workers. Increases in work stress may increase the susceptibility to poor health outcomes of workers residing in households reporting food insecurity.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "efdc5dcafed37ad7f256d94aef960dfe",
  "timestamp": "2025-05-15T03:19:21.345143"
}