{
  "id": 5679,
  "title": "Therapeutic Decisions in Atrial Fibrillation for Stroke Prevention: The Role of Aversion to Ambiguity and Physicians' Risk Preferences",
  "abstract": "Background: Knowledge-to-action gaps influence therapeutic decisions in atrial fibrillation (AF). Physician-related factors are common, but the least studied. We evaluated the prevalence and determinants of physician-related factors and knowledge-to-action gaps among physicians involved in the management of AF patients. Design: In this cross-sectional study, participants from 6 South American countries recruited during an educational program answered questions regarding 16 case scenarios of patients with AF and completed experiments assessing 3 outcome measures: therapeutic inertia, herding, and errors in risk stratification knowledge translated into action (ERSKTA) based on commonly used stratification tools (Congestive heart failure, Hypertension, Age >= 75 years (double), Diabetes mellitus, previous Stroke/transient ischemic attack/thromboembolism (double), Vascular disease, Age 65-74 years, and female gender (score of 0 for males and 1 for female) (CHA(2)DS(2)-VASc) and Congestive heart failure, Hypertension, Age years, Diabetes mellitus, and previous Stroke/transient ischemic attack (double) (CHADS(2))). Logistic regression analysis was conducted to determine factors associated with the outcomes. Results: Overall, 149 physicians were invited to participate, of which 88 (59.1%) completed the online assessment tool. Cardiology was the most frequent specialty (69.3%). Therapeutic inertia was present in 53 participants (60.2%), herding in 66 (75.0%), and ERSKTA in 46 (52.3%). Therapeutic inertia was inversely associated with willingness to take financial risks (odds ratio [OR] .72, 95% confidence interval [CI] .59-.89 per point in the financial risk propensity score), herding was associated with aversion to ambiguity in the medical domain (OR 5.35, 95% CI 1.40-20.46), and ERSKTA was associated with the willingness to take risks (OR 1.70, 95% CI 1.15-2.50, per point in score). Conclusions: Among physicians involved in stroke prevention in AF, individual risk preferences and aversion to ambiguity lead to therapeutic inertia, herding, and errors in risk stratification and subsequent use of oral anticoagulants. Educational interventions, including formal training in risk management and decision-making are needed.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "efe38d7b12226260a070337e6849977c",
  "timestamp": "2025-05-15T02:50:21.210191"
}