{
  "id": 1724,
  "title": "Using GAN-generated market simulations to guide genetic algorithms in index tracking optimization",
  "abstract": "Index tracking is the problem of building a portfolio that replicates the performance of a market index. The recent applications involving deep learning in index tracking are more focused on the learned information rather than on the framework that consumes this information. The problem is that, until now, a way to enable the extension of the index tracking models that adopt machine learning was not yet proposed. Nowadays, the mathematical programming framework is more flexible when considering model extensions to build realistic portfolios. Thus, this study presents ways to combine generative adversarial networks (GANs) within this framework to generate market simulations incorporated into a base index tracking model. It was verified how the simulations generated by GANs can impact the out-of-sample performance of the portfolio and how to deal with their instability, by using real data from the Brazilian market. To achieve this, two evolutionary metaheuristics were proposed to solve the multiple scenario index tracking problem. The proposed evolutionary algorithms minimize the tracking errors of a portfolio in multiple market simulations generated by GANs. The performance of the proposed algorithms was compared against another evolutionary metaheuristic that solves the index tracking problem using historical data. It was possible to observe that the scenario-based dominance genetic algorithm (SDM-SBDGA-GAN) was able to perform better than the real data genetic algorithm (RDM-GA) and the sample average approximation genetic algorithm (SDM-SAAGA-GAN). These results open doors for new applications of synthetic data in the construction of portfolios using more realistic constraints and other tracking objectives. This work also brings discussions about problems related to the application of GANs in this context.& COPY; 2023 Elsevier B.V. All rights reserved.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "efe77fa5465689ac56a7de771fb84feb",
  "timestamp": "2025-05-15T00:58:50.689792"
}