{
  "id": 9024,
  "title": "Hospital network participation and outcomes following elective posterior lumbar fusions - are mergers effective?",
  "abstract": "BACKGROUND CONTEXT: Due to financial pressures associated with healthcare reforms, an increasing number of hospitals are now merging (or consolidating) into networks (or systems). However, it remains unclear how these mergers or network participations affect quality of care and/or costs. PURPOSE: The current study aims to evaluate the impact of hospital network participation on 90-day complications, charges, and costs following elective posterior lumbar fusions (PLFs). STUDY DESIGN: Retrospective review of a 100% national sample of Medicare claims from 2010 to 2014 (SAF100). STUDY SAMPLE: All Medicare-eligible patients undergoing elective 1-to-3 level PLFs for degenerative lumbar pathology from 2010 to 2014. OUTCOME MEASURES: Ninety-day complications, charges, and costs. METHODS: The 2010 to 2014 100% Medicare Standard Analytical Files (SAF100) was used to identify patients undergoing elective 1- to 3-level PLFs for degenerative lumbar pathology. The Dartmouth Atlas for Healthcare hospital-level data, which uses a combination of American Hospital Association and additional source data, was used to identify hospitals that were part of a network (or system) between 2010 and 2014. The study sample was divided into 2 cohorts (network hospitals and non-network hospitals) for analyses. Multivariate logistic regression models were used to compare differences in 90-day complications between network and non-network hospitals, while controlling for baseline demographics (age, gender, region, year of surgery, median household income, co-morbidity burden) and hospital-level characteristics (case volume, teaching status, urban/rural location, and hospital ownership). Generalized linear regression modeling was used to assess for differences in 90-day charges and costs. RESULTS: A total of 145,141 patients undergoing surgery in 2,186 hospitals were included in the study, out of which 107,919 (74.4%) underwent surgery in a network hospital (N=1,526). Network hospitals were more prevalent in the South or West regions of the United States. Patients in network hospitals had a median household income less than the 5th quintile. Network hospitals were also more likely to have a higher annual case volume of elective 1- to 3-level PLFs, greater number of beds, be located in an urban location, and have a voluntary/nonprofit or proprietary/profit ownership model. Multivariate analyses showed that even though patients undergoing surgery at network hospitals (vs non-network hospitals) had a slightly increased odds of 90-day cardiac complications (7.9% vs 7.4%, odds ratio [OR] 1.07 [95% confidence interval {CI} 1.02-1.12]; p=.010), thromboembolic complications (2.4% vs 2.2%, OR 1.12 [95% CI 1.01-1.20]; p=.025) and emergency department visits (16.4% vs 16.0%, OR 1.06 [95% CI 1.02-1.09]; p=.002), the differences would not be considered clinically significant. Despite a slight decrease in risk-adjusted 90-day reimbursements (-$272), the risk-adjusted 90-day charges were actually significantly higher (+$9,959; p<.001) at network hospitals. CONCLUSIONS: Even though hospitals that are part of a network do not appear to have significantly different complication rates following elective PLFs, they do have significantly higher risk-adjusted charges as compared to non-network hospitals. Further research is required to understand market-level changes induced by hospital mergers into networks. (C) 2020 Elsevier Inc. All rights reserved.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "efe93451f370c2dc7273b30c4b028d44",
  "timestamp": "2025-05-15T03:24:54.882485"
}