{
  "id": 2651,
  "title": "Enhancing performance of shipboard photovoltaic grid-connected inverter through CRNN-LM-BP control optimized by particle swarm optimization of LCL parameters",
  "abstract": "The global renewable energy portfolio is experiencing a growing proportion of shipboard photovoltaic (PV) energy. Grid-connected system has become the development trend of photovoltaic power generation technology in marine applications because of its high energy utilization efficiency. However, in the grid-connected process, harmonic pollution is easily caused by time-varying marine environment disturbance, which affects the quality of grid-connected power. The current recurrent neural network Levenberg-Marquardt backpropagation (CRNN-LMBP) method, a control methodology, is introduced in this paper to ensure the robustness, stability, and consistency of the system. In addition, the inductance-capacitance-inductance (LCL) filter is optimized using particle swarm optimization (PSO) to minimize the presence of high frequency harmonics. The system that has been developed possesses the ability to improve the accuracy of steady-state control, operate with high efficiency and effectiveness, and maintain a total harmonic distortion of 1.73 %. Concurrently, streamlining the Jacobian matrix in the LM algorithm expedites convergence. It enables the system to improve its dynamic response, minimize excess, and quickly return to a stable condition when faced with load variations, a wide range of filter parameter adjustments, and voltage fluctuations. The suggested method's effectiveness and applicability are evaluated by comparing it to the traditional proportional-resonant control, CRNN-BP control, using Matlab/ Simulink and the real-time simulator OPAL-RT5700..",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "efebfa312844e276a61df2e7976c6825",
  "timestamp": "2025-05-15T01:09:14.880319"
}