{
  "id": 6633,
  "title": "Understanding burden in caregivers of colorectal cancer survivors: what role do patient and caregiver factors play?",
  "abstract": "This study investigated how both caregiver and patient factors predict different aspects of burden in colorectal cancer caregivers. One hundred and fifty-three caregiver-survivor dyads separately provided information on patient disease and treatment-related factors, and perceived global health status (EORTC QLQ30), along with caregiver socio-demographic factors, health and care-related activities. Four multiple regression analyses were conducted to assess the influence of caregiver characteristics, patient characteristics and care-related activities on four dimensions of burden from the Caregiver Reaction Assessment scale. Caregiver characteristics significantly predicted health and financial burden (11%-13% of explained variance) with comorbidity and younger age increasing this risk. Patient health, in particular global health status and the presence of a stoma, predicted all burden scores, explaining 14%-22% of variance. Care-related activities was also a significant predictor of all burden scores, explaining an additional 5%-11% of variance, with time involved in caring the most consistent predictor. Results highlight that a combination of factors influence caregiver burden. These results may be used to identify those most at risk, allowing practitioners to deliver tailored effective support. In particular, efforts to alleviate the burden of caring on caregiver schedule may be merited, given that this was the domain in which the burden was greatest.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "eff06f7b42b6e9bd5a0dfa6f56aadf5d",
  "timestamp": "2025-05-15T03:00:04.996560"
}