{
  "id": 3573,
  "title": "Reducing risk through crop diversification: An application of portfolio theory to diversified horticultural systems",
  "abstract": "In agricultural sciences, it is frequently stated that diversified systems are more likely to cope with risks, but rarely demonstrated in a quantitative way. On the theoretical perspective, risk reduction based on asset diversification is a well studied mechanism in economics that has been formalized in the Modern Portfolio Theory (MPT). In this paper, we thus explore the opportunities for application of MPT to quantify the benefits of diversification for risk reduction in a context of highly diversified horticultural systems. Our analysis relies on a model of the effect of crop diversification on risk and expected yield. It is based on a dataset obtained from a range of 44 species and over a period of 10 years. Results show that (i) the variability of expected crop yield can be reduced up to 77% by choosing the appropriate crop combination; (ii) most common crop classifications such as botanical classification or functional types do not make it possible to identify suitable diversification strategies. These results provide insight into how different horticultural crop combinations may shape the relationship between production and risk in diversified farming systems. Our findings also provide indications on new diversification strategies based on a quantification of risk reduction.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f0014b4df0ccb6c553eaaed66455f81b",
  "timestamp": "2025-05-15T01:18:20.598112"
}