{
  "id": 7345,
  "title": "Preoperative Opioid Use Increases the Cost of Care in Total Joint Arthroplasty",
  "abstract": "Introduction: Predictors of financial costs related to total joint arthroplasty (TJA) have become increasingly important becuase payment methods have shifted from fee for service to bundled payments. The purpose of this study was to assess the relationship between preoperative opioid use and cost of care in primary TJA. Methods: A retrospective study was conducted in Medicare patients who underwent elective unilateral primary total knee or hip arthroplasty between 2015 and 2018. Preoperative opioid usage, comorbidities, length of stay, and demographic information were obtained from chart review. The total episode-of-care (EOC) cost data was obtained from the Centers of Medicare and Medicaid Services based on Bundled Payments for Care Improvement Initiative Model 2, including index hospital and 90-day postacute care costs. Patients were grouped based on preoperative opioid usage. Costs were compared between groups, and multivariate linear regression analyses were performed to analyze whether preoperative opioid usage influenced the cost of TJA care. Analyses were risk-adjusted for patient risk factors, including comorbidities and demographics. Results: A total of 3,211 patients were included in the study. Of the 3,211 TJAs, 569 of 3,211 patients (17.7%) used preoperative opioids, of which 242 (42.5%) only used tramadol. EOC costs were significantly higher for opioid and tramadol users than nonopioid users ($19,229 versus $19,403 versus $17,572, P < 0.001). Multivariate regression predicted that the use of preoperative opioids in TJA was associated with increased EOC costs by $789 for opioid users (95% confidence interval [CI] $559 to $1,019, P < 0.001) and $430 for tramadol users (95% CI $167 to $694, P = 0.001). Total postacute care costs were also increased by 70% for opioid users (95% CI 44% to 102%, P < 0.001) and 48% for tramadol users (95% CI 22% to 80%, P < 0.001). Discussion: This study demonstrated that preoperative opioid usage was associated with higher cost of care in TJA. Limiting preoperative opioid use for pain management before TJA could contribute to cost savings within a bundled model.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f002256e9d0a0b2686bb5b05c89a4567",
  "timestamp": "2025-05-15T03:07:31.911253"
}