{
  "id": 8311,
  "title": "Political connection and firm's financial performance; the role of corporate governance",
  "abstract": "PurposeThis study aims to analyze the impact of political connection on the firm's financial performance in presence of corporate governance.Design/methodology/approachThe study utilizes panel regression analyses (OLS) and margin and contrast analysis techniques on a data set of Pakistan's listed companies ranging from 2012 to 2021. For political connection, an aggregate score was calculated from political ties at the central, provincial and local level. Corporate governance was measured through an index using principal component analysis technique capturing its attributes comprised of board size, board tenure, board independence, board gender diversity, CEO duality, audit committee tenure and audit quality.FindingsThe study finds that politically affiliated individuals can exploit the wealth of firms. It also supports the positive role of corporate governance in augmenting the firm financial performance and further confirms that the presence of robust corporate governance practices can help mitigate the risk posed by the political connection.Practical implicationsThe study provides valuable information to investors and offer insights into the investment opportunities available in nonfinancial sectors and identifies areas where investments may not yield favorable results. It provides solutions to the companies to effectively compose their boards and offset the adverse effect of political connection and capitalize on its potential benefits. Investors can draw upon these insights to inform and facilitate their investment decision-making processes. By gaining a better comprehension of the impact of political associations on corporate governance and performance, regulators and policymakers can better design policies that strike a balance between preventing abuses while still allowing firms to reap the benefits of political connections.Originality/valueTo the best of the authors' knowledge, this is the first study that delves into an analysis to mitigate viz-a-viz offset the adverse effect of political affiliations by implementing robust practices of corporate governance. Further, in lieu of a binary indicator variable of political connection, this study applies a different approach to quantify the varying intensities of the political connections, which is a nascent method. It further undertakes margin & contrast analysis and also analyzes effect of different levels of political connections as well as the role of various attributes of corporate governance, which offer a novel contribution.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f004c5cfc1faa5a9a6f87294df166bcc",
  "timestamp": "2025-05-15T03:17:21.606598"
}