{
  "id": 1710,
  "title": "A differentiated description of building-stocks for a georeferenced urban bottom-up building-stock model",
  "abstract": "Several building-stock modelling techniques have been employed to investigate the impact of energy efficiency measures (EEM), where the description of the building-stock generally consists of an age type classification to specify building characteristics for groups of buildings. Such descriptions lack the appropriate level of detail to differentiate the potential for EEM within age groups. This paper proposes a methodology for building-stock description using building-specific data and measured energy use to augment an age-type building-stock classification. By integrating building characteristics from energy performance certificates, measured energy use and envelope areas from a 2.5D GIS model, the building stock description reflects the heterogeneity of the building-stock. The proposed method is validated using a local building portfolio (N=433) in the city of Gothenburg, where modelled results for space heating and domestic hot water are compared to data from measurements, both on an individual building level and for the entire portfolio. Calculated energy use based on the building-stock description of the portfolio differ less than 3% from measured values, with 42% of the individual buildings being within a 20% margin of measured energy use indicating further work is needed to reduce or quantify the uncertainty on a building level. (C) 2016 The Authors. Published by Elsevier B.V.",
  "year": 2016,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f014b82345d90342407189b9f151d3e1",
  "timestamp": "2025-05-15T00:58:50.633335"
}