{
  "id": 7520,
  "title": "Moderating effects of country-level institutional quality and cultural dimensions on CSR-stock price crash risk relationship: a meta-analysis study",
  "abstract": "PurposeThis study uses meta-analysis to examine the relationship between corporate sustainability reporting (CSR) and stock price crash risk (SPCR) and to discern the moderating effects of country-level institutional quality and cultural dimensions on this link.Design/methodology/approachThe study used mean correlation coefficients to test the relationship between CSR and SPCR and meta-regressions to test the moderating effects. The analysis considers 65 effect sizes from 24 empirical studies.FindingsThe results showed that CSR reduces the chances of SPCR. The inverse relationship between CSR and SPCR is stronger in masculine, high power distance and long-term oriented cultures and is less pronounced in individualistic, uncertainty avoidance and indulgent cultures. The inverse relationship is also stronger in countries where high-quality institutions exist.Research limitations/implicationsThis study is based on correlation coefficient analysis and excludes studies publishing only regression results. Furthermore, it provides guidance to lessen SPCR. Findings suggest that such initiatives may mitigate the risk of stock price crashes for firms. Through meta-analysis, this research investigates the correlation between environmental, social and governance (ESG) disclosure and stock price crash occurrences, offering insights with significant implications for the European financial landscape and globally.Originality/valueThis is a pioneer meta-analysis that investigates the link between CSR and SPCR and the moderating effects of country-level institutional quality and cultural dimensions. Our study sheds light on the potential impact of promoting a sustainable and responsible business environment in Europe through comprehensive ESG disclosure under the Corporate Sustainability Reporting Directive (CSRD).",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f01986d529ab059c6a84203f8f8e431f",
  "timestamp": "2025-05-15T03:09:36.828431"
}