{
  "id": 2618,
  "title": "Best-Fit Containerization as a Brokered Service",
  "abstract": "IT consumption is rapidly moving to an everything-as-a-Service (XaaS) model wherein a cloud broker, or in general, a digital marketplace, maintains a portfolio of infrastructure, platform and software services. In the meanwhile, containerization of workloads and the immutable microservices paradigm of application software architecture has witnessed a dramatic upswing across industries. In this scenario, we see the need for a smart fulfillment engine within a cloud broker that can automatically deploy a chosen cataloged IT service into the best-performing container environment from among the set of available underpinning brokered container hosting systems. More broadly, the problem statement we address in this paper is to supply best-performing container deployment as a provisioning-time service to applications that are part of a broker's SaaS catalog, in an on-demand and pay-as-you-go manner. We show why this problem is operationally complex and time consuming, and how we heuristically prune the associated decision tree in two phases so that it becomes viable to implement this service on the fly during SaaS provisioning time. We also show that the utility of the algorithmic framework that we propose is not limited to the container fitness use case that we analyze in this paper; rather it can be extended to address a class of problems where overall time and cost complexity for provisioning-time decision making needs to be controlled under a given set of constraints. Our contribution can hence be seen as an abstraction framework for infrastructure consumption when viewed in the larger context of research devoted to simplifying the leverage of hybrid clouds.",
  "year": 2018,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f02fd5f7e3f88c29d9ec964fa4aa1732",
  "timestamp": "2025-05-15T01:08:41.937206"
}