{
  "id": 8372,
  "title": "Future economic outlook of Nebraska rural community pharmacies based on break-even analysis of community operational costs and county population",
  "abstract": "Background: There is growing concern over increasingly limited access to local health care, including pharmacies, for rural citizens of the United States. Although geographically distant from most competitors, rural pharmacies may still struggle to generate an acceptable profit to remain economically viable. Therefore, a method for calculating the economic viability for a community pharmacy to recruit a potential new owner to assume the entrepreneurial risk is an important issue to consider when evaluating rural pharmacy access. Objectives: The primary objective of this study was to use a modified break-even analysis to predict the future financial potential of the current pharmacy business to attract a new owner. The secondary objective was to forecast a risk level for a Nebraska county to sustain the number of pharmacies in the country beyond current ownership. Methods: This research used data provided by pharmacies that responded to a Nebraska Medicaid cost of dispensing (COD) survey in addition to data from the US Census Bureau, US Office of Management and Budget, and the Nebraska State Board of Pharmacy. Break-even analysis was used to determine the point where the prescription volume of the pharmacy not only covered the variable and fixed costs but also maintained a reasonable profit to attract new ownership. Counties were classified into 3 risk levels based on the projected available prescription volume and the number of pharmacies in each county. Sensitivity analysis was performed on the risk levels to determine the impact of variance in projected available prescription volume on the projected future outlook for the pharmacies in each county. Results: Regression analysis of responses to the COD survey indicated that the annual break-even prescription volume ranged from 44,790 to 49,246 prescriptions per pharmacy per annum. The number of rural Nebraska pharmacies was projected to decline from 126 to 78. The number of counties in Nebraska without a single pharmacy was projected to increase from 19 to 26, and the number of counties with just one pharmacy was projected to increase from 17 to 31. Thus, the number of counties with 1 or no pharmacy was projected to increase to 57 out of the total 93 Nebraska counties. Conclusions: The forecasted closure of pharmacies in rural areas will cause significant portions of the state to be without a pharmacy. Low county populations will be unable to sustain a local prescription volume large enough to remove them from the high risk of pharmacy closure. (C) 2010 Elsevier Inc. All rights reserved.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f03ae1cd89da3fee2d7fad1e1188c4b8",
  "timestamp": "2025-05-15T03:18:19.536219"
}