{
  "id": 6586,
  "title": "The Interaction between Ownership Concentration and Market Risk in European, American and Chinese Markets: the Effects of BREXIT",
  "abstract": "Today's economy is facing various economic shocks, for instance BREXIT, that do not have any evidence from the past. Economic shocks directly affect market risks, the characteristics of which are observed by business company managers before making investment and operational decisions. Such decisions are directly affected by corporate ownership concenfration and structure. The issue of ownership concenfration in literature lacks approach when it is analysed in the interaction with market risk, caused by an economic shock. The contribution of this research to the discipline is the interaction between the indicators that reflect the impact of ownership concentration on corporate market risk by an economic shock (regression model was created). This model is proposed as a methodological tool to assess and analyse the scientific problem in question; it can also serve as a new and reliable insfrument for business decision-makers and managers. An example of the data analysis representing European, American and Chinese markets as well as the United Kingdom as a country of origin of the economic shock under consideration is provided. The research proves that there exist statistically significant differences in the interaction between ownership concentration and corporate market risk in different markets. Also, it was found that BREXIT most significantly raised the risk in the UK market, as in the country of origin, in comparison to the risk observed in other markets. This paper contributes to the literature in corporate management decisions and systemic risk management; it also sheds light upon the economic financial effects of the BREXIT process. Practical implication of this research is related to a focus on a detailed measurement instrument which allows to assess the systemic risk from a corporate management perspective.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f041c63e1331abbbbc35c715f797d7cc",
  "timestamp": "2025-05-15T02:59:37.010080"
}