{
  "id": 7373,
  "title": "Asymmetric effect of renewable and non-renewable energy consumptions on corporate cash holdings: new panel data evidence from BRICS economies",
  "abstract": "PurposeIn the recent wake of environmental sustainability, more attention has been paid to the consumption of specific energy types. However, how the consumption of such energy alternatives influences multiple corporate-level decisions has not yet been well explored in the literature. The current analysis bridges this deficiency in literature by exploring the empirical relationship between energy alternatives and cash holdings.Design/methodology/approachFor empirical analysis, the authors sample the non-financial sector enterprises founded in five BRICS economies and employ the system GMM and fully modified ordinary least square techniques to establish the regression. The selection of econometric techniques is subject to the existence of endogeneity and cointegration.FindingsThe estimated coefficients reveal a significant negative effect of renewable energy (REC) while a significant positive impact of non-renewable energy consumption (FFE) on cash holdings. Referring to low pollution emissions, less operational risk and a cheap source of energy, the more consumption of renewable energy reduces the motives of cash holdings. Primarily, the current analysis advocates an important policy regarding the utilization of renewable energy as industrial fuel inputs because it has a material impact on cash holdings and also ensures environmental sustainability.Practical implicationsThis study has equal policy outputs for industry officials, policy regulators and environmental economists. Corporate managers should do more focus on transforming the energy needs from non-renewable to renewable as such transformation can benefit in terms of both, i.e. environmental sustainability and low cash holdings.Originality/valueContemporary literature mainly highlights the determinants of energy consumption. However, it is less known how the consumption of specific energy sources affects the firm's cash-holding decisions. Thus, this study enriches both energy economics and financial economics literature by offering cutting-edge evidence on the sustainable role of REC in declining cash holdings.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f04705764f19eb5ac5ad0664a7087813",
  "timestamp": "2025-05-15T03:08:00.752774"
}