{
  "id": 6170,
  "title": "Do productive firms get external finance? Evidence from Chinese listed manufacturing firms",
  "abstract": "Due to information asymmetry problem in financial markets good quality firms often find it difficult to prove to external finance providers about their true quality and to distinguish themselves from bad quality firms. We argue that instead of sending indirect signals to financial market good quality firms could focus on improving their productivity to obtain external finance. Besides relying solely on firms' balance sheet information external finance providers using firms' TFP or labour productivity information would have a true knowledge of firms' efficiency and risk. Overall, using a panel of 1591 Chinese listed manufacturing firms between 2003 and 2016 we find that productivity measured by TFP or labour productivity is statistically and economically important and positive in determining firms' external finance, i.e. total leverage, new issue of equity and long-term debt. We find that productivity is helpful for firms to raise new equity finance, but only some weak results for total leverage and long-term debt. Such results hold for both the whole sample and private firm sample. We also find that large and/or old firms and exporting firms are able to make better use of their productivity to gain external finance than their respective counterparts, i.e. small young firms and non-exporting firms. The causality of the regression results is also confirmed by difference-in-difference tests using an exogenous industrial policy shock.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f049979378a63f89e8a905b94f41e25c",
  "timestamp": "2025-05-15T02:55:44.440616"
}