{
  "id": 2868,
  "title": "An equity-implied rating model forunrated firms",
  "abstract": "While investors and lenders rely on one or more external credit rating agencies(eg, EthiFinance, Standard & Poor's, Moody's or Fitch Ratings) to directly assesstheir obligors' credit quality, or simply to benchmark their own estimates, part oftheir portfolio might not be covered by these credit assessment institutions. Con-sequently, some practitioners estimate obligors' probability of default using mod-els derived from Merton's classic 1974 model and then translate them into market-implied ratings. These measures are highly volatile and sensitive to overall marketmovement; that is, probabilities of default are high in a bear market and low ina bull market, whereas an obligor's actual credit quality might stay relatively sta-ble. In this paper we propose an alternative approach based on Merton's distance todefault. We compute the distance to default from market data and transform it into adistance-to-default-based rating for each firm listed on the stock market. Further, weuse a machine learning algorithm to link the firm's distance to default and sector toits credit rating. Ultimately, this approach allows us to assign a distance-to-default-based rating to unrated firms. To show the relevance of this method, we compare theexplanatory power of the model's equity-implied ratings with those of actual credit ratings in relation to the interest/debt ratio, and we find similar results (ie, a coef-ficient of determination of 87% in both cases). This demonstrates that our modelexplains the interest rates paid as well as the credit ratings",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f05709ab812be8c972cc448bebf90e2b",
  "timestamp": "2025-05-15T01:11:17.434357"
}