{
  "id": 7205,
  "title": "IPO initial return in Pakistan: influence of country-level institutional quality",
  "abstract": "Purpose The present study investigated the influence of country-level institutional quality on IPO initial return using World Bank Governance indices. Design/methodology/approach This study analysed 84 IPOs listed on Pakistan Stock Exchange between 2000 and 2017 using cross-sectional data. The impact of country-level institutional quality on IPO initial returns was examined using ordinary least square, robust least square, stepwise least square and quantile regression. Findings Empirically, the values of political stability, government effectiveness and regulatory quality were positively significant, whereas rule of law and control of corruption were negatively significant in explaining the intensity of IPO initial return. The results also show the presence of significant risk in the market. Hence, investors were compensated with higher initial returns for weak country-level institutional quality. The results also reveal that improving country-level institutional quality would improve the financial market transparency, thereby reducing IPO initial returns. Originality/value No studies have been conducted regarding the influence of country-level institutional quality on IPO initial return in Pakistan. This study is a pioneering study that seeks to give insights into the link between these variables in the context of Pakistan.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f05d66332dc99a884beaaddf0d39f9da",
  "timestamp": "2025-05-15T03:06:01.310317"
}