{
  "id": 7107,
  "title": "Structural factors associated with methamphetamine smoking among female sex workers in Tijuana, Mexico",
  "abstract": "Introduction and AimsSmoking methamphetamine is associated with increased risk of HIV among female sex workers (FSW). The structural context of substance use is an important shaper of individual behaviour; however, structural determinants of methamphetamine use among FSWs are largely unknown. We identified individual, structural and neighbourhood factors associated with smoking methamphetamine among FSWs in the border city of Tijuana, Baja California, Mexico. Design and MethodsA prospective cohort of 301 FSWs sampled from indoor and outdoor sex work venues throughout Tijuana participated in quantitative surveys on behaviours and mapping of home and work neighbourhoods across three visits. Multinomial logistic regression using generalised estimating equations identified individual, structural and neighbourhood variables associated with smoking methamphetamine. ResultsMethamphetamine use, particularly smoking, was highly prevalent among FSWs. Over half (61%) of FSWs had ever used methamphetamine in their lifetime and at baseline, 38% currently smoked methamphetamine. Smoking methamphetamine daily was associated with living in the red light district [adjusted odds ratio (AOR)=2.72, 95% confidence interval (CI)=1.23-6.02] and with perceived homelessness, but only among women in a good financial situation (AOR=4.08, 95% CI=1.58-10.50). Smoking methamphetamine less than daily was associated with older age (AOR=1.06, 95% CI=1.02-1.10). Discussion and ConclusionsOur findings point to the important dynamic between the residential environment and more severe methamphetamine use. FSWs may prioritise the purchase of methamphetamine over stable housing if they have the financial means. Given the high prevalence of smoking methamphetamine among FSWs in Tijuana, drug treatment options, especially for women living in the red light district, are needed.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f06be6820fd0afb6d86d11e68c6c0bb6",
  "timestamp": "2025-05-15T03:05:03.572645"
}