{
  "id": 1156,
  "title": "Landslide risk zoning using support vector machine algorithm",
  "abstract": "Landslides are one of the most dangerous phenomena and natural disasters. Landslides cause many human and financial losses in most parts of the world, especially in mountainous areas. Due to the climatic conditions and topography, people in the northern and western regions of Iran live with the risk of landslides. One of the measures that can effectively reduce the possible risks of landslides and their crisis management is to identify potential areas prone to landslides through multi-criteria modeling approach. This research aims to model landslide potential area in the Oshvand watershed using a support vector machine algorithm. For this purpose, evidence maps of seven effective factors in the occurrence of landslides namely slope, slope direction, height, distance from the fault, the density of waterways, rainfall, and geology, were prepared. The maps were generated and weighted using the continuous fuzzification method and logistic functions, resulting values in zero and one range as weights. The weighted maps were then combined using the support vector machine algorithm. For the training and testing of the machine, 81 slippery ground points and 81 non-sliding points were used. Modeling procedure was done using four linear, polynomial, Gaussian, and sigmoid kernels. The efficiency of each model was compared using the area under the receiver operating characteristic curve; the root means square error, and the correlation coefficient . Finally, the landslide potential model that was obtained using Gaussian's kernel was selected as the best one for susceptibility of landslides in the Oshvand watershed.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f06da5d7778a60ffa20228b821116f35",
  "timestamp": "2025-05-15T01:59:21.737107"
}