{
  "id": 1394,
  "title": "Enhancing Forecasting Accuracy in Commodity and Financial Markets: Insights from GARCH and SVR Models",
  "abstract": "The aim of this study is to enhance the understanding of volatility dynamics in commodity returns, such as gold and cocoa, as well as the financial market index S&P500. It provides a comprehensive overview of each model's efficacy in capturing volatility clustering, asymmetry, and long-term memory effects in asset returns. By employing models like sGARCH, eGARCH, gjrGARCH, and FIGARCH, the research offers a nuanced understanding of volatility evolution and its impact on asset returns. Using the Skewed Generalized Error Distribution (SGED) in model optimization shows how important it is to understand asymmetry and fat-tailedness in return distributions, which are common in financial data. Key findings include the sGARCH model being the preferred choice for Gold Futures due to its lower AIC value and favorable parameter estimates, indicating significant volatility clustering and a slight positive skewness in return distribution. For Cocoa Futures, the FIGARCH model demonstrates superior performance in capturing long memory effects, as evidenced by its higher log-likelihood value and lower AIC value. For the S&P500 Index, the eGARCH model stands out for its ability to capture asymmetry in volatility responses, showing superior performance in both log-likelihood and AIC values. Overall, identifying superior modeling approaches like the FIGARCH model for long memory effects can enhance risk management strategies by providing more accurate estimates of Value-at-Risk (VaR) and Expected Shortfall (ES). Additionally, the out-of-sample evaluation reveals that Support Vector Regression (SVR) outperforms traditional GARCH models for short-term forecasting horizons, indicating its potential as an alternative forecasting tool in financial markets. These findings underscore the importance of selecting appropriate modeling techniques tailored to specific asset classes and forecasting horizons. Furthermore, the study highlights the potential of advanced techniques like SVR in enhancing forecasting accuracy, thus offering valuable implications for portfolio management and risk assessment in financial markets.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f096011c61d88ecf4c1d076908f07d10",
  "timestamp": "2025-05-15T02:02:22.748480"
}