{
  "id": 1003,
  "title": "Machine learning for zombie hunting: predicting distress from firms' accounts and missing values",
  "abstract": "In this contribution, we propose machine learning techniques to predict zombie firms. First, we derive the risk of failure by training and testing our algorithms on disclosed financial information and nonrandom missing values of 304,906 firms active in Italy from 2008 to 2017. We then identify the highest financial distress conditional on predictions that lie above a threshold for which a combination of the false positive rate (false prediction of firm failure) and the false negative rate (false prediction of active firms) is minimized. Therefore, we identify zombies as firms that remain in financial distress, i.e., whose forecasts fall into the risk category above the threshold for at least three consecutive years. To this end, we implement a gradient boosting algorithm (XGBoost) that exploits information about missing values. The inclusion of missing values in our prediction model is crucial because patterns of undisclosed accounts are correlated with firm failure. Finally, we show that our preferred machine learning algorithm outperforms (i) proxy models such as Z-scores and the distance-to-default, (ii) traditional econometric methods, and (iii) other widely used machine learning techniques. We provide evidence that zombies are less productive and smaller on average and that they tend to increase in times of crisis. Finally, we argue that our application can help financial institutions and public authorities design evidence-based policies-e.g., optimal bankruptcy laws and information disclosure policies.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f09ffd9d29902a656e9fa94121b71075",
  "timestamp": "2025-05-15T01:57:29.975647"
}