{
  "id": 5194,
  "title": "The association of financial difficulties with clinical outcomes in cancer patients: secondary analysis of 16 academic prospective clinical trials conducted in Italy",
  "abstract": "Background: Cancer may cause financial difficulties, but its impact in countries with public health systems is unknown. We evaluated the association of financial difficulties with clinical outcomes of cancer patients enrolled in academic clinical trials performed within the Italian public health system. Patients and methods: Data were pooled from 16 prospective multicentre trials in lung, breast or ovarian cancer, using the EORTC quality of life (QOL) C30 questionnaire. Question 28 scores financial difficulties related to disease or treatment in four categories from 'not at all' to 'very much'. We defined financial burden (FB) as any financial difficulty reported at baseline questionnaire, and financial toxicity (FT) as score worsening in a subsequent questionnaire. We investigated (i) the association of FB with clinical outcomes (survival, global QOL response [questions 29/30] and severe toxicity), and (ii) the association of FT with survival. Multivariable analyses were performed using logistic regression models or the Cox model adjusting for trial, gender, age, region and period of enrolment, baseline global QOL and, where appropriate, FB and global QOL response. Results are reported as odds ratio (OR) or hazard ratio (HR) with 95% confidence intervals (CI). Results: At baseline 26% of the 3670 study patients reported FB, significantly correlated with worse baseline global QOL. FB was not associated with risks of death (HR 0.94, 95% CI 0.85-1.04, P = 0.23) and severe toxicity (OR 0.90, 95% CI 0.76-1.06, P = 0.19) but was predictive of a higher chance of worse global QOL response (OR 1.35, 95% CI 1.08-1.70, P = 0.009). During treatment, 2735 (74.5%) patients filled in subsequent questionnaires and 616 (22.5%) developed FT that was significantly associated with an increased risk of death (HR 1.20, 95% CI 1.05-1.37, P = 0.007). Several sensitivity analyses confirmed these findings. Conclusion: Even in a public health system, financial difficulties are associated with relevant cancer patients outcomes like QOL and survival.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f0d97b130b7cc217f23cad11ce4a10db",
  "timestamp": "2025-05-15T02:45:17.116439"
}