{
  "id": 5937,
  "title": "House price bubble detection in Ukraine",
  "abstract": "PurposeThe purpose of this paper is to present a framework for the assessment of the fundamental value of house prices in the largest Ukrainian cities, as well as to identify the thresholds, the breach of which would signal a bubble.Design/methodology/approachHouse price bubbles are detected using two approaches: ratios and regression analysis. Two variants of each method are considered. The authors calculate the price-to-rent and price-to-income ratios that can identify a possible overvaluation or undervaluation of house prices. Then, the authors perform regression analyses by considering individual multi-factor models for each city and by using a within regression model with one-way (individual) effects on panel data.FindingsThe only pronounced and prolonged period of a house price bubble is the one that coincides with the Global Financial Crisis. The bubble signals produced by these methods are, on average, simultaneous and in accordance with economic sense.Research limitations/implicationsThe framework described in this paper can serve as a model for the implementation of a tool for detecting house price bubbles in other countries with emerging, small and open economies, due to adjustments for high inflation and significant dependence on reserve currencies that it incorporates.Practical implicationsA tool for measuring fundamental house prices and a bubble indicator for housing markets will be used to monitor the systemic risks stemming from the real estate market. Thus, it will help the National Bank of Ukraine maintain financial stability.Social implicationsThe framework presented in this research will contribute to the enhancement of the systemic risk analysis toolkit of the National Bank of Ukraine. Therefore, it will help to prevent or mitigate risks that might originate in the real estate market.Originality/valueThe authors show how to implement an instrument for detecting house price bubbles in Ukraine. This will become important in the context of the after-war reconstruction of Ukraine, with mortgages potentially becoming the main tool for the financing of the rebuilding/renovation of the residential real estate stock.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f0dafad30da1a2c38819540c68a95aea",
  "timestamp": "2025-05-15T02:53:03.087852"
}