{
  "id": 4226,
  "title": "A structured methodology for essential medicines lists and health emergency stockpiles: Experience with the Emergency Medicines Buffer Stock in the United Kingdom",
  "abstract": "Introduction: Formularies of essential medicines, such as Essential Medicines Lists (EMLs) and health emergency stockpiles, are intended to be always available, including in emergency situations, acting as important tools for access to medicines. The Emergency Medicines Buffer Stock (EMBS) in the United Kingdom (UK) was a stockpile of critical medicines managed by the UK Department of Health and Social Care (DHSC). We propose a new methodology for selecting and including medicines in EMLs and health emergency stockpiles and empirically apply it for selecting medicines in the case of the UK EMBS.Methods: We used Multi-Attribute Value Theory and Portfolio Decision Analysis to develop a three-phase methodological framework for medicines selection, involving: (i) the decision context definition and selection of evaluation criteria, (ii) the therapeutic area prioritisation, and (iii) the medicines value-for-money evaluation and product selection. The EMBS application took place in 2018-2019 and focused on therapeutic area prioritisation, involving primary data collection through expert interviews (n = 4), a workshop with DHSC decisionmakers (n = 13), and an online survey with National Clinical Directors and relevant experts (n = 24). A Monte Carlo simulation supported therapeutic area prioritisation using the British National Formulary (BNF) classification. Findings: Two criteria sets were selected for i) therapeutic area prioritisation, reflecting the value concerns of population need and shortage severity, and ii) medicines evaluation, reflecting magnitude of clinical benefit and supply vulnerability, among others. Primary evidence was collected for national need and shortage severity, based on which a population health loss index was developed. A total of 51 therapeutic areas were ranked using their index value while assessing the robustness of the ranking. The top ranked therapeutic area was antisecretory drugs and mucosal protectants, closely followed by diabetes drugs.Conclusions: The methodological application generated a ranking of therapeutic areas based on expected population health loss index, while addressing evidence uncertainty. The methodology can be adapted for other EMLs and emergency stockpile contexts to inform medicines selection.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f0e0d9e5c7d492196f25245ebea1e9c4",
  "timestamp": "2025-05-15T01:24:51.506708"
}