{
  "id": 3862,
  "title": "How do global commodities react to increasing geopolitical risks? New insights into the Russia-Ukraine and Palestine-Israel conflicts",
  "abstract": "The present study examines the impact of geopolitical risk on global commodities returns by including both major conflicts spanning from January 3, 2023 to December 18, 2023 to cover both the Russia-Ukraine and Palestine-Israel wars. Our study utilizes the QVAR model, the Quantile-on-Quantile regression (QQR) and the frequency causality test. Surprisingly, during the pre-conflict period, our findings reveal a weak positive influence of GPR on commodities, indicating their resilience to extreme negative shocks. Variance decompositions further highlight the limited role of GPR in explaining the commodity price variance. The spillover analysis highlights a low interconnectedness between GPR and commodities, demonstrating a high hedging effectiveness against expected negative GPR shocks. The heterogeneous reaction of commodities to extremely positive GPR shocks suggests diverse responses, emphasizing the need for nuanced investment strategies. Conversely, during the crisis periods, commodities exhibit a resilience to both negative and positive shocks from geopolitical tensions, therefore, presenting diversification opportunities for investors. The causality frequency analysis emphasizes the complex dynamics between GPR and commodities in both the time and frequency domains. Our study also offers significant implications for investors, portfolio managers, and policymakers, advocating for recognition of the weak pre-conflict link between GPR and commodities.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f0ef0d87b4758fc3be160afd71213c9c",
  "timestamp": "2025-05-15T01:21:41.340163"
}