{
  "id": 7653,
  "title": "Health Care Costs Associated With Child Maltreatment: Impact on Medicaid",
  "abstract": "OBJECTIVE: To estimate the increased Medicaid expenditures associated with child maltreatment. METHODS: Data on child maltreatment were collected from the National Survey of Child and Adolescent Well-Being, a nationally representative sample of cases investigated or assessed by local Child Protective Services agencies between October 1999 and December 2000. Medicaid claims data for 2000 to 2003 were obtained from the Medicaid Analytic Extract (MAX). Children from the National Survey of Child and Adolescent Well-Being who had Medicaid were matched to the MAX data by Social Security number or birthdate, gender, and zip code. Propensity score matching was used to select a comparison group from the MAX data. Two-part regression models were used to estimate the impact of child maltreatment on expenditures. Data with individual identifiers were obtained under confidentiality agreements with the collecting agencies. RESULTS: Children who were identified as maltreated or as being at risk of maltreatment incurred, on average, Medicaid expenditures that were >$2600 higher per year compared with children not so identified. This finding accounted for similar to 9% of all Medicaid expenditures for children. CONCLUSIONS: Child maltreatment imposes a substantial financial burden on the Medicaid system. These expenses could be partially offset by increased investment in child maltreatment prevention.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f0f78aa79e03f3b641d546c60f127ff9",
  "timestamp": "2025-05-15T03:10:33.118916"
}