{
  "id": 6527,
  "title": "Risk assessment of oil and gas pipelines with consideration of induced seismicity and internal corrosion",
  "abstract": "Over the last decade, unconventional oil and gas production has increased due to use of hydraulic fracturing and second oil recovery techniques. However, this activity is followed by prevalence of induced seismicity and has the potential to damage pipelines. The integrity of these pipelines is essential for oil and gas companies, regulator organizations, and. stakeholders due to adverse environmental consequences and significant financial losses. Therefore, it is important to investigate a potential impact of the induced seismicity on the pipeline infrastructure in order to enhance informed decision making (e.g. permitting decisions). To accomplish this task, this paper presents a probabilistic seismic risk assessment approach, which has been used for pipeline infrastructure located in the Northeast of British Columbia, Canada. Spatial clustering analysis is used for earthquakes, previously registered in the region, to delineate areas, which are particularly prone to the induced seismicity. The state-of-the-art ground motion prediction equation for induced seismicity is applied in Monte Carlo simulation to obtain a stochastic field of the seismic intensity. Based on the pipelines' seismic fragility formulations as well as its mechanical characteristics and corrosion conditions, spatial and probabilistic distributions of the repair rate and probability of failure have been obtained and visualized with the aid of the Geospatial Information System. (C) 2017 Elsevier Ltd. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f1037418b84a41b25d07c92c16f2fb88",
  "timestamp": "2025-05-15T02:59:07.473814"
}