{
  "id": 9231,
  "title": "Cancer history, insurance coverage, and cost-related medication nonadherence in Medicare beneficiaries, 2013-2018",
  "abstract": "BACKGROUND: Cancer survivors are at risk of financial hardships and cost-related medication nonadherence, particularly among those without adequate insurance coverage. OBJECTIVE: To examine the association between cancer history and cost-related medication nonadherence, as well as the association between insurance coverage and nonadherence among Medicare beneficiaries. METHODS: We used the 2013-2018 Medicare Current Beneficiary Survey Public Use File, a survey on the health, health service utilization, access to care, and satisfaction among a nationally representative sample of Medicare beneficiaries. Cost-related medication nonadherence was defined as often or sometimes reporting any of the following: (1) took smaller dose of medication, (2) skipped doses to make medication last, (3) delayed medication because of cost, and (4) not get medication because of cost. Logistic regression was used to estimate the odds ratio of cost-related nonadherence associated with cancer history, adjusting for survey year and sociodemographic characteristics of the respondents, including age, sex, race and ethnicity, highest grade completed, income level, marital status, and number of chronic conditions. We also included Medicare Part D, an interaction between Part D and the low-income subsidy, and Medicare Advantage in the model to examine the effect of insurance coverage on cost-related nonadherence. RESULTS: From 2013 to 2018, there were 12,492 cancer survivors and 53,262 respondents without a history of cancer in our sample, and 16.5% reported cost-related medication nonadherence. After adjusting for characteristics of the respondents, cancer survivors were more likely than those without a history of cancer to report cost-related medication nonadherence (adjusted OR = 1.10; 95% CI = 1.02-1.19). Having unsubsidized Part DPart D without the low-income subsidy-was associated with a greater likelihood of reporting cost-related medication nonadherence (adjusted OR = 1.63, 95% CI= 1.49-1.78), while having subsidized Part D was not (adjusted OR= 0.96; 95% CI = 0.85-1.08). Finally, being on Medicare Advantage was associated with lower likelihood of reporting cost-related nonadherence compared with traditional feefor-service Medicare (adjusted OR = 0.86; 95% CI = 0.80-0.92). CONCLUSIONS: Expanding the low-income subsidy and capping out-of-pocket drug expenditure can be effective policy options to reduce cost-sharing burden and cost-related nonadherence.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f11e0565dc6145db0d05ed38126853f8",
  "timestamp": "2025-05-15T03:26:54.541418"
}