{
  "id": 7518,
  "title": "Examining the Relationship Between Pediatric Behavioral Health and Parent Productivity Through a Parent-Reported Survey in the Time of COVID-19: Exploratory Study",
  "abstract": "Background: Pediatric behavioral health needs skyrocketed during the COVID-19 pandemic. Parents and caregivers lacked access to well-established tools to identify risk and protective factors while also experiencing decreased access to treatment options to meet their families' behavioral health needs. Objective: The aim of this study is to investigate the associations of known pediatric behavioral health risk factors and parents' reports of workplace productivity. Methods: A clinical research team at Brightline-a virtual, pediatric behavioral health solution-drew on standardized instruments to create a survey designed to understand pediatric behavioral health conditions, child stress, and family resilience and connection during the COVID-19 pandemic. Multivariable linear regression was used to characterize the relationship between these variables and parents' reports of workplace productivity. Results: Participants (N=361) completed the survey between October 2020 and November 2021. In the multivariable model, higher pediatric stress and time spent managing children's behavioral health needs were associated with greater productivity loss among working parents, whereas higher family connection was associated with lower productivity loss. COVID-19 diagnoses among parents and dependents, financial impact of COVID-19 on households, and family resilience were not associated with parents' workplace productivity. Conclusions: This survey captured child stress, family connection, and productivity as reported by parents and caregivers during the COVID-19 pandemic. Exploratory studies are the first step in understanding the relationship between these variables. The results from this study can empower parents by providing insights to help manage their child's behavioral health concerns and identify pediatric behavioral health services to aid working parents who are caregivers.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f12c25a446d299e7b4a4c50f8a0f4d1b",
  "timestamp": "2025-05-15T03:09:36.817322"
}