{
  "id": 8188,
  "title": "Revisiting endotracheal self-extubation in the surgical and trauma intensive care unit: Are they all fine?",
  "abstract": "Objectives: Endotracheal self-extubation (ESE) is a serious health care concern. We designed this study to test our hypothesis that not all patients with ESE are successful in spontaneous breathing and reintubation has negative impact on outcomes. Methods: Data on all 39 patients of ESE in our surgical and trauma intensive care unit (ICU) in 2012 were prospectively collected and retrospectively analyzed. Results: There were 42 episodes of ESE in 39 of 939 intubated patients (frequency, 4.0%), with 54% of events requiring reintubation. Pre-ESE positive end-expiratory pressure was higher and Pao(2)/fraction of inspired oxygen ratio was lower, and the post-ESE respiration rate was higher in the reintubated group. On univariate analysis, weaning and spontaneous breathing trial before ESE were favorable predictors for nonreintubation. Multivariate regression analysis demonstrated that agitation before ESE was an independent predictor of reintubation. The need for reintubation was associated with increased risk of pulmonary infectious complications, ventilator days, the need for tracheostomy, and ICU and hospital LOS. The financial costs for ventilator days and ICU rooms were significantly higher in patients with reintubation. Conclusion: Not all patients were fine after ESE. We have not decreased the frequency of ESE or improved outcomes if the patients were reintubated. The need for reintubation was not only associated with a high pulmonary complication rate but also prolonged duration on mechanical ventilation and hospital/ICU stay and increased the hospital costs. (C) 2015 Elsevier Inc. All rights reserved.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f12cb256400e673505b573e0c680c93c",
  "timestamp": "2025-05-15T03:16:17.396269"
}