{
  "id": 8628,
  "title": "Risk and protective factors related to children's symptoms of emotional difficulties and hyperactivity/inattention during the COVID-19-related lockdown in France: results from a community sample",
  "abstract": "Objective The COVID-19 epidemic has spread worldwide since December 2019. To contain it, preventive measures including social distancing, economic shutdown, and school closures were introduced, carrying the risk of mental health burden in adults and children. Although the knowledge base regarding children's response to trauma and adverse events in general has broadened, descriptions of their mental health during epidemics remain scarce. In particular, the role of family socioeconomic characteristics and parental mental health are poorly understood. Methods We assessed the correlates of children's emotional difficulties and symptoms of hyperactivity/inattention during the COVID-19 lockdown in a French community-based sample. Data came from 432 community-based parents (27-46 years, TEMPO cohort) and their children (mean age 6.8 +/- 4.1) interviewed online. Children's symptoms of emotional difficulties and hyperactivity/inattention were assessed using the parent-reported Strengths and Difficulties Questionnaire during the 5th week of home confinement. Family socioeconomic characteristics and parental mental health and substance use were assessed weekly during the first 5 weeks of home confinement. Data were analyzed using logistic regression models. Results 7.1% of children presented symptoms of emotional difficulties and 24.7% symptoms of hyperactivity/inattention. Family financial difficulties and parental symptoms of anxiety and depression, as well as children's sleeping difficulties and screen time, were associated with the presence of psychological difficulties. Conclusion Children's emotional and behavioural difficulties are associated with parental mental health and socioeconomic difficulties. In the unprecedented situation of the COVID-19 epidemic, parents and professionals involved in caring for children should pay special attention to their mental health needs.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f1384a327d529db0a9e264667ebe33f8",
  "timestamp": "2025-05-15T03:20:55.869207"
}