{
  "id": 6708,
  "title": "Voluntary carbon disclosure by Spanish companies: an empirical analysis",
  "abstract": "Purpose - This paper aims to identify and analyze the factors contributing to the decision of organizations to disclose carbon information, as well as its transparency level. Design/methodology/approach - The Tobit regression is used to analyze the results of the Spanish companies that were invited in 2012 to respond to the Carbon Disclosure Project (CDP) questionnaire. The results of this study are interpreted according to the legitimacy and stakeholder theories. Findings - The results show that the probability of carbon disclosure and its transparency level are explained by the influence of pressures from society, markets, shareholders and international interactions. In the Spanish case, the factors that have shown a stronger influence are the size of the company, financial risk, their listing in the IBEX35 and FT500 indexes and the ownership concentration. Originality/value - One of the main contributions of this study to the previous literature lies in the used research method. Thus, while previous studies analyze the factors that can determine whether companies disclose carbon information, this paper has also considered the quantification and differentiation of the effect of these factors on the probability of supplying this information, as well as obtaining a higher score in the CDP questionnaire, representing a higher transparency level in the information provided. For this objective, the usefulness of the Tobit regression is to be highlighted.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f138aadce74a0632df626e43c967e7c5",
  "timestamp": "2025-05-15T03:00:35.549886"
}