{
  "id": 2136,
  "title": "Exploring resource blessing hypothesis within the coffin of technological innovation and economic risk: Evidence from wavelet quantile regression",
  "abstract": "In contemporary times, the interrelationship between financial development and natural resources remains ambiguous in research findings. Some studies support the concept of a resource curse, while others confirm the idea of a resource blessing. Therefore, we clarify the resource blessing/curse hypothesis by considering the role of technological progress and economic risk. The study employed data spanning from 1985/q1 to 2020/q4. Given the non-linear distribution of the data, we employ innovative wavelet quantile regression. Unlike traditional quantile regression, wavelet quantile regression allows for identifying interrelationships between series across various quantiles and periods. Additionally, we utilized quantile ADF and quantile PP to assess the stationarity characteristics of the series, with quantile-on-quantile regression serving as a robustness check for wavelet quantile regression. The results of wavelet quantile regression indicate a significant positive impact of natural resources on financial development in the long-term, supporting the resource blessing hypothesis. Furthermore, empirical evidence reveals that both technological advancement and economic risk contribute significantly to sustained financial development over the long term. The findings of quantile-on-quantile regression align with the outcomes of wavelet quantile regression, reinforcing the robustness of the results. In light of these results, we put forth policy recommendations.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f151db503b2eec0441f8046ee97aa36b",
  "timestamp": "2025-05-15T02:11:40.578681"
}