{
  "id": 8602,
  "title": "Impact of COVID-19 pandemic on Moroccan sectoral stocks indices",
  "abstract": "In this paper, we make an original contribution by identifying the impact of COVID-19 on Moroccan sectoral stocks indices. For this purpose, we collected data of 22 sectors from the Casablanca stock exchange from January 2017 to December 2021 and investigated two regression models that included a dummy variable representing the onset of COVID-19. In addition, we examined performance measures (Sharp ratio and Treynor ratio) and risk measures (CVaR and Beta) of each individual sector before and during COVID-19. Furthermore, a GARCH model is applied to show conditional variance, aiming to emphasize the volatility of the selected stocks indices overall the chosen period. The results allowed us to divide sectors into two samples: the first one, referred to as sample 1, that was negatively impacted, and the second one, referred to as sample 2, that benefited from the pandemic of COVID-19. Further, conditional variance revealed that COVID-19 boosted, significantly but for a short period, the volatility of all sectors, even though the magnitude of the effect on volatility varies by sample and also by sector. Overall, we see COVID-19 as a crisis for some sectors and an opportunity for a new business transformation, as it is a period that results in significant improvement for some specific sectors. Furthermore, our results reflect the behavior of the sectors of an African emerging market during the COVID-19 outbreak, which is relevant for the formulation of strategies to ensure financial sustainability during future sanitary crises of this magnitude, for this type of economy. (C) 2022 The Authors. Published by Elsevier B.V. on behalf of African Institute of Mathematical Sciences / Next Einstein Initiative.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f1574462accd2d39f5541258e730634d",
  "timestamp": "2025-05-15T03:20:22.355525"
}