{
  "id": 7825,
  "title": "A model for disclosing the first trimester part of an integrated Down's syndrome screening test",
  "abstract": "This study was designed to evaluate a model for disclosing the first part of an integrated Down's syndrome (DS) test without affecting its low false-positive results. Parturient women underwent sequential DS-screening tests. They included nuchal translucency (NT) and biochemistry assessments in the first trimester and a mid-gestation triple test. Although screening tests results were given following each test, fetal karyotyping was performed by means of mid-gestation amniocentesis. The proposed approach for disclosure refers to either (a) cases picked by a statistical model (this is based on a logistic regression analysis and a receiver-operated curve that was set to a specificity of 100% of first-trimester markers pointing on at very high probability of aneuploidy) or (b) cases demonstrating a first trimester DS risk greater than or equal to1 : 40 (a threshold level at which the integrated test results will always be screen positive). The results of the sequential screening and pregnancy outcome were available for 372 normal and 22 chromosomal affected singletons. NT and pregnancy-associated placental protein A emerged as the most sensitive marker combination. The statistical model picked up seven of 22 abnormal cases (32%), and a first-trimester DS risk greater than or equal to1 : 40 was detected in 11 (50%) (there was an overlap of five cases). The combined strategy yields a 60% detection rate (13/22) of the affected pregnancies and without any increase in the false-positive results. This can be achieved immediately following the first part of the integrated DS test. This model obviates the ethical, clinical, and financial implications of further assessing about 60% of the affected pregnancies.",
  "year": 2004,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f15959bf81bae39a4aa2cdffc8585f46",
  "timestamp": "2025-05-15T03:12:36.415819"
}