{
  "id": 7149,
  "title": "The limits of discipline -: Ownership and hard budget constraints in the transition economies",
  "abstract": "The existing literature on soft budget constraints suggests that firms may be subsidized for political reasons or because of the creditors' desire to recover a part of the sunk cost invested in an earlier period. In all these models hard budget constraints are viewed as being, in principle, capable of inducing the necessary restructuring behaviour on the level of the firm. This paper argues that the imposition of financial discipline is not sufficient to remedy ownership and governance-related deficiencies of corporate performance. Using evidence from the post-communist transition economies, the paper shows that a policy of hard budget constraints cannot induce successful revenue restructuring, which requires entrepreneurial incentives inherent in certain ownership types (most notably, outside investors). The paper also shows that the policy of hard budget constraints falters when state firms, because of inferior revenue performance and less willingness to meet payment obligations, continue to pose a higher credit risk than privatized firms. The brunt of state firms' lower creditworthiness falls on state creditors. But the 'softness' of these creditors, while harmful in many ways, is not necessarily irrational, if it prevents the demise of firms that are in principle capable of successful restructuring through ownership changes. JEL classification: G32, P17, P27, P31.",
  "year": 2000,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f15ab6faeb73872a99638744226bb9a3",
  "timestamp": "2025-05-15T03:05:32.083136"
}