{
  "id": 7959,
  "title": "No heat, no eat: (Dis)entangling insecurities and their implications for health and well-being",
  "abstract": "This study explores the associations between energy poverty, food insecurity, and a set of outcomes-including the self-reported burden of chronic illness, physical disabilities, and mental health-among social-aid recipients across Israel. We highlight the socio-demographic characteristics and housing conditions of energy-poor households and analyze the association between energy poverty and health and well-being using multivariate regression models. Of 1390 aid-recipient respondents, more than 85% met the criteria for living in an energy-poor household, and almost all of them also struggled with food insecurity and were raised in poor house-holds as children. In addition, the severity of energy poverty was positively and significantly associated with the occurrence of diabetes, hypertension, and mental illness, and, as compared with energy-secure households, severely energy-poor households were more prone to forgo acquiring prescription medications, medical aid, or required health treatments due to financial hardships. These findings highlight the nuanced negotiation over necessities that aid-supported households make; despite being at greater risk of being sick, energy-poor house-holds are more likely to forgo buying medicines and seeking healthcare so as to pay the electricity bills. Hidden energy poverty, coupled with what might be hidden morbidity, may have significant implications for healthcare systems, and a climate-sensitive health policy at both the municipal and national levels is required to strengthen resilience among low-income households.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f1612308834077b68c53437aa70eb34e",
  "timestamp": "2025-05-15T03:13:30.746382"
}