{
  "id": 3492,
  "title": "Predictors of quality of life of patients with chronic obstructive pulmonary disease",
  "abstract": "Background/Aim. Chronic obstructive pulmonary disease (COPD) has a significant impact on quality of life of patients. We investigated which demographic and social characteristics can predict the global quality of life (QoL) of COPD patients. Methods. The patients (n = 288) were divided into three groups according to the stage of disease: Group I = stage 0 - at risk; Group II = Stages I and II; Group III = stages III and IV. The patients fulfilled a questionnaire related to the demographic and social characteristics and the validated multidimensional questionnaire - Serbian version of the St. George's Respiratory Questionnaire (SGRQ). The Student's t test, chi(2) test, ANOVA, univariate and multivariate logistic regression tests were used for statistical analyses. Results. In the group I, prevailed the men, employed persons, with a moderate financial status and no family history of COPD. In the group II dominated women, pensioners, with a moderate financial status, duration of illness up to five years, and no family history of COPD. In the group III prevailed women, unemployed persons, a moderate financial status, COPD duration up to 5 years and no family history of COPD. The predictors of the Symptoms score were grades of COPD and duration of the disease, and the predictors of Activity grades of COPD, sex, age and financial status. All variables were found to have a statistically significant relationship in the Impact score in the pre-analyses, were also significant in the univariate regression model. They were age, employement status, financial status and COPD duration. The same predictors that significantly contributed to the explanation of the Impact score, contributed to the explanation of the Total score on SGRQ. In the multivariate regression model, the predictors of the Activity score, Impacts score and Total score were the COPD grade and financial status; only the COPD grade contributed to the explanation of the Symptoms score. Conclusion. Financial status is the most important social factor, and the grade of COPD is the best disease-related predictor of QoL of COPD patients.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f167406c05003da82fe1bf60bb338a47",
  "timestamp": "2025-05-15T02:26:48.562743"
}