{
  "id": 5695,
  "title": "SPILL CONSEQUENCE ANALYSIS: A METHOD TO PRIORITIZE INTEGRITY EXCAVATIONS OF LIQUID PIPELINES",
  "abstract": "Corrosion and stress corrosion cracking (SCC) control programs are elements of pipeline integrity management. These programs often include in-line inspections (ILI's) to identify, characterize and size anomalies, followed by field excavations to repair defects, remediate coating failures, and establish tool sizing accuracy. The highest priority excavations target anomalies with the lowest predicted remaining strength or deepest flaws. In cases where loss of pipeline integrity is highly consequential, selection of additional excavation sites based on the risk of failure is warranted. As specified in Annex B of CSA Z662-07, the risk of failure combines probability (typically based on the predicted remaining life of known corrosion or cracking features) with an evaluation of consequence along the pipeline length. Consequence evaluation typically considers the impacts of health and safety, environmental, property damage, public disruption, service interruption and financial loss. A practical methodology for evaluating consequence for liquid pipelines was developed for the NPS 10 Alberta Products Pipeline (APPL) in Alberta, Canada. Comprising of three (3) parts, the methodology starts with an evaluation of spill volume along the pipeline based on valve closure times and pipeline inventory drawdown. Combined with soil absorption data and topography, the spill volumes are used to model spill areas along the pipeline. Finally, the spill areas are overlaid on a classification of land use along the pipeline to quantify the relative spill consequence. The land use classification developed for this analysis has commonalities with the definitions for High Consequence Areas (HCA) and Unusually Sensitive Areas (USA) within U.S. Code of Federal Regulations (49 CFR, Part 195). Prioritized segments of the pipeline with elevated consequence levels were identified and used with the probability of failure to calculate risk and prioritize sites for ILI excavation programs.",
  "year": 2010,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f171869981c5e0354cb3342459c9d811",
  "timestamp": "2025-05-15T02:50:21.318630"
}