{
  "id": 3933,
  "title": "Loan to value ratio and housing loan default - evidence from microdata in India",
  "abstract": "Purpose This study aims to investigate the factors that drive housing loan default in India based on unique micro-level data drawn from a public sector bank's credit files with a national presence in India. The authors address endogeneity in the loan to value ratio (LTV) while deciphering the drivers of default. Design/methodology/approach The study uses a probit regression approach to analyze the relationship between the probability of default and the explanatory variables. The authors introduce two instrumental variables to address the issue of endogeneity. The authors also add state-level demographic and several other control variables, including an indicator variable that captures the recent regulatory change. The authors' analysis is based on 102,327 housing loans originated by the bank between January 2001 and December 2017. Findings The authors find that addressing the endogeneity issue is essential to specify default drivers, especially LTV, correctly. The nature of employment, gender, socio-religious category and age have a distinct bearing on housing loan defaults. Apart from the LTV ratio, the other key determinants of default are the interest rate, frequency of repayment, prepayment options and the loan period. The findings suggest that the population classification of branch location plays a significant role in loan default. The authors find that an increase in per capita income and an increase in the number of employed people in the state, which reflects borrowers' ability to pay by borrowers, reduce the probability of default. The change in the regulatory classification of loan assets by the Reserve Bank of India did not bear the main results. Research limitations/implications The non-availability of the house price index in analyzing the default dynamics in the Indian housing finance market for the period covered under the study has constrained our analysis. The applicability of the equity theory of default, strategic default, borrowers' characteristics and personality traits are potential research areas in the Indian housing finance market. Practical implications The study's findings are expected to provide valuable inputs to the banks and the housing finance companies to explore and formulate appropriate strategic options in lending to this sector. It has highlighted various vistas of tailor-making housing loan product offerings by the commercial banks to ensure and steady and healthy growth of their loan portfolio. It has also highlighted the regulatory and policy underpinnings to ensure the healthy growth of the Indian housing finance market. Originality/value The study provides a fresh perspective on the default drivers in the Indian housing finance market based on micro-level data. In our analysis, the authors find clear evidence of endogeneity in LTV and argue that any attempts to decipher the default drivers of housing loans without addressing the issue of endogeneity may lead to faulty interpretation. Therefore, this study is unique in recognizing endogeneity and has gone deeper in identifying the default drivers in the Indian housing market not addressed by earlier papers on the Indian housing market. The authors also control for the regulatory changes in the Indian housing finance market and include state-level control variables like per capita GDP and the number of workers per thousand to capture the borrowers' ability to pay characteristics.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f172c45e7c1df7a8856d7207e1091c70",
  "timestamp": "2025-05-15T01:22:11.975903"
}