{
  "id": 6300,
  "title": "Risk factors for pre-diabetes and diabetes in adolescence and their variability by race and ethnicity",
  "abstract": "Adolescent risk factors for pre-diabetes and diabetes in young adulthood were examined in three minority groups and compared to those in non-Hispanic Whites. Retrospective cohort study with data on 8337 adolescent respondents from Add Health (1994-2008). Participants included 5131 non-Hispanic Whites, 1651 non-Hispanic Blacks, 1223 Hispanics, and 332 American Indians/ Alaska Natives. Diabetes was defined as: hemoglobin A1C >= 6.5%, glucose > 125 mg/ dl, self-reported diabetes, or self-reported diabetes medication use, in Wave 4 data. Pre-diabetes was defined as hemoglobin A1C >= 5.7%. Relative risk regression models were used to evaluate the association between risk factors and risk of diabetes and pre-diabetes, controlling for body mass index, sedentary and physical activity habits, fast food consumption, and parental education, parental diabetes status, and financial stability. 484 participants developed diabetes; 2878 developed pre-diabetes between 1994 and 2008. Pre-diabetes and diabetes were more prevalent in non-Hispanic Blacks (55% and 12%, respectively) than in American Indians/ Alaska Natives (43% and 11%), Hispanics (37% and 6%), and non-Hispanic Whites (27% and 3%). In all races, higher body mass index and parental diabetes were associated with higher risk of pre-diabetes and diabetes, while female sex was associated with lower risk of pre-diabetes. Efforts to reduce the risk of pre-diabetes and diabetes in adolescents should emphasize parental diabetes and BMI in all races, independent of physical activity, sedentary behaviors, or fast food consumption. Future interventions might be interested in targeting households, rather than individuals, to prevent pre-diabetes and diabetes in adolescents and young adults.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f1855cfc803ff9894b0c02e4c152bbb9",
  "timestamp": "2025-05-15T02:56:37.512182"
}