{
  "id": 8569,
  "title": "Trends in Alcoholic Hepatitis-related Hospitalizations, Financial Burden, and Mortality in the United States",
  "abstract": "Background:Alcoholic hepatitis (AH) is the most florid manifestation of alcoholic liver disease which accounts for significant morbidity, mortality, and financial burden. Aim of this study is to evaluate temporal trend of hospitalizations from AH and evaluate its financial impact.Methods:The National Inpatient Sample databases (from 2002 to 2010) which are collected as part of Healthcare Cost and Utilization Project by Agency for Healthcare Research and Quality were utilized. Individuals aged 21 years and older were included. The hospitalizations with primary diagnosis of AH were captured by ICD-9 codes. The national estimates of hospitalization were derived using sample weights provided by National Inpatient Sample. Simple linear regression method was used to assess trends in mortality and length of stay over time.Results:We observed the increased in total cases of AH-related hospitalization from 249,884 (0.66% of total admission in 2002) to 326,403 (0.83% of total admission in 2010). The significant increase in the total admission rate was attributable mainly to the rise in inpatient hospitalization for secondary diagnosis of AH (0.48% in 2002 to 0.67% in 2010). Most of the AH-related hospitalization were males. Hepatic encephalopathy was found to be the most common admitting diagnosis for individuals hospitalized with secondary diagnosis of AH (8.9% in 2002 and 8.6% in 2010). There was a significant decrease in inpatient mortality for primary diagnosis of AH from 10.07% (in 2002) to 5.76% (in 2010) (absolute risk reduction: 4.3%). Average cost of hospitalization related to primary diagnosis of AH was $27,124 and $46,264 in 2002 and 2010, respectively. After adjusting for inflation, the additional cost of each hospitalization seemed to increase by 40.7% in 2010 compared with 2002 (additional cost per hospitalization $11,044 in 2010 compared with 2002). Federal (Medicare) or state (Medicaid) supported health insurance program are the main primary expected payers for these AH hospitalizations (approximate to 25% to 29%). Despite increase in cost per hospitalization, length of stay for hospitalization due to primary diagnosis of AH was not observed to decrease substantially over time (6.7 d in 2002 to 6.1 d in 2010).Conclusions:AH-related hospitalization continued to increase during the study period, despite the decrease in the in-hospital mortality rate. Substantial increases in health care cost and utilization among hospitalized AH patients were observed.",
  "year": 2015,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f19e0d55b64b66aa786235a6ee090351",
  "timestamp": "2025-05-15T03:20:22.149529"
}