{
  "id": 901,
  "title": "Semantic Analysis and Image Processing-Jointly Driven Multimodal Deep Learning Framework for Smart Warning of Enterprise Financial Risk",
  "abstract": "Financial risk warning is a crucial technical issue for enterprises. Traditionally, it relied on modeling analysis of a single data type, which does not fully capture the diverse characteristics of financial risk activities. To address this, this paper introduces a multimodal deep learning framework driven by semantic analysis and image processing for intelligent warning of enterprise financial risks. Initially, natural language processing algorithms analyze textual data such as financial statements, news reports, and social media comments within the industry. Concurrently, two convolutional neural network models, M-CNN and M-RNN, extract features from images and chart data. These textual and visual feature representations are then fused to create a multimodal deep neural network framework. Extensive experimental evaluation and comparative analysis of the proposed framework were conducted. The results indicate that the financial risk rate of consumer fraud graph analysis varies significantly, displaying a fluctuating state with values ranging from 2.1% to 16.8%. Compared to other methods, the proposed approach demonstrates superior performance in financial risk warning tasks, with the risk rate increasing from 1.2% to 26.5% as it iterates from 1 to 6.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f1bfcd9bd27c4a4e37aa6e06891b06ab",
  "timestamp": "2025-05-15T01:56:17.603634"
}