{
  "id": 4059,
  "title": "Value at risk and the cross-section of hedge fund returns",
  "abstract": "Using two large hedge fund databases, this paper empirically tests the presence and significance of a cross-sectional relation between hedge fund returns and value at risk (VaR). The univariate and bivariate portfolio-level analyses as well as the fund-level regression results indicate a significantly positive relation between VaR and the cross-section of expected returns on live funds. During the period of January 1995 to December 2003, the live funds with high VaR outperform those with low VaR by an annual return difference of 9%. This risk-return tradeoff holds even after controlling for age, size, and liquidity factors. Furthermore, the risk profile of defunct funds is found to be different from that of live funds. The relation between downside risk and expected return is found to be negative for defunct funds because taking high risk by these funds can wipe out fund capital, and hence they become defunct. Meanwhile, voluntary closure makes some well performed funds with large assets and low risk fall into the defunct category. Hence, the risk-return relation for defunct funds is more complicated than what implies by survival. We demonstrate how to distinguish live funds from defunct funds on an ex ante basis. A trading rule based on buying the expected to live funds and selling the expected to disappear funds provides an annual profit of 8-10% depending on the investment horizons. (c) 2006 Elsevier B.V. All rights reserved.",
  "year": 2007,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f1c033bc4fb4ee19d9d9b8dcd00fafe5",
  "timestamp": "2025-05-15T01:23:27.323398"
}