{
  "id": 8719,
  "title": "A Multi-Site Study of Mental Disorders in the Mozambican Health Care System",
  "abstract": "In Mozambique, human and financial resources for public mental health services are extremely limited. Understanding the mental health needs of those seeking healthcare can inform efficient targeting of mental health services. We examined if the frequency of mental disorders in a health facility varied based on the level of specialization of such facility, from primary care without mental health specialists (PrCMH -), to those with mental health specialists (PrCMH +) and tertiary care (TerC), where both inpatient and outpatient mental health services are available. Participants were adults (convenience sample) seeking health or mental health services at six facilities (2 PrCMH + , 3 PrCMH -, and 1 TerC) in the cities of Maputo and Nampula in Mozambique. Mental disorders were assessed by the MINI International Neuropsychiatric Interview (MINI) 4.0.0. We compared the sociodemographic characteristics and MINI diagnoses across the three types of health facilities. Multiple logistic regression models determined the likelihood that a person seeking services at each type of facility would have any mental disorder, common mental disorders (CMD), severe mental disorders (SMD), substance use disorders (SUD), and moderate-to-high suicide risk, adjusting for sociodemographic factors. Of the 612 total participants, 52.6% (n = 322) were positive for at least one mental disorder: 37.1% were positive for CMD, 28.9% for SMD, 13.2% for SUD, and 10.5% had suicide risk. Presence of any mental disorder was highest in TerC (62.5%) and lowest in PrCMH - (48.4%). Adjusting for sociodemographic covariates, participants in PrCMH + were significantly more likely to have SMD (OR 1.85, 95%CI 1.10-3.11) and SUD (OR 2.79, 95%CI 1.31-5.94) than participants in PrCMH -; participants in TerC were more likely to have CMD (OR 1.70, 95%CI 1.01-2.87) and SUD (OR 2.57, 95%CI 1.14-5.79) than in PrCMH -. Suicide risk was the only condition that did not differ across facility types. As anticipated, people with mental disorders were more likely to be cared for at facilities with mental health specialists. However, our study detected in this convenience sample a remarkably high frequency of mental disorders across different types of facilities within the Mozambican healthcare system. These results, if confirmed in representative samples, suggest a need to increase mental health services at the primary care level.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f1e755f766ea7d9f4c929f2f70d6e677",
  "timestamp": "2025-05-15T03:21:56.579012"
}