{
  "id": 8702,
  "title": "Predictors of suicide attempts in male UK gamblers seeking residential treatment",
  "abstract": "Background: Disordered gambling can have serious negative consequences for the individual and those around them. Previous research has indicated that disordered gamblers are at an increased risk of suicidal thoughts, ideation and attempts. The current study sought to utilise data from a clinical sample to identify factors that are associated with prior suicide attempts. Methods: The sample included 621 patients entering a gambling-specific residential facility in the UK. A series of Chi-Square analyses and binary logistic regressions were run to identify clinical and sociodemographic variables associated with suicide attempts. Results: Of the 20 variables analysed using Chi-square statistics, five were significantly associated with the outcome variable (lifetime attempted suicide): loss of family relationships, loss of home, prior depression, prior suicidal thoughts, and medication use. Regression analysis showed that individuals were more likely to have reported suicide attempts if they had experienced loss of family relationships (1.65 times), loss of a home (1.87 times), prior depression (3.2 times), prior suicidal thoughts (6.14 times), or were taking medication (1.95 times) compared to those not reporting such individual events. Conclusions: Disordered gamblers are vulnerable to suicide; a number of factors have been identified in the current study that predict an increased likelihood of attempted suicide. The factors mainly revolve around loss: not financial loss, but rather disintegration of an individual's support network and deterioration in the individual's mental health. Findings indicate that isolation and negative affect associated with gambling are most influential in attempted suicide and should therefore be more strongly considered when creating and providing the legislative, educational and treatment environments for those experiencing gambling related harm.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f1e723b7d71c323d40d3c21fe0379b86",
  "timestamp": "2025-05-15T03:21:24.725037"
}