{
  "id": 8145,
  "title": "Mergers of Corporations and Causes of their Failure",
  "abstract": "This paper presents the results of research on the efficiency of mergers carried out in the Czech Republic. The aim of the research is to find out if the mergers have met the expectations of the management and the owners of the merging companies. The methodology of the solution is based on the determination of the success factors of mergers, the classification of the level achieved by the mergers, the separation of the successful ones from the unsuccessful ones, the identification of the problems and the formulation of the hypotheses. The object of the analysis is a representative sample of mergers of all those carried out in the Czech territory at the interval of 6 years. The effect of the company size on the success of mergers is also examined. The results were verified testing the hypotheses with empirical data. The tests performed with the data taken from financial statements of the recent 7 years have confirmed that failure of mergers can be expected in 55 %-68 % of the basic set, i.e. all mergers implemented in the monitored period, with 95 % reliability. Research has found no direct correlation between the size of the acquiring company and the success of the merger. The results of the questionnaire research lead us to the conclusion that the highest risk in merger implementation in the Czech conditions is maintaining of employees and customers; on the other hand, a merger that follows an acquisition and thus represents finishing of the transformation process of a company seems to be trouble free.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f1fdcc530a2fba9229aa79f47dd022c6",
  "timestamp": "2025-05-15T03:15:38.431755"
}