{
  "id": 2356,
  "title": "Financial Literacy, Fintech, and Risky Financial Investment in Urban Households-An Analysis Based on CHFS Data",
  "abstract": "In recent years, China's financial markets have come under increasing scrutiny. In order to explore the impact of financial literacy on urban household investment in the risk financial market, this paper used the micro-data of the 2019 China Household Finance Survey (CHFS) to start from two perspectives: household risk financial investment and the number of investment financial products, namely the breadth of investment. By constructing a probit model and ordered probit model for empirical analysis, the main conclusions are as follows. Benchmark regression results show that the improvement of financial literacy can significantly promote urban households to make risky financial investments and can significantly broaden the types of risky financial investments. Based on the IV-probit model and two-stage least square method, the endogeneity test using the economic and financial information attention degree as the instrumental variable showed that the model results were credible. The robustness test showed that the model results were basically correct. Furthermore, the mechanism analysis found that the use of fintech played an intermediary effect in the process of financial literacy affecting urban household risky financial investment and the amount of investment. This indicates that the improvement of financial literacy can improve the probability of using fintech, thus promoting the household risky financial investment behavior. Heterogeneity analysis based on risk attitude showed that financial literacy had a greater effect on the improvement in the risky financial investment behavior of risk-inclined families, followed by risk-neutral families, and had the least effect on risk-averse families. The research conclusions of this paper are of practical significance to solve the problems related to urban household financial market investment. Therefore, this paper puts forward some suggestions for reference, especially in terms of financial education and the digital economy.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f21f2f9d0b62ea9a48aefe7b2e1b11ed",
  "timestamp": "2025-05-15T02:14:19.678642"
}