{
  "id": 4230,
  "title": "Knowledge-based Networking Strategies: Characterisation and Case-Study Research",
  "abstract": "Purpose - In the current economy, it is impossible to individual firms to manage all the knowledge that is necessary to compete. Hence, networking relationships are an important asset, through which firms can develop their potentialities and access resources of other actors. However, the networking strategies that companies implement can vary, depending on the nature of their competitive conditions and on their specific goals. The paper analyses this topic, and particularly the relationship between networking strategies and knowledge strategies of companies. By developing and combining classifications previously proposed in the literature, the study aims to investigate the way companies set their networking strategies based on their capability and necessity to share knowledge with business partners (clients, suppliers, service providers, etc.). Design/methodology/approach - We develop past classifications to formulate a new taxonomy of knowledge-based networking strategies. Firstly, a classification of knowledge strategies is adopted that is based on two dimensions: the kind of technological knowledge and that of applicative knowledge on which a company's strategy is based. The combination of these dimensions leads to the definition of four knowledge strategies that can be associated with a particular networking strategy based on a varied degree of openness. The assumption that each of the four strategies requires a different way to network with other organizations is verified by means of a multiple case-study research involving ERP (Enterprise Resource Planning) software producers in Northern Italy. Originality/value - The attempt to combine a notion of knowledge strategy and that of networking strategy is substantially a novel approach. Although the literature has focused on these two aspects separately, and despite many studies has underlined the importance of knowledge transfers in inter-company networks, the combination of the two notions of knowledge strategy and knowledge networking has been little examined. Another original point of the paper is that, so far, the literature on knowledge networks has mainly focused on manufacturing industries. Less effort has been deployed in order to analyze services and in particular Knowledge Intensive Business Services (T-KIBS) like ERP producers. Practical implications - The outcomes of the study can be significant for both research and practice. The proposed classification can lead to a better understanding of the mechanisms underpinning inter-company networking. The findings show that networks are relevant in the investigated context, and different business strategies can be acted based of different recourse to external knowledge and capabilities. Different forms of collaboration and types of actors involved in the knowledge strategy of the firms, highlighting the firms' portfolio of choices when it comes to open their processes to the contribution of external partners, are described. This can provide managerial suggestions for companies not only in the analysed sector but also in other similar markets.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f22972feaed88215e7c56ab814147014",
  "timestamp": "2025-05-15T01:24:51.522625"
}