{
  "id": 2340,
  "title": "Prioritization of the IT Sector in the CEE Stock Markets: Investment Policies, Trends and Hidden Gems",
  "abstract": "Objective: The main purpose of the research is to show that the Central and Eastern European (CEE) market is an essential component of the global stock market. It displays similar patterns to developed countries, and there is a special emphasis on information technology. Research Design & Methods: The study is supported by various machine learning methods and economic analysis, in addition to using Python and R packages. In order to gain a more com- prehensive insight into the developments in CEE-region trends, the paper considers a compar- ative portfolio that focuses on German business, and there is a simulation of the incorporation of the Ukrainian IT sector. Constructing a business strategy in accordance with the Fama-French approach is boosted by incorporating neural networks. Findings: An examination of the performance of Czech, Polish, and Hungarian firms on the stock exchanges suggests that the investment policy oriented towards software is a reasonable choice. The results yielded by the IT companies unmistakably reveal the substantial benefits of their stock market ventures, as well as indicating the ongoing trend of investor reliance. The problem of IT business valuation is highlighted as one of the pitfalls of investing. Implications & Recommendations: The research proposes that maintaining a priority focus on IT, even in challenging circumstances, ensures steady regional advancement.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f23bc13251a6c9ff4df50695cbbc20ca",
  "timestamp": "2025-05-15T01:06:10.622869"
}