{
  "id": 7458,
  "title": "Intimate partner violence against women on the Colombia Ecuador border: a mixed-methods analysis of the liminal migrant experience",
  "abstract": "Background Intimate partner violence (IPV) has serious long-term health and psychological consequences and is highly prevalent in Latin America and among displaced populations. Liminality - the ambiguous in-between state of individuals completing a migratory journey - represents a state of legal, economic, and physical insecurity. Through the framework of liminality, this analysis seeks to understand the unique challenges faced by displaced Colombian women in Ecuador including their experience of IPV. Methods We performed a secondary analysis of 15 in-depth interviews and 319 longitudinal surveys, conducted on the border of Ecuador and Colombia, following a sequential explanatory mixed-methods design. We analysed interviews thematically and mapped the main themes onto complementary quantitative variables. We conducted logistic regression with identified risk and protective factors (measured at time 1) and recent IPV (measured at time 2), controlling for demographic characteristics and IPV at time 1. Results Our mixed-methods analysis revealed four main mechanisms by which displacement influenced the social and economic realities of Colombian women years after crossing the border, compounding their risk of IPV and limiting their ability to escape it. Lack of legal residence and documentation, violence experienced along life course and migratory continuums which increased their risk for later revictimisation, social isolation including loss of support networks and restricted mobility and lastly, financial stress. Conclusions This research highlights the critical importance of supporting the economic and social integration of migrants and refugees in host communities, as well as the need to carefully consider migration-related vulnerabilities in IPV prevention and response interventions. As the regional refugee crisis grows, policy makers must consider how the long-term marginalisation of refugee women contributes to their victimisation. This research also supports the idea of incorporating gender synchronised, transformative IPV prevention and response programmes into migration-related and poverty alleviation international development efforts.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f23bb776d4260e715b3004af4ee2683e",
  "timestamp": "2025-05-15T03:08:37.987514"
}