{
  "id": 7746,
  "title": "Mapping the Wave of Industry Digitalization by Co-Word Analysis: An Exploration of Four Disruptive Industries",
  "abstract": "This paper aims to identify global digital trends across industries and to map emerging business areas by co-word analysis. As the industrial landscape has become complex and dynamic due to the rapid pace of technological changes and digital transformation, identifying industrial trends can be critical for strategic planning and investment policy at the firm and regional level. For this purpose, the paper examines industry and technology profiles of top startups across four industries (i.e. education, finance, healthcare, manufacturing) using CrunchBase metadata for the period 2016-2018 and studies in which subsector early-stage firms bring digital technologies on a global level. In particular, we apply word co-occurrence analysis to reveal which subindustry and digital technology keywords/keyphrases appear together in startup company classification. We also use network analysis to visualize industry structure and to identify digitalization trends across sectors. The results obtained from the analysis show that gamification and personalization are emerging trends in the education sector. In the finance industry, digital technologies penetrate in a wide set of services such as financial transactions, payments, insurance, venture capital, stock exchange, asset and risk management. Moreover, the data analyses indicate that health diagnostics and elderly care areas are at the forefront of the healthcare industry digitalization. In the manufacturing sector, startup companies focus on automating industrial processes and creating smart interconnected manufacturing. Finally, we discuss the implications of the study for strategic planning and management.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f23def9d69aa45d3bcf01ad38df54176",
  "timestamp": "2025-05-15T03:11:38.559059"
}