{
  "id": 3702,
  "title": "ESG Risk Disclosure and Earning Timelines in the Mexican Capital Market Using Fuzzy Logic Regression",
  "abstract": "This study analyzes whether ESG risk information disclosures impact on earnings per share to confirm accounting conservatism in Mexico. The main objective is to determine if nonfinancial information disclosure, such as the ESG risk metric, affects the quality the earning timeliness in Mexico. This re-search was conducted during 2020 using a sample of 31 listed companies from the Mexican capital market. However, due to the volatility and uncertainty of the 2020 profits due to the COVID-19 pandemic crisis, an alternative method to estimate under this environment is necessary. Thus, to estimate the model, we applied the fuzzy regression. The results suggest that the impact of the market reaction (positive or negative returns) on the financial performance is ambiguous since there is a probability of 41% to obtain a positive or direct effect of market returns on financial performance. However, this probability rises to 100% if the firms increase the ESG risk to medium, high, or severe levels. On other words, the bad socially responsible news increases the impact of the market reaction to financial performance. These results suggest the presence of accounting conservatism in the Mexican capital market in 2020 due to the negative disclosures of ESG risks.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2421ca6c342715609117ea1ca3fda4c",
  "timestamp": "2025-05-15T02:29:00.206238"
}