{
  "id": 6839,
  "title": "Stressful Life Events Among New Mothers in Georgia: Variation by Race, Ethnicity and Nativity",
  "abstract": "Introduction Prior research has identified psychosocial stress as a risk factor for adverse maternal and infant outcomes for non-Hispanic Black and White women. However, whether psychosocial stress differs in its profile and association with preterm birth across diverse racial-ethnic-nativity groups in the Southeast remains unexamined. Both foreign-born and Hispanic women represent important proportions of new mothers in many Southeastern states. The objective of this paper is to describe the prevalence of categories of prenatal life events among Georgia mothers, the variation across race, ethnicity and nativity, and the association of prenatal stress with prevalence of preterm birth. Methods We calculated racial-ethnic-nativity specific prevalence of stress categories (emotional/traumatic, financial, or partner-related) with data from the 2012 to 2015 Georgia PRAMS. Maternal race, ethnicity, and nativity were reported on birth certificates. We used logistic regression to examine the association of different categories of stress with preterm birth. We conducted a bias analysis to estimate the potential impact of recall bias on observed associations. Results The sample was 20.2% foreign born overall, 15.5% non-Hispanic White, 45.7% non-Hispanic Black, 32.3% Hispanic, and 6.5% non-Hispanic other. The prevalence of specific stressors varied by race-ethnicity-nativity. Women who experienced financial stress had a slightly elevated prevalence of preterm birth (prevalence ratio: 1.32 (0.97-1.79)). Discussion Prenatal and preconception stress were common among women who gave birth between 2012 and 2015 in Georgia and may have implications for preterm and postpartum maternal mental health.",
  "year": 2020,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f261766d6ce249f4bd567aa7baaf5fad",
  "timestamp": "2025-05-15T03:02:07.488969"
}