{
  "id": 3037,
  "title": "Staying alive. Advancing medicinal chemistry by enhancing student responsibility for learning",
  "abstract": "Our Innovations in Teaching portfolio describes the most recent of our strategies to increase student interest in medicinal chemistry and in taking responsibility for learning. Course content was updated, rewritten and packaged in conversational packets containing a detailed lesson handout, learning objectives, lesson summary, and case study problems. Students read the handout packet and complete a comprehensive quiz over the material no later than 24 hours prior to class. Quiz questions are provided in the lesson packet to guide learning and the final quiz average counts for ten percent of the final grade, serving as the reward for preparedness. Lecturing over handout materials has been abandoned in favor of interactive discussion on areas of difficulty, active learning exercises and group presentations designed to stimulate analytical thinking and sharpen clinical problem solving skills. Students have been much better prepared for class discussion than in previous years, and responded positively to the quizzes and the interactive classroom. Performance, as measured by exam and final grades, did not suffer. This approach shows that small changes in content delivery, and the offering of relatively small academic rewards, can stimulate students to preparedness and enliven the classroom by allowing time for activities which foster higher level thinking and reinforce clinical relevance. In addition, interest in the subject matter is increased when classroom activities are more meaningful to the learners. Finally, professionalism will be optimized when the entire academic culture fosters student responsibility for learning.",
  "year": 2002,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f266daae3ee0d85618e9461f7297a8a8",
  "timestamp": "2025-05-15T01:12:43.149695"
}