{
  "id": 465,
  "title": "Risk Structure of Banks in Spain: Do BHCs Have Greater Cost of Debt?",
  "abstract": "Holding companies legally separate the assets and owners of a company creating a layer of liability protection. Theoretically, this feature lowers the risk attributable to holding companies, enabling them to offer lower-cost debts compared to stand-alone alternatives. However, no study has ever tested this hypothesis due to its technical and practical difficulties. Testing this hypothesis requires a separate classification of holding and stand-alone companies' outstanding debts to compare their risk spreads, controlling the bonds' risk ranking, maturities, and issue sizes. Further, a model is needed to make the callable bond spreads with unknown maturity dates comparable to non-callable bonds. This work is the first attempt to evaluate the risk spreads of stand-alone banks and bank holding companies in Spain by including all outstanding rated bonds offered by Spanish banks. In order to make callable bond spreads comparable with noncallable bond spreads, we obtained the option-adjusted spreads for the bonds using a lattice option-pricing model that treats the callable bonds as a bond with embedded options. We then regressed to option-adjusted spreads on control variables and ownership structure dummy to see if there exists a statistically and economically significant coefficient for the introduced dummy variable. We found that bank-holding company bonds have higher risk spreads compared to the stand-alone alternatives in Spain. This may be attributable to the characteristics of holding companies that introduce other risks that offset the gains obtained from the added layer of liability protection.",
  "year": 2023,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f26f00f653312df8031720df84aa1052",
  "timestamp": "2025-05-15T01:32:30.161341"
}