{
  "id": 4542,
  "title": "The Effect of Financial Incentives on Patient Decisions to Undergo Low-value Head Computed Tomography Scans",
  "abstract": "Background Excessive diagnostic testing and defensive medicine contribute to billions of dollars in avoidable costs in the United States annually. Our objective was to determine the influence of financial incentives, accompanied with information regarding test risk and benefit, on patient preference for diagnostic testing. Methods We conducted a cross-sectional survey of patients at the University of Michigan emergency department (ED). Each participant was presented with a hypothetical scenario involving an ED visit following minor traumatic brain injury. Participants were given information regarding potential benefit (detecting brain hemorrhage) and risk (developing cancer) of head computed tomography scan, as well as an incentive of $0 or $100 to forego testing. We used 0.1 and 1% for test benefit and risk, and values for risk, benefit, and financial incentive varied across participants. Our primary outcome was patient preference to undergo testing. We also collected demographic and numeracy information. We then used logistic regression to estimate odds ratios (ORs), which were adjusted for multiple potential confounders. Our sample size was designed to find at least 300 events (preference for testing) to allow for inclusion of up to 30 covariates in fully adjusted models. We had 85% to 90% power to detect a 10% absolute difference in testing rate across groups, assuming a 95% significance level. Results We surveyed 913 patients. Increasing test benefit from 0.1% to 1% significantly increased test acceptance (adjusted OR [AOR] = 1.6, 95% confidence interval [CI] = 1.2 to 2.1) and increasing test risk from 0.1% to 1% significantly decreased test acceptance (AOR = 0.70, 95% CI = 0.52 to 0.93). Finally, a $100 incentive to forego low-value testing significantly reduced test acceptance (AOR = 0.6; 95% CI = 0.4 to 0.8). Conclusions Providing financial incentives to forego testing significantly decreased patient preference for testing, even when accounting for test benefit and risk. This work is preliminary and hypothetical and requires confirmation in larger patient cohorts facing these actual decisions.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f27cdabc8529ea49db5ce13356848ce3",
  "timestamp": "2025-05-15T02:38:20.408552"
}