{
  "id": 400,
  "title": "Deep reinforcement learning for pairs trading: Evidence from China black series futures",
  "abstract": "Pair trading is one of the main methods of statistical arbitrage, mainly by taking advantage of the temporary price anomalies between related financial products with long-term equilibrium relationships to obtain arbitrage opportunities. In this paper, based on the co-integration method for the selection of allotment, the deep reinforcement learning method is integrated. The deep reinforcement learning method establishes an autonomous learning model and develops paired trading rules under different cycles. At the same time, the deep neural network model is used to implement the learning and training algorithm. This paper uses the data of Shanghai Commodity Exchange and Dalian Commodity Exchange on black futures, and the period is from January 2, 2014 to December 31, 2021. Three different periods were set for five models, namely simple threshold method (ST), simple threshold method based on pairwise cointegration (CA -ST), simple threshold method based on tripartite Cointegration (CA -ST -ALL), deep reinforcement learning method (DRL), and Deep reinforcement learning method based on pairwise cointegration (CADRL), and economic indicators were compared. The final results show that, combining the results of the three time periods, the deep reinforcement learning method based on pairwise cointegration performs better regarding return and risk control, validating the feasibility of deep reinforcement learning in China 's future market.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f29363231e89b9b2fb6524d41350d11c",
  "timestamp": "2025-05-15T01:50:14.100979"
}