{
  "id": 1496,
  "title": "Principles based accounting standards, audit fees and going concern: evidence using advanced machine learning",
  "abstract": "PurposeThe current study uses an advanced machine learning method and aims to investigate whether auditors perceive financial statements that are principles-based as less risky. More specifically, this study aims to explore the association between principles-based accounting standards and audit pricing and between principles-based accounting standards and the likelihood of receiving a going concern opinion.Design/methodology/approachThe study uses an advanced machine-learning method to understand the role of principles-based accounting standards in predicting audit fees and going concern opinion. The study also uses multiple regression models defining audit fees and the probability of receiving going concern opinion. The analyses are complemented by additional tests such as economic significance, firm fixed effects, propensity score matching, entropy balancing, change analysis, yearly regression results and controlling for managerial risk-taking incentives and governance variables.FindingsThe paper provides empirical evidence that auditors charge less audit fees to clients whose financial statements are more principles-based. The finding suggests that auditors perceive financial statements that are principles-based less risky. The study also provides evidence that the probability of receiving a going-concern opinion reduces as firms rely more on principles-based standards. The finding further suggests that auditors discount the financial numbers supplied by the managers using rules-based standards. The study also reveals that the degree of reliance by a US firm on principles-based accounting standards has a negative impact on accounting conservatism, the risk of financial statement misstatement, accruals and the difficulty in predicting future earnings. This suggests potential mechanisms through which principles-based accounting standards influence auditors' risk assessments.Research limitations/implicationsThe authors recognize the limitation of this study regarding the sample period. Prior studies compare rules vs principles-based standards by focusing on the differences between US generally accepted accounting principles (GAAP) and international financial reporting standards (IFRS) or pre- and post-IFRS adoption, which raises questions about differences in cross-country settings and institutional environment and other confounding factors such as transition costs. This study addresses these issues by comparing rules vs principles-based standards within the US GAAP setting. However, this limits the sample period to the year 2006 because the measure of the relative extent to which a US firm is reliant upon principles-based standards is available until 2006.Practical implicationsThe study has major public policy suggestions as it responds to the call by Jay Clayton and Mary Jo White, the former Chairs of the US Securities and Exchange Commission (SEC), to pursue high-quality, globally accepted accounting standards to ensure that investors continue to receive clear and reliable financial information globally. The study also recognizes the notable public policy implications, particularly in light of the current Chair of the International Accounting Standards Board (IASB) Andreas Barckow's recent public statement, which emphasizes the importance of principles-based standards and their ability to address sustainability concerns, including emerging risks such as climate change.Originality/valueThe study has major public policy suggestions because it demonstrates the value of principles-based standards. The study responds to the call by Jay Clayton and Mary Jo White, the former Chairs of the US SEC, to pursue high-quality, globally accepted accounting standards to ensure that investors continue to receive clear and reliable financial information as business transactions and investor needs continue to evolve globally. The study also recognizes the notable public policy implications, particularly in light of the current Chair of the IASB Andreas Barckow's recent public statement, which emphasizes the importance of principles-based standards and their ability to address sustainability concerns, including emerging risks like climate change. The study fills the gap in the literature that auditors perceive principles-based financial statements as less risky and further expands the literature by providing empirical evidence that the likelihood of receiving a going concern opinion is increasing in the degree of rules-based standards.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f29a124ccff8089c2e333ab4f587a8d8",
  "timestamp": "2025-05-15T02:03:39.815669"
}