{
  "id": 3273,
  "title": "Sector-specific calendar anomalies in the US equity market",
  "abstract": "While previous studies have predominantly examined market-wide calendar anomalies, they have overlooked the seasonal patterns in each sector. This study bridges this gap by identifying sector-specific calendar anomalies within the US equity market. Using the longest available data (January 1999-December 2023) on sectoral exchange-traded funds (ETFs) without overlapping constituents, we statistically estimate significant positive and negative month-of-the-year effects across nine sectors as well as the S&P500. We present a comprehensive analysis of which months exhibit statistically significant and persistent calendar anomalies within individual sectors using two sample periods. Where necessary, we capture volatility clustering in a number of ETFs to improve the efficiency of our estimators. We also check the stability of the estimated models to reinforce the generalizability of our findings. Inter alia, the findings suggest that eight out of nine sectoral ETFs consistently yield positive returns in April and/or November and/or December. In both sample periods, none of the ten ETFs (including SPY) exhibited a significant positive or negative calendar anomaly in the muted months of March, May, June, August, September, and October. This study offers investment strategists useful insights for portfolio rebalancing, allowing them to capitalize on the most likely seasonal patterns affecting equity returns in specific sectors.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2ac6aabbc22e636dbcbd9ada8573184",
  "timestamp": "2025-05-15T01:15:26.156474"
}