{
  "id": 6205,
  "title": "Tail risk contagion and multiscale spillovers in the green finance index and large US technology stocks",
  "abstract": "Our purpose is to check the dynamic asymmetric volatility connectedness among the Green Finance Index and six large US technology stocks. The QVAR connectedness framework, the quantile Granger causality test, the TVPVAR frequency connectedness framework, and the quantile-on-quantile regression (QQR) function were employed to measure the cross-frequency and quantile risk dependencies among these indices. The findings show that: (1) the volatility connectedness effect is higher at extreme tails. In addition, the dynamic spillover between the Green financial index and large US technology stocks is strengthened during bullish market conditions. (2). Net risk spillover characteristics across markets show cyclicality and heterogeneity. The S&P 500 ESG index and Microsoft are the dominant sources of risk. In contrast, the S&P Green Bond Index and Apple act as net recipients of spillovers. (3). Connectedness networks across quartiles exhibit asymmetric behavior. (4). When considering all quartiles, there was a significant Granger causality between the Green Finance Index and major US technology firms. (5). The results of frequency spillovers indicate that long-term frequency spillovers predominate over short-term frequency spillover. The S&P 500 ESG Index contributed risk across frequencies, while green bonds acted as a receiver of risk across frequencies. (6) Utilising the multivariate QQR method, we find the impact of the green finance index on US technology stocks risk exhibited significant non-linear and asymmetric characteristics, demonstrating pronounced cross-quantile heterogeneity. Our empirical findings held practical significance for heterogeneous market participants concerned with the risks associated with green finance and hightech assets across different investment horizons and market conditions.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2b84f2f9d93fb1feb5d8a9028ee50af",
  "timestamp": "2025-05-15T02:55:44.647318"
}