{
  "id": 6330,
  "title": "Seroprevalence and risk factors of infectious bovine rhinotracheitis in cattle in Gharbia governorate, Egypt: A comparative study of traditional and commercial production systems",
  "abstract": "Background: Infectious bovine rhinotracheitis (IBR) is a global contagious respiratory disease of ruminants caused by Bovine Herpes virus-1 (BoHV-1). It causes substantial financial losses in the dairy industry worldwide and is considered one of the most important causative agents of abortion and reproductive problems in dairy cattle. Aim: This study aimed to estimate the seroprevalence of IBR and the related risk factors in the dairy population in Methods: A cross-sectional study was conducted to investigate the seroprevalence and associated risk factors of IBR in bovine dairy herds in Qutur district, Gharbia governorate, Egypt from March 2023 to February 2024. A total of 12 smallholder farms and six commercial dairy farms that did not use vaccination protocol against BoHV-1 were randomly selected. Serum samples (n = 400) were collected from 360 cattle and 40 Italian buffaloes and were subjected to evaluation of the serological status of BoHV-1 using indirect ELISA. A multivariate logistic regression model was implemented to evaluate the strength of the risk factors associated with the infection. Results: The overall seroprevalence of IBR was 22.5% (95% CI: 18.5%-26.9%). The prevalence of IBR in animals reared under traditional and commercial systems was 28.04% and 21.06%, respectively. The multivariate logistic regression revealed that the risk of infection with IBR in winter months was significantly higher than in autumn [OR = 5.9, CI 95%: 2.22-16.16]. The seroprevalence of IBR was higher in weaned and yearling calves than in adult cattle (p-value = 0.000). The risk of exposure to IBR infection was higher in free stall houses than in tie stall houses [OR = 3.7, CI 95%: 1.11-12.35]. The risk of seropositivity to IBR was significantly higher in animals with a history of recent respiratory manifestation than those without a history of recent respiratory problems (p-value = 0.000). Conclusion: This research study revealed that IBR is prevalent among dairy cattle reared under both production systems in the Gharbia governorate. Introducing an appropriate vaccination protocol becomes inevitable to protect our dairy industries from potential economic losses due to this disease.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2bc00caf6b9a504b7001a98b8ea94cf",
  "timestamp": "2025-05-15T02:57:07.684265"
}