{
  "id": 8192,
  "title": "Differences in Sexually Transmitted Infections between the Precrisis Period (2000-2007) and the Crisis Period (2008-2014) in Granada, Spain",
  "abstract": "Objective: To analyze the difference in the prevalence of sexually transmitted infections (STIs) between two time periods (2000-2007 and 2008-2014, with the latter period characterized by the economic crisis), as well as determine differences in sociodemographic factors, clinical care, and risk indicators. Methods: This was a retrospective, observational, and analytical study, reviewing 1437 medical records of subjects attending a specialized center in the province of Granada (Spain) for consultation associated with the presence or suspicion of an STI between 2000-2014. Data were collected on variables relating to the research objective. A descriptive and bivariate statistical analysis was performed by multiple logistic regression. Results: In the analysis comparing the presence of STIs between the crisis and non-crisis periods, the percentage of positive diagnoses reached 56.6% compared to 43.4% negative diagnoses during the non-crisis period, while the percentages were 75.2% and 24.8%, respectively, during the crisis period. This difference was statistically significant (p < 0.001) with an odds ratio (OR) of 2.21 after adjusting for age, sex, days since last unprotected sexual intercourse, and partners in the last year. Conclusions: There are significant differences in the prevalence of STIs between the study periods, which is consistent with the reports of some authors regarding the effect of the financial crisis on these conditions; however, it is worth considering other aspects that might explain the differences.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2c767944e31f530dc2d911becea96bb",
  "timestamp": "2025-05-15T03:16:17.403580"
}