{
  "id": 108,
  "title": "RETRACTED: Empirical Analysis of Enterprise Financial Management Risk Prediction in View of Associative Memory Neural Network (Retracted Article)",
  "abstract": "Enterprise financial analysis has a far-reaching impact on modern enterprise management decision-making and plays a role that cannot be ignored. Financial status is related to the life and death of an enterprise and is the lifeline of an enterprise. Fast and efficient financial analysis can provide reliable and accurate decision-making information support for enterprise investors, operators, creditors, and other organizations and individuals to understand and evaluate the enterprise status and future development potential. With the development of intelligent methods such as associative memory neural network, the research of financial analysis decision support based on artificial intelligence has been paid more and more attention by academia and management, and has made new progress. Efficient and accurate financial risk prediction can help enterprises predict the possible financial risks in the future earlier, facilitate the early detection of problems, and take effective measures to avoid risks or minimize losses. However, most of the existing mature financial risk prediction studies are based on balanced data sets. The research on the classification of unbalanced data sets is not mature and perfect and needs to be further studied. Generally speaking, this paper mainly adopts the research method of cross integration of various disciplines and organically integrates the key theories, methods, and technologies such as default risk management theory, financial index analysis theory, data mining principle, prediction and decision theory, computer technology, multiclassifier integration technology, a variety of enterprise financial risk early warning technology and statistical sampling, carrying out systematic research on enterprise financial risk prediction. This review constructs the enterprise financial risk prediction method system based on heterogeneous data mining technology, mainly including data preprocessing layer, improved nearest neighbor delta increment layer, heterogeneous nearest neighbor extraction layer, and case-based reasoning prediction layer, so as to improve the traditional financial risk prediction method and obtain a new risk classification prediction model. The case-based method has some significant advantages in risk prediction performance, and it also helps to reduce the probability of financial risk.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2c8e04884872ad6db4a3556b41416f4",
  "timestamp": "2025-05-15T01:46:39.629087"
}