{
  "id": 6776,
  "title": "Pleiotropic genes for metabolic syndrome and inflammation",
  "abstract": "Metabolic syndrome (MetS) has become a health and financial burden worldwide. The MetS definition captures clustering of risk factors that predict higher risk for diabetes mellitus and cardiovascular disease. Our study hypothesis is that additional to genes influencing individual MetS risk factors, genetic variants exist that influence MetS and inflammatory markers forming a predisposing MetS genetic network. To test this hypothesis a staged approach was undertaken. (a) We analyzed 17 metabolic and inflammatory traits in more than 85,500 participants from 14 large epidemiological studies within the Cross Consortia Pleiotropy Group. Individuals classified with MetS (NCEP definition), versus those without, showed on average significantly different levels for most inflammatory markers studied. (b) Paired average correlations between 8 metabolic traits and 9 inflammatory markers from the same studies as above, estimated with two methods, and factor analyses on large simulated data, helped in identifying 8 combinations of traits for follow-up in meta-analyses, out of 130,305 possible combinations between metabolic traits and inflammatory markers studied. (c) We performed correlated meta-analyses for 8 metabolic traits and 6 inflammatory markers by using existing GWAS published genetic summary results, with about 2.5 million SNPs from twelve predominantly largest GWAS consortia. These analyses yielded 130 unique SNPs/genes with pleiotropic associations (a SNP/gene associating at least one metabolic trait and one inflammatory marker). Of them twenty-five variants (seven loci newly reported) are proposed as MetS candidates. They map to genes MACF1, KIAA0754, GCKR, GRB14, COBLL1, LOC646736-IRS1, SLC39A8, NELFE, SKIV2L, STK19, TFAP2B, BAZ1B, BCL7B, TBL2, MLXIPL, LPL, TRIB1, ATXN2, HECTD4, PTPN11, ZNF664, PDXDC1, FTO, MC4R and TOMM40. Based on large data evidence, we conclude that inflammation is a feature of MetS and several gene variants show pleiotropic genetic associations across phenotypes and might explain a part of MetS correlated genetic architecture. These findings warrant further functional investigation. (C) 2014 Elsevier Inc. All rights reserved.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2cad1b7694d1a4d8233a3742fd4980f",
  "timestamp": "2025-05-15T03:01:31.374313"
}