{
  "id": 4607,
  "title": "A machine learning approach to determine the risk factors for fall in multiple sclerosis",
  "abstract": "BackgroundFalls in multiple sclerosis can result in numerous problems, including injuries and functional loss. Therefore, determining the factors contributing to falls in people with Multiple Sclerosis (PwMS) is crucial. This study aims to investigate the contributing factors to falls in multiple sclerosis using a machine learning approach.MethodsThis cross-sectional study was conducted with 253 PwMS admitted to the outpatient clinic of a university hospital between February and August 2023. A sociodemographic data collection form, Fall Efficacy Scale (FES-I), Berg Balance Scale (BBS), Fatigue Severity Scale (FSS), Expanded Disability Status Scale (EDSS), Multiple Sclerosis Impact Scale (MSIS-29), and Timed 25 Foot Walk Test (T25-FW) were used for data collection. Gradient-boosting algorithms were employed to predict the important variables for falls in PwMS. The XGBoost algorithm emerged as the best performed model in this study.ResultsMost of the participants (70.0%) were female, with a mean age of 40.44 +/- 10.88 years. Among the participants, 40.7% reported a fall history in the last year. The area under the curve value of the model was 0.713. Risk factors of falls in PwMS included MSIS-29 (0.424), EDSS (0.406), marital status (0.297), education level (0.240), disease duration (0.185), age (0.130), family type (0.119), smoking (0.031), income level (0.031), and regular exercise habit (0.026).ConclusionsIn this study, smoking and regular exercise were the modifiable factors contributing to falls in PwMS. We recommend that clinicians facilitate the modification of these factors in PwMS. Age and disease duration were non-modifiable factors. These should be considered as risk increasing factors and used to identify PwMS at risk. Interventions aimed at reducing MSIS-29 and EDSS scores will help to prevent falls in PwMS. Education of individuals to increase knowledge and awareness is recommended. Financial support policies for those with low income will help to reduce the risk of falls.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2cdf0a15652b84f53e5db253b221ac6",
  "timestamp": "2025-05-15T02:38:56.442624"
}