{
  "id": 136,
  "title": "Risk Analysis of Bankruptcy in the US Healthcare Industries Based on Financial Ratios: A Machine Learning Analysis",
  "abstract": "The prediction of bankruptcy risk poses a formidable challenge in the fields of economics and finance, particularly within the healthcare industry, where it carries significant economic implications. The burgeoning field of healthcare electronic commerce, continuously evolving through technological advancements and changing regulations, introduces additional layers of complexity. We collected financial data from 1265 U.S. healthcare industries to predict bankruptcy based on 40 financial ratios using multi-class classification machine learning models across various industry subsectors and market capitalizations. The exceptionally high post-tuning accuracy rates, exceeding 90%, along with high-performance metrics solidified the robustness and exceptional predictive capability of the gradient boosting model in bankruptcy prediction. The results also demonstrate the power and sensitivity of financial ratios in predicting bankruptcy based on financial ratios. The Altman models highlight the return on investment (ROI) as the most important parameter for predicting bankruptcy risk in healthcare industries. The Ohlson model identifies return on assets (ROA) as an important ratio specifically for predicting bankruptcy risk within industry subsectors. Furthermore, it underscores the significance of both ROA and the enterprise value to earnings before interest and taxes (EV/EBIT) ratios as important parameters for predicting bankruptcy based on market capitalization. Recognizing these ratios enables proactive decision making that enhances resilience. Our findings contribute to informed risk management strategies, allowing for better management of healthcare industries in crises like those experienced in 2022 and even on a global scale.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2d87762cc8a3348fdc4c1db8717ec6b",
  "timestamp": "2025-05-15T01:47:14.091420"
}