{
  "id": 6430,
  "title": "Risk for Coerced Sex Among Female Youth in Ghana: Roles of Family Context, School Enrollment And Relationship Experience",
  "abstract": "CONTEXT: A better understanding is needed of the variables that may influence the risk of experiencing coerced sex among adolescent females in Sub-Saharan Africa. METHODS: Data were collected from 700 female respondents who were interviewed in 2010 and 2012 waves of a longitudinal study of behavioral risk for HIV infection among youth aged 13-14 or 18-19 and living in two towns in southeastern Ghana. A series of logistic regression models examined the influences of household composition and wealth, four family process variables (behavioral control, relationship quality, financial support, conflict), school enrollment and relationship experience on females' risk of experiencing coerced sex. RESULTS: Eighteen percent of respondents reported having experienced coerced sex prior to Wave 1, and 13% experienced it between Waves 1 and 2. In both cross-sectional and prospective models, the variable with the strongest association with having experienced coerced sex was having ever had a boyfriend (fully adjusted odds ratios, 4.5 and 2.6, respectively). In cross-sectional analyses, parental behavioral control was negatively associated with risk for coerced sex, while parental conflict was positively associated; these associations were not significant in the prospective analyses. Having a boyfriend appears to be the primary predictor of coerced sex among young females, beyond any influence of family, school or other household variables. CONCLUSIONS: More research is needed to understand the context of females' relationships with boyfriends in an effort to reduce the risk of sexual coercion and to promote the prevention of sexual violence perpetrated by males within these relationships.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2d9952c1353060c5265a9023ccabbd2",
  "timestamp": "2025-05-15T02:58:05.650818"
}