{
  "id": 9237,
  "title": "STRESSED CAREGIVERS. AN OBSERVATIONAL STUDY IN A REHABILITATION CARE HOME IN WESTERN SICILY",
  "abstract": "Introduction: Caregiver is the person who takes care of the patient from the practical point of view, helping him in managing the disease and carrying out daily activities, but also supporting him on an emotional level. Caregiver burnout is a state of physical, emotional, and mental exhaustion that may be accompanied by a change in attitude from positive and caring to negative and unconcerned. The aim of the study was to understand what factors were associated with having panic attacks or crying crises in the caregivers of our study population. Materials and methods: The study design is observational. An anonymous questionnaire was administered to caregivers of the patients of a hospital for the intensive post-acute rehabilitation from April 2016 to December 2018. The statistical significance level chosen for the entire analysis was 0.05. The covariates to be included were selected using a stepwise backward selection process, with a univariate p-value <0.25 as the main criterion. Results are expressed as adjusted Odds Ratio (aOR) with 95% Confidence Intervals (CI). Results: The sample consists of 302 caregivers (60.93% was females and 39.07% was males). The mean age of the sample is 53.42 years old (SD +/- 12.19). The multivariable logistic regression model shows that the risk to have panic or crying crisis is significantly associated with the following indipendent variables: female gender (aOR 27.06); living with the patient (aOR 4.38); had claimed that the problems related to the illness of their family member is a source of stress (aOR 23.54), smoking cigarettes (aOR 14.68); had claimed that taking care of their client affected their personal financial statement/career (aOR 5.95), having free time (aOR 7.68). Conclusions: In our study we found a greater probability of having panic attacks or crying crises in female subjects, smokers, who think they have sacrificed their careers to take care of the person they follow from a welfare point of view. Certainly in the light of what has emerged it is necessary to dedicate and pay close attention to the psychological and social aspects of the caregiver.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2e77d7c6cae7ebc7b131c28668302b0",
  "timestamp": "2025-05-15T03:26:54.561107"
}