{
  "id": 7630,
  "title": "Dynamic contributions of socioeconomic status to mental health with the resettlement process among refugees",
  "abstract": "Socioeconomic status (SES) is shown to be associated with refugees' mental health, but few studies have considered that these associations may vary over time. This study aimed to examine the dynamic contributions of SES to refugees' mental health during resettlement. We used five waves of data from a cohort study in Australia; 2399 refugees completed the interview in Wave 1, and the remaining waves had 2009, 1894, 1929, and 1881 participants, respectively. SES, high risk of severe mental illness (HR-SMI), and post-traumatic stress disorder (PTSD) were assessed in each wave. Weighted multilevel regression models were performed, and analyses were stratified by sex. For both sexes, financial hardships were consistently positively associated with HR-SMI and PTSD across all five waves. However, time or sex differences were more pronounced for associations between other SES factors and mental health. For males, there were negative associations of current paid jobs with HR-SMI and PTSD in Waves 3-5. For females, the current paid job was negatively associated with HR-SMI only in Wave 5. Our findings highlight the dynamic associations and sex differences between SES and refugees' mental health. We recommend interventions focusing on increasing employment opportunities, particularly for male refugees in the later resettlement stages.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2eaa9197721d557920306db2410fd09",
  "timestamp": "2025-05-15T03:10:33.010723"
}