{
  "id": 5009,
  "title": "Higher complication and readmission rates after total knee arthroplasty with discharge to inpatient facility vs. home: a propensity score matched analysis",
  "abstract": "IntroductionThe purpose of this retrospective cohort study was to assess differences in complication rates, early readmission rates, and reasons for readmission following TKA based on discharge destination. Secondarily, we aimed to identify independent risk factors for developing any adverse event (AAE) in the 30-day postoperative period. MethodsThe American College of Surgeons (ACS) National Surgical Quality Improvement Program (NSQIP) was filtered using current procedural terminology (CPT) codes to identify patients undergoing TKA from 2015 to 2020. Patients were divided into three cohorts based on discharge destination: home, skilled nursing facility (SNF), or inpatient rehabilitation facility (IRF). Propensity score matching was used to account for confounding variables. Statistical analysis was conducted using one-way analysis of variance (ANOVA), Chi-square tests, and multivariable logistic regression. Results352,824 patients were initially identified with 303,375 discharged home, 31,635 discharged to SNF, and 17,814 discharged to IRF. Following propensity score matching, there were 5,000 patients in each cohort. Regarding postoperative complications, the home cohort had significantly a lower readmission rate (p = 0.01) and rate of any adverse event (p < 0.001) when compared to the IRF and SNF cohorts. The IRF cohort had a significantly higher rate of AAE than the SNF cohort or the home cohort. On multivariable analysis, increasing age, increasing BMI, increasing length of hospital stay, male sex, American Society of Anesthesiologists (ASA) classification four, and history of COPD were all found to be independent risk factors for developing AAE. ConclusionsThis study demonstrates that patients who are discharged to a rehabilitation facility or SNF following TKA experienced significantly higher rates of readmission and postoperative complications than patients discharged home, even after controlling for baseline demographic differences and comorbidities. Given the high financial burden associated with these facilities, it is important for physicians to consider these potential impacts on outcomes when determining patient disposition following TKA.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2ebd0b513d5a0e063eaef3373f2c5ee",
  "timestamp": "2025-05-15T02:43:06.888457"
}