{
  "id": 4621,
  "title": "Quantifying uncertainty in mineral resources by use of classification schemes and conditional simulations",
  "abstract": "Mineral inventory determination consists of estimating the amount of mineral resources on a block-by-block basis and classifying individual blocks into categories with increasing level of geologic confidence. Such classification is a crucial issue for mining companies, investors, financial institutions, and authorities, but it remains subject to some confusion because of the wide variations in methodologies and the lack of standardized procedures. The first part of this paper considers some of the criteria used to classify resources in practice and their impact through a sensitivity study using data from a Chilean porphyry copper deposit. Five classification criteria are compared and evaluated, namely: Search neighborhoods, absolute and relative kriging variances, absolute and relative conditional simulation variances. It is shown that some classification criteria either favor or penalize the high-grade areas if the grade distribution presents a proportional effect. In the second part of the paper, conditional simulations are used to quantify the uncertainty on the overall mineral resources. This approach is promising for risk analysis and decision-making. Unlike linear kriging, simulations allow inclusion of a cutoff grade in the calculation of the resources and also provide measures of their joint uncertainty over production volumes.",
  "year": 2006,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2f7d2dc83d843ca37c2592188bd8d80",
  "timestamp": "2025-05-15T02:39:26.935599"
}