{
  "id": 8580,
  "title": "Dental status, quality of life, and mortality in an older community population: A multivariate approach",
  "abstract": "OBJECTIVE: To evaluate the relationships between a functional measure of dental status (FDS), several variables belonging to a quality of life (QOL) profile, and mortality in an older community population. DESIGN: Cross-sectional analysis for FDS and QOL; 10-year prospective study for mortality. SETTING: The historical and central district of the city of Brescia, northern Italy PARTICIPANTS: The entire cohort of 70 to 75-year-old people living in the above-mentioned district (n = 1303): 1201 subjects were eligible for interview at baseline; 11 refused the physical examination; 52 were lost to follow-up; data are presented for the remaining sample of 1137 subjects. MEASUREMENTS: FDS examination was used to classify the subjects into three groups: naturally adequate (ADS) (25.2%), naturally inadequate (IDS) (14.3%) dental status, and denture wearers (DW) (60.4%). Various QOL domains were assessed: mood level, cognitive status, instrumental activities of daily living (IADL), social relationships, indexes of somatic health, and health behaviors. The demographic and socioeconomic parameters were used as covariates. RESULTS: Univariate analysis showed that both the ADS and the DW groups had a better QOL profile than the IDS group. Multiple logistic regression indicated that ADS and DW conditions were predicted independently by better educational and financial conditions, higher social relationships and a better IADL level in comparison with IDS. Moreover, compared with IDS, DS was a significant predictor of a better level at the SELF, IADL, and HCU scales whereas DM predicted only a better IADL level. Crude survival analysis showed that ADS was associated with a lower mortality risk compared with both DW and IDS, which did not differ from each other. FDS also remained a significant and independent predictor of mortality in a more general Cox's regression model. CONCLUSIONS: Within this cohort of 70 to 75-year-old urban residents, FDS is associated with several QOL domains and with long-term survival. A hierarchy of reciprocal relationships exists among these parameters. The present study provides a basis for encouraging more extensive use of dentures. Longitudinal studies using oral health outcomes are warranted before clinical recommendations can be made.",
  "year": 1997,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2fb089aa4e4bb3ce9c7f594d35b170c",
  "timestamp": "2025-05-15T03:20:22.208945"
}