{
  "id": 4970,
  "title": "Production of energy from renewable sources and financial performance of European utilities: A panel-data analysis",
  "abstract": "Energy transition has become a priority for utilities worldwide. Renewable electricity generation represents one of the pillars of the European decarbonization policy and is included among eligible activities in the Taxonomy Regulation. The limited literature regarding the effects of investments in renewables on the financial performance of firms is fundamentally split in two lines: the first is focused on stock returns, the second concerns the determinants of the financial performance which is measured either through risk or accounting metrics. A limited set of studies has assessed the effects of investments in renewable power generation on the performance of utilities. In this article three linear regression analysis conducted on a panel-data composed of firm-year observations for 64 electric utilities from continental Europe between 2011 and 2020 are presented. The analysis has focused on: (i) profitability (Return-On-Asset), (ii) market valuation (Tobin's q) (iii) risk (Weighted Average Cost of Capital). The results show that the renewable generation share is significantly and positively correlated with the first two indicators, while not correlated with the cost of capital. This could represent a constraint to investments in renewable generation capacity with a negative impact on the achievement of the targets of the European decarbonization policy.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f2fd07f84e9e5278bd4cb0e9442db588",
  "timestamp": "2025-05-15T02:43:06.691573"
}