{
  "id": 5811,
  "title": "The predictors and outcome of psychiatric disorders among survivors post-earthquake: survey from Sichuan China",
  "abstract": "Objective The aims of the study were to investigate predictors and outcomes of psychiatric disorders among survivors post-earthquake. Design Cross-sectional design survey. Setting Government-aided communities with temporary shelters. Subjects A multistage stratified and cluster sampling strategy was employed to select participants via face-to-face interviews, and a total of 1,297 survivors participated in the research. Main outcome measure Psychiatric disorders were measured with self-reporting questionnaire-20 (SRQ-20), and quality of life was measured with medical outcomes study 36-item short form health survey (SF-36) and a series of problems were made to evaluate the demographic characteristics of survivors. Results The findings of the present study show that psychiatric morbidity was very prevalent among survivors (76.6%). Negative correlation was found between the total score of SRQ and PCS (r(s)= -0.525, p< 0.001), and MCS(r(s)= -0.679, p< 0.001) by Pearson correlation analysis. The multivariate logistic regression analysis demonstrated that female, aged 60 or older, having financial burden and having > 2 chronic diseases were significant risk factors for psychiatric disorder. While married, monthly income > (sic)1,500,and with medical insurance were significant protection factors against psychiatric disorders. Conclusions The psychiatric morbidity was very prevalent among survivors two years after the earthquake. The survivors with psychiatric disorders tend to have poor quality of life. Appropriate public health and medical interventions should put an emphasis on survivors who are female, aged 60 or older, having financial burden and having > 2 chronic diseases because they are at heightened risk for psychiatric disorders.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f31054277a90ed801e972d00fad24fd0",
  "timestamp": "2025-05-15T02:51:30.137793"
}