{
  "id": 3340,
  "title": "An Ecosystem Evaluation Framework for Global Seamount Conservation and Management",
  "abstract": "In the last twenty years, several global targets for protection of marine biodiversity have been adopted but have failed. The Convention on Biological Diversity (CBD) aims at preserving 10% of all the marine biomes by 2020. For achieving this goal, ecologically or biologically significant areas (EBSA) have to be identified in all biogeographic regions. However, the methodologies for identifying the best suitable areas are still to be agreed. Here, we propose a framework for applying the CBD criteria to locate potential ecologically or biologically significant seamount areas based on the best information currently available. The framework combines the likelihood of a seamount constituting an EBSA and its level of human impact and can be used at global, regional and local scales. This methodology allows the classification of individual seamounts into four major portfolio conservation categories which can help optimize management efforts toward the protection of the most suitable areas. The framework was tested against 1000 dummy seamounts and satisfactorily assigned seamounts to proper EBSA and threats categories. Additionally, the framework was applied to eight case study seamounts that were included in three out of four portfolio categories: areas highly likely to be identified as EBSA with high degree of threat; areas highly likely to be EBSA with low degree of threat; and areas with a low likelihood of being EBSA with high degree of threat. This framework will allow managers to identify seamount EBSAs and to prioritize their policies in terms of protecting undisturbed areas, disturbed areas for recovery of habitats and species, or both based on their management objectives. It also identifies seamount EBSAs and threats considering different ecological groups in both pelagic and benthic communities. Therefore, this framework may represent an important tool to mitigate seamount biodiversity loss and to achieve the 2020 CBD goals.",
  "year": 2012,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f31567fe74ca03cae763c83f17c3af21",
  "timestamp": "2025-05-15T01:16:22.051160"
}