{
  "id": 9372,
  "title": "Glaucoma Surgery SOS: Emergency Department Utilization Greater among Younger and First-Time Surgical Patients with Glaucoma",
  "abstract": "Purpose: To describe the frequency, findings, and interventions of patients' emergency department (ED) visits after all types of glaucoma surgery Design: Retrospective cohort study Subjects: All surgical patients with glaucoma between 2013 and 2021 Methods: This single institution study collected demographics, surgery type, and surgical parameters for each patient. Subsequently, for those visiting the ED within 50 days of surgery, data were collected on reason for visit, findings, and ophthalmic intervention. Logistic regression models were used to determine the odds of ED visits based on multiple risk factors. Main Outcome Measures: Postoperative presentation to ED Results: Among 9155 surgeries in 5505 patients, 5.7% had ED visits within 50 days, with 46.3% having ocular complaints. Patients with ocular diagnoses presented earlier than those without (P < 0.001). Patients who presented to the ED with an ocular diagnosis were found to be significantly younger than those who did not present (62.2 +/- 18.6 vs. 65.4 +/- 18.0 years old, P < 0.028). Furthermore, white patients were more likely than Black patients to present with an ocular diagnosis compared to a nonocular diagnosis (odds ratio [OR]: 2.64; 95% confidence interval [CI], 1.67-4.18; P < 0.001). Patients undergoing their first glaucoma surgery had a much higher chance of presenting to the ED compared to patients who had undergone more than one surgery (OR: 3.75; 95% CI, 2.74-5.14; P < 0.001). Those who underwent traditional surgeries were more likely than patients with trabecular meshwork bypass stent to present to the ED with an ocular diagnosis (OR: 3.02; 95% CI, 1.29-7.08; P = 0.011). Filtering surgeries and glaucoma drainage device (GDD) revisions exhibited more vision- threatening conditions than GDDs (P = 0.037 and P = 0.010 respectively). Ophthalmology consultation was sought for 88.0% of ocular diagnoses. Most received medical therapy (71.0%), primarily intraocular pressure- lowering drops. Conclusion: Emergency department visits after glaucoma surgery are infrequent, yet more often seen in younger patients or those undergoing their first glaucoma surgery. Trabecular meshwork bypass stent, but not trabecular meshwork excision and/or Schlemm canal dilation, were less likely to present to the ED than traditional surgeries. Filtering surgeries and tube revisions presented more often with visual threatening conditions. Financial Disclosures: The author(s) have no proprietary or commercial interest in any materials discussed inthis article. Ophthalmology Glaucoma 2025;8:37-452024 by the American Academy of Ophthalmology",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f32876809d3e0f0e6e0c317566a4519f",
  "timestamp": "2025-05-15T03:28:17.535221"
}