{
  "id": 8871,
  "title": "Does the Female Presence in Corporate Governance Influence the Level of Indebtedness in Agri-Food Family Firms?",
  "abstract": "Family firms form the backbone of most of the world's economies. While the issues surrounding family firms are diverse, gender diversity and its impact on the strategic and financial decisions of such firms is a topic that has generated significant debate in recent years. In particular, one of the most crucial unresolved questions is whether or not increasing the female presence in the family firms' corporate governance bodies would be beneficial for improving their internal functioning. To shed new light on these issues, our study aims to examine the influence of gender diversity on the level of indebtedness of Spanish agri-food family firms. Specifically, and applying a risk-aversion perspective, the research goal is to analyse whether the female presence in corporate governance structures (board of directors, top management team and general shareholders' meeting) influences the level of firm indebtedness. To test the suggested relationships, ordinary least square regression models were applied to a sample of 137 firms. The final sample was obtained by combining quantitative data from the SABI database and qualitative data from a survey conducted by the Spanish Institute of Family Firms and the Spanish Network of Family Business Chairs. This study reveals an inverse relationship of female presence in the board of directors, in the top management team, and in the general shareholders' meeting on the level of indebtedness of Spanish agri-food family firms. In other words, the findings show that female presence in corporate governance structures contributes to enhanced business management behaviour and, thus, to a better utilisation of firms' financing strategies. The obtained results have very important practical and social implications, insofar as they contribute to the building of a more inclusive and sustainable business world, aimed at reducing gender inequality at top positions in firms.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f333e32c67a9fbf051c4396f4916aafa",
  "timestamp": "2025-05-15T03:23:27.759039"
}