{
  "id": 7572,
  "title": "Patients Undergoing Total Laryngectomy An At-Risk Population for 30-Day Unplanned Readmission",
  "abstract": "IMPORTANCE Patients undergoing total laryngectomy are at high risk for hospital readmission. Hospital readmissions are increasingly scrutinized because they are used as a metric of quality care and are subject to financial penalties. OBJECTIVE To determine the rate of, reasons for, and risk factors that predict 30-day unplanned readmission for patients undergoing total laryngectomy. DESIGN, SETTING, AND PATIENTS Retrospective cohort study at a single academic tertiary referral medical center. The study population comprised 155 patients who underwent total laryngectomy with or without flap closure between January 2007 and December 2012 as either a primary treatment or salvage treatment for prior nonsurgical management. INTERVENTIONS Total laryngectomy. MAIN OUTCOMES AND MEASURES Rate of 30-day unplanned readmission, readmission diagnoses, and risk factors for unplanned readmission. Univariable and multivariable logistic regression were performed to identify risk factors for unplanned readmission within 30 days of discharge. RESULTS The 30-day unplanned readmission rate for patients following discharge after total laryngectomy was 26.5%(41 of 155). The most common readmission diagnoses were pharyngocutaneous fistula (27% of readmissions; n = 11) and stomal cellulitis (16% of readmissions; n = 7). The median time to unplanned readmission was 7 days. Thirty-four percent of readmissions (14 of 41) occurred within 3 days of discharge. Significant predictors of 30-day unplanned readmission on multivariable analysis were postoperative complication after discharge (odds ratio [OR], 11.50; 95% CI, 4.10-32.28), visit to the emergency department within 30 days after discharge (OR, 5.25; 95% CI, 1.84-14.99), salvage total laryngectomy (OR, 3.52; 95% CI, 1.56-13.12), and chyle fistula during the index hospitalization (OR, 5.25; 95% CI, 0.86-29.92). The discriminative ability of the model to predict unplanned readmission, as measured by the C statistic, was 0.88. CONCLUSIONS AND RELEVANCE Patients undergoing total laryngectomy are an at-risk patient population with a high rate of unplanned readmission within 30 days of discharge. By identifying the risk factors that predict 30-day unplanned readmission, these data can be used to design and implement quality-improvement interventions to decrease readmissions.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3343b306a0d19047e0d0fe69e52bfdb",
  "timestamp": "2025-05-15T03:10:05.525580"
}