{
  "id": 4240,
  "title": "Government Health and Social Services Spending Show Evidence of Single-Sector Rather Than Multi-Sector Pursuit of Population Health",
  "abstract": "Population health improvements can be achieved through work made possible by government spending on health care, public health, and social services. The extent to which spending allocations across these sectors is synergistic with or trade-off against one another is unknown. Achieving a balanced portfolio with multi-sector contributions is key to improving health outcomes. This study tested competing hypotheses regarding achievement of balanced multi-sector resources for health. County-level U.S. Census Bureau data on all local governmental spending measured each county's average per capita local government spending for public hospitals, public health, social services, and education. American Hospital Association (AHA) Annual Survey data on hospital community health service provision were used to calculate an index of hospital community service provision aggregated to county level by year. County Health Rankings data measured each county's health outcomes and health factors. Longitudinal mixed-effects regression models (n = 1877 counties) predicted changes in spending for each government spending category based on two sets of predictors (government spending vs community health services and needs) from current and prior year. Models account for average spending in each category and county-, state-, and time-trends. Models showed that spending increases in each of the four spending categories examined (public hospitals, public health, social services, and education) were not associated with changes in spending across other categories in current or prior years. For all categories, an increase from baseline spending levels in Year 1 was always significantly associated with an increase from baseline spending level in that same category in Year 2 (ie, spending stayed above baseline in Year 2). Multi-sector initiatives to health outcomes require funding across sectors, yet there was little evidence to suggest that communities that invest in public hospitals, public health, or other social services see commensurate increases in other areas. Underlying funding decisions may reflect strategic decisions within a community to scale up single sectors, constrained resources for multi-sector scale up, or a host of additional factors not measured here.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f345762aa6de5eec0070d5d40cef2db9",
  "timestamp": "2025-05-15T01:25:23.211520"
}