{
  "id": 3893,
  "title": "Foreign Investors' Abnormal Trading Behavior in the Time of COVID-19",
  "abstract": "This study investigates the behavior of foreign investors in the Stock Exchange of Thailand (SET) in the time of coronavirus disease 2019 (COVID-19) as to whether trading is abnormal, what strategy is followed, whether herd behavior is present, and whether the actions destabilize the market. Foreign investors' trading behavior is measured by net buying volume divided by market capitalization, whereas the stock market behavior is measured by logged return on the SET index portfolio. The data are daily from Tuesday, August 28,2018, to Monday, May 18, 2020. The study extends the conditional-regression model in an event-study framework and extracts the unobserved abnormal trading behavior using the Kalman filtering technique. It then applies vector autoregressions and impulse responses to test for the investors' chosen strategy, herd behavior, and market destabilization. The results show that foreign investors' abnormal trading volume is negative and significant. An analysis of the abnormal trading volume with stock returns reveals that foreign investors are not positive-feedback investors, but rather, they self-herd. Although foreign invstors' abnormal trading does not destabilize the market, it induces stock-return volatility of a similar size to normal trade. The methodology is new, the findings are useful for researchers, local authorities, and investors.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3525e949c400d913001c415cf81bdfe",
  "timestamp": "2025-05-15T01:22:11.791828"
}