{
  "id": 7786,
  "title": "Socioeconomic Status and Risk of Type 2 Diabetes Mellitus among an Elderly Group Population in Romania",
  "abstract": "Disregarding age, type 2 diabetes mellitus represents a major health problem for patients as well as for their families. Complications induced by the evolution of diabetes and the related conditions have a negative impact on the autonomy and quality of life, and imply a heavy burden on health and social care system. The increase of life-expectancy has induced higher disease prevalence in elderly population together with a strong financial contribution, which sometimes exceeds their resources. Firstly, we aimed to study whether the socioeconomic status explains the tendency for the hypertension status, both for the elderly and adult groups studied. Secondly, we focused on hypertension and other risk factors that may increase these patients risk of developing diabetes. The analysis was carried out on a number of 259 people included into the study. They were selected from two primary care offices in the urban area of Iasi, Romania. Using logistic regression for the hypertensive status, we found that the variables describing the socioeconomic status are all significant predictors, except for the current level of income. For a cut-off level of 0.5 for the predicted probability, in the groups with high and medium education, the threshold age of becoming hypertensive is around 50 years old, about 10 years earlier than for people with low education level. The hypertensive status and the duration of hypertension had a significant influence over the occurrence of diabetes mellitus. This influence was surpassed by that of the heredo-collateral antecedents of diabetes mellitus and by the presence of the abdominal obesity assessed by waist circumference. (C) 2014 Elsevier B.V.",
  "year": 2014,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f354322dc43e13a3cc8523336eb80fb8",
  "timestamp": "2025-05-15T03:12:11.604692"
}