{
  "id": 8609,
  "title": "Parental hesitancy toward children vaccination: a multi-country psychometric and predictive study",
  "abstract": "Aim Understanding vaccine hesitancy, as a critical concern for public health, cannot occur without the use of validated measures applicable and relevant to the samples they are assessing. The current study aimed to validate the Vaccine Hesitancy Scale (VHS) and to investigate the predictors of children's vaccine hesitancy among parents from Australia, China, Iran, and Turkey. To ensure the high quality of the present observational study the STROBE checklist was utilized.Design A cross-sectional study.Method In total, 6,073 parent participants completed the web-based survey between 8 August 2021 and 1 October 2021. The content and construct validity of the Vaccine Hesitancy Scale was assessed. Cronbach's alpha and McDonald's omega were used to assess the scale's internal consistency, composite reliability (C.R.) and maximal reliability (MaxR) were used to assess the construct reliability. Multiple linear regression was used to predict parental vaccine hesitancy from gender, social media activity, and perceived financial well-being.Results The results found that the VHS had a two-factor structure (i.e., lack of confidence and risk) and a total of 9 items. The measure showed metric invariance across four very different countries/cultures, showed evidence of good reliability, and showed evidence of validity. As expected, analyses indicated that parental vaccine hesitancy was higher in people who identify as female, more affluent, and more active on social media.Conclusions The present research marks one of the first studies to evaluate vaccine hesitancy in multiple countries that demonstrated VHS validity and reliability. Findings from this study have implications for future research examining vaccine hesitancy and vaccine-preventable diseases and community health nurses.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f35ede073cba1cb8a6cbe6a9dd84dae2",
  "timestamp": "2025-05-15T03:20:22.407393"
}