{
  "id": 5174,
  "title": "Double burden: financial toxicity in patients with advanced soft tissue sarcoma at the start of first-line palliative chemotherapy: baseline data from the HOLISTIC study",
  "abstract": "Purpose The HOLISTIC study assessed health-related quality of life (HRQoL) in advanced soft tissue sarcoma (STS) patients receiving first-line palliative chemotherapy. The secondary objective discussed here is to evaluate baseline self-reported financial difficulties and associated sociodemographic factors and global health status (GHS), compare financial toxicity between patients in the United Kingdom (UK) and the Netherlands (NL), and evaluate the consequences of financial toxicity. Methods This prospective study included 72 UK and 65 NL patients. Financial toxicity was evaluated by the financial difficulties scale of the EORTC QLQ-C30. Associated factors (i.e., country, gender, educational level, relationship status, employment changes, income, age, time since diagnosis, and GHS) were analyzed using descriptive analysis, Chi-square tests, and univariate and multivariate logistic regression. Results Median participant age was 62 (range: 27-79) years, and gender distribution was equal. 58% of UK and 48% of NL patients had no income or a monthly income <= pound/ 2000 (p = 0.417). Self-reported additional costs for medication (31% vs. 9%, p < 0.001) and parking (75% vs. 41%, p < 0.001) were more prevalent among Dutch than UK patients. Travel expenses were similar: 68% in NL and 66% in UK. Univariate analysis showed an increased risk of financial toxicity in UK patients (40% vs. 22% [NL], p = 0.023), single patients (52% vs. 27% [with partner], p = 0.014), and those with a change in employment status (46% vs. 24% [no change], p = 0.019). In UK patients, multivariate analysis indicated lower odds for financial toxicity for patients with a high income (OR 0.207, p = 0.031) and higher odds for patients with a worse GHS (OR 5.171, p = 0.012), whereas in NL, higher odds were seen for male (OR 13.286, p = 0.027) and single (OR 41.735, p = 0.007) patients. Conclusion Financial toxicity was common among advanced STS already at the start of palliative chemotherapy, influenced by factors such as residence country, income, relationship status, gender, and GHS. Timely interventions are needed to address financial challenges in this population.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f363c28e1e638e95193ddb4dae5b3272",
  "timestamp": "2025-05-15T02:45:17.017993"
}