{
  "id": 7977,
  "title": "Determinants of heterogeneity in investors' opinions on IPO valuation: evidence from the Pakistan stock market",
  "abstract": "Purpose This study investigated the effect of pricing mechanism and oversubscription on the heterogeneity of investors' opinions on initial public offering (IPO) valuation. Design/methodology/approach Besides the ordinary least square method, this study incorporated robust least square, stepwise least square and quantile regression methods to investigate the aftermarket behaviour of investors using the price range on the first day of trading of 82 IPOs listed on the Pakistan stock exchange. Findings The aftermarket behaviour of investors was found to be significantly influenced by the pricing mechanism, oversubscription, financial leverage, political stability and the risk of IPO, whereas control of corruption showed an insignificant impact. Concurrently, the findings showed that pricing mechanism and oversubscription played a crucial role in determining the intensity of investors' heterogeneous opinions at high levels of significance. Originality/value Pricing mechanism and oversubscription not only signal the quality of IPOs but also provide an important means for reducing the information asymmetry associated with new listings. Based on the literature review, it was found that both the pricing mechanism and oversubscription have yet to be explored in investigating the aftermarket behaviour of investors using the price range in the Pakistan IPO market. This study suggests that book building pricing mechanism and oversubscription are associated with lower heterogeneity in investors' opinions at a high level of significance.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f364bd470a7747074fe84395afed19b4",
  "timestamp": "2025-05-15T03:14:07.180929"
}