{
  "id": 8362,
  "title": "Persistent oral health inequality in children-repeated cross-sectional studies in 2010 and 2019",
  "abstract": "Background and aim Children growing up in vulnerable circumstances have a higher risk of caries experience. Tracking the development of caries in relation to socioeconomic variables over time is essential for fair resource distribution to groups with higher caries risk and to even out inequalities in oral health. The aim was therefore to analyse the association between 6-year-olds caries prevalence and socioeconomic variables at family and residential area levels in 2010 and 2019 as well as potential differences in the association between 2010 and 2019. Methods The study design is an epidemiological registry-based, repeated cross-sectional study based on caries data (grouped as 0, 1-3 and > 3 dmft) for the population of 6-year-olds in 2010 (n = 4,408, 95% coverage) and 2019 (n = 5,199, 94% coverage) in a Swedish region. Multiple socioeconomic variables for the children's families and residential areas were retrieved from official registries. Multinomial logistic regression was performed at both levels to produce models for each level and studied year. Results The variables that explained most of the association between caries and socioeconomic variables were mainly the same over the years at both levels. At the family level, these were: maternal age when having their first child (explained most of the association in both years, at 30 and 35%, respectively); maternal age when having the child in the study group; parental employment; parental and child's migration background; maternal educational level; form of housing; and financial assistance (only 2010). At the residential area level, these were: migration background (explained most of the association both years; 82 and 52%, respectively), educational level and number of persons per household. The association between socioeconomic variables and caries was consistently stronger for severe caries (dmft > 3) than moderate (dmft 1-3). Multiple socioeconomic risk variables meant an even greater likelihood of caries. Conclusion Over the studied years, variables related to socioeconomic vulnerability continued to be associated with caries in young children growing up under socially disadvantaged circumstances. Effective efforts for families living in socially vulnerable contexts are needed to achieve good and equal oral health, as is continued follow-up to evaluate whether the goal is reached.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f37205d325f077b2b1c9ed406c5203aa",
  "timestamp": "2025-05-15T03:17:49.218128"
}