{
  "id": 8136,
  "title": "Asthma Morbidity, Comorbidities, and Modifiable Factors Among Older Adults",
  "abstract": "BACKGROUND: Asthma morbidity is increased among older adults, especially older adult women. Interventions to improve asthma control in this population are not well described. OBJECTIVE: The objective of this study was to identify risk factors (including modifiable factors) associated with asthma-related hospitalizations and emergency department or urgent care center visits (ED/UCV) among older adults. A secondary objective was to investigate sex differences in variables relevant to asthma control. METHODS: Data were obtained from 14,076 older adults >= 65 years with active asthma participating in the 2006-2010 Behavioral Risk Factor Surveillance System Asthma Call-back Survey (a random-digit dialed survey) in 40 US states, the District of Columbia, and Puerto Rico, representative of >2.6 million persons. Weighted, adjusted logistic regression was conducted. RESULTS: One or more asthma-related hospitalizations in the past year were reported by 5.7% (95% confidence interval [95% CI] = 5.0% to 6.4%) of participants; 10.6% (95% CI = 9.7% to 11.5%) reported >= 1 asthma-related ED/UCV. Compared with older adults without asthma-related hospitalizations, adjusted odds were higher among those with >= 1 asthma-related hospitalization for chronic obstructive pulmonary disease (COPD), coronary artery disease, depression, cockroaches or mold in the home, and cost barriers to asthma-related health care or medication. All these factors, except for cockroaches, were associated with asthma-related ED/UCV. Compared with males, adjusted odds were higher among females for COPD, depression, obesity, and cost barriers to asthma-related health care or medication. CONCLUSIONS: Among older adults, asthma-related hospitalizations and ED/UCV were associated with clinical comorbidities, mold in the home, and financial barriers to asthma-related health care. Interventions addressing modifiable factors could reduce asthma morbidity among older adults. Published by Elsevier Inc. on behalf of the American Academy of Allergy, Asthma & Immunology",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3783fa20554629bb2e9070fba1706b4",
  "timestamp": "2025-05-15T03:15:38.395257"
}