{
  "id": 2681,
  "title": "THE EFFECTS OF IMPLEMENTATION OF IFRS 9 IN FINANCIAL STATEMENTS OF BANKS IN POLAND",
  "abstract": "The development of financial markets results in the appearance of new one and continuous improvement of the existing forms of liabilities, in particular financial instruments, which are used by entities to an increasing range. The use of financial instruments in the operational activity of business entities has a significant and direct influence on their financial situation. Financial instruments may be used for investment or financial purposes as well as an hedging instrument protecting against various types of risk (including price risk) and for stabilizing financial results. A particular challenge of modern accounting is the correct valuation of financial instruments, their identification and presentation in the financial statements to follow the accounting rules, in particular the principle of a faithful and reliable image. The constantly developing international markets, the growth of economic development and international exchange are the reason for changes also in the scope of classification and valuation of financial instruments in the accounting standards. This is particularly evident in the banking sector, in which the implementation of IFRS 9 (instead of IAS 39) from 1 January 2018 resulted in tremendous changes in some positions in the financial statements of individual banks operating on the Polish market. The purpose of this article is an indication of changes of the principles of identification and valuation of financial instruments caused by the implementation of IFRS 9 and a presentation of their effects in the banking sector in Poland on the example of selected banks.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3819e107fed9768619a956c0cf3ff4c",
  "timestamp": "2025-05-15T02:18:06.160015"
}