{
  "id": 8892,
  "title": "The transition journey of EU vs. NON-EU countries for waste management",
  "abstract": "This study aims to identify macroeconomic indicators that can be used as predictors of waste management on the European continent. The study was conducted taking in account the intensification of urbanizations, the increase of standard of leaving that fuels to consumerism phenomenon, and imposed challenges for waste management. The research focuses on the interval from 2010 to 2020 for 37 European countries grouped according to EU15/EU28/non-EU and EU/non-EU members. As macroeconomic indicators, human development index (HDI), GDP/capita. GNI/capita, general government expenditure with environment protection, people at risk of poverty or social exclusion, population by educational attainment level, sex, and age (%)-less than primary, primary and lower secondary education (levels 0-2) were used. A multilinear regression model with collinearity diagnosis was applied to find out the direction and intensity of the contribution of independent variables and to hierarchy the predictors of waste management.. For multiple comparison between and inside of each grouping of countries, statistical inference methods were used: one-way ANOVA with Bonferroni post hoc test multiple comparisons and independent samples Kruskal-Wallis test with Dunn's post hoc test. The main conclusions of the study are that EU15 countries have the highest average values for most indicators of waste management, comparative with EU28 and with non-EU countries, followed by a group of EU28 countries. For indicators of recycling rate of packaging waste by type of packaging-metallic and recycling rate of e-waste, the non-EU countries have the highest values of mean compared with the EU15 and EU28 groups of countries. This can be explained by the high level of development of the some non-euro area countries (Iceland, Norway, Switzerland, Liechtenstein) that have intense concerns about waste recycling and have the necessary financial strength to carry out complex environmental protection programs.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f381584b1aba83d0999d7d46dd1f3f7a",
  "timestamp": "2025-05-15T03:23:27.846044"
}