{
  "id": 3690,
  "title": "Can energy-price regulations smooth price fluctuations? Evidence from China's coal sector",
  "abstract": "Due to the dominance of coal in China's energy mix, coal prices have always been a challenging part of pricing reform. The recent frequent government interventions raise the key research questions: what is the actual impact of price policies on coal price fluctuations, and how can forward-looking pricing policies be made. By proposing a novel classification of coal pricing policies and introducing an expectation and forward-looking coefficient, the paper examines the relationship between coal price fluctuations and pricing policies using the generalized method of moments (GMM) method. It shows that the lagging coal price and coal demand play a positive role in regulating coal prices, while coal supply and marketization have significantly negative effects on coal price fluctuations. The heterogeneous impacts of price policies are due to differences in market players' expectations, policy instruments and the methods of policy release. In addition, China's coal pricing policy portfolio from 2013 to 2016 exerted synergy effects on the restraint of coal price fluctuations. As the forward-looking coefficient was considerably low, the government's intervention behaviors were obviously biased towards ex post facto responses. The paper suggests short run and long run policies to advance marketization of coal prices amid the energy transition.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f38305ef7c9268befe09b79a323b59b4",
  "timestamp": "2025-05-15T01:20:03.340298"
}