{
  "id": 3065,
  "title": "Asset-pricing anomalies and spanning: Multivariate and multifactor tests with heavy-tailed distributions",
  "abstract": "In this paper we propose a multivariate regression based assessment of the multifactor model first developed by Fama and French (1993). We study mean-variance efficiency and spanning, as well as factor relevance. In particular, we assess the relative contribution of the factors in accounting for asset pricing anomalies. Our tests are motivated by a finite-sample distributional theory, invariant to portfolio repackaging, and achieve size control exactly conditioning on observed factors, in normal and non-normal contexts. We focus on the multivariate normal and Student-t distributions, in which case we rely on the simulation procedure proposed and applied in Beaulieu et al. (2007). We also assess, from a finite-sample and multivariate test perspective, the specification and fit of the model and error distributions considered. In its most general form, the model considered includes six factors: the market portfolio, size, the ratio of book equity to market equity as well as term structure variables (a term premium and a default premium) and momentum. Portfolio returns (coming from assets traded at NYSE. AMEX and NASDAQ) from Fama and French's data base are analyzed on monthly frequencies from 1961-2000. Our results show the following. (1) Normality in model residuals becomes more dependable as a working hypothesis, over short time spans, when the book to market equity and size factors or when the momentum factor are accounted for. (2) Allowing for heavy tailed distributions empirically accommodates some stylized asset pricing anomalies. (3) Loadings on the term structure variables and the momentum factor seem (jointly, across portfolios) statistically insignificant at usual levels in many sub-periods. (4) Mean-variance efficiency is rejected in fewer subperiods allowing for non-normal errors in multi-factor settings: the book to market equity and size factors contribute importantly in reinforcing efficiency. (5) Enlarging the set of assets [From a one factor to a six factor model] does not reinforce the mean-variance spanning hypothesis, which is globally rejected at usual levels. (C) 2010 Published by Elsevier B.V.",
  "year": 2010,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f384982ad5c5f9c85ccfe94cd4ed54fa",
  "timestamp": "2025-05-15T01:13:09.867968"
}