{
  "id": 2447,
  "title": "The Portfolio Diet and HbA1c in Adults Living with Type 2 Diabetes Mellitus: A Patient-Level Pooled Analysis of Two Randomized Dietary Trials",
  "abstract": "(1) Background: The Portfolio Diet, a dietary pattern of cholesterol-lowering foods, is also rich in low glycemic index (GI) foods. While strong evidence supports clinically meaningful reductions in cholesterol, evidence on the relationship between the Portfolio Diet and diabetes management is lacking. (2) Objective: To evaluate the relationship between the Portfolio Diet and glycated hemoglobin (HbA1c) as a determinant of glycemic control among adults living with type 2 diabetes mellitus (T2DM). (3) Methods: Patient-level data was pooled from two randomized dietary trials of low glycemic index interventions compared to high cereal fibre control diets in adults living with T2DM where HbA1c was collected (clinicaltrials.gov identifiers: NCT00438698, NCT00438698). Dietary exposure was assessed using weighed 7-day diet records. Adherence to the Portfolio Diet and its pillars (nuts and seeds, plant protein, viscous fibre, plant sterols, monounsaturated fatty acid [MUFA] oils) was determined using the validated clinical Portfolio Diet Score (c-PDS). Multiple linear regression was used to assess the association between change in the c-PDS and change in HbA1c over 6-months with covariate adjustments. (4) Results: A total of 267 participants, predominantly White (67%) and male (63%), were included, with a mean +/- standard error age of 62 +/- 0.5 years, baseline BMI of 30.2 +/- 0.3 kg/m2, HbA1c of 7.08 +/- 0.03%, and a c-PDS of 4.1 +/- 0.3 points out of 25. Change in the c-PDS was significantly associated with a change in HbA1c (beta: -0.04% per point, 95% CI: -0.07, -0.02, p = 0.001). A 7.5-point (30%) increase in the c-PDS was associated with a 0.3% reduction in HbA1c. Of the individual pillars, a 1-point change in nut and seeds intake (beta: -0.07%, 95% CI: -0.12, -0.02, p = 0.009) or in plant protein intake (beta: -0.11%, 95% CI: -0.18, -0.03, p = 0.009) was associated with a change in HbA1c. Further analysis of plant protein intake revealed that an increase in dietary pulse intake, a particularly low-GI food, was significantly associated with a reduction in HbA1c (beta: -0.24% per 1-cup points cooked pulses (226 g) or 2 c-PDS points, 95% CI: -0.45, -0.03, p = 0.028). (5) Conclusions: Among adults living with T2DM, the Portfolio Diet was associated with lower HbA1c over a 6-month period, predominantly driven by two pillars: nuts and seeds and plant protein, particularly dietary pulses. These data have implications for including the Portfolio Diet in dietary recommendations for glycemic control in T2DM. A trial demonstrating the direct causal effect of the Portfolio Diet in a diverse group is warranted.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f389235a6a730117e40e829a7acc39b0",
  "timestamp": "2025-05-15T01:07:02.966523"
}