{
  "id": 852,
  "title": "Construction of an efficient portfolio of power purchase decisions based on risk-diversification tradeoff",
  "abstract": "We present a methodology based on the tradeoff between risk and diversification in order to evaluate a purchase portfolio of energy, where the assets refer to purchasing strategies of a retailer-generator of electricity in three markets: spot, regulated and non-regulated markets. We use two measures of diversification: i) entropy based on factors, constructed by principal components analysis, and ii) entropy based on asset risk. In each case, weights for each strategy are estimated by using the interior point method, for which monthly forecasts of returns are calculated a year ahead for each market Spot prices are modeled using an ARIMA model and bilateral contracts are modeled using growth rates. We compare risk-diversified portfolios with mean-variance portfolio. Although diversification does not necessarily mean a lower risk, we show that the mean-variance portfolio's risk is not always lower than the risk-diversified approaches. Also, we show that diversification converges to one for the highest risk portfolio, but this does not happen in the case of entropy based on factors, because one asset can participate in more than one principal component. Clearly, the mean-variance approach is unable to perform a diversified allocation. These results are useful for retailer-generators who want combine the criteria of risk and diversification. (C) 2017 Elsevier B.V. All rights reserved.",
  "year": 2017,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f391d4108db79bcc532cda8744197482",
  "timestamp": "2025-05-15T00:49:03.122594"
}