{
  "id": 1872,
  "title": "Accuracy of artificial intelligence in prediction of osteoporotic fractures in comparison with dual-energy X-ray absorptiometry and the Fracture Risk Assessment Tool: A systematic review",
  "abstract": "BACKGROUND Osteoporotic fractures, whether due to postmenopausal or senile causes, impose a significant financial burden on developing countries and diminish quality of life. Recent advancements in artificial intelligence (AI) algorithms have demonstrated immense potential in predicting osteoporotic fractures. AIM To assess and compare the efficacy of AI models against dual-energy X-ray absorptiometry (DXA) and the Fracture Risk Assessment Tool (FRAX) in predicting fragility fractures. METHODS We conducted a literature search in English using electronic databases, including PubMed, Web of Science, and Scopus, for studies published until May 2024. The keywords employed were fragility fractures, osteoporosis, AI, deep learning, machine learning, and convolutional neural network. The inclusion criteria for selecting publications were based on studies involving patients with proximal femur and vertebral column fractures due to osteoporosis, utilizing AI algorithms, and analyzing the site of fracture and accuracy for predicting fracture risk using SPSS version 29 (Chicago, IL, United States). RESULTS We identified 156 publications for analysis. After applying our inclusion criteria, 24489 patients were analyzed from 13 studies. The mean area under the receiver operating characteristic curve was 0.925 +/- 0.69. The mean sensitivity was 68.3% +/- 15.3%, specificity was 85.5% +/- 13.4%, and positive predictive value was 86.5% +/- 6.3%. DXA showed a sensitivity of 37.0% and 74.0%, while FRAX demonstrated a sensitivity of 45.7% and 84.7%. The P value for sensitivity between DXA and AI was < 0.0001, while for FRAX it was < 0.0001 and 0.2. CONCLUSION This review found that AI is a valuable tool to analyze and identify patients who will suffer from fragility fractures before they occur, demonstrating superiority over DXA and FRAX. Further studies are necessary to be conducted across various centers with diverse population groups, larger datasets, and a longer duration of follow-up to enhance the predictive performance of the AI models before their universal application.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3c3f44674afc0ee5457bf6065374417",
  "timestamp": "2025-05-15T02:08:38.962762"
}