{
  "id": 4710,
  "title": "Short-Term Electricity Load Forecasting for the Integrated Single Electricity Market (I-SEM)",
  "abstract": "The electricity market structure in Ireland is being reconstructed in order to meet with the requirements of the EU Third Energy Package. The forthcoming Integrated-Single Electricity Market (I-SEM) differs from the current market structure in many ways. However this research addresses the issue of balance responsibility under the I-SEM. Given the volatility of prices in the Balancing market, observed in similarly-structured markets around the world, Irish supply companies need to be able to accurately forecast their customers' load in the Day-Ahead market in order to manage risk in the Balancing market. This paper presents a means for suppliers to implement short-term load forecasting (STLF) of electricity. A Neural Network model is used as well as a Double Seasonal Exponential Smoothing variation of the Holt-Winters method. Data from the Irish market was used to forecast a supply company's load as well as the national load, using these methods. Measured by MAPE (mean absolute percentage error), both methods produced positive results of below 3%. It is envisaged that with these results, a supply company operating in the Irish market should be able to apply these forecasting methods to their historical customer data to submit modestly accurate bids, with the intention of securing their position in the Day-Ahead market and reducing the potential of any financial implications accruing in the Balancing market.",
  "year": 2017,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3d34f7aece9f03734ce035779f6efba",
  "timestamp": "2025-05-15T02:39:57.630381"
}