{
  "id": 1749,
  "title": "Measuring multi-volatility states of financial markets based on multifractal clustering model",
  "abstract": "Measuring multi-volatility states is an important component of financial risk management. In this paper, taking 17 years' high-frequency data of the Shanghai Stock Exchange Composite Index (SSEC) as an example, we set out to propose a novel model of multifractal clustering model (MCM), combining multifractal algorithm with k-mean clustering algorithm, to measure the multi-volatility states of financial markets. The empirical results present that the financial markets are multifractal and the multifractal parameter S-alpha measured by multifractal algorithm correlates well with the performance of financial markets. Meanwhile, the multi-volatility states recognized by k-mean clustering algorithm based on S-alpha have obvious statistical significance. More importantly, the experiment results show that by the loss functions and Diebold-Mariano (DM) test, generalized autoregressive conditional heteroscedasticity (GARCH) model with the multi-volatility state measured by MCM is superior to others measured by Markov switching (MRS) model and hidden Markov model (HMM) as well as that without the multi-volatility states, which indicates that MCM has best performance of measuring the multi-volatility states of financial markets. The robustness of MCM is also evaluated by Shenzhen Securities Component Index (SZSE) instance set, SSEC instance sets with different time intervals, and different volatility models. The results still prove that MCM has strong robustness on measuring the multi-volatility states of financial markets.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3de07a0693da01e14cf9b4b3d7b4848",
  "timestamp": "2025-05-15T02:06:52.728216"
}