{
  "id": 5602,
  "title": "Non-operating revenue is an important source of funding for rural hospitals, especially those that are government-owned",
  "abstract": "Purpose: Non-operating revenue (NOR), derived from investments, contributions, government appropriations, and medical space rentals, can contribute to financial stability of hospitals by offsetting operating losses and improving profitability. NOR might benefit rural hospitals that often face intense financial pressures. However, little is known about how much rural hospitals rely on NOR and if certain organizational characteristics are associated with differences in NOR. Methods: Healthcare Cost Report Information System data from 2011 to 2019 were used to analyze sources of revenue among Critical Access Hospitals (CAHs) and Rural Prospective Payment System (R-PPS) hospitals through descriptive statistics and regression models. Reliance onNOR was measured by the percentage of total revenue from non-operating sources. Findings: Results indicate that both CAHs and R-PPS hospitals rely on NOR; however, CAHs have a higher percentage of total revenue derived from non-operating sources (3.2%) as compared to R-PPS hospitals (1.9%) (p < 0.001). Government-owned hospitals have significantly higher reliance on NOR than other ownership types. System affiliation also influences reliance on NOR. Lastly, results suggest that NORmay play a role in improving overall profit margins. Conclusions: As rural hospitals disproportionately face challenges related to declining profitability and the risk for closure, they may rely on NOR to continue to strengthen financial performance and provide health care to their communities. However, NOR is not guaranteed, and reliance on NOR further reiterates the value of stable, adequate reimbursement to guard against fluctuations in NOR.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3dfcf3984055019286e09dee60b7470",
  "timestamp": "2025-05-15T02:49:21.735863"
}