{
  "id": 1754,
  "title": "A Hybrid Approach for Predicting Corporate Financial Risk: Integrating SMOTE-ENN and NGBoost",
  "abstract": "The financial condition of an enterprise is a critical factor in determining its viability and long-term prospects, and it also directly affects the interests of stakeholders such as investors and creditors. So extra attention is needed to evaluate and forecast the financial risk of an enterprise. This paper proposes a novel enterprise financial risk evaluation and prediction model integrating Synthetic Minority Over-sampling and Edited Nearest Neighbors (SMOTE-ENN) and Natural Gradient Boosting (NGBoost). The CRITIC-TOPSIS method is first employed to conduct a comprehensive evaluation of the financial risk of the listed companies based on their annual financial statements. Subsequently, the obtained evaluation results are subjected to a clustering analysis to categorize the companies into different levels of financial risk. To address the issue of imbalanced samples, the study introduces the SMOTE-ENN combined sampling method. This technique is applied to mitigate the imbalance in the number of samples across different categories. Lastly, NGBoost is utilized to develop a prediction model for corporate financial risk based on the clustered data. The analysis reveals that companies with low levels of financial risk typically exhibit a balanced financial profile, robust operational performance, and substantial growth potential. Conversely, companies with high levels of financial risk are characterized by weak profitability and debt-paying ability. The experimental findings show that the model has a 97.18% accuracy rate, thereby suggesting that the model is both reasonable and practicable.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3e2289633b237c55893ae135956937f",
  "timestamp": "2025-05-15T02:06:52.773253"
}