{
  "id": 9212,
  "title": "Factors associated with long intensive care unit (ICU) admission among inpatients with and without diabetes in South Western Sydney public hospitals using the New South Wales admission patient data collection (2014-2017)",
  "abstract": "Background Long stay in intensive care unit (ICU) is associated with poor outcomes, particularly in people with diabetes. It increases the financial burden of care and this is a challenge to the South Western Sydney region, which is already a hotspot for diabetes in Australia. This study compared ICU admission characteristics of people with and without diabetes and the factors associated with long ICU stay among patients admitted to public hospitals in this metropolitan health district from 2014 to 2017. Methods Cross-sectional datasets on 187,660, including all ICU admissions in the New South Wales Admitted Patient Data Collection (APDC) from June 2014 - July 2017 in public hospital were extracted. Data on demographic and health insurance status, primary admission diagnosis using ICD-10, comorbidities including death among hospital inpatients aged >= 18 years residing in SWS were analysed. The ICU length of stay was the outcome variable and were classified into short stay (<= 48 h) and long stay (> 48 h), and were examined against potential confounding factors using bivariate and multiple logistic regression analyses. Results Our results showed higher ICU admissions in patients with diabetes than in those without diabetes (5% vs. 3.3%, P < 0.001) over three years. The median and interquartile range (IQR) of length of the ICU stay were similar in both groups [diabetes: 40 h, IQR = 16-88 h vs. non-diabetes: 43 h, IQR = 19-79 h]. The prevalence of long ICU stays among people with and without diabetes were 44.9% [95% CI 42.1, 47.7%] and 43.6% [95% CI 42.2, 44.9%], respectively. For both groups, increased odds of long ICU stay were associated with death and circulatory system disease admissions, while musculoskeletal disease admissions were associated with lower risk of long ICU stay. In the non-diabetes group, male sex, nervous system disease admissions and living in peri-urban areas were associated with higher odds of long ICU stay. Conclusions The rate of ICU admissions among inpatients remain higher in people with diabetes. One in every two admissions to ICU had a long stay. Additional care for those admitted with circulatory system diseases are needed to reduce long ICU stay related deaths in SWS.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3e8a3c77c5ba2004b7c3e5e30c9d4bb",
  "timestamp": "2025-05-15T03:26:26.101758"
}