{
  "id": 367,
  "title": "A Novel Risk-Perception Model Based on Blockchain for Supply Chain Finance of China Real Estate",
  "abstract": "More than 220 enterprises in China's real estate industry have gone bankrupt, causing serious losses. The National Bureau of Statistics of China showed that the country's investment in property development fell by 8.5% year -on -year, while domestic lending dropped by 11.5% and the use of foreign capital fell by 43%. Upon this, the development of supply chain finance can alleviate the pressure on enterprise funds and stabilize the real estate market. However, risk in supply chain finance is the biggest obstacle to the development of supply chain finance and current researches on risk assessment of supply chain finance face problems such as imprecise classification, slow assessment speed, a small number of samples, and data that is easily tampered with. Therefore, this study integrated graph convolutional neural networks into the smart contracts of the contract layer of blockchain. This integration established a novel intelligent perception model for supply chain finance risk. Based on a consortium chain with the government and enterprises as nodes, the model was established, including risk monitoring, assessment, and categorized early warnings. In the risk assessment part, we compared the graph convolutional neural network with multilayer perceptron and support vector machine finding that the accuracy rate of the graphic convolutional neural network is 94%, which is higher than the above models. The intelligent risk -perception model proposed in this paper operates faster than expert judgment assessments used by banks. It also provides accurate risk levels and quantifies the probability of enterprises being classified as high -risk, offering technical support to regulatory authorities in controlling supply chain financial risk.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3fcd8a976206290fd946fcdd52eaf30",
  "timestamp": "2025-05-15T01:50:13.998222"
}