{
  "id": 3409,
  "title": "Cooperation and technological areas in the state universities of Sao Paulo: An analysis from the perspective of the triple helix model",
  "abstract": "This article analyzes the technological cooperation networks, and their respective areas, of the public universities of the State of Sao Paulo that resulted in patent. The cooperation networks were built from the assignee data and for the technology areas networks the International Patent Classification. It adopted the metrics of Social Network Analysis to characterize these partnerships and analyze it from the perspective of the Triple Helix. A total of 458 technology partnerships were identified that resulted in patents, 210 at USP, 173 at UNICAMP and 75 at UNESP. The main partners were companies and other universities, follow by research institutes, government support institutions and support foundations had low participation, except for FAPESP and EMBRAPA. Regarding technological areas, technologies with applications in the health sector and chemical were the most representative. It was found that the cooperation is still developed in an incipient way, especially regarding the continuity of technological development. In general, there is the multidisciplinary portfolio of patents from universities, but with strong guidance for the areas of health, indicating the search for expertise in this area of expertise.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f3fd5ce21093dd52a46be75fc5855d7f",
  "timestamp": "2025-05-15T01:16:55.456910"
}