{
  "id": 5950,
  "title": "Subjective well-being predicts Covid-19 risk in the elderly: a case-control study",
  "abstract": "Background Covid-19 is a serious public health concern. Previous studies have shown that although there are concerns about the subjective well-being (SWB) of older people in the Covid period, the link between SWB and the risk of Covid-19 is still unclear. This study aimed to investigate the predictive effect of SWB on the Covid-19 risk in the elderly as well as the determinants of SWB. Methods This case-control study was performed in the elderly over 60 years of age. The case group consisted of all hospitalized patients with COVID-19 and the control group from the same population with no history of COVID-19 matched by age, sex, and place of residence. Data collection tools included a demographic questionnaire and SWB scale of Keyes and Magyarmo to measure emotional, psychological and social well-being. All data were analyzed via SPSS and STATA software. Multiple binary logistic regression was run to predict the probability of Covid-19 risk on the values of total SWB and its three subscales and multiple linear regression to identify SWB determinants. Results The results showed that increasing one unit in total SWB reduces the risk of Covid-19 by 4% (OR = 0.969, CI = 0.947-0.991, p = 0.006). Emotional well-being with 0.823 had the highest odds ratio for predicting Covid-19 risk, followed by social well-being with an odds ratio of 0.981. Increasing age and education, better economic status, marriage against celibacy, lack of comorbidity, and a better understanding of own health were associated with greater SWB. Discussion This study provides evidence for the protective effect of SWB on Covid-19 risk. To promote SWB, we need to focus on the elderly with higher financial worries and comorbidities, as well as those with less education, health perception and SWB. Therefore, it will be important for the elderly to determine strategies to improve SWB during the epidemic.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4050e5c34665dd5230ffcb31a74cc3e",
  "timestamp": "2025-05-15T02:53:03.147302"
}