{
  "id": 6829,
  "title": "Can virtual reality nudge toward green investing? An experiment with small business entrepreneurs",
  "abstract": "PurposeStorytelling through virtual reality (VR) combines the strengths of cutting-edge technology with traditional informational campaigns. As a tool for climate change mitigation, VR has been shown to educate individuals and stimulate both emotional and cognitive responses that promote pro-environmental behavior. This paper aims to investigate whether these benefits extend to the field of green investing through an experiment conducted with a sample of small business entrepreneurs.Design/methodology/approachThe experimental design involved making choices between bonds varying in maturity dates, annual interest and environmental classification (regular versus green). To identify potential impacts of the immersive experience on investment decisions, these choices were made both before and after exposure to VR videos illustrating the devastating effects of climate change. A multiple price list was employed to elicit subjects' risk preferences, enabling the joint estimation of the treatment effect and the risk and time preference parameters. FindingsThe findings indicate that, when risk and time preference parameters are controlled for, a VR experience can nudge toward green investment choices. This effect is more profound among those who already exhibit a greater propensity to opt for green investments.Originality/valuePrevious research shows that negative emotions, such as guilt, affect pro-environmental intentions, as well as actions, while message vividness through immersive experiences is effective in nudging greener behavior. Since analogous results in the framework of financial investments are not currently available, this paper seeks to test whether VR videos depicting the adverse effects of climate change can generate negative emotions associated with experiencing these effects and make them salient in subsequent investment decisions made by small business entrepreneurs.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f41f6a902596e4ba433fe8394e8bf948",
  "timestamp": "2025-05-15T03:02:07.463443"
}