{
  "id": 3705,
  "title": "The survival analysis approach in Basel II credit risk management: modeling danger rates in the loss given default parameter",
  "abstract": "In the last three years most European banking groups have chosen to adopt Basel II advance status. This has required banks to develop statistical models for estimating probability of default, loss given default and exposure at default within a horizon time of one year. Such models make no attempt to describe the exact timing of default. In particular, while the literature on probability of default is extensive for both academics and practitioners, studies on loss given default are in a less advanced state. One of the main reasons for this could be the difficulty of modeling and forecasting danger (cure) rates. The aim of this paper is to show the results of the first application of the survival analysis technique for estimating loss given default by modeling the danger rates of the portfolio of an Italian retail bank. Two issues arise from the forecasting of danger rates: dealing positions that change their status - or do not - toward charge-off; and the difficulties in obtaining a certain level of accuracy across time, giving more complex results than in simpler classification methods. This paper analyzes the use of a parametric survival model, where time is assumed to follow some distributions whose probability density function can be expressed in terms of unknown parameters: hazard and shape.",
  "year": 2013,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f42558fc924ac50743d736f7c2aac86c",
  "timestamp": "2025-05-15T01:20:03.412281"
}