{
  "id": 8381,
  "title": "Do Appalachian Women Attending a Mobile Mammography Program Differ from Those Visiting a Stationary Mammography Facility?",
  "abstract": "To compare the characteristics (demographic, access to care, health-related behavioral, self and family medical history, psychosocial) of women aged 40 years and above who utilize a mobile mammography unit with those women aged 40 years and above who obtain mammography screening at a stationary facility. A cross-sectional study design was used with participant cohorts comprised of women age 40 years and above throughout West Virginia (WV) who utilized mobile mammography unit to get mammogram and those who had mammography screening at the stationary facility and completed the Mammography Screening and Preventive Care Survey. A total of 1,161 women who utilized the mobile mammography unit and 1,104 women who utilized stationary facility were included in the analysis. In logistic regression after adjusting for all the variables, women who utilized mobile mammography unit were more likely to be in age group 40-49, with lower income, with no health insurance coverage, not visit doctor or obstetrician/gynecologist (OB/GYN) in the past year, not adherent to clinical breast exam and mammography screening guidelines, with lower perceived five-year risk of developing breast cancer and with high knowledge about mammography screening. Women who utilize mobile unit are not adherent to mammography screening guidelines thereby suggesting that the mobile mammography unit is indeed reaching a rural vulnerable population who may not routinely access preventive health services. Financial and insurance constraints, as well as access to medical care, restricted WV women from receiving mammography screening from the stationary screening facilities.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f432904ac5fa612ec299b7168c214939",
  "timestamp": "2025-05-15T03:18:19.560131"
}