{
  "id": 105,
  "title": "Comparative analysis of deep learning algorithms for predicting construction project delays in Saudi Arabia",
  "abstract": "Construction projects in Saudi Arabia often encounter delays, which present significant challenges to project managers and result in financial losses and stakeholder dissatisfaction. Effectively managing these delays is essential for maintaining project timelines and optimizing resource use. This study explores the hypothesis that advanced deep learning algorithms can significantly improve the prediction and management of construction project delays in Saudi Arabia. The research focuses on three algorithms: Generative Adversarial Networks (GAN), Long Short-Term Memory (LSTM), and Multilayer Perceptron (MLP), evaluating their effectiveness across datasets with varying class imbalances. A structured methodology was employed to assess the algorithms based on key performance metrics, including accuracy, precision, sensitivity, specificity, and misclassification errors. GAN, LSTM, and MLP were trained and tested using real-world construction project data, incorporating tools such as k-fold cross-validation for validation. The GAN model achieved the highest accuracy at 91 %, with a misclassification error of 9 %, outperforming both LSTM (accuracy: 88 %, error: 12 %) and MLP (accuracy: 83 %, error: 17 %). GAN also demonstrated superior precision (90 %) and sensitivity (87 %), making it the most reliable algorithm for delay risk assessment. While LSTM was effective, it had slightly lower precision (88 %) but exhibited strong generalization to unseen data. MLP showed the weakest performance, with higher misclassification rates and lower robustness. These findings suggest that deep learning models, particularly GAN, can significantly improve decision-making and delay mitigation in construction projects.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4363db816855a72b8b3de9515a63b47",
  "timestamp": "2025-05-15T01:33:49.063469"
}