{
  "id": 8441,
  "title": "The Cumulative Impact of Unmet Essential Needs on Indicators of Attrition: Findings from a Public University Population-Based Sample of Students in the Bronx, NY",
  "abstract": "In recent decades, a growing proportion of college students have experienced financial stress, resulting in unmet essential needs including food insecurity, housing instability, lack of healthcare access, and inadequate mental health treatment. Given that urban-based public universities constitute a substantial proportion of the US college student population, understanding how unmet needs affect academic achievement in this population is crucial for developing strategies that alleviate college failure and dropout. We examined the cumulative impact of unmet essential needs (scored from 0 to 4) on indicators of college attrition (dropout, leave of absence, risk of academic probation). The sample comprised a college population-representative sample of 1833 students attending one of three urban public colleges in the Bronx, NY. Employing adjusted multinomial and binomial logistic regression models, we assessed how total unmet essential needs predict any indicator of college attrition. Each unit increase in unmet need increased the odds of having any attrition indicator by 29% (p < 0.01). Students with two unmet needs had 43% greater odds (p < 0.01), students with three unmet needs had 57% greater odds (p < 0.01), and students with four unmet needs had 82% greater odds (p < 0.01) of having any attrition indicator compared to those without unmet needs. Findings revealed a modest dose-response relationship between the number of unmet needs and the likelihood of experiencing indicators of attrition, suggesting a cumulative impact of unmet needs on students' ability to persist to graduation. Designing interventions aimed at college students with multiple unmet essential needs, and addressing these needs holistically, may assist student retention and graduation.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f439a4234f2b0c233be1ad73c57a63ac",
  "timestamp": "2025-05-15T03:18:51.629912"
}