{
  "id": 6563,
  "title": "Economic strain, parental education and psychotic experiences among college students in the United States: Findings from the Healthy Minds Study 2020",
  "abstract": "Aim Socioeconomic status (SES) is linked to psychosis, and much can be learned by examining how various indicators of SES-specifically economic strain and intergenerational transfer of resources-are related to sub-threshold psychotic experiences among college students. Methods Using data from the Healthy Minds Survey (September 2020-December 2020), we used multivariable logistic regression models to examine the associations between five SES indicators and 12-month psychotic experiences, adjusting for age, gender and race/ethnicity. We also examined the count of predictors and psychotic experiences. Results Each indicator of economic strain was associated with greater odds of psychotic experiences. In particular, increasing levels of financial stress (current, childhood and pandemic-related) were associated with greater odds of psychotic experiences in a dose-response fashion. Food insecurity was associated with double the odds of psychotic experiences. In terms of intergenerational transfer of resources, having either one or no parents who attended college was associated with significantly greater odds of having psychotic experiences, when compared with having both parents who attended college. Examining all predictors in the same model, only childhood and current financial stress and food insecurity were significantly associated with psychotic experiences. The count of predictors was significantly associated with greater odds of having psychotic experiences in a dose-dependent fashion. Conclusions Among college students, economic strain and intergenerational transfer of resources were associated with recent psychotic experiences, highlighting the importance of economic interventions targeting young adults to influence risk for psychosis.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f444b1abb47a2b2870bf1fc5d8efdc6d",
  "timestamp": "2025-05-15T02:59:36.856947"
}