{
  "id": 4006,
  "title": "Does gender moderate the relationship between protective factors and rule violating behavior?",
  "abstract": "This paper explores the role that gender plays in moderating the relationship between protective factors and rule violating behavior among adolescents and young adults. We explore the relationship between rule violating behavior, protective factors, and gender for regulatory strengths, meaning making strengths, and interpersonal strengths. The Resilience Portfolio Model is used to understand the process of resilience and how utilizing various types of strengths may decrease the prevalence of rule violating behavior. Participants were 860 adolescents and young adults (12-20 years old) within a rural, Appalachian area of the United States who self-reported behaviors based on survey data. Blockwise regression analyses and interaction analyses were conducted to identify gender differences. Findings indicate that overall, males are significantly more likely to report rule violating behaviors than females. Gender moderated the relationship between psychological endurance and moral meaning making with these strengths showing a stronger protective effect for male versus female youth. Several strengths were associated with less rule violating behavior and operated similarly for male and female youth, including emotion regulation, optimism, and community support. Findings suggest that more attention needs to focus on identifying and understanding gender-specific strengths as well as identifying strengths which may operate similarly for both males and females that contribute to reduced rule violating to improve developmental outcomes for adolescents and young adults. These findings are important especially as it relates to prevention of rule breaking among all adolescents and young adults.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f445a303d60759302320af25d022eb4b",
  "timestamp": "2025-05-15T01:23:07.298719"
}