{
  "id": 8461,
  "title": "Epidemiological Characteristics of the Lumpy Skin Disease Outbreak in Nawalpur, Nepal, 2022",
  "abstract": "Lumpy skin disease (LSD) is an economically important and notifiable transboundary viral disease of cattle and water buffalo, predominantly transmitted by arthropod vectors. In recent times, LSD has emerged as a notable concern in Nepal, with the first outbreak reported in June 2020, in Morang district. In 2022, outbreaks of LSD were observed in several districts with Nawalpur district being the hard-hit district. The objective of this study is to provide insights into the epidemiological characteristics of LSD, to identify potential sources and associated risk factors for LSD outbreak in Nawalpur, and its financial impact. The overall morbidity rate was observed to be 28.02% (n = 431/1,538) and the mortality rate was 3.06% (n = 47/1,538), resulting in a case fatality rate of 10.90% (n = 47/431). The predominant clinical symptoms were skin nodules, lameness, and decreased milk production in milking animals. Dry cattle, including pregnant cows and cattle heifers were the most affected. Univariable logistic regression analysis identified factors linked to disease outbreaks, such as importing animals from disease prevalent regions, sharing feed and water, herd size, and the presence of clinical signs in neighboring farms. Multivariable analysis highlighted the significance of neighboring farms having sick animals in resulting disease outbreaks. Because of the substantial economic impact due to LSD, it is imperative to implement effective control and preventive measures. These include animal movement control and quarantine, following biosecurity protocols during nearby outbreaks, and targeted vaccination of susceptible populations to prevent further disease spread.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f45095b5bfb14e6418486097feae6c20",
  "timestamp": "2025-05-15T03:18:51.769141"
}