{
  "id": 4714,
  "title": "Fintech-based financial inclusion and banks' risk-taking: the role of regulation in Sub-Saharan Africa",
  "abstract": "PurposeThe study examines the role of regulation in the fintech-based financial inclusion (FBFI)-risk-taking nexus in the Sub-Saharan African (SSA) region.Design/methodology/approachUsing a sample of 10 countries in SSA over the period 2014 to 2021, the study employed the fixed-effect regression model and the two-step generalized method of moments (GMM) estimator.FindingsThe results show that FBFI mitigates commercial banks risk-taking in SSA. But as FBFI progresses, the association takes the shape of an inverted U, increasing risks initially and decreasing them later on. Effective supervision and regulatory quality, in particular, are essential in moderating this relationship by offsetting the adverse consequences of FBFI in its early stages.Research limitations/implicationsFirst, while our sample is limited to banks in ten SSA countries, future studies could extend the sample size, enabling more explicit generalization of the results. Second, the FBFI-bank risk nexus can be explored further by comparing diverse forms of fintech participation, such as fintech company investment, fintech technology investment, cooperation with specific fintech service providers and cooperation with Internet giants.Practical implicationsPolicymakers, banks and fintech companies should collaborate to certify the sustainable utilization of fintech tools to ensure financial inclusion. Policymakers should craft policies that encourage effective supervision and regulatory quality of fintechs since they reduce banks' risk-taking practices, which usually have positive effect on the economy.Originality/valueThe study adds value to the debate on the role of regulation on the FBFI-risk-taking nexus, taking into account countries that are at different levels of development.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f451a3b422c8bee8dbc4c5a48db45488",
  "timestamp": "2025-05-15T02:40:27.846344"
}