{
  "id": 6217,
  "title": "Economic and financial ratios: Relevant for stock selection in power and energy sector?",
  "abstract": "The study shows the effect of Macro-Economic Factors such as Interest Rate (INT) and Gross Domestic Product (GDP), Inflation (INF), Financial Ratios such as EPS, NPM, ROC, DE, ATR, CR, ITR, EV on Power and Energy stock prices. The period of the study is from 2011-2021. S&P BSE Energy Index consists of 26 companies, but the study has been conducted on 21 companies due to the unavailability of data in the continuous form. While in S & P BSE Power Index, 14 companies are listed, out of which data of 4 companies was not available in continuous form, thus the final power index sample is locked with 10 companies. The results are important for investors to select the stocks of Power and Energy sectors by considering the resultant effective factors of the study. The Random Effect (RE) Model of Panel Regression was applied which shows that Inflation, Interest Rate, GDP, EPS, ATR and CR have significant effect on Stock Prices. The Research Paper is based on the stocks of Power and energy sector which empowers an investor in analyzing the stock by considering these ratios and accordingly they may include the stock in their portfolio and diversify the risk. The study hasn't covered other economic factors and financial ratios. Other factors and ratios may be considered to know the association with stock return.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4581fea8fa82e910c8457847bb1be94",
  "timestamp": "2025-05-15T02:56:10.565632"
}