{
  "id": 8356,
  "title": "Timing of Diagnosis and Treatment of Glaucoma following Infantile Cataract Surgery",
  "abstract": "Purpose: To report timing of diagnosis and treatment of glaucoma following cataract surgery (GFCS) in a large cohort of infants undergoing cataract surgery at a tertiary care center. Study Design: Cross-sectional study. Participants: All consecutive infants that underwent cataract surgery over a 30-year period from January 1991 to December 2021 were included if they had at least 1 year follow-up. Methods: The data collection included age at time of cataract surgery, presence of associated ocular or systemic conditions, age at diagnosis of GFCS, and treatment required to control GFCS. Glaucoma diagnosis required intraocular pressure (IOP) > 21 mmHg on > 2 visits with glaucomatous optic nerve head changes and/or visual field changes, or in young children, other anatomic changes such as corneal enlargement or haze or accelerated axial elongation and myopic shift. Main Outcome Measures: The incidence of GFCS was calculated. Linear regression was performed to assess the effect of age at time of cataract surgery. Analysis of risk factors and treatment modalities was performed using univariate and multivariate analysis. Results: Three hundred eighty-three eyes (260 patients) were analyzed. Median age at surgery was 52 days and median follow-up, 8 years. Glaucoma following cataract surgery was noted in 27% (104/383 eyes; median age at surgery, 45 days; median follow-up, 13 years.) Young age at surgery (< 3 months) was the greatest risk factor ( P = 0.001) but the incidence was similar for infants operated in the first, second, or third month of life (25%, 36%, 40%, respectively, P = 0.4). Microcornea (41%, P < 0.0001), poorly dilating pupils (25%, P = 0.001), persistent fetal vasculature (PFV, 13%; P = 0.8), or anterior segment dysgenesis (3%, P = 0.02) were considered as additional risk factors. Surgical intervention was needed for 73% (24/33) eyes with early-onset GFCS compared with 14% (10/71) eyes with later-later onset GFCS ( P < 0.0001). Medical treatment was effective in 86% with later-onset GFCS ( P = 0.006). Conclusions: The incidence of GFCS was 27%, and timing of diagnosis occurred in a bimodal fashion. Earlyonset GFCS usually requires surgical intervention; medical treatment is effective for later-onset GFCS. Cataract surgery within the first 3 months of life, microcornea, and poorly dilating pupils were major risk factors. Financial Disclosure(s): The authors have no proprietary or commercial interest in any materials discussed in this article. (c) 2023 by the American Academy of Ophthalmology",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f45cddc75c9a57a53e8b362504fef91f",
  "timestamp": "2025-05-15T03:17:49.203357"
}