{
  "id": 123,
  "title": "A new hybrid parametric and machine learning model with homogeneity hint for European-style index option pricing",
  "abstract": "Here, we propose and investigate a hybrid model that combines parametric option pricing models such as Black-Scholes (BS) option pricing model, Monte Carlo option pricing model, and finite difference method with nonparametric machine learning techniques such as support vector regression (SVR) and extreme learning machine-based regression models. The purpose of this model is to support better investment decisions by forecasting the option price with high predictive accuracy. To further reduce the forecasting error, we incorporate a homogeneity hint (i.e., training the model by categorizing the options data based on moneyness and time-to-maturity of the option contract) into the model. We examine the feasibility and effectiveness of this model using a case study to predict the one-day-ahead price of index options traded in the National Stock Exchange of India Limited. Our experimental results show that the proposed new hybrid model is viable and effective and provides better predictive performance as compared with our benchmark models (standard BS Model, standard Monte Carlo, standard finite difference model, and standard SVR Model). For example, the proposed hybrid model using SVR improved, respectively, the root-mean-square error and mean absolute error by 83.66 and 85.46 % (D1 dataset), 78.02 and 76.0 % (D2 dataset), 91.86 and 90.62 % (D3 dataset), and 87.7 and 90.29 % (D4 dataset), when compared with the benchmarked BS model. We observe similar improvements over the other benchmarked models. Therefore, the proposed new hybrid model is a suitable alternative model for option pricing when higher predictive accuracy is desired.",
  "year": 2017,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f46019b5fc4d65a82609fc6f072411f9",
  "timestamp": "2025-05-15T01:28:35.353277"
}