{
  "id": 244,
  "title": "Research on the multifractal volatility of Chinese banks based on the synthetic minority oversampling technique, edited nearest neighbors and long short-term memory",
  "abstract": "This paper uses five-minute high-frequency trading data for the Shanghai Stock Exchange Banks Index (ticker: SH.000134) from 2014 to 2023 as a research sample, and it employs a method based on multifractal characteristics to classify the financial market risk states of listed banks. A long short-term memory (LSTM) neural network is improved by combining it with the SMOTEENN method (itself a combination of the synthetic minority oversampling technique and edited nearest neighbors), and the SMOTEENN-LSTM model is then used to predict these risk states. The results show that the financial market for China's banking industry exhibits obvious multifractal behavior, and that we can accurately determine the normal state of the market and the states that need attention based on multifractal volatility parameters. The SMOTEENN-LSTM model greatly improves the prediction accuracy of the unmodified LSTM model, and it also significantly outperforms two traditional machine learning models - support vector machines and backpropagation neural networks - with its accuracy reaching 89.27% (as measured by the area under the receiver operating characteristic curve). Fivefold cross-validation shows that, compared with the support vector machine and backpropagation neural network models, the SMOTEENN-LSTM model has superior stability in accuracy indicators such as the area under the receiver operating characteristic curve and the geometric mean, indicating its strong robustness and reliability. This proves it can effectively deal with the problems encountered by traditional models when processing imbalanced data sets. This paper can provide effective tools for financial regulators and financial institutions to better monitor and manage the risks of banking markets and promote their healthy development.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f46b2254246558741547fa701c3b2b30",
  "timestamp": "2025-05-15T01:48:30.771420"
}