{
  "id": 6384,
  "title": "Application of network analysis parameters in risk-based surveillance - Examples based on cattle trade data and bovine infections in Sweden",
  "abstract": "Financial resources may limit the number of samples that can be collected and analysed in disease surveillance programmes. When the aim of surveillance is disease detection and identification of case herds, a risk-based approach can increase the sensitivity of the surveillance system. In this paper, the association between two network analysis measures, i.e. 'in-degree' and 'ingoing infection chain', and signs of infection is investigated. It is shown that based on regression analysis of combined data from a recent cross-sectional study for endemic viral infections and network analysis of animal movements, a positive serological result for bovine coronavirus (BCV) and bovine respiratory syncytial virus (BRSV) is significantly associated with the purchase of animals. For BCV, this association was significant also when accounting for herd size and regional cattle density, but not for BRSV. Examples are given for different approaches to include cattle movement data in risk-based surveillance by selecting herds based on network analysis measures. Results show that compared to completely random sampling these approaches increase the number of detected positives, both for BCV and BRSV in our study population. It is concluded that network measures for the relevant time period based on updated databases of animal movements can provide a simple and straight forward tool for risk-based sampling. (C) 2011 Elsevier B.V. All rights reserved.",
  "year": 2012,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f46cd6ffe148797edd75875bf3041a37",
  "timestamp": "2025-05-15T02:57:38.735722"
}