{
  "id": 6366,
  "title": "Intimate Partner Violence Among Poor Disabled Women in Egypt",
  "abstract": "Intimate partner violence (IPV) is a pervasive global issue that disproportionately impacts women with disabilities, yet remains underexplored in many contexts. This study examines the prevalence and determinants of IPV among poor disabled women in Egypt, aiming to identify the key factors contributing to their heightened vulnerability. Specifically, it addresses the following questions: What are the prevalence rates of IPV in this population? Which sociodemographic and psychological factors influence IPV? How do relationship dynamics shape IPV risk among disabled women? Using data from the 2020 Survey of Violence Against Disabled Women in Egypt, conducted by the National Council for Women in collaboration with the Central Agency for Public Mobilization and Statistics and the United Nations Population Fund, the study analyzes a stratified random sample of 3,144 ever-married disabled women aged 18 years and older from diverse regions of Egypt. Descriptive statistics and logistic regression models were applied to identify significant predictors of IPV. The findings reveal that IPV risk is influenced by sociodemographic factors (e.g., geographical region, educational level, employment status), the onset and type of disability, psychological factors (e.g., self-esteem, self-confidence, fear of the husband, acceptance of violence), and relationship dynamics (e.g., dependency, controlling behaviors, financial control). Women with hearing impairments and those whose disabilities began in childhood or youth were found to face particularly high risks of IPV. Additionally, fear of the husband, acceptance of beating, controlling behaviors, and financial control were identified as strong predictors of IPV across all groups. This study underscores the urgent need for targeted interventions and policies to protect disabled women in Egypt. Recommendations include the development of accessible services, culturally sensitive educational campaigns, and efforts to challenge societal norms that normalize violence. Such measures are critical for mitigating IPV and supporting disabled women, particularly in low- and middle-income countries.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f47f36df9ff6d7eff0103441caf2e545",
  "timestamp": "2025-05-15T02:57:38.678690"
}