{
  "id": 3176,
  "title": "Comparative Analysis of Various Strategies Used in Algorithmic Trading",
  "abstract": "In the ever-growing era of technological advancements, the onset of machine learning and artificial intelligence has brought about a lot of scope in the financial market for the ones willing to undertake the risk. This research project deals with the analysis of various technical indicators which are used in designing Trade-Bots. Also, this research paper aims to assess demand in the Indian consumers regarding the use of algorithms being used for trading in the live market and their perception towards it. Major portion of this report includes creating and testing strategies using machine learning algorithms in python. Expected outcome of this research paper is to identify the best possible strategy for day trading by using the various technical indicators individually as well as in combination. Indian population is skeptical regarding the subject matter but it is evident from the performance of companies like RenTech (Renaissance Technologies) that use of algorithms has helped them gain immense profits, hence the scope of algorithmic trading is vast. Use of both these opportunities together opens up a vast sea of unexplored avenues, one of which is algorithmic trading and finding the best strategy is a never-ending process, this project aims at exploring the various strategies and their impact after back testing them with historical data. This study aims to help the individual investors as well as the investing institutions by exploring the potential of algorithmic trading and its future scope. The analysis provides evidence that SMA/EMA crossover trading strategy and Stochastic oscillator trading strategy are extremely good at predicting the movement of Reliance industries stock, and provide with more than approximately 15 times the initial investment.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f48ef87c7812c827e9bf633b99423eb2",
  "timestamp": "2025-05-15T02:23:33.509402"
}