{
  "id": 3831,
  "title": "Determinants of idiosyncratic risk: evidence from BRICS countries",
  "abstract": "Purpose This study examines the determinants of idiosyncratic risk (IR) or unsystematic risk. The study also examines the determinants of IR by dividing the firms into different categories: beta-based firms, liquid and illiquid firms and financially constrained (FC) and unconstrained (FUC) firms. Design/methodology/approach The fixed effects static panel data model specifications are formulated based on Hausman (1978) test for BRICS (Brazil, Russia, India, China, and South Africa) member countries over the period 2000-2019. Moreover, the t-test is applied to see whether the returns of different types of portfolios are significantly different. Findings The portfolio analysis results show that, on average, high IR firms tend to be small in size, highly leveraged, have low competitiveness, low profitability, less dividend yield and low returns for all the sampled countries. The sample paired t-test also confirms that a significant difference exists between extreme portfolios: small and large size and low IR and high IR portfolios. The panel regression results show that firm size, market power, price-to-earnings ratio, return on equity (ROE) and dividend yield negatively relates to IR. Yet, both leverage and liquidity are positively related to IR. However, the sign of momentum returns is mostly positive for the entire sample. The coefficient values for high-beta, FC and illiquid firms are more significant and large than the firms' counterparts for all BRICS member countries. These results support the hypothesis of an under-diversified portfolio and suggest that the above-mentioned firm-specific variables are the significant determinants of unsystematic risk. Practical implications The securities exchange commission, as the supervisor of the public limited companies, needs to increase its role in investor protection related to the uncertainty of investment in the capital market. Accordingly, in making investment decisions in a stock exchange, investors can use the information that captures unsystematic risk for investment decision-making. Originality/value This study is the first to explore the determinants of IR in top emerging countries. Second, none of the existing studies has focused on the determinants of the IR based on different categories of firms.",
  "year": 2024,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f493a9e3de8e8c21980403c5b6fa2b19",
  "timestamp": "2025-05-15T01:21:08.301820"
}