{
  "id": 1293,
  "title": "An investigational analysis on forecasting intraday values",
  "abstract": "Purpose The algorithmic trading has advanced exponentially and necessitates the evaluation of intraday stock market forecasting on the grounds that any stock market series are foreseen to follow the random walk hypothesis. The purpose of this paper is to forecast the intraday values of stock indices using data mining techniques and compare the techniques' performance in different markets to accomplish the best results. Design/methodology/approach This study investigates the intraday values (every 60th-minute closing value) of four different markets (namely, UK, Australia, India and China) spanning from April 1, 2017 to March 31, 2018. The forecasting performance of multivariate adaptive regression spline (MARSplines), support vector regression (SVR), backpropagation neural network (BPNN) and autoregression (1) are compared using statistical measures. Robustness evaluation is done to check the performance of the models on the relative ratios of the data. Findings MARSplines produces better results than the compared models in forecasting every 60th minute of selected stocks and stock indices. Next to MARSplines, SVR outperforms neural network and autoregression (1) models. The MARSplines proved to be more robust than the other models. Practical implications - Forecasting provides a substantial benchmark for companies, which entails long-run operations. Significant profit can be earned by successfully predicting the stock's future price. The traders have to outperform the market using techniques. Policy makers need to estimate the future prices/trends in the stock market to identify the link between the financial instruments and monetary policy which gives higher insights about the mechanism of existing policy and to know the role of financial assets in many channels. Thus, this study expects that the proposed model can create significant profits for traders by more precisely forecasting the stock market. Originality/value This study contributes to the high-frequency forecasting literature using MARSplines, SVR and BPNN. Finding the most effective way of forecasting the stock market is imperative for traders and portfolio managers for investment decisions. This study reveals the changing levels of trends in investing and expectation of significant gains in a short time through intraday trading.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4b1d0d9dccbe697a64726e852177fff",
  "timestamp": "2025-05-15T00:54:24.604607"
}