{
  "id": 8498,
  "title": "What drives the price behavior of US sustainable stocks?",
  "abstract": "PurposeThis paper aims to identify the key drivers of US sustainable stock price movements in both the short and long term, deploying a rich collection of variables corresponding to green finance, investor attention and sentiment, market fear and uncertainty, macroeconomic variables, common market risk factors, commodity markets and the carbon emission market.Design/methodology/approachThe empirical analysis is based on two main methodologies. First, the elastic net penalized regression is utilized to select the factors most influential on the price formation of sustainable stocks. Second, short- and long-run dynamics of the chosen factors are examined using the dynamic simulations of the autoregressive distributed lag (DYNARDL) model.FindingsOf 32 candidate variables, the elastic net chooses US renewable energy, European sustainable stock market, EU ETS emission allowances, public attention to sustainable finance, gold and European renewable energy as the most contributing factors to the price behavior of sustainable stocks. The DYNARDL estimation results reveal that US renewable energy, European sustainable stock market and EU ETS emission allowances are important determinants in the short and long term, while public attention (European renewable energy) tends to affect sustainable stock prices only in the short (long) run.Practical implicationsThe corresponding short- and long-run effects of US renewable energy, EU ETS emission allowances and European sustainable stocks on US sustainable stock prices should induce policymakers to keep the price behavior of these factors under systematic review. The formulation of policy measures could serve to safeguard the sustainable stock market from the price vagaries in these influential markets.Originality/valueRelevant literature often focuses on the reaction of sustainable stocks to mainstream assets and risk proxies, limiting analysis to a few factors and providing an incomplete understanding of the drivers behind sustainable stock prices. More comprehensive research is needed due to the lack of studies on the determinants of sustainable stock prices and the growing global demand for these investments. This paper aims to address this gap by examining the potential explanatory power of 32 candidate factors representing key players in the global economic and financial landscape.",
  "year": 2025,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4b228a3d8449f8f88582ee10a07e04e",
  "timestamp": "2025-05-15T03:19:21.355168"
}