{
  "id": 3655,
  "title": "Ecology of trading strategies in a forex market for limit and market orders",
  "abstract": "There is a growing interest to understand financial markets as ecological systems, where the variety of trading strategies correspond to that of biological species. For this purpose, transaction data for individual traders are studied recently as empirical analyses. However, there are few empirical studies addressing how traders submit limit and market order at the level of individual traders. Since limit and market orders are key ingredients finally leading to transactions, it would be necessary to understand what kind of strategies are actually employed among traders before making transactions. Here we demonstrate the variety of limit-order and market-order strategies and show their roles in the financial markets from an ecological perspective. We find these trading strategies can be well-characterized by their response pattern to historical price changes. By applying a clustering analysis, we provide an overall picture of trading strategies as an ecological matrix, illustrating that liquidity consumers are likely to exhibit high trading performances compared with liquidity providers. Furthermore, we reveal both high-frequency traders (HFTs) and low-frequency traders (LFTs) exhibit high trading performance, despite the difference in their trading styles; HFTs attempt to maximize their trading efficiency by reducing risk, whereas LFTs make their profit by taking risk.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4ba10eee0e3e41a58b5eaf0e8bc6076",
  "timestamp": "2025-05-15T02:28:29.429956"
}