{
  "id": 3922,
  "title": "Financial uncertainty valuation: does Shariah compliant screening matter?",
  "abstract": "Purpose This paper aims to investigate the financial uncertainty vary according to different financial assets type: conventional and Islamic. Design/methodology/approach Common factors are related to risk or known information. For this, the authors use general dynamic factor model to extract common variation between both types of indexes. Then they calculate stochastic volatility for each idiosyncratic component. They also carry out the study on three different family indexes respectively, Dow Jones, S&P and MSCI indexes, for the period going from January 1, 2008 to June 30, 2018. Through a comparison analysis with uncertainty index designed for conventional assets, the authors examine the similarity between the two indexes via mean, median and variance tests. They decrypt the interrelation between them by using OLS linear regression, vector autoregressive model. Findings The findings show that Islamic assets uncertainty is different from conventional uncertainty level. This difference can be due to the Shariah screening and the prohibition of gharar. The main findings suggest that Islamic financial uncertainty is lower than conventional one. The OLS results prove that conventional financial uncertainties have no impact on their Islamic counterparts. In addition, Islamic financial uncertainty appears to have no significant influence on conventional one exception for Dow Jones pair. Overall, the findings support the decoupling hypothesis in term of uncertainty only for SP and MSCI indexes. Practical implications Risk averse investors can find their claim in Shariah-compliant assets, as it offers a low level of financial uncertainty. A portfolio manager may benefit from the long run non-association in uncertainty between Islamic and conventional assets especially in time of crisis. Originality/value In this work, the authors measured financial uncertainty differently and take into account the specific features of each index type to improve the results quality.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4d01a715c0aa90f2e991f6b76a75e58",
  "timestamp": "2025-05-15T02:31:28.342353"
}