{
  "id": 1393,
  "title": "A Machine Learning Assisted Method of Coverage and Capacity Optimization (CCO) in 4G LTE Self Organizing Networks (SON)",
  "abstract": "Self-Organizing Network (SON) has been introduced more than a decade by the Next Generation Mobile Networks (NGMN) and later standardized by the 3rd Generation Partner-ship Project (3GPP). However, SON has ever never fully met the expectation from Mobile Network Operators (MNOs) since day one due to lack of suitable wireless based Machine Learning (ML) techniques which can empower SON with intelligence in the old days. The authors propose, validate, and productize a wireless ML based scheme ISO-SON to mitigate cell coverage and interference problems in 4G Long Term Evolution (LTE) networks. ISO-SON algorithm portfolio targets at maximally optimizing cell weak coverage and over-coverage collectively. To scale ISO-SON from a single pain-point optimization in a silo to joint optimization for a problem cell group, a novel clustering methodology is also developed in ISO-SON to identify the social network of the targeted problem cell through modeling neighbor cell closeness rate, pair-wised handoff frequencies between problem cell and neighbor cell candidates, and traffic density of neighbor cell candidates. Finally Sequentially Unconstrained Maximization Technique (SUMT) is applied to converge the ISO-SON loss function in a specific conditional range which is feasible for engineering implementation in tuning antenna angles, due to which the gap between 3GPP SON standards and actual operations is bridged through ISO-SON. ISO-SON is productized and now up and running on a tier-1 MNO's 4G LTE networks. Reference Signal Received Power (RSRP), the coverage performance indicator, has been improved by 15% for the problem cells after ISO-SON is deployed.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4d133b1765c2d1d9a9fc6d676c1a1bb",
  "timestamp": "2025-05-15T00:55:28.415143"
}