{
  "id": 4891,
  "title": "THE IMPACT OF SELECTED FINANCIAL FACTORS ON BUSINESS ETHICS IN THE SMES SEGMENT IN THE V4 COUNTRIES",
  "abstract": "This paper aimed to quantify the impact of selected financial management factors on business ethics in the segment of small and medium-sized enterprises (SMEs) in the Visegrad Four countries (Czech Republic, Slovakia, Poland, and Hungary). The empirical research, which was aimed at ascertaining the attitudes of SMEs, was conducted in June 2022 in the Visegrad Four countries. The selection of respondents was carried out by random sampling using the CAWI method. In the Czech Republic, the total number of respondents was 347, in the Slovak Republic, the total number of respondents was 322, in Poland, the total number of respondents was 381 and in Hungary, the total number of respondents was 348. The scientific hypotheses were verified through regression and correlation analysis. The empirical research yielded a number of interesting and stimulating scientific findings. The results showed that the selected factors in the financial management of SMEs have a significant impact on the formation of entrepreneurs' attitudes in the field of business ethics. Knowledge of the most important aspects of the firm's financial management represents the most significant factor influencing the implementation of ethical aspects in the management process of SMEs and positive perceptions of business ethics in the context of financial performance. Other financial factors, namely entrepreneurs' belief that they can appropriately manage financial risks in the firm, a correct understanding of financial risk, and belief in the firm's survival in the medium term, have also shown a significant impact on business ethics. A surprising finding was that a positive assessment of a firm's current financial performance does not have any impact on the formation of attitudes towards business ethics. The representation and intensity of the effect of financial management factors on business ethics varies across the V4 countries. While the attitudes of SMEs in the Czech Republic, Slovakia and Poland have similar characteristics, Hungarian SMEs differ significantly from them.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4dfe439344a0fd8df462be483cbd642",
  "timestamp": "2025-05-15T02:42:04.879725"
}