{
  "id": 1801,
  "title": "Mexican Stock Return Prediction with Differential Evolution for Hyperparameter Tuning",
  "abstract": "Technical analysis aims to predict market movement by examining historical data through statistical procedures. Nevertheless, it is sensitive to the parameter it is working with. An optimization problem is defined to tune technical analysis parameters by minimizing an error metric for stock return prediction. Differential Evolution is a metaheuristic that provides good solutions to an optimization problem, searching for the optimal combination of parameters for technical analyzers to predict Mexican stock returns. For the application of the metaheuristic, an objective function based on a Random Forest prediction is used. The literature has proven the use of different macroeconomic variables (MEV) to determine expected returns, such as the Capital Asset Pricing Model (CAPM) or different Arbitrage Pricing Theories (APT). This paper considers the influence of macroeconomic factors on stock prices; it is approached with a Granger-causality test on the different sector indexes of the Mexican stock exchange, to see the relationship they hold. Instead of supervising the error from the machine learning models, it is proposed to analyze their performance in a more realistic scenario, by simulating a portfolio. Constructing a diversified portfolio is a smart way to allocate your money parting from the expected returns computed, still, other relevant factors may alter its performance. This work shows the performance of different portfolios constructed from the same expected return computations, reaching excess returns over the benchmarks of the 12% in the 3 years analyzed.",
  "year": 2021,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4e70299a1c220416966c15970838776",
  "timestamp": "2025-05-15T00:59:53.141390"
}