{
  "id": 5236,
  "title": "Can climate risk exposure compel companies to undergo a green transformation?",
  "abstract": "Based on the annual report texts of Chinese companies, this paper employs textual analysis to count the frequency of climate risk keywords appearing in annual reports and constructs a company-level climate risk exposure index. In addition, this paper utilizes the entropy method to build a green transformation index from eight dimensions. Utilizing a substantial research sample of 27,012 companies across various industries, excluding the financial sector, from 2011 to 2021, this study investigates whether companies are driven to pursue green transformation by their exposure to climate risks. The empirical results show that both overall climate risk exposure and transition risk exposure have the potential to compel companies to adopt green strategies. However, the influence of physical risk exposure on their green transformation is not effective. Group regression analysis finds that the impact of climate risk exposure driving corporate green transformation is particularly notable in the case of non-state-owned enterprises (NSOEs), larger-scale companies, and manufacturing companies. Mechanism study reveals that climate risk exposure compels corporate green transformation by encouraging increased R&D investments and enhancing supply chain efficiency. As for the economic outcome, companies compelled to undergo green transformation could experience an enhancement of their market value, which is important for the sustainable development of companies.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f4f2155e020b0e55153e2201c2ccbbde",
  "timestamp": "2025-05-15T02:45:47.401829"
}