{
  "id": 5071,
  "title": "ASA score and procedure type predict complications and costs in maxillofacial reconstructive surgery: a retrospective study using a hospital administrative database",
  "abstract": "BACKGROUND: Reconstruction of osseous and soft tissue defects after surgical resection of oral cavity cancers can be achieved by a single-stage procedure with a microvascular bone flap or by a two-step approach with a soft tissue flap and subsequent bone augmentation. The therapeutic approach should be selected based on the patient's needs. Economic pressure requires preoperative risk assessment and estimation of the postoperative course. Flat-rate reimbursement systems via diagnosis-related groups with insufficient morbidity adjustments and financial sanction of medical complications might additionally cause false incentives in the choice of treatment. OBJECTIVE: This study aimed to assess the influence of the type of flap chosen for maxillofacial reconstructive surgery on the total costs. Complication rates of different types of flap surgery and their prediction by a preoperative risk assessment tool (American Society of Anesthesiologists [ASA] score) were determined. Overall, the fairness of the current reimbursement system was rated. METHODS: Patient characteristics, clinical data, and data on total costs and reimbursement of patients aged 18 years and older having undergone maxillofacial reconstructive flap surgery at the University Hospital of Zurich (Switzerland) between 2012 and 2014 were analysed. The preoperative risk was classified by the ASA score. Complications were graded according to the Clavien-Dindo classification system and the comprehensive complication index (CCI). Statistical analysis included Spearman and Pearson rank correlation, Kruskal-Wallis and Mann-Whitney nonparametric tests, and linear regression analysis. RESULTS: 129 patients were included in this study. Soft tissue flaps were performed in 82 patients, of which 56 were radial forearm flaps (43.4%), bone flaps in 41 patients, of which 32 were fibula flaps (24.8%), and combined flaps in 6 patients (4.7%). Patients with fibula flaps showed a significantly higher CCI and higher total costs. Higher preoperative ASA scores were significantly associated with increased length of stay, total costs and complications. Both the ASA score and reconstruction with a radial forearm flap were significant predictors of complications and total costs. Total median costs for radial forearm flaps were CHF 50,560 (reimbursement: CHF 60,851; difference: CHF 10,291) and for fibula flaps CHF 66,982 (reimbursement: CHF 58,218; difference: CHF -8,764). CONCLUSION: The ASA score allows a reliable preoperative assessment of patient outcomes and financial burden in maxillofacial reconstructive flap surgery. The type of flap reconstruction significantly influences complications and ultimately total costs. The current reimbursement system via diagnosis-related groups (DRGs) does not take sufficient account of this fact. Adaptations are therefore needed to prevent misplaced incentives to the detriment of patients.",
  "year": 2021,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f50009788a04acb43bbeb2af9a64308a",
  "timestamp": "2025-05-15T02:44:10.978265"
}