{
  "id": 4454,
  "title": "Examining the Role of Substance Abuse in Elder Mistreatment: Results From Mistreatment Investigations",
  "abstract": "Substance abuse has long been identified as a risk factor for elder mistreatment, yet research on the topic remains sparse. This study tested hypotheses whether perpetrator and victim substance use problems were associated with financial exploitation, physical abuse, emotional abuse, and neglect versus no abuse. Cross-sectional data were collected on 948 cases with yes/no substantiation decisions where 357 cases had no abuse in elder mistreatment investigations. Hypotheses were tested using odds ratios, bivariate, and multiple linear regression analyses including a control for victim vulnerability. Of 948 alleged victims, 42 (4.4%) exhibited signs of substance use problems. Among the 323 alleged perpetrators, 87 (26.9%) were reported to have substance use problems. Substance use problems by alleged perpetrators were associated (p < .01) with financial exploitation, physical abuse, and emotional abuse but not neglect. Substance use problems by alleged victims were associated with neglect, but not the other types. Alleged perpetrators with substance use problems tended to commit multiple forms of abuse, were male and not caregivers. Except for the findings on neglect, the associations with elder mistreatment were stronger for alleged perpetrators with substance use problems, than for alleged victims. Clarification of the role of perpetrator risk factors such as substance abuse should improve risk identification and subsequent intervention.",
  "year": 2019,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5012609227b9d7faa5fd483c281209b",
  "timestamp": "2025-05-15T02:37:16.966617"
}