{
  "id": 6946,
  "title": "Q Fever Knowledge, Attitudes and Vaccination Status of Australia's Veterinary Workforce in 2014",
  "abstract": "Q fever, caused by Coxiella burnetii, is a serious zoonotic disease in humans with a worldwide distribution. Many species of animals are capable of transmitting C. burnetii, and consequently all veterinary workers are at risk for this disease. An effective Q fever vaccine has been readily available and used in Australia for many years in at-risk groups, and the European Centre for Disease Prevention and Control has recently also called for the use of this vaccine among at-risk groups in Europe. Little is known about attitudes towards this vaccine and vaccine uptake in veterinary workers. This study aimed to determine the Q fever vaccination status of veterinarians and veterinary nurses in Australia and to assess and compare the knowledge and attitudes towards Q fever disease and vaccination of each cohort. An online cross-sectional survey performed in 2014 targeted all veterinarians and veterinary nurses in Australia. Responses from 890 veterinarians and 852 veterinary nurses were obtained. Binary, ordinal and multinomial logistic regression were used to make comparisons between the two cohorts. The results showed that 74% of veterinarians had sought vaccination compared to only 29% of veterinary nurses. Barriers to vaccination among those not vaccinated did not differ between cohorts, and included a lack of perceived risk, financial expense, time constraints, and difficulty in finding a vaccine provider. Poor knowledge and awareness of Q fever disease and vaccination were additional and notable barriers for the veterinary nursing cohort, suggesting veterinary clinics and veterinarians may not be meeting their legal responsibility to educate staff about risks and risk prevention. Further evaluation is needed to identify the drivers behind seeking and recommending vaccination so that recommendations can be made to improve vaccine uptake.",
  "year": 2016,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f503fe4e49896d88ea6830d85248eff9",
  "timestamp": "2025-05-15T03:03:13.507140"
}