{
  "id": 9358,
  "title": "Enhanced Detection of Open-angle Glaucoma with an Anatomically Accurate Optical Coherence Tomography-Derived Neuroretinal Rim Parameter",
  "abstract": "Objective: Neuroretinal rim assessment based on the clinical optic disc margin (DM) lacks a sound anatomic basis for 2 reasons: (1) The DM is not reliable as the outer border of rim tissue because of clinically and photographically invisible extensions of Bruch's membrane (BM) inside the DM and (2) nonaccountability of rim tissue orientation in the optic nerve head (ONH). The BM opening-minimum rim width (BMO-MRW) is a parameter that quantifies the rim from its true anatomic outer border, BMO, and accounts for its variable orientation. We report the diagnostic capability of BMO-MRW. Design: Case control. Participants: Patients with open-angle glaucoma (n = 107) and healthy controls (n = 48). Methods: Spectral-domain optical coherence tomography (SD-OCT) with 24 radial and 1 circumpapillary B-scans, centered on the ONH, and confocal scanning laser tomography (CSLT) were performed. The internal limiting membrane (ILM) and BMO were manually segmented in each radial B-scan. Three SD-OCT parameters were computed globally and sectorally: (1) circumpapillary retinal nerve fiber layer thickness (RNFLT); (2) BMO-horizontal rim width (BMO-HRW), the distance between BMO and ILM in the BMO reference plane; and (3) BMO-MRW, the minimum distance between BMO and ILM. Moorfields Regression Analysis (MRA) with CLST was performed globally and sectorally to yield MRA1 and MRA2, where borderline was classified as normal and abnormal, respectively. Main Outcome Measures: Sensitivity, specificity, and likelihood ratios (LRs) for positive and negative test results (LR+/LR-). Results: The median (interquartile range) age and mean deviation of patients and controls were 69.9 (64.3-76.9) and 65.0 (58.1-74.3) years and -3.92 (-7.87 to -1.62) and 0.33 (-0.32 to 0.98) dB, respectively. Globally, BMO-MRW yielded better diagnostic performance than the other parameters. At 95% specificity, the sensitivity of RNFLT, BMO-HRW, and BMO-MRW was 70%, 51%, and 81%, respectively. The corresponding LR+/LR- was 14.0/0.3, 10.2/0.5, and 16.2/0.2. Sectorally, at 95% specificity, the sensitivity of RNFLT ranged from 31% to 59%, of BMO-HRW ranged from 35% to 64%, and of BMO-MRW ranged from 54% to 79%. Globally and in all sectors, BMO-MRW performed better than MRA1 or MRA2. Conclusions: The higher sensitivity at 95% specificity in early glaucoma of BMO-MRW compared with current BMO methods is significant, indicating a new structural marker for the detection and risk profiling of glaucoma. Financial Disclosure(s): Proprietary or commercial disclosure may be found after the references. Ophthalmology 2013;120:535-543 (C) 2013 by the American Academy of Ophthalmology.",
  "year": 2013,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f50411544d35130cc0bda2549189cf5f",
  "timestamp": "2025-05-15T03:27:53.432023"
}