{
  "id": 8462,
  "title": "Relief Policy and the Sustainability of COVID-19 Pandemic: Empirical Evidence from the Italian Manufacturing Industry",
  "abstract": "This work investigates the impact of COVID-19 on the Italian manufacturing industry, testing whether the recovery measures introduced by the government were effective in alleviating the economic consequences of the virus in 2020. In particular, this work aims to address the impact of COVID-19 on the Italian manufacturing industry, and evaluation of the adopted recovery measures. Considering the current situation, with the war in Ukraine and the related gas crisis across the European Union, such investigation on policy relief is even more relevant, contributing to the current debate. Adopting RE models, and considering the latest economic and financial information available, we analyzed active private limited firms in the Italian manufacturing industry between 2019 and 2020, investigating the impact of layoff on their productivity (i.e., Total Factor Productivity) and profitability (i.e., Return On Assets), as well as their expected probability of default. According to the results of these regression models, and assuming 8 weeks of layoff, we observed an increase in productivity (between 1.20% and 1.59%), a decrease in profitability (1.47%) and an increase in bankruptcy risk (2.27%). Hence, the relief policy was not able to alleviate the economic consequences of COVID-19 for these firms, even though the layoffs were able to support their productivity. Practical implications concern the necessary improvements for the above relief policy, i.e., interventions to support the demand of manufactured products, interventions to support the digitalization of services, interventions to support the remote working, and interventions to support the introduction of innovative products on the market.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f50a6c31a3273567172a444a34713546",
  "timestamp": "2025-05-15T03:18:51.775641"
}