{
  "id": 3437,
  "title": "MARKETING MANAGEMENT OF A SMALL INDUSTRIAL ENTERPRISE",
  "abstract": "The article focuses on establishing the marketing management system of a small industrial enterprise in the B2B market based on the relationship marketing concept. The study aims to develop methodological approach to estimating the relationship marketing performance, and to elaborate the marketing balanced scorecard for a small industrial enterprise. Methodology is based on relationship marketing concept, marketing goals relying on the Kaplan and Norton's business perspectives. The paper presents statistical models to validate the factors influencing the sales. The factors are tested with the regression model, multivariate dispersive analysis in the SPSS software. The models are used for a small-scale PVC producer case study. The findings suggest that advertising and dealer network parameters have the greatest impact on sales. Regression model calculations confirmed the importance of customer satisfaction with products, services, and relations for the sales of a small industrial enterprise in the B2B market. The advantages of the proposed marketing balanced scorecard allowed integrating the marketing management into the overall management system, providing analytical support for managerial decisions, forecasting the demand, developing portfolio of relationship management strategies for major customers based on their values. The study contributes to understanding the importance of relationship marketing for a small industrial enterprise.",
  "year": 2019,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f50e56e4fcdaf194897c883601c42576",
  "timestamp": "2025-05-15T01:16:55.614684"
}