{
  "id": 5170,
  "title": "Health-related productivity losses increase when the health condition is co-morbid with psychological distress: findings from a large cross-sectional sample of working Australians",
  "abstract": "Background: The health condition of workers is known to impact on productivity outcomes. The relationship between health and productivity is of increasing interest amid the need to increase productivity to meet global financial challenges. Prevalence of psychological distress is also of growing concern in Australia with a two-fold increase in the prevalence of psychological distress in Australia from 1997-2005. Methods: We used the cross-sectional data set from the Australian Work Outcomes Research Cost-benefit (WORC) study to explore the impacts of health conditions with and without co-morbid psychological distress, compared to those with neither condition, in a sample of approximately 78,000 working Australians. The World Health Organisation Health and Performance Questionnaire was used which provided data on demographic characteristics, health condition and working conditions. Data were analysed using negative binomial logistic regression and multinomial logistic regression models for absenteeism and presenteeism respectively. Results: For both absenteeism and presenteeism productivity measures there was a greater risk of productivity loss associated when health conditions were co-morbid with psychological distress. For some conditions this risk was much greater for those with co-morbid psychological distress compared to those without. Conclusions: Co-morbid psychological distress demonstrates an increased risk of productivity loss for a range of health conditions. These findings highlight the need for further research to determine whether co-morbid psychological distress potentially exacerbates lost productivity.",
  "year": 2011,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f51515ad7f6bb54d63215513cbfb8bde",
  "timestamp": "2025-05-15T02:45:17.007577"
}