{
  "id": 4426,
  "title": "Financial strain is associated with poorer cardiovascular health: The multi-ethnic study of atherosclerosis",
  "abstract": "Objective: Psychosocial stress is associated with increased cardiovascular disease (CVD) risk. The relationship between financial strain, a toxic form of psychosocial stress, and ideal cardiovascular health (CVH) is not well established. We examined whether financial strain was associated with poorer CVH in a multi-ethnic cohort free of CVD at baseline. Methods: This was a cross-sectional analysis of 6,453 adults aged 45-84 years from the Multi-Ethnic Study of Atherosclerosis. Financial strain was assessed by questionnaire and responses were categorized as yes or no. CVH was measured from 7 metrics (smoking, body mass index, physical activity, diet, total cholesterol, blood glucose and blood pressure). A CVH score of 14 was calculated by assigning points to the categories of each metric (poor = 0 points, intermediate = 1 point, ideal = 2 points). Multinomial logistic regression was used to examine the association of financial strain with the CVH score (inadequate 0-8, average 9-10, and optimal 11-14 points) adjusting for sociodemographic factors, depression and anxiety. Results: The mean age (SD) was 62 (10) and 53 % were women. Financial strain was reported by 25 % of participants. Participants who reported financial strain had lower odds of average (OR, 0.82 [95 % CI, 0.71, 0.94]) and optimal (0.73 [0.62, 0.87]) CVH scores. However, in the fully adjusted model, the association was only significant for optimal CVH scores (0.81, [0.68, 0.97]). Conclusion: Financial strain was associated with poorer CVH. More research is needed to understand this relationship so the burden of CVD can be decreased, particularly among people experiencing financial hardship.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f51f02dd3ec38e7286f2240acae339e1",
  "timestamp": "2025-05-15T02:37:16.795717"
}