{
  "id": 1614,
  "title": "A Generalized Approach for Digital Holographic Recording and Reconstruction",
  "abstract": "In recent years, research efforts in the field of digital holography have expanded significantly, due to the ability to obtain high resolution intensity and phase images. The information contained in these images have become of great interest to the machine learning community, with applications spanning a wide portfolio of research areas including bioengineering. In this work, we seek to demonstrate a high fidelity simulation of holographic recording. By accurately representing diffraction, aberrations, and speckle introduced via propagation of a coherent light source through a series of optical elements and the object itself, we will accurately predict the optical interference of the object and reference wave at the recording plane. We will show that the optical transformation that predicts the complex field at the recording plane can be generalized for arbitrary holographic recording configurations using matrix optics. In addition, we will provide a detailed description of digital phase reconstruction and aberration compensation, for a variety of off-axis holographic configurations. Reconstruction errors will be presented for the various holographic recording geometries and complex field objects. The generalized holographic simulation described in this work will seek to motivate using the reconstruction of the simulated holograms to populate a database which can be used to train machine learning algorithms aimed at classifying relevant objects recorded through a variety of holographic setups.",
  "year": 2020,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f54b6dfbb1aceebad2b2830b03f5dff1",
  "timestamp": "2025-05-15T00:57:46.844996"
}