{
  "id": 167,
  "title": "RETRACTED: A Convolutional Neural Network-Based Model for Supply Chain Financial Risk Early Warning (Retracted Article)",
  "abstract": "At present, there are widespread financing difficulties in China's trade circulation industry. Supply chain finance can provide financing for small- and medium-sized enterprises in China's trade circulation industry, but it will produce financing risks such as credit risks. It is necessary to analyze the causes of the risks in the supply chain finance of the trade circulation industry and measure these risks by establishing a credit risk assessment system. In this article, a supply chain financial risk early warning index system is established, including 4 first-level indicators and 29 third-level indicators. Then, on the basis of the supply chain financial risk early warning index system, combined with the method of convolution neural network, the supply chain financial risk early warning model of trade circulation industry is constructed, and the evaluation index is measured by the method of principal component analysis. Finally, the relevant data of trade circulation enterprises are selected to make an empirical analysis of the model. The conclusion shows that the supply chain financial risk early warning model and risk control measures established in this article have certain reference value for the commercial circulation industry to carry out supply chain finance. It also provides guidance for trade circulation enterprises to deal with supply chain financial risks effectively.",
  "year": 2022,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f54c6d6d639565f87bd7a6586eff9aa9",
  "timestamp": "2025-05-15T01:47:52.930792"
}