{
  "id": 4071,
  "title": "Banking sector reforms in Bangladesh: In search of solution",
  "abstract": "With a view to making banking sector more disciplined organized and productive several measures were taken during a decade under policy stabilization and reform package. It is observed that the overall performance of the reform measures is of course very poor and unsatisfactory. In tile Study it is found that Financial Sector Reforms Program (FSRP) Succeeded in the improvement of some regulatory framework Such as liberalizing interest rates, development of indirect monetary instruments, introducing loans classification and provisioning guidelines, etc. As a result reform measures under FSRP have failed mostly to establish financial stability in the banking sector. In order to make financial sector dynamic and efficient the next phase of reforms program started in 1997 under Commercial Bank Restructuring Project (CBRP) with due attention in the management of Nationalized Commercial Banks (NCBs). restructuring the commercial banks, technology development, restoration of capital adequacy of banks based oil risk-weighted assets, etc. However, it has also been observed in the study that like FSRP, reform measures under CBRP Could not able to bring my visible positive result in terms of loan recovery and operational efficiency with a few exceptions. Thus the study reveals that financial sector reform measurers ire largely unsuccessful to fulfill the reforms target as expected.",
  "year": 2002,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f57873ffab2bfe149688c082a676d2ed",
  "timestamp": "2025-05-15T02:33:03.367983"
}