{
  "id": 7992,
  "title": "A 3-year follow-up study of social, lifestyle and health predictors of cognitive impairment in a Chinese older cohort",
  "abstract": "Background Longitudinal data on the older population in the Asian setting are limited. This paper reports the factors associated with the development of cognitive impairment (CI) in a cohort of Chinese elderly aged greater than or equal to70 years. Methods The study cohort comprising 2030 subjects aged greater than or equal to70 years was assembled in 1991-1992 and followed for 36 months. Baseline information on cognitive function, as well as a number of social and health variables were obtained through face-to-face interview at the respondent's place of residence. The outcome variable was the development of CI among 988 cohort members who were initially free from CL and who could be contacted at the 36-month follow-up. The instrument used to assess CI was based on the information/orientation part of the Clifton Assessment Procedure for the elderly (CAPE), using a cut-off point of 7. Results Of the men, 6.7%, but 22.2% of women had CI at 3-year follow-up. The age-adjusted annual incidence of CI was 1.52% in men, and 6.37% in women. Multivariate logistic regression analysis showed that women had a 2.5-fold increased risk of having CI, compared with men. The risk increased by about 1.5-fold with every 5-year increase in age. Slow gait time, as assessed by the 16-foot walk, was a predictor of CI in both sexes (odds ratio [OR] = 1.03 per second increase, 95% CI: 1.0-1.07). Men residing in institutions had a 4.4-fold increased risk of having CI (95% CI: 1.7-11.1) compared with those residing in community, while the OR among women was 2.5 (95% CI : 1.3-4.9). Among women, no formal education increased the risk of having CI by 3.2-fold (95% CI : 1.8-5.5). Income dependency also increased the risk of CI by about fourfold, and no exercise at baseline was associated with a twofold increased risk of CI. Incident stroke during follow-up also increased the risk of CI (OR = 8.4, 9 5 % CI : 1.2-59.4). Conclusions Older age and female sex were independent factors associated with CI. No formal education, slow gait time and institutionalization increased the risk of CI in both sexes. While education had a stronger effect in women, institutionalization had a stronger effect in men. Financial dependency, lack of exercise and incident stroke played a significant role in women.",
  "year": 2001,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5936a96e4f5c1a268ecf6e6eaaa4561",
  "timestamp": "2025-05-15T03:14:07.268094"
}