{
  "id": 1567,
  "title": "Sustainable finance: The role of savings and credit cooperatives in Ecuador",
  "abstract": "The current world situation leads us to consider that sustainable development needs to be a global priority to ensure the future of the planet and improve the quality of life. There is a need for sustainable finance to support this. Savings and credit cooperatives could help to achieve this impact as they serve the microfinance and microlending market. They facilitate the financial inclusion of the most vulnerable people, most of whom live in rural areas and are members of organizations, such as agricultural cooperatives and associations. Previous studies have focused exclusively on overall profitability, so this paper contributes to extending the literature by analyzing the whole population of savings and credit cooperatives in Ecuador (510 institutions), focusing on their profitability in two ways: the overall profitability necessary for the viability of the business and, in addition, the microcredit portfolio profitability, as a specific measure of its contribution to sustainability and social value creation. Another novelty is that the analysis has been carried out using several machine learning techniques for the wider generalization of the results. These show that size is the most relevant variable for predicting the ROE and that the microcredit portfolio profitability is conditioned by the credit variables.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f59b34a977e1758a5851333ed32da2d2",
  "timestamp": "2025-05-15T00:57:12.655191"
}