{
  "id": 7453,
  "title": "Readmissions in patients with cerebral cavernous malformations: a national readmission database study",
  "abstract": "BACKGROUND: Cerebral cavernous malformations (CCMs) are microvascular CNS lesions prone to hemorrhage leading to neurological sequela such as stroke and seizure. A subset of CCM patients have aggressive disease leading to multiple bleeding events, likely resulting multiple hospitalizations. Hospital admission rates are an important metric that has direct financial impact on hospitals and an indicator of overall disease burden. Furthermore, analysis of hospital readmissions can lead to early identification of high-risk patients and provides insight into the pathogenesis of CCM lesions. The purpose of this study is to identify high risk CCM patients with increased all cause readmission and comorbidities associated with increased readmissions. METHODS: All US hospital admissions due to CCMs were searched using the 2017 National Readmission Database (NRD). Patients with readmissions within 30 days of discharge from index hospitalization were identified and analyzed, relative to the remaining population.RESULTS: Among all patients hospitalized for CCM, 14.9% (13.7-16.2%) required all cause readmission within 30 days. Multivariate logistical regression analysis showed that substance abuse (P=0.003), diabetes (P=0.018), gastrointestinal bleed (P=0.002), renal failure (P=0.027), and coronary artery disease (P=0.010) were predictive of all cause readmissions, while age group 65-74 (P=0.042), private insurance (P<0.001), and treatment at a metropolitan teaching institution (P=0.039) were protective. Approximately half of all readmissions are caused by neurological (33.9%) and infectious (14.6%) etiologies. The 30-day lesion bleeding rate after index hospitalization is 0.8% (0.5-1.2%).CONCLUSIONS: All identified comorbidities associated with increased risks of readmission contribute to vascular stress, suggesting its role in lesion pathogenesis. This is the first and only study to analyze readmission metrics for CCMs in order to identify high risk patient factors to date.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5a3c6fb286483830c9546c7fbc9a6b0",
  "timestamp": "2025-05-15T03:08:37.973938"
}