{
  "id": 7884,
  "title": "Who enrols in voluntary micro health insurance schemes in low-resource settings? Experience from a rural area in Bangladesh",
  "abstract": "Background: Micro health insurance (MHI) has proved to be a potential health-financing tool for many developing countries. Bangladesh also included MHI in its current health-financing strategy which aims to achieve universal health coverage. However, low uptake, low renewal and high dropouts have historically challenged financial sustainability of these schemes. Objective: This study aims to identify factors influencing people from low-resource settings, particularly those from Bangladesh, to enrol in MHI schemes. Methods: The study analyses the Amader Shasthya' MHI scheme operating in Chakaria, a sub-district under Cox's Bazar district, Bangladesh. A household survey was carried out during May-June 2016 among 2,000 households from the scheme coverage area. The Outreville's insurance-demand framework was used to identify enrolment influencing factors. Multivariate logistic regression analysis was carried out to identify significant influencing factors of enrolment. Results: Enrolment influencing factors were identified in four dimensions: economic, socio-cultural, demographic and structural. Households with the main income earner having 10+years of schooling (odds 1.9 [CI 1.2-2.9] compared to illiterate), having financial literacy (odds 1.5 [CI 1.2-1.8] compared to financially illiterate) and being a public/private service holder (odds 1.6 [CI 1.1-2.4] compared to menial labour) were more likely to enrol. Membership in development programmes of NGOs also influenced enrolment decision significantly (odds 1.3 [CI 1.0-1.5]). The presence of chronic illness in household encouraged enrolment (odds 1.5 [CI 1.2-1.8]). Households living closer to health centres were more likely to enrol (odds 2.1 [CI 1.6-2.7]) compared to those living further away. Conclusion: The findings are expected to have significant implications in terms of designing similar health insurance schemes, particularly in terms of designing demand-driven and context adapted schemes that have greater potential to attract a larger client pool, ensure effective risk pooling and eventually expedite the achievement of universal health coverage in low-resource settings.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5a9bdc66ce563496324573b2cb276b9",
  "timestamp": "2025-05-15T03:13:04.918619"
}