{
  "id": 439,
  "title": "Determination of the adequate capital for default protection under the one-factor Gaussian term structure model",
  "abstract": "In practice, credit risk is measured by one of the two different methodologies. One measures the prices and sensitivities of the credit linked instruments. Another measures the required collateral or capital needed to cover a potential default loss. This paper introduces a pricing methodology, which also determines the required capital. Conventionally the value-at-risk method is used to determine collateral requirements. Artzner et al. demonstrated that the resulting adequate capital measures may fail to capture the credit diversification effect, which is critical in credit risk management. (cf Artzner, P., Delbaen, F., Eber, J.-M., Heath, D. 1997. Definition of coherent measures of risk. Paper presented at the Symposium on Risk Management, European Finance Association, Vienna, August 27-30). In order to overcome this problem, this paper introduces a new approach, which combines closed form solutions and the Hull-White trinomial tree. This combined approach is computationally faster than a naively implemented Monte-Carlo-based VAR methodology. The pricing model is based on the rating-based Gaussian term structure model developed by Nakazato. This approach is applicable to a wide variety of credit derivatives and their portfolios in a coherent fashion. In this paper, however, attention is concentrated on determining the collateral requirement for the counter party risk when there is the risk of credit rating change on an issue and also risk of default on that issue or on any protection already written on the issue. (C) 2000 Elsevier Science B.V. All rights reserved. JEL classification: G33; G21; E43.",
  "year": 2000,
  "source": "WOS",
  "area": "derivatives_pricing",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5b0e4bad813052af2e561da5d944ba4",
  "timestamp": "2025-05-15T01:31:50.787502"
}