{
  "id": 494,
  "title": "Early warning of systemic risk in stock market based on EEMD-LSTM",
  "abstract": "With the increasing importance of the stock market, it is of great practical significance to accurately describe the systemic risk of the stock market and conduct more accurate early warning research on it. However, the existing research on the systemic risk of the stock market lacks multi-dimensional factors, and there is still room for improvement in the forecasting model. Therefore, to further measure the systemic risk profile of the Chinese stock market, establish a risk early warning system suitable for the Chinese stock market, and improve the risk management awareness of investors and regulators. This paper proposes a combination model of EEMD-LSTM, which can describe the complex nonlinear interaction. Firstly, 35 stock market systemic risk indicators are selected from the perspectives of macroeconomic operation, market cross-contagion and the stock market itself to build a comprehensive indicator system that conforms to the reality of China. Furthermore, based on TEI@I complex system methodology, an EEMD-LSTM model is proposed. The EEMD method is adopted to decompose the composite index sequence into intrinsic mode function components (IMF) of different scales and one trend term. Then the LSTM algorithm is used to predicted and model the decomposed sub-sequences. Finally, the forecast result of the composite index is obtained through integration. The empirical results show that the stock market systemic risk index constructed in this paper can effectively identify important risk events within the sample period. In addition, compared with the benchmark model, the EEMD-LSTM model constructed in this paper shows a stronger early warning ability for systemic financial risks in the stock market.",
  "year": 2024,
  "source": "WOS",
  "area": "financial_risk",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5ba8c10679166c3a075e8c11b87faa0",
  "timestamp": "2025-05-15T01:38:59.275729"
}