{
  "id": 5797,
  "title": "Downside risk and profitability ratios: The case of the New York Stock Exchange",
  "abstract": "This article analyses the relationship between the volatility and sensitivity measures determined based on accounting profitability ratios and those calculated based on rates of return of public corporations from DJIA. The study employed downside and symmetric risk measures. The average accounting profitability and mean rate of returns on NYSE have also been compared. An additional goal was to present a classification of selected risk measures divided into accounting and market ones. This study examined the profitability and risk of the largest companies listed on the NYSE. The risk measurement was performed with the measures based on information from financial statements as well as measures whose calculation was based on the market share prices. The total risk was considered in the context of variance (standard deviation) and semi-variance (semi-deviation). The downside systematic risk was measured with the modified BawaLindenberg and Harlow-Rao formulas. These formulas were also implemented to determine the downside accounting betas. The empirical studies helped to identify a positive correlation between the mean quarterly profitability ratios (ROA and ROE) and the mean quarterly return rates in the largest NYSE companies. The correlations between the market and accounting betas calculated using the Bawa-Lindenberg modified formula were positive and statistically significant. A positive and statistically positive correlation between the market and accounting measures was also found for the total downside risk. Moreover, it has been shown that for both total and systematic market risk measures their accounting equivalents can be used. The accounting risk measures may be a valuable supplement to market measures. Of particular importance in this context are the downside accounting beta coefficients. The downside accounting betas are a new group of risk measures, and research into their use in risk analysis and in asset pricing is in its early stages.",
  "year": 2023,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5cc7c82a954de881bb8f3bb6808b6df",
  "timestamp": "2025-05-15T02:51:30.086862"
}