{
  "id": 2056,
  "title": "Risk Decision of Corporate Internet Financial Reporting Based on Brain Evoked Potential Testing Technology",
  "abstract": "Corporate decision makers will weigh and balance before making any decisions at different points in time. Different time and process of decision-making will lead to different degrees of risk to the financial status of the company. According to different inter-temporal decision-making financial risks, corporate decision makers will show different behavioral responses and neural changes. Based on the brain evoked potential testing technology, this study tests the behavioral performance and brain mechanism responses of the subjects under the frameworks of financial risk and zero financial risk, and explores the brain evoked potential and brain network mechanism of inter-temporal decision-making on financial risks. The experimental results show that subjects are more willing to choose the options that are nearer in time and smaller in number under the framework of risk conditions. Under the two frame conditions, the decision type has significant main effect, while the electrode has no main effect, and there is no interaction effect between the decision type and the electrode. The degree distribution, clustering coefficient and shortest path length under the two frame conditions are different, that is, the function and efficiency of brain network are different. Analysis of the key nodes by degree distribution also shows that the brain mechanism is different under the two conditions.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5d30ee536322b1444ecd9aa1a4d959d",
  "timestamp": "2025-05-15T02:10:25.840164"
}