{
  "id": 254,
  "title": "E2EAI: End-to-End Deep Learning Framework for Active Investing",
  "abstract": "Active investing aims to construct a portfolio of assets that are expected to be relatively profitable in the markets. A popular strategy involves the use of factor-based methods. Recently, efforts have increased to apply deep learning to identify deep factors that could provide more active returns or promising pipelines for asset trend prediction. However, the question of constructing an active investment portfolio via an end-to-end deep learning framework (E2E) remains largely unexplored in existing research. In this paper, we are the first to propose an E2E approach that encompasses nearly the entire process of factor investing, including factor selection, combination, stock selection, and portfolio construction. A key challenge we address is the potential divergence in the directions of deep factors across different horizon lengths, which can create conflicts in the learning process of our multi-task learning model, E2EAI. To overcome this, we design a directional recovery algorithm that ensures consistent learning across tasks. Extensive experiments on real stock market data demonstrate the effectiveness of our end-to-end deep learning framework in active investing. Our approach not only enhances the potential returns of active investment strategies but also provides a comprehensive solution for managing multi-task learning conflicts in the context of deep learning-based factor investing.",
  "year": 2023,
  "source": "WOS",
  "area": "portfolio",
  "method": "deep learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5de80d2021c8055862730c6b85e5051",
  "timestamp": "2025-05-15T00:34:13.489157"
}