{
  "id": 6707,
  "title": "Analysis on the Influence of C-ROSS on the Profitability of China's Property Insurance Companies",
  "abstract": "In recent years, China's insurance industry has developed rapidly but the profits have been fluctuating. Especially China Risk Oriented Solvency System(C-ROSS) was formally implemented in 2016, industry profits fell by 30% and the net profits of property insurers declined significantly with the slow growth of premium income. How C-ROSS affects the profitability of property insurers has become the focus of this study. Through analyze the profitability status of the whole property insurance market and combined with the DuPont analysis system to analyze the profitability of different-scale property insurers. And I build models with dummy variables and C-ROSS related indicators, using the YEARBOOK OF CHINA'S INSURANCE and the companies' annual reports to fully explore the impact of C-ROSS on the profitability of China's property insurers. The article has five chapters. The first chapter describes the background and significance of the topic selection, and analyzes the status quo by combining domestic The second chapter analyzes the profitability status of the whole property insurance market and selects 30 sample companies' data as research object. The sample companies are classified and analyzed separately from the cost and profit structure according to the scale of premium income. The third chapter introduces the DuPont analysis method and combines the characteristics of the property insurers to decompose and replace some indicators, and analyze the indicators in the light of different types of property insurance companies. The fourth chapter is the empirical part of this article. I select 30 sample companies' panel data from 2012 to 2016 to conduct empirical analysis and use Eviews software to test the stability of the sample data and the Hausman test, building a model that includes dummy variables and C-ROSS related indicators and analyze them separately. Through the regression results, the correlations between various financial indicators, dummy variables and the profitability of the property insurance companies are analyzed. Finally, the fifth part has conclusions. The impact of C-ROSS on the profitability of different insurance companies is related to their own profit structures. The underwriting profit rate and net investment rate are the two most important factors. The fixed income investment ratio has significant influence on all sample companies. The innovation is mainly reflected on the analysis of the profitability of the entire property insurance market and the subdivision of sample companies according to the scale of premium income. Firstly, we use the DuPont analysis system to construct a profitability evaluation system based on the analysis of financial indicators. Then further introduce dummy variables and three indicators related to the quantitative risk of C-ROSS with the background of C-ROSS. So we can build panel data models with different scales that includes financial indicators, dummy variables and C-ROSS related indicators to fully investigate the impact of C-ROSS on the profitability of property insurance companies, which will make the regression model more perfect and the article more realistic.",
  "year": 2018,
  "source": "WOS",
  "area": "financial_risk",
  "method": "machine learning",
  "keywords": [
    "machine learning",
    "supervised learning",
    "unsupervised learning",
    "reinforcement learning",
    "semi-supervised learning",
    "active learning",
    "classification",
    "regression",
    "PCA",
    "support vector machine",
    "SVM",
    "decision tree",
    "clustering",
    "principal components analysis",
    "manifold learning",
    "feature learning",
    "feature representation",
    "neural network",
    "deep learning",
    "representation learning",
    "backpropagation",
    "BP",
    "rectified linear unit",
    "ReLU",
    "sigmoid",
    "tanh",
    "hidden layer",
    "convolutional neural network",
    "CNN",
    "recurrent neural network",
    "long short-term memory",
    "LSTM",
    "sequence-to-sequence learning",
    "seq2seq",
    "encoder-decoder",
    "autoencoder",
    "denoising autoencoder",
    "deep belief network",
    "DBM",
    "restricted Boltzmann machine",
    "dropout regularization",
    "unsupervised pre-train",
    "memory network",
    "attention mechanism",
    "Large Language Model",
    "LLM",
    "In-context Learning",
    "Instruction Tuning",
    "Chain-of-Thought",
    "Few-shot Learning",
    "Zero-shot Learning",
    "Long Context Modeling",
    "Tool Manipulation",
    "Tool-augmented Model",
    "Memory Augmented Model",
    "ChatGPT",
    "GPT-4",
    "LLaMA"
  ],
  "cache_key": "f5e49f6447f78a8399631daaf34d65d7",
  "timestamp": "2025-05-15T03:00:35.542935"
}